***********************************************************************         
* CREATED BY PC36146   ON 97/01/07  AT 16:53                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'FRÅGA ORDER - ALLMÄNT           '                               
W4N501   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T501 7',                                           +        
               8='W4T501 7',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T501 7',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T501  ',                                          +        
               14='W4T502  ',                                          +        
               15='W4T503  ',                                          +        
               16='W4T504  ',                                          +        
               17='W4T505  ',                                          +        
               18='W4T506  ',                                          +        
               19='W4T507  ',                                          +        
               20='W4T508  ',                                          +        
               21='W4T509  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,7)),                                         +        
               FILL=PT                                                          
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'QUERY ORDER GENERAL   ',                               +        
               POS=(1,12),LTH=22,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Dist',                                                 +        
               POS=(2,2),LTH=4,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDDISTRI DFLD  POS=(2,7),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Cust',                                                 +        
               POS=(2,12),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
IDKUNDNI DFLD  POS=(2,17),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Order',                                                +        
               POS=(2,24),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
IDORDNRI DFLD  POS=(2,30),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Part',                                                 +        
               POS=(2,38),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
IDARTNRI DFLD  POS=(2,43),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Cse',                                                  +        
               POS=(2,53),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
IDKOLLII DFLD  POS=(2,57),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Prod',                                                 +        
               POS=(2,63),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
IDPRONRI DFLD  POS=(2,68),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,76),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
IDDCI    DFLD  POS=(2,79),LTH=2,                                       +        
               ATTR=(ALPHA,NOPROT)                                              
IDDISTRU DFLD  POS=(3,7),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
IDKUNDNU DFLD  POS=(3,17),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
IDORDNRU DFLD  POS=(3,30),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
IDARTNRU DFLD  POS=(3,43),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
IDKOLLIU DFLD  POS=(3,57),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
IDPRONRU DFLD  POS=(3,68),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDCU    DFLD  POS=(3,79),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
TEDDI    DFLD  POS=(4,70),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'DC    Prod   Ddel Trp date  DC    Prod   Ddel Trp date'+        
               ,                                                       +        
               POS=(5,27),LTH=54,                                      +        
               ATTR=(PROT)                                                      
ARBDC01 DFLD   POS=(6,27),LTH=2,                                       +        
               ATTR=(PROT)                                                      
ARBPNR01 DFLD  POS=(6,30),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
ARBLEV01 DFLD  POS=(6,39),LTH=5,                                       +        
               ATTR=(PROT)                                                      
ARBSKP01 DFLD  POS=(6,47),LTH=6,                                       +        
               ATTR=(PROT)                                                      
ARBDC05 DFLD   POS=(6,55),LTH=2,                                       +        
               ATTR=(PROT)                                                      
ARBPNR05 DFLD  POS=(6,58),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
ARBLEV05 DFLD  POS=(6,67),LTH=5,                                       +        
               ATTR=(PROT)                                                      
ARBSKP05 DFLD  POS=(6,75),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Order class',                                          +        
               POS=(6,2),LTH=11,                                       +        
               ATTR=(PROT)                                                      
KLASS    DFLD  POS=(6,17),LTH=1,                                       +        
               ATTR=(PROT)                                                      
ARBDC02 DFLD   POS=(7,27),LTH=2,                                       +        
               ATTR=(PROT)                                                      
ARBPNR02 DFLD  POS=(7,30),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
ARBLEV02 DFLD  POS=(7,39),LTH=5,                                       +        
               ATTR=(PROT)                                                      
ARBSKP02 DFLD  POS=(7,47),LTH=6,                                       +        
               ATTR=(PROT)                                                      
ARBDC06 DFLD   POS=(7,55),LTH=2,                                       +        
               ATTR=(PROT)                                                      
ARBPNR06 DFLD  POS=(7,58),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
ARBLEV06 DFLD  POS=(7,67),LTH=5,                                       +        
               ATTR=(PROT)                                                      
ARBSKP06 DFLD  POS=(7,75),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Freight code',                                         +        
               POS=(7,2),LTH=12,                                       +        
               ATTR=(PROT)                                                      
FRAKT    DFLD  POS=(7,16),LTH=2,                                       +        
               ATTR=(PROT)                                                      
ARBDC03 DFLD   POS=(8,27),LTH=2,                                       +        
               ATTR=(PROT)                                                      
ARBPNR03 DFLD  POS=(8,30),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
ARBLEV03 DFLD  POS=(8,39),LTH=5,                                       +        
               ATTR=(PROT)                                                      
ARBSKP03 DFLD  POS=(8,47),LTH=6,                                       +        
               ATTR=(PROT)                                                      
ARBDC07 DFLD   POS=(8,55),LTH=2,                                       +        
               ATTR=(PROT)                                                      
ARBPNR07 DFLD  POS=(8,58),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
ARBLEV07 DFLD  POS=(8,67),LTH=5,                                       +        
               ATTR=(PROT)                                                      
ARBSKP07 DFLD  POS=(8,75),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Invoice type',                                         +        
               POS=(8,2),LTH=12,                                       +        
               ATTR=(PROT)                                                      
FAKT     DFLD  POS=(8,17),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Export DC   ',                                         +        
               POS=(9,2),LTH=12,                                       +        
               ATTR=(PROT)                                                      
EXPDC    DFLD  POS=(9,16),LTH=2,                                       +        
               ATTR=(PROT)                                                      
ARBDC04 DFLD   POS=(9,27),LTH=2,                                       +        
               ATTR=(PROT)                                                      
ARBPNR04 DFLD  POS=(9,30),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
ARBLEV04 DFLD  POS=(9,39),LTH=5,                                       +        
               ATTR=(PROT)                                                      
ARBSKP04 DFLD  POS=(9,47),LTH=6,                                       +        
               ATTR=(PROT)                                                      
ARBDC08 DFLD   POS=(9,55),LTH=2,                                       +        
               ATTR=(PROT)                                                      
ARBPNR08 DFLD  POS=(9,58),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
ARBLEV08 DFLD  POS=(9,67),LTH=5,                                       +        
               ATTR=(PROT)                                                      
ARBSKP08 DFLD  POS=(9,75),LTH=6,                                       +        
               ATTR=(PROT)                                                      
ARBDC09 DFLD   POS=(10,55),LTH=2,                                      +        
               ATTR=(PROT)                                                      
ARBPNR09 DFLD  POS=(10,58),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
ARBLEV09 DFLD  POS=(10,67),LTH=5,                                      +        
               ATTR=(PROT)                                                      
ARBSKP09 DFLD  POS=(10,75),LTH=6,                                      +        
               ATTR=(PROT)                                                      
ARBDC10 DFLD   POS=(11,55),LTH=2,                                      +        
               ATTR=(PROT)                                                      
ARBPNR10 DFLD  POS=(11,58),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
ARBLEV10 DFLD  POS=(11,67),LTH=5,                                      +        
               ATTR=(PROT)                                                      
ARBSKP10 DFLD  POS=(11,75),LTH=6,                                      +        
               ATTR=(PROT)                                                      
ARBDC11 DFLD   POS=(12,55),LTH=2,                                      +        
               ATTR=(PROT)                                                      
ARBPNR11 DFLD  POS=(12,58),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
ARBLEV11 DFLD  POS=(12,67),LTH=5,                                      +        
               ATTR=(PROT)                                                      
ARBSKP11 DFLD  POS=(12,75),LTH=6,                                      +        
               ATTR=(PROT)                                                      
ARBDC12 DFLD   POS=(13,55),LTH=2,                                      +        
               ATTR=(PROT)                                                      
ARBPNR12 DFLD  POS=(13,58),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
ARBLEV12 DFLD  POS=(13,67),LTH=5,                                      +        
               ATTR=(PROT)                                                      
ARBSKP12 DFLD  POS=(13,75),LTH=6,                                      +        
               ATTR=(PROT)                                                      
ARBDC13 DFLD   POS=(14,55),LTH=2,                                      +        
               ATTR=(PROT)                                                      
ARBPNR13 DFLD  POS=(14,58),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
ARBLEV13 DFLD  POS=(14,67),LTH=5,                                      +        
               ATTR=(PROT)                                                      
ARBSKP13 DFLD  POS=(14,75),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KONTOTE  DFLD  POS=(10,2),LTH=7,                                       +        
               ATTR=(PROT)                                                      
IDKONTO  DFLD  POS=(10,10),LTH=10,                                     +        
               ATTR=(PROT)                                                      
ANALYSTE DFLD  POS=(10,21),LTH=9,                                      +        
               ATTR=(PROT)                                                      
IDANALYS DFLD  POS=(10,31),LTH=12,                                     +        
               ATTR=(PROT)                                                      
KSTTE    DFLD  POS=(11,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDKST    DFLD  POS=(11,5),LTH=10,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Consignee name',                                       +        
               POS=(12,2),LTH=14,                                      +        
               ATTR=(PROT)                                                      
DGIA0000 DFLD  POS=(12,18),LTH=35,                                     +        
               ATTR=(PROT)                                                      
DGIA0001 DFLD  POS=(13,18),LTH=35,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Consignee addr.',                                      +        
               POS=(14,2),LTH=15,                                      +        
               ATTR=(PROT)                                                      
ADGMTGAT DFLD  POS=(14,18),LTH=35,                                     +        
               ATTR=(PROT)                                                      
ADGMTADR DFLD  POS=(15,18),LTH=35,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Country',                                              +        
               POS=(16,2),LTH=7,                                       +        
               ATTR=(PROT)                                                      
ADGMTLAN DFLD  POS=(16,18),LTH=35,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Trp date',                                             +        
               POS=(17,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
AVGDATE  DFLD  POS=(17,11),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Time',                                                 +        
               POS=(17,18),LTH=4,                                      +        
               ATTR=(ALPHA,PROT)                                                
AVGTID   DFLD  POS=(17,23),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'TrpId',                                                +        
               POS=(17,29),LTH=5,                                      +        
               ATTR=(ALPHA,PROT)                                                
AVGTRP   DFLD  POS=(17,35),LTH=5,                                      +        
               ATTR=(PROT)                                                      
IDSYST   DFLD  POS=(17,42),LTH=4,                                      +        
               ATTR=(PROT)                                                      
INTERN   DFLD  POS=(17,49),LTH=22,                                     +        
               ATTR=(PROT)                                                      
ORDERNO  DFLD  POS=(17,74),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'No. lines',                                            +        
               POS=(18,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
FLD1613  DFLD  POS=(18,21),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Cases packed',                                         +        
               POS=(18,29),LTH=12,                                     +        
               ATTR=(PROT)                                                      
FLD1643  DFLD  POS=(18,44),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Net kg',                                               +        
               POS=(18,49),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1656  DFLD  POS=(18,56),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Gr kg',                                                +        
               POS=(18,66),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLD1672  DFLD  POS=(18,72),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Pack lines',                                           +        
               POS=(19,2),LTH=10,                                      +        
               ATTR=(PROT)                                                      
FLD1713  DFLD  POS=(19,21),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Cases loaded',                                         +        
               POS=(19,29),LTH=12,                                     +        
               ATTR=(PROT)                                                      
FLD1743  DFLD  POS=(19,44),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Net M3',                                               +        
               POS=(19,49),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1756  DFLD  POS=(19,56),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Gr M3',                                                +        
               POS=(19,66),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLD1772  DFLD  POS=(19,72),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Order value',                                          +        
               POS=(20,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
FLD1814  DFLD  POS=(20,14),LTH=12,                                     +        
               ATTR=(PROT)                                                      
TEASTRIX DFLD  POS=(20,27),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Cases invoiced',                                       +        
               POS=(20,29),LTH=14,                                     +        
               ATTR=(PROT)                                                      
FLD1843  DFLD  POS=(20,44),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '13 Gen order   14 Order part   15 Order value 16 Order +        
               cust info 17 Pack/load',                                +        
               POS=(21,2),LTH=77,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 Cases load  19 Archive PU   20 Cases',              +        
               POS=(22,2),LTH=39,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21 Part info',                                         +        
               POS=(22,48),LTH=12,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,67),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4I501N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N501),                                           +        
               OPT=2,                                                  +        
               NXT=W4O501N1                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '45012',                                                +        
               LTH=5                                                            
         MFLD  (IDDISTRI,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDISTRU,                                               +        
               LTH=4                                                            
         MFLD  (IDKUNDNI,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDKUNDNU,                                               +        
               LTH=6                                                            
         MFLD  (IDORDNRI,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDORDNRU,                                               +        
               LTH=7                                                            
         MFLD  (IDARTNRI,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDARTNRU,                                               +        
               LTH=9                                                            
         MFLD  (IDKOLLII,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDKOLLIU,                                               +        
               LTH=5                                                            
         MFLD  (IDPRONRI,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDPRONRU,                                               +        
               LTH=7                                                            
         MFLD  (IDDCI,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  IDDCU,                                                  +        
               LTH=2                                                            
         MSGEND                                                                 
W4O501N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N501,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I501N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDDISTRI,                                               +        
               LTH=4                                                            
         MFLD  IDDISTRU,                                               +        
               LTH=4                                                            
         MFLD  IDKUNDNI,                                               +        
               LTH=6                                                            
         MFLD  IDKUNDNU,                                               +        
               LTH=6                                                            
         MFLD  IDORDNRI,                                               +        
               LTH=7                                                            
         MFLD  IDORDNRU,                                               +        
               LTH=7                                                            
         MFLD  IDARTNRI,                                               +        
               LTH=9                                                            
         MFLD  IDARTNRU,                                               +        
               LTH=9                                                            
         MFLD  IDKOLLII,                                               +        
               LTH=5                                                            
         MFLD  IDKOLLIU,                                               +        
               LTH=5                                                            
         MFLD  IDPRONRI,                                               +        
               LTH=7                                                            
         MFLD  IDPRONRU,                                               +        
               LTH=7                                                            
         MFLD  IDDCI,                                                  +        
               LTH=2                                                            
         MFLD  IDDCU,                                                  +        
               LTH=2                                                            
         MFLD  TEDDI,                                                  +        
               LTH=11                                                           
         MFLD  ARBDC01,                                                +        
               LTH=2                                                            
         MFLD  ARBDC02,                                                +        
               LTH=2                                                            
         MFLD  ARBDC03,                                                +        
               LTH=2                                                            
         MFLD  ARBDC04,                                                +        
               LTH=2                                                            
         MFLD  ARBDC05,                                                +        
               LTH=2                                                            
         MFLD  ARBDC06,                                                +        
               LTH=2                                                            
         MFLD  ARBDC07,                                                +        
               LTH=2                                                            
         MFLD  ARBDC08,                                                +        
               LTH=2                                                            
         MFLD  ARBDC09,                                                +        
               LTH=2                                                            
         MFLD  ARBDC10,                                                +        
               LTH=2                                                            
         MFLD  ARBDC11,                                                +        
               LTH=2                                                            
         MFLD  ARBDC12,                                                +        
               LTH=2                                                            
         MFLD  ARBDC13,                                                +        
               LTH=2                                                            
         MFLD  ARBPNR01,                                               +        
               LTH=7                                                            
         MFLD  ARBPNR02,                                               +        
               LTH=7                                                            
         MFLD  ARBPNR03,                                               +        
               LTH=7                                                            
         MFLD  ARBPNR04,                                               +        
               LTH=7                                                            
         MFLD  ARBPNR05,                                               +        
               LTH=7                                                            
         MFLD  ARBPNR06,                                               +        
               LTH=7                                                            
         MFLD  ARBPNR07,                                               +        
               LTH=7                                                            
         MFLD  ARBPNR08,                                               +        
               LTH=7                                                            
         MFLD  ARBPNR09,                                               +        
               LTH=7                                                            
         MFLD  ARBPNR10,                                               +        
               LTH=7                                                            
         MFLD  ARBPNR11,                                               +        
               LTH=7                                                            
         MFLD  ARBPNR12,                                               +        
               LTH=7                                                            
         MFLD  ARBPNR13,                                               +        
               LTH=7                                                            
         MFLD  ARBLEV01,                                               +        
               LTH=5                                                            
         MFLD  ARBLEV02,                                               +        
               LTH=5                                                            
         MFLD  ARBLEV03,                                               +        
               LTH=5                                                            
         MFLD  ARBLEV04,                                               +        
               LTH=5                                                            
         MFLD  ARBLEV05,                                               +        
               LTH=5                                                            
         MFLD  ARBLEV06,                                               +        
               LTH=5                                                            
         MFLD  ARBLEV07,                                               +        
               LTH=5                                                            
         MFLD  ARBLEV08,                                               +        
               LTH=5                                                            
         MFLD  ARBLEV09,                                               +        
               LTH=5                                                            
         MFLD  ARBLEV10,                                               +        
               LTH=5                                                            
         MFLD  ARBLEV11,                                               +        
               LTH=5                                                            
         MFLD  ARBLEV12,                                               +        
               LTH=5                                                            
         MFLD  ARBLEV13,                                               +        
               LTH=5                                                            
         MFLD  ARBSKP01,                                               +        
               LTH=6                                                            
         MFLD  ARBSKP02,                                               +        
               LTH=6                                                            
         MFLD  ARBSKP03,                                               +        
               LTH=6                                                            
         MFLD  ARBSKP04,                                               +        
               LTH=6                                                            
         MFLD  ARBSKP05,                                               +        
               LTH=6                                                            
         MFLD  ARBSKP06,                                               +        
               LTH=6                                                            
         MFLD  ARBSKP07,                                               +        
               LTH=6                                                            
         MFLD  ARBSKP08,                                               +        
               LTH=6                                                            
         MFLD  ARBSKP09,                                               +        
               LTH=6                                                            
         MFLD  ARBSKP10,                                               +        
               LTH=6                                                            
         MFLD  ARBSKP11,                                               +        
               LTH=6                                                            
         MFLD  ARBSKP12,                                               +        
               LTH=6                                                            
         MFLD  ARBSKP13,                                               +        
               LTH=6                                                            
         MFLD  KLASS,                                                  +        
               LTH=1                                                            
         MFLD  FRAKT,                                                  +        
               LTH=2                                                            
         MFLD  FAKT,                                                   +        
               LTH=1                                                            
         MFLD  EXPDC,                                                  +        
               LTH=2                                                            
         MFLD  KONTOTE,                                                +        
               LTH=7                                                            
         MFLD  IDKONTO,                                                +        
               LTH=10                                                           
         MFLD  ANALYSTE,                                               +        
               LTH=9                                                            
         MFLD  IDANALYS,                                               +        
               LTH=12                                                           
         MFLD  KSTTE,                                                  +        
               LTH=2                                                            
         MFLD  IDKST,                                                  +        
               LTH=10                                                           
         MFLD  DGIA0000,                                               +        
               LTH=35                                                           
         MFLD  DGIA0001,                                               +        
               LTH=35                                                           
         MFLD  ADGMTGAT,                                               +        
               LTH=35                                                           
         MFLD  ADGMTADR,                                               +        
               LTH=35                                                           
         MFLD  ADGMTLAN,                                               +        
               LTH=35                                                           
         MFLD  AVGDATE,                                                +        
               LTH=6                                                            
         MFLD  AVGTID,                                                 +        
               LTH=5                                                            
         MFLD  AVGTRP,                                                 +        
               LTH=5                                                            
         MFLD  IDSYST,                                                 +        
               LTH=4                                                            
         MFLD  INTERN,                                                 +        
               LTH=22                                                           
         MFLD  ORDERNO,                                                +        
               LTH=7                                                            
         MFLD  FLD1613,                                                +        
               LTH=5                                                            
         MFLD  FLD1643,                                                +        
               LTH=4                                                            
         MFLD  FLD1656,                                                +        
               LTH=8                                                            
         MFLD  FLD1672,                                                +        
               LTH=8                                                            
         MFLD  FLD1713,                                                +        
               LTH=5                                                            
         MFLD  FLD1743,                                                +        
               LTH=4                                                            
         MFLD  FLD1756,                                                +        
               LTH=8                                                            
         MFLD  FLD1772,                                                +        
               LTH=8                                                            
         MFLD  FLD1814,                                                +        
               LTH=12                                                           
         MFLD  TEASTRIX,                                               +        
               LTH=1                                                            
         MFLD  FLD1843,                                                +        
               LTH=4                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  FSYSMSG,                                                +        
               LTH=79                                                           
         MSGEND                                                                 
         END                                                                    
