***********************************************************************         
* CREATED BY PCC4448   ON 95/03/08  AT 09:24                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W4N532   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W4T531  ',                                           +        
               2='W4T532  ',                                           +        
               3='W4T533  ',                                           +        
               4='W4T534  ',                                           +        
               5='W4T535  ',                                           +        
               6='W4T536  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T531  ',                                          +        
               14='W4T532  ',                                          +        
               15='W4T533  ',                                          +        
               16='W4T534  ',                                          +        
               17='W4T535  ',                                          +        
               18='W4T536  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,9)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'CROSS REF PACKED CASES',                               +        
               POS=(1,11),LTH=22,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Distr',                                                +        
               POS=(2,2),LTH=5,                                        +        
               ATTR=(ALPHA,PROT)                                                
FLD0211  DFLD  POS=(2,9),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Cust',                                                 +        
               POS=(2,15),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD0224  DFLD  POS=(2,21),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'FC',                                                   +        
               POS=(2,29),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD0235  DFLD  POS=(2,33),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Shipm',                                                +        
               POS=(2,37),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLD0247  DFLD  POS=(2,44),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,53),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DCI      DFLD  POS=(2,57),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD0311  DFLD  POS=(3,9),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
FLD0324  DFLD  POS=(3,21),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0335  DFLD  POS=(3,33),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0347  DFLD  POS=(3,44),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
DCO      DFLD  POS=(3,57),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0402  DFLD  POS=(4,2),LTH=79,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Prod  Order',                                          +        
               POS=(5,5),LTH=11,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Prod  Order',                                          +        
               POS=(5,29),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Prod  Order',                                          +        
               POS=(5,53),LTH=11,                                      +        
               ATTR=(PROT)                                                      
FLD0602  DFLD  POS=(6,2),LTH=19,                                       +        
               ATTR=(PROT)                                                      
FLD0626  DFLD  POS=(6,26),LTH=19,                                      +        
               ATTR=(PROT)                                                      
FLD0650  DFLD  POS=(6,50),LTH=19,                                      +        
               ATTR=(PROT)                                                      
FLD0702  DFLD  POS=(7,2),LTH=19,                                       +        
               ATTR=(PROT)                                                      
FLD0726  DFLD  POS=(7,26),LTH=19,                                      +        
               ATTR=(PROT)                                                      
FLD0750  DFLD  POS=(7,50),LTH=19,                                      +        
               ATTR=(PROT)                                                      
FLD0802  DFLD  POS=(8,2),LTH=19,                                       +        
               ATTR=(PROT)                                                      
FLD0826  DFLD  POS=(8,26),LTH=19,                                      +        
               ATTR=(PROT)                                                      
FLD0850  DFLD  POS=(8,50),LTH=19,                                      +        
               ATTR=(PROT)                                                      
FLD0902  DFLD  POS=(9,2),LTH=19,                                       +        
               ATTR=(PROT)                                                      
FLD0926  DFLD  POS=(9,26),LTH=19,                                      +        
               ATTR=(PROT)                                                      
FLD0950  DFLD  POS=(9,50),LTH=19,                                      +        
               ATTR=(PROT)                                                      
FLD1002  DFLD  POS=(10,2),LTH=19,                                      +        
               ATTR=(PROT)                                                      
FLD1026  DFLD  POS=(10,26),LTH=19,                                     +        
               ATTR=(PROT)                                                      
FLD1050  DFLD  POS=(10,50),LTH=19,                                     +        
               ATTR=(PROT)                                                      
FLD1102  DFLD  POS=(11,2),LTH=19,                                      +        
               ATTR=(PROT)                                                      
FLD1126  DFLD  POS=(11,26),LTH=19,                                     +        
               ATTR=(PROT)                                                      
FLD1150  DFLD  POS=(11,50),LTH=19,                                     +        
               ATTR=(PROT)                                                      
FLD1202  DFLD  POS=(12,2),LTH=19,                                      +        
               ATTR=(PROT)                                                      
FLD1226  DFLD  POS=(12,26),LTH=19,                                     +        
               ATTR=(PROT)                                                      
FLD1250  DFLD  POS=(12,50),LTH=19,                                     +        
               ATTR=(PROT)                                                      
FLD1302  DFLD  POS=(13,2),LTH=19,                                      +        
               ATTR=(PROT)                                                      
FLD1326  DFLD  POS=(13,26),LTH=19,                                     +        
               ATTR=(PROT)                                                      
FLD1350  DFLD  POS=(13,50),LTH=19,                                     +        
               ATTR=(PROT)                                                      
FLD1402  DFLD  POS=(14,2),LTH=19,                                      +        
               ATTR=(PROT)                                                      
FLD1426  DFLD  POS=(14,26),LTH=19,                                     +        
               ATTR=(PROT)                                                      
FLD1450  DFLD  POS=(14,50),LTH=19,                                     +        
               ATTR=(PROT)                                                      
FLD1502  DFLD  POS=(15,2),LTH=19,                                      +        
               ATTR=(PROT)                                                      
FLD1526  DFLD  POS=(15,26),LTH=19,                                     +        
               ATTR=(PROT)                                                      
FLD1550  DFLD  POS=(15,50),LTH=19,                                     +        
               ATTR=(PROT)                                                      
FLD1602  DFLD  POS=(16,2),LTH=19,                                      +        
               ATTR=(PROT)                                                      
FLD1626  DFLD  POS=(16,26),LTH=19,                                     +        
               ATTR=(PROT)                                                      
FLD1650  DFLD  POS=(16,50),LTH=19,                                     +        
               ATTR=(PROT)                                                      
FLD1702  DFLD  POS=(17,2),LTH=19,                                      +        
               ATTR=(PROT)                                                      
FLD1726  DFLD  POS=(17,26),LTH=19,                                     +        
               ATTR=(PROT)                                                      
FLD1750  DFLD  POS=(17,50),LTH=19,                                     +        
               ATTR=(PROT)                                                      
FLD1802  DFLD  POS=(18,2),LTH=19,                                      +        
               ATTR=(PROT)                                                      
FLD1826  DFLD  POS=(18,26),LTH=19,                                     +        
               ATTR=(PROT)                                                      
FLD1850  DFLD  POS=(18,50),LTH=19,                                     +        
               ATTR=(PROT)                                                      
FLD1902  DFLD  POS=(19,2),LTH=79,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD2002  DFLD  POS=(20,2),LTH=47,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD2053  DFLD  POS=(20,50),LTH=31,                                     +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  '1 Query cases   2 Cross cases   3 Loading rel   4 Backo+        
               ut load  5 Inv. rel',                                   +        
               POS=(21,2),LTH=74,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  '6 Backout inv   7',                                    +        
               POS=(22,2),LTH=17,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '8',                                                    +        
               POS=(22,34),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '9',                                                    +        
               POS=(22,50),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W4O532N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N532,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I532N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0211,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0311,                                                +        
               LTH=4                                                            
         MFLD  FLD0224,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0324,                                                +        
               LTH=6                                                            
         MFLD  FLD0235,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0335,                                                +        
               LTH=2                                                            
         MFLD  FLD0247,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0347,                                                +        
               LTH=7                                                            
         MFLD  DCI,                                                    +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DCO,                                                    +        
               LTH=2                                                            
         MFLD  FLD0402,                                                +        
               LTH=79                                                           
         MFLD  FLD1902,                                                +        
               LTH=79                                                           
         MFLD  FLD2002,                                                +        
               LTH=47                                                           
         MFLD  FLD2053,                                                +        
               LTH=31                                                           
         MFLD  FLD0602,                                                +        
               LTH=19                                                           
         MFLD  FLD0626,                                                +        
               LTH=19                                                           
         MFLD  FLD0650,                                                +        
               LTH=19                                                           
         MFLD  FLD0702,                                                +        
               LTH=19                                                           
         MFLD  FLD0726,                                                +        
               LTH=19                                                           
         MFLD  FLD0750,                                                +        
               LTH=19                                                           
         MFLD  FLD0802,                                                +        
               LTH=19                                                           
         MFLD  FLD0826,                                                +        
               LTH=19                                                           
         MFLD  FLD0850,                                                +        
               LTH=19                                                           
         MFLD  FLD0902,                                                +        
               LTH=19                                                           
         MFLD  FLD0926,                                                +        
               LTH=19                                                           
         MFLD  FLD0950,                                                +        
               LTH=19                                                           
         MFLD  FLD1002,                                                +        
               LTH=19                                                           
         MFLD  FLD1026,                                                +        
               LTH=19                                                           
         MFLD  FLD1050,                                                +        
               LTH=19                                                           
         MFLD  FLD1102,                                                +        
               LTH=19                                                           
         MFLD  FLD1126,                                                +        
               LTH=19                                                           
         MFLD  FLD1150,                                                +        
               LTH=19                                                           
         MFLD  FLD1202,                                                +        
               LTH=19                                                           
         MFLD  FLD1226,                                                +        
               LTH=19                                                           
         MFLD  FLD1250,                                                +        
               LTH=19                                                           
         MFLD  FLD1302,                                                +        
               LTH=19                                                           
         MFLD  FLD1326,                                                +        
               LTH=19                                                           
         MFLD  FLD1350,                                                +        
               LTH=19                                                           
         MFLD  FLD1402,                                                +        
               LTH=19                                                           
         MFLD  FLD1426,                                                +        
               LTH=19                                                           
         MFLD  FLD1450,                                                +        
               LTH=19                                                           
         MFLD  FLD1502,                                                +        
               LTH=19                                                           
         MFLD  FLD1526,                                                +        
               LTH=19                                                           
         MFLD  FLD1550,                                                +        
               LTH=19                                                           
         MFLD  FLD1602,                                                +        
               LTH=19                                                           
         MFLD  FLD1626,                                                +        
               LTH=19                                                           
         MFLD  FLD1650,                                                +        
               LTH=19                                                           
         MFLD  FLD1702,                                                +        
               LTH=19                                                           
         MFLD  FLD1726,                                                +        
               LTH=19                                                           
         MFLD  FLD1750,                                                +        
               LTH=19                                                           
         MFLD  FLD1802,                                                +        
               LTH=19                                                           
         MFLD  FLD1826,                                                +        
               LTH=19                                                           
         MFLD  FLD1850,                                                +        
               LTH=19                                                           
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I532N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N532),                                           +        
               OPT=2,                                                  +        
               NXT=W4O532N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '45322',                                                +        
               LTH=5                                                            
         MFLD  (FLD0211,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0311,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0224,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0324,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0235,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0335,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0247,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0347,                                                +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DCI,                                                   +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  DCO,                                                    +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLD0402,                                                +        
               LTH=79,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD1902,                                                +        
               LTH=79,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD2002,                                                +        
               LTH=47,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD2053,                                                +        
               LTH=31,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
