         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'LASTNINGSRELEASE 3 PER TRANSPORT'                               
W4N673   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0t501  ',                                           +        
               3='W0t501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0t501  ',                                           +        
               8='W0t501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T673U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4N673   DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'LOADING 3 TRANSPORT         ',                         +        
               POS=(1,11),LTH=28,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Transport',                                            +        
               POS=(2,2),LTH=9,                                        +        
               ATTR=(NUM,PROT)                                                  
FLD0212  DFLD  POS=(2,12),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Carrier   ',                                           +        
               POS=(2,17),LTH=10,                                      +        
               ATTR=(PROT)                                                      
FLD0228  DFLD  POS=(2,28),LTH=12,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Dang. goods ',                                         +        
               POS=(2,42),LTH=12,                                      +        
               ATTR=(PROT)                                                      
FLD0255  DFLD  POS=(2,55),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'DC',                                                   +        
               POS=(2,58),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDDCIN   DFLD  POS=(2,61),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
FLD0312  DFLD  POS=(3,12),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0328  DFLD  POS=(3,28),LTH=12,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD0335  DFLD  POS=(3,55),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDCUT   DFLD  POS=(3,61),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'No. of cases   Gr.weight',                             +        
               POS=(5,25),LTH=24,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Gr.volume',                                            +        
               POS=(5,54),LTH=9,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Already selected:    :',                               +        
               POS=(6,2),LTH=22,                                       +        
               ATTR=(PROT)                                                      
KVKOLLIV DFLD  POS=(6,32),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0641  DFLD  POS=(6,41),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0655  DFLD  POS=(6,55),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Distr. Cust.    Order     Case',                       +        
               POS=(8,2),LTH=30,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Distr. Cust.    Order     Case',                       +        
               POS=(8,38),LTH=30,                                      +        
               ATTR=(PROT)                                                      
FLD0902  DFLD  POS=(09,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0909  DFLD  POS=(09,09),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0918  DFLD  POS=(09,18),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0928  DFLD  POS=(09,28),LTH=5,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0938  DFLD  POS=(09,38),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0945  DFLD  POS=(09,45),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0954  DFLD  POS=(09,54),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0964  DFLD  POS=(09,64),LTH=5,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1002  DFLD  POS=(10,02),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1009  DFLD  POS=(10,09),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1018  DFLD  POS=(10,18),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1028  DFLD  POS=(10,28),LTH=5,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1038  DFLD  POS=(10,38),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1045  DFLD  POS=(10,45),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1054  DFLD  POS=(10,54),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1064  DFLD  POS=(10,64),LTH=5,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1102  DFLD  POS=(11,02),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1109  DFLD  POS=(11,09),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1118  DFLD  POS=(11,18),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1128  DFLD  POS=(11,28),LTH=5,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1138  DFLD  POS=(11,38),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1145  DFLD  POS=(11,45),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1154  DFLD  POS=(11,54),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1164  DFLD  POS=(11,64),LTH=5,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1202  DFLD  POS=(12,02),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1209  DFLD  POS=(12,09),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1215  DFLD  POS=(12,18),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1228  DFLD  POS=(12,28),LTH=5,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1238  DFLD  POS=(12,38),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1245  DFLD  POS=(12,45),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1254  DFLD  POS=(12,54),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1264  DFLD  POS=(12,64),LTH=5,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1302  DFLD  POS=(13,02),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1309  DFLD  POS=(13,09),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1318  DFLD  POS=(13,18),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1328  DFLD  POS=(13,28),LTH=5,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1338  DFLD  POS=(13,38),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1345  DFLD  POS=(13,45),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1354  DFLD  POS=(13,54),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1364  DFLD  POS=(13,64),LTH=5,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1402  DFLD  POS=(14,02),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1409  DFLD  POS=(14,09),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1418  DFLD  POS=(14,18),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1428  DFLD  POS=(14,28),LTH=5,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1438  DFLD  POS=(14,38),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1445  DFLD  POS=(14,45),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1454  DFLD  POS=(14,54),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1464  DFLD  POS=(14,64),LTH=5,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1502  DFLD  POS=(15,02),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1509  DFLD  POS=(15,09),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1518  DFLD  POS=(15,18),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1528  DFLD  POS=(15,28),LTH=5,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1538  DFLD  POS=(15,38),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1545  DFLD  POS=(15,45),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1554  DFLD  POS=(15,54),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1564  DFLD  POS=(15,64),LTH=5,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1602  DFLD  POS=(16,02),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1609  DFLD  POS=(16,09),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1618  DFLD  POS=(16,18),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1628  DFLD  POS=(16,28),LTH=5,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1638  DFLD  POS=(16,38),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1645  DFLD  POS=(16,45),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1654  DFLD  POS=(16,54),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1664  DFLD  POS=(16,64),LTH=5,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1702  DFLD  POS=(17,02),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1709  DFLD  POS=(17,09),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1718  DFLD  POS=(17,18),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1728  DFLD  POS=(17,28),LTH=5,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1738  DFLD  POS=(17,38),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1745  DFLD  POS=(17,45),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1754  DFLD  POS=(17,54),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1764  DFLD  POS=(17,64),LTH=5,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1802  DFLD  POS=(18,02),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1809  DFLD  POS=(18,09),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1818  DFLD  POS=(18,18),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1828  DFLD  POS=(18,28),LTH=5,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1838  DFLD  POS=(18,38),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1845  DFLD  POS=(18,45),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1854  DFLD  POS=(18,54),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1864  DFLD  POS=(18,64),LTH=5,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1902  DFLD  POS=(19,02),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1909  DFLD  POS=(19,09),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1918  DFLD  POS=(19,18),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1928  DFLD  POS=(19,28),LTH=5,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1938  DFLD  POS=(19,38),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1945  DFLD  POS=(19,45),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1954  DFLD  POS=(19,54),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1964  DFLD  POS=(19,64),LTH=5,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD2002  DFLD  POS=(20,02),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD2009  DFLD  POS=(20,09),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD2018  DFLD  POS=(20,18),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD2028  DFLD  POS=(20,28),LTH=5,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD2038  DFLD  POS=(20,38),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD2045  DFLD  POS=(20,45),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD2054  DFLD  POS=(20,54),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD2064  DFLD  POS=(20,64),LTH=5,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD2102  DFLD  POS=(21,02),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD2109  DFLD  POS=(21,09),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD2118  DFLD  POS=(21,18),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD2128  DFLD  POS=(21,28),LTH=5,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD2138  DFLD  POS=(21,38),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD2145  DFLD  POS=(21,45),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD2154  DFLD  POS=(21,54),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD2164  DFLD  POS=(21,64),LTH=5,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'F10=WHELP',                                            +        
               POS=(22,02),LTH=09,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'F11=Update',                                           +        
               POS=(22,13),LTH=10,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'F12=Logoff',                                           +        
               POS=(22,25),LTH=10,                                     +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O673N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N673,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I673N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4N673                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0212,                                                +        
               LTH=3                                                            
         MFLD  FLD0312,                                                +        
               LTH=3                                                            
         MFLD  FLD0228,                                                +        
               LTH=12                                                           
         MFLD  FLD0328,                                                +        
               LTH=12                                                           
         MFLD  FLD0255,                                                +        
               LTH=1                                                            
         MFLD  FLD0335,                                                +        
               LTH=1                                                            
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  KVKOLLIV,                                               +        
               LTH=4                                                            
         MFLD  FLD0641,                                                +        
               LTH=8                                                            
         MFLD  FLD0655,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0902,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0909,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0918,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0928,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1002,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1009,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1018,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1028,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1102,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1109,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1118,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1128,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1202,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1209,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1215,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1228,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1302,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1309,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1318,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1328,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1402,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1409,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1418,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1428,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1502,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1509,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1518,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1528,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1602,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1609,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1618,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1628,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1702,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1709,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1718,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1728,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1802,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1809,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1818,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1828,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1902,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1909,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1918,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1928,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2002,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2009,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2018,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2028,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2102,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2109,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2118,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2128,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0938,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0945,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0954,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0964,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1038,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1045,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1054,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1064,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1138,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1145,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1154,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1164,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1238,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1245,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1254,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1264,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1338,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1345,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1354,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1364,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1438,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1445,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1454,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1464,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1538,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1545,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1554,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1564,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1638,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1645,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1654,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1664,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1738,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1745,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1754,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1764,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1838,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1845,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1854,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1864,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1938,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1945,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1954,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1964,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2038,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2045,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2054,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2064,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2138,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2145,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2154,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2164,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I673N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N673),                                           +        
               OPT=2,                                                  +        
               NXT=W4O673N1                                                     
MID      LPAGE SOR=(W4N673)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '46732',                                                +        
               LTH=5                                                            
         MFLD  (FLD0212,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0312,                                               +        
               '   '),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0228,                                               +        
               '++++++++++++'),                                        +        
               LTH=12,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLD0328,                                               +        
               '            '),                                        +        
               LTH=12,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLD0255,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLD0335,                                               +        
               ' '),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDDCUT,                                                +        
               '  '),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0902,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0909,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0918,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0928,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1002,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1009,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1018,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1028,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1102,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1109,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1118,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1128,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1202,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1209,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1215,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1228,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1302,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1309,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1318,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1328,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1402,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1409,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1418,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1428,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1502,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1509,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1518,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1528,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1602,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1609,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1618,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1628,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1702,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1709,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1718,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1728,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1802,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1809,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1818,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1828,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1902,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1909,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1918,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1928,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD2002,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD2009,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD2018,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD2028,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD2102,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD2109,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD2118,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD2128,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0938,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0945,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0954,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0964,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1038,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1045,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1054,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1064,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1138,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1145,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1154,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1164,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1238,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1245,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1254,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1264,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1338,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1345,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1354,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1364,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1438,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1445,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1454,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1464,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1538,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1545,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1554,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1564,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1638,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1645,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1654,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1664,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1738,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1745,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1754,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1764,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1838,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1845,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1854,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1864,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1938,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1945,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1954,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1964,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD2038,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD2045,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD2054,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD2064,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD2138,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD2145,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD2154,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD2164,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
