***********************************************************************         
* CREATED BY V0C2425   ON 02/09/02  AT 11:19                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'PROFORMA SUPPLEMENT 2          '                                
W4N678   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W4T678 3',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T678U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4N678   DPAGE CURSOR=((4,55)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(PROT,MOD)                                                  
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(PROT,MOD)                                                  
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(PROT,MOD)                                                  
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'PROFORMA SUPPLEMENT 2',                                +        
               POS=(1,11),LTH=22,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
IDTRPTIN DFLD  POS=(2,12),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
IDLBBEIN DFLD  POS=(2,28),LTH=12,                                      +        
               ATTR=(PROT,MOD)                                                  
FLFARLIN DFLD  POS=(2,55),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDCIN   DFLD  POS=(2,61),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Transport',                                            +        
               POS=(3,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
IDTRPTUT DFLD  POS=(3,12),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Carrier',                                              +        
               POS=(3,20),LTH=7,                                       +        
               ATTR=(PROT)                                                      
IDLBBEUT DFLD  POS=(3,28),LTH=12,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Dang. goods',                                          +        
               POS=(3,42),LTH=11,                                      +        
               ATTR=(PROT)                                                      
FLFARLUT DFLD  POS=(3,55),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'DC',                                                   +        
               POS=(3,58),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDDCUT   DFLD  POS=(3,61),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Dist',                                                 +        
               POS=(4,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
IDDIST   DFLD  POS=(4,12),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Cust',                                                 +        
               POS=(4,20),LTH=4,                                       +        
               ATTR=(PROT)                                                      
IDKUND   DFLD  POS=(4,28),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Separate Inv',                                         +        
               POS=(4,42),LTH=12,                                      +        
               ATTR=(PROT)                                                      
FLSEPINV DFLD  POS=(4,55),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
FILLCURR DFLD  POS=(6,2),LTH=11,                                       +        
               ATTR=(PROT)                                                      
KDVALISO DFLD  POS=(6,15),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Freight',                                              +        
               POS=(8,2),LTH=7,                                        +        
               ATTR=(PROT)                                                      
PRFRAKT  DFLD  POS=(8,15),LTH=10,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Gross weight',                                         +        
               POS=(8,35),LTH=12,                                      +        
               ATTR=(PROT)                                                      
VKORDBTO DFLD  POS=(8,51),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Insurance',                                            +        
               POS=(9,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
PRFOERS  DFLD  POS=(9,15),LTH=10,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Gross vol.',                                           +        
               POS=(9,35),LTH=10,                                      +        
               ATTR=(PROT)                                                      
VLORDBTO DFLD  POS=(9,51),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Insurance %',                                          +        
               POS=(10,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
REFOERS  DFLD  POS=(10,19),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Value',                                                +        
               POS=(10,35),LTH=5,                                      +        
               ATTR=(PROT)                                                      
SUORDV   DFLD  POS=(10,51),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Over ins %',                                           +        
               POS=(11,2),LTH=10,                                      +        
               ATTR=(PROT)                                                      
REOVKOFF DFLD  POS=(11,21),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Legal',                                                +        
               POS=(12,2),LTH=5,                                       +        
               ATTR=(PROT)                                                      
PRLEGKST DFLD  POS=(12,15),LTH=10,                                     +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Legal %',                                              +        
               POS=(13,2),LTH=7,                                       +        
               ATTR=(PROT)                                                      
RELEGKST DFLD  POS=(13,21),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Pack handl',                                           +        
               POS=(14,2),LTH=10,                                      +        
               ATTR=(PROT)                                                      
PREMBHNT DFLD  POS=(14,15),LTH=10,                                     +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Pack handl %',                                         +        
               POS=(15,2),LTH=12,                                      +        
               ATTR=(PROT)                                                      
REEMBHNT DFLD  POS=(15,21),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Reduction',                                            +        
               POS=(16,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
PRAVDRAG DFLD  POS=(16,15),LTH=10,                                     +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Reduction %',                                          +        
               POS=(17,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
REAVDRAG DFLD  POS=(17,21),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'F3=Return to Transport Supplement 1',                  +        
               POS=(21,2),LTH=35,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'F11=Update',                                           +        
               POS=(21,65),LTH=10,                                     +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W4O678N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N678,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I678N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4N678                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  IDTRPTIN,                                               +        
               LTH=3                                                            
         MFLD  IDTRPTUT,                                               +        
               LTH=3                                                            
         MFLD  IDLBBEIN,                                               +        
               LTH=12                                                           
         MFLD  IDLBBEUT,                                               +        
               LTH=12                                                           
         MFLD  FLFARLIN,                                               +        
               LTH=1                                                            
         MFLD  FLFARLUT,                                               +        
               LTH=1                                                            
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  IDDIST,                                                 +        
               LTH=4                                                            
         MFLD  IDKUND,                                                 +        
               LTH=6                                                            
         MFLD  FLSEPINV,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FILLCURR,                                               +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDVALISO,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRFRAKT,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  PRFOERS,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  REFOERS,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  REOVKOFF,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRLEGKST,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  RELEGKST,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PREMBHNT,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  REEMBHNT,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRAVDRAG,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  REAVDRAG,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VKORDBTO,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  VLORDBTO,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SUORDV,                                                 +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I678N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N678),                                           +        
               OPT=2,                                                  +        
               NXT=W4O678N1                                                     
MID      LPAGE SOR=(W4N678)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F8'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '46782',                                                +        
               LTH=5                                                            
         MFLD  (IDTRPTIN,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLBBEIN,                                              +        
               '++++++++++++'),                                        +        
               LTH=12,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLFARLIN,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLSEPINV,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (PRFRAKT,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PRLEGKST,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RELEGKST,                                              +        
               '++++'),                                                +        
               LTH=04,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PREMBHNT,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (REEMBHNT,                                              +        
               '++++'),                                                +        
               LTH=04,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PRFOERS,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (REFOERS,                                               +        
               '++++++'),                                              +        
               LTH=06,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (REOVKOFF,                                              +        
               '++++'),                                                +        
               LTH=04,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PRAVDRAG,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (REAVDRAG,                                              +        
               '++++'),                                                +        
               LTH=04,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
