***********************************************************************         
* CREATED BY V030186   ON 02/11/21  AT 12:29                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'Ship doc - Start printing       '                               
W4N622   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=OSMSG,                                           +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W4T622 4',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T622 7',                                           +        
               8='W4T622 8',                                           +        
               9='W4T622 9',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'SHIPPING DOCUMENTS INFO-PRINT',                        +        
               POS=(1,11),LTH=29,                                      +        
               ATTR=(PROT)                                                      
TEMFS    DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Transport',                                            +        
               POS=(2,2),LTH=9,                                        +        
               ATTR=(NUM,PROT)                                                  
IDTRPTIN DFLD  POS=(2,12),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Carrier',                                              +        
               POS=(2,17),LTH=7,                                       +        
               ATTR=(PROT)                                                      
IDLBBEIN DFLD  POS=(2,25),LTH=12,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Date',                                                 +        
               POS=(2,39),LTH=4,                                       +        
               ATTR=(PROT)                                                      
TISKEPIN DFLD  POS=(2,44),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Dc',                                                   +        
               POS=(2,52),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDDCIN   DFLD  POS=(2,55),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
IDTRPTUT DFLD  POS=(3,12),LTH=3,                                       +        
               ATTR=(PROT)                                                      
IDLBBEUT DFLD  POS=(3,25),LTH=12,                                      +        
               ATTR=(PROT)                                                      
TISKEPUT DFLD  POS=(3,44),LTH=6,                                       +        
               ATTR=(PROT)                                                      
IDDCUT   DFLD  POS=(3,55),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Printer',                                              +        
               POS=(4,2),LTH=7,                                        +        
               ATTR=(PROT)                                                      
IDLTERM  DFLD  POS=(4,12),LTH=8,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Printer DC',                                           +        
               POS=(4,23),LTH=10,                                      +        
               ATTR=(PROT)                                                      
DCREC    DFLD  POS=(4,34),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Cmd    Carrier',                                       +        
               POS=(6,2),LTH=14,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Date',                                                 +        
               POS=(6,26),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Time',                                                 +        
               POS=(6,35),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Ship.no.    No. of copies',                            +        
               POS=(6,48),LTH=25,                                      +        
               ATTR=(PROT)                                                      
KDCMD01  DFLD  POS=(7,3),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDLBBE01 DFLD  POS=(7,9),LTH=12,                                       +        
               ATTR=(PROT)                                                      
TISKEP01 DFLD  POS=(7,26),LTH=6,                                       +        
               ATTR=(PROT)                                                      
TISKPT01 DFLD  POS=(7,35),LTH=6,                                       +        
               ATTR=(PROT)                                                      
IDSHIP01 DFLD  POS=(7,48),LTH=7,                                       +        
               ATTR=(PROT)                                                      
KVANTE01 DFLD  POS=(7,62),LTH=1,                                       +        
               ATTR=(PROT)                                                      
KDCMD02  DFLD  POS=(8,3),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDLBBE02 DFLD  POS=(8,9),LTH=12,                                       +        
               ATTR=(PROT)                                                      
TISKEP02 DFLD  POS=(8,26),LTH=6,                                       +        
               ATTR=(PROT)                                                      
TISKPT02 DFLD  POS=(8,35),LTH=6,                                       +        
               ATTR=(PROT)                                                      
IDSHIP02 DFLD  POS=(8,48),LTH=7,                                       +        
               ATTR=(PROT)                                                      
KVANTE02 DFLD  POS=(8,62),LTH=1,                                       +        
               ATTR=(PROT)                                                      
KDCMD03  DFLD  POS=(9,3),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDLBBE03 DFLD  POS=(9,9),LTH=12,                                       +        
               ATTR=(PROT)                                                      
TISKEP03 DFLD  POS=(9,26),LTH=6,                                       +        
               ATTR=(PROT)                                                      
TISKPT03 DFLD  POS=(9,35),LTH=6,                                       +        
               ATTR=(PROT)                                                      
IDSHIP03 DFLD  POS=(9,48),LTH=7,                                       +        
               ATTR=(PROT)                                                      
KVANTE03 DFLD  POS=(9,62),LTH=1,                                       +        
               ATTR=(PROT)                                                      
KDCMD04  DFLD  POS=(10,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDLBBE04 DFLD  POS=(10,9),LTH=12,                                      +        
               ATTR=(PROT)                                                      
TISKEP04 DFLD  POS=(10,26),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TISKPT04 DFLD  POS=(10,35),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDSHIP04 DFLD  POS=(10,48),LTH=7,                                      +        
               ATTR=(PROT)                                                      
KVANTE04 DFLD  POS=(10,62),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KDCMD05  DFLD  POS=(11,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDLBBE05 DFLD  POS=(11,9),LTH=12,                                      +        
               ATTR=(PROT)                                                      
TISKEP05 DFLD  POS=(11,26),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TISKPT05 DFLD  POS=(11,35),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDSHIP05 DFLD  POS=(11,48),LTH=7,                                      +        
               ATTR=(PROT)                                                      
KVANTE05 DFLD  POS=(11,62),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KDCMD06  DFLD  POS=(12,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDLBBE06 DFLD  POS=(12,9),LTH=12,                                      +        
               ATTR=(PROT)                                                      
TISKEP06 DFLD  POS=(12,26),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TISKPT06 DFLD  POS=(12,35),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDSHIP06 DFLD  POS=(12,48),LTH=7,                                      +        
               ATTR=(PROT)                                                      
KVANTE06 DFLD  POS=(12,62),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KDCMD07  DFLD  POS=(13,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDLBBE07 DFLD  POS=(13,9),LTH=12,                                      +        
               ATTR=(PROT)                                                      
TISKEP07 DFLD  POS=(13,26),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TISKPT07 DFLD  POS=(13,35),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDSHIP07 DFLD  POS=(13,48),LTH=7,                                      +        
               ATTR=(PROT)                                                      
KVANTE07 DFLD  POS=(13,62),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KDCMD08  DFLD  POS=(14,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDLBBE08 DFLD  POS=(14,9),LTH=12,                                      +        
               ATTR=(PROT)                                                      
TISKEP08 DFLD  POS=(14,26),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TISKPT08 DFLD  POS=(14,35),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDSHIP08 DFLD  POS=(14,48),LTH=7,                                      +        
               ATTR=(PROT)                                                      
KVANTE08 DFLD  POS=(14,62),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KDCMD09  DFLD  POS=(15,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDLBBE09 DFLD  POS=(15,9),LTH=12,                                      +        
               ATTR=(PROT)                                                      
TISKEP09 DFLD  POS=(15,26),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TISKPT09 DFLD  POS=(15,35),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDSHIP09 DFLD  POS=(15,48),LTH=7,                                      +        
               ATTR=(PROT)                                                      
KVANTE09 DFLD  POS=(15,62),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KDCMD10  DFLD  POS=(16,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDLBBE10 DFLD  POS=(16,9),LTH=12,                                      +        
               ATTR=(PROT)                                                      
TISKEP10 DFLD  POS=(16,26),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TISKPT10 DFLD  POS=(16,35),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDSHIP10 DFLD  POS=(16,48),LTH=7,                                      +        
               ATTR=(PROT)                                                      
KVANTE10 DFLD  POS=(16,62),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KDCMD11  DFLD  POS=(17,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDLBBE11 DFLD  POS=(17,9),LTH=12,                                      +        
               ATTR=(PROT)                                                      
TISKEP11 DFLD  POS=(17,26),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TISKPT11 DFLD  POS=(17,35),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDSHIP11 DFLD  POS=(17,48),LTH=7,                                      +        
               ATTR=(PROT)                                                      
KVANTE11 DFLD  POS=(17,62),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KDCMD12  DFLD  POS=(18,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDLBBE12 DFLD  POS=(18,9),LTH=12,                                      +        
               ATTR=(PROT)                                                      
TISKEP12 DFLD  POS=(18,26),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TISKPT12 DFLD  POS=(18,35),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDSHIP12 DFLD  POS=(18,48),LTH=7,                                      +        
               ATTR=(PROT)                                                      
KVANTE12 DFLD  POS=(18,62),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'F4=Print  F7=First  F8=Next  F9=Jump to 4621  F10=WHELP+        
                 F12=Logoff',                                          +        
               POS=(22,2),LTH=67,                                      +        
               ATTR=(PROT)                                                      
MPPMSG   DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0000 DFLD  POS=(23,64),LTH=17,                                     +        
               ATTR=(PROT)                                                      
OSMSG    DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O622N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N622,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I622N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFS,                                                  +        
               LTH=40                                                           
         MFLD  IDTRPTIN,                                               +        
               LTH=3                                                            
         MFLD  IDTRPTUT,                                               +        
               LTH=3                                                            
         MFLD  IDLBBEIN,                                               +        
               LTH=12                                                           
         MFLD  IDLBBEUT,                                               +        
               LTH=12                                                           
         MFLD  TISKEPIN,                                               +        
               LTH=6                                                            
         MFLD  TISKEPUT,                                               +        
               LTH=6                                                            
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  KDCMD01,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDLBBE01,                                               +        
               LTH=12                                                           
         MFLD  TISKEP01,                                               +        
               LTH=6                                                            
         MFLD  TISKPT01,                                               +        
               LTH=6                                                            
         MFLD  IDSHIP01,                                               +        
               LTH=7                                                            
         MFLD  KVANTE01,                                               +        
               LTH=1                                                            
         MFLD  KDCMD02,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDLBBE02,                                               +        
               LTH=12                                                           
         MFLD  TISKEP02,                                               +        
               LTH=6                                                            
         MFLD  TISKPT02,                                               +        
               LTH=6                                                            
         MFLD  IDSHIP02,                                               +        
               LTH=7                                                            
         MFLD  KVANTE02,                                               +        
               LTH=1                                                            
         MFLD  KDCMD03,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDLBBE03,                                               +        
               LTH=12                                                           
         MFLD  TISKEP03,                                               +        
               LTH=6                                                            
         MFLD  TISKPT03,                                               +        
               LTH=6                                                            
         MFLD  IDSHIP03,                                               +        
               LTH=7                                                            
         MFLD  KVANTE03,                                               +        
               LTH=1                                                            
         MFLD  KDCMD04,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDLBBE04,                                               +        
               LTH=12                                                           
         MFLD  TISKEP04,                                               +        
               LTH=6                                                            
         MFLD  TISKPT04,                                               +        
               LTH=6                                                            
         MFLD  IDSHIP04,                                               +        
               LTH=7                                                            
         MFLD  KVANTE04,                                               +        
               LTH=1                                                            
         MFLD  KDCMD05,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDLBBE05,                                               +        
               LTH=12                                                           
         MFLD  TISKEP05,                                               +        
               LTH=6                                                            
         MFLD  TISKPT05,                                               +        
               LTH=6                                                            
         MFLD  IDSHIP05,                                               +        
               LTH=7                                                            
         MFLD  KVANTE05,                                               +        
               LTH=1                                                            
         MFLD  KDCMD06,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDLBBE06,                                               +        
               LTH=12                                                           
         MFLD  TISKEP06,                                               +        
               LTH=6                                                            
         MFLD  TISKPT06,                                               +        
               LTH=6                                                            
         MFLD  IDSHIP06,                                               +        
               LTH=7                                                            
         MFLD  KVANTE06,                                               +        
               LTH=1                                                            
         MFLD  KDCMD07,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDLBBE07,                                               +        
               LTH=12                                                           
         MFLD  TISKEP07,                                               +        
               LTH=6                                                            
         MFLD  TISKPT07,                                               +        
               LTH=6                                                            
         MFLD  IDSHIP07,                                               +        
               LTH=7                                                            
         MFLD  KVANTE07,                                               +        
               LTH=1                                                            
         MFLD  KDCMD08,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDLBBE08,                                               +        
               LTH=12                                                           
         MFLD  TISKEP08,                                               +        
               LTH=6                                                            
         MFLD  TISKPT08,                                               +        
               LTH=6                                                            
         MFLD  IDSHIP08,                                               +        
               LTH=7                                                            
         MFLD  KVANTE08,                                               +        
               LTH=1                                                            
         MFLD  KDCMD09,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDLBBE09,                                               +        
               LTH=12                                                           
         MFLD  TISKEP09,                                               +        
               LTH=6                                                            
         MFLD  TISKPT09,                                               +        
               LTH=6                                                            
         MFLD  IDSHIP09,                                               +        
               LTH=7                                                            
         MFLD  KVANTE09,                                               +        
               LTH=1                                                            
         MFLD  KDCMD10,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDLBBE10,                                               +        
               LTH=12                                                           
         MFLD  TISKEP10,                                               +        
               LTH=6                                                            
         MFLD  TISKPT10,                                               +        
               LTH=6                                                            
         MFLD  IDSHIP10,                                               +        
               LTH=7                                                            
         MFLD  KVANTE10,                                               +        
               LTH=1                                                            
         MFLD  KDCMD11,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDLBBE11,                                               +        
               LTH=12                                                           
         MFLD  TISKEP11,                                               +        
               LTH=6                                                            
         MFLD  TISKPT11,                                               +        
               LTH=6                                                            
         MFLD  IDSHIP11,                                               +        
               LTH=7                                                            
         MFLD  KVANTE11,                                               +        
               LTH=1                                                            
         MFLD  KDCMD12,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDLBBE12,                                               +        
               LTH=12                                                           
         MFLD  TISKEP12,                                               +        
               LTH=6                                                            
         MFLD  TISKPT12,                                               +        
               LTH=6                                                            
         MFLD  IDSHIP12,                                               +        
               LTH=7                                                            
         MFLD  KVANTE12,                                               +        
               LTH=1                                                            
         MFLD  IDLTERM,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DCREC,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  MPPMSG,                                                 +        
               LTH=55                                                           
         MFLD  DGIA0000,                                               +        
               LTH=17                                                           
         MFLD  (OSMSG,                                                 +        
               ' '),                                                   +        
               LTH=79                                                           
         MSGEND                                                                 
W4I622N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N622),                                           +        
               OPT=2,                                                  +        
               NXT=W4O622N1                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '46221',                                                +        
               LTH=5                                                            
         MFLD  (IDTRPTIN,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLBBEIN,                                              +        
               '++++++++++++'),                                        +        
               LTH=12                                                           
         MFLD  (TISKEPIN,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (KDCMD01,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDCMD02,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDCMD03,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDCMD04,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDCMD05,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDCMD06,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDCMD07,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDCMD08,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDCMD09,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDCMD10,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDCMD11,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDCMD12,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLTERM,                                               +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (DCREC,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
