***********************************************************************         
* CREATED BY PC65797   ON 98/05/06  AT 09:31                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'BILL OF LADING - UPDATING       '                               
W4N669   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T669 7',                                           +        
               8='W4T669 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T669U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4N669   DPAGE CURSOR=((2,7)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'BILL OF LADING',                                       +        
               POS=(1,11),LTH=14,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Date',                                                 +        
               POS=(2,2),LTH=4,                                        +        
               ATTR=(NUM,PROT)                                                  
DATIN    DFLD  POS=(2,7),LTH=6,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Transp',                                               +        
               POS=(2,14),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
TRPTIN   DFLD  POS=(2,21),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Carrier',                                              +        
               POS=(2,25),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
LBBIN    DFLD  POS=(2,33),LTH=12,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Distr',                                                +        
               POS=(2,46),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
DISTRIN  DFLD  POS=(2,52),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Cust',                                                 +        
               POS=(2,57),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
KUNDIN   DFLD  POS=(2,62),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,69),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DATUT    DFLD  POS=(3,7),LTH=6,                                        +        
               ATTR=(PROT,MOD)                                                  
TRPTUT   DFLD  POS=(3,21),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
LBBUT    DFLD  POS=(3,33),LTH=12,                                      +        
               ATTR=(PROT,MOD)                                                  
DISTRUT  DFLD  POS=(3,52),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
KUNDUT   DFLD  POS=(3,62),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDCUT   DFLD  POS=(3,72),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Ship to adress',                                       +        
               POS=(5,2),LTH=14,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'New ship to address',                                  +        
               POS=(5,40),LTH=19,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '1',                                                    +        
               POS=(6,2),LTH=1,                                        +        
               ATTR=(PROT)                                                      
RAD1UT   DFLD  POS=(6,4),LTH=35,                                       +        
               ATTR=(PROT,MOD)                                                  
RAD1IN   DFLD  POS=(6,40),LTH=35,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  '2',                                                    +        
               POS=(7,2),LTH=1,                                        +        
               ATTR=(PROT)                                                      
RAD2UT   DFLD  POS=(7,4),LTH=35,                                       +        
               ATTR=(PROT,MOD)                                                  
RAD2IN   DFLD  POS=(7,40),LTH=35,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  '3',                                                    +        
               POS=(8,2),LTH=1,                                        +        
               ATTR=(PROT)                                                      
GATAUT   DFLD  POS=(8,4),LTH=35,                                       +        
               ATTR=(PROT,MOD)                                                  
GATAIN   DFLD  POS=(8,40),LTH=35,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  '4',                                                    +        
               POS=(9,2),LTH=1,                                        +        
               ATTR=(PROT)                                                      
PADRUT   DFLD  POS=(9,4),LTH=35,                                       +        
               ATTR=(PROT,MOD)                                                  
PADRIN   DFLD  POS=(9,40),LTH=35,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Cmd   Order',                                          +        
               POS=(11,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Prod',                                                 +        
               POS=(11,21),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '  Case PSN  Class Case code  Gross Weight',            +        
               POS=(11,27),LTH=41,                                     +        
               ATTR=(PROT)                                                      
CMD1     DFLD  POS=(12,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
ORDER1   DFLD  POS=(12,6),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
PRODNR1  DFLD  POS=(12,18),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
KOLLI1   DFLD  POS=(12,27),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
PSN1     DFLD  POS=(12,34),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
KLASS1   DFLD  POS=(12,41),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
KDKOLL1  DFLD  POS=(12,47),LTH=8,                                      +        
               ATTR=(NOPROT,MOD)                                                
VIKT1    DFLD  POS=(12,56),LTH=8,                                      +        
               ATTR=(NOPROT,MOD)                                                
CMD2     DFLD  POS=(13,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
ORDER2   DFLD  POS=(13,6),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
PRODNR2  DFLD  POS=(13,18),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
KOLLI2   DFLD  POS=(13,27),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
PSN2     DFLD  POS=(13,34),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
KLASS2   DFLD  POS=(13,41),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
KDKOLL2  DFLD  POS=(13,47),LTH=8,                                      +        
               ATTR=(NOPROT,MOD)                                                
VIKT2    DFLD  POS=(13,56),LTH=8,                                      +        
               ATTR=(NOPROT,MOD)                                                
CMD3     DFLD  POS=(14,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
ORDER3   DFLD  POS=(14,6),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
PRODNR3  DFLD  POS=(14,18),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
KOLLI3   DFLD  POS=(14,27),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
PSN3     DFLD  POS=(14,34),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
KLASS3   DFLD  POS=(14,41),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
KDKOLL3  DFLD  POS=(14,47),LTH=8,                                      +        
               ATTR=(NOPROT,MOD)                                                
VIKT3    DFLD  POS=(14,56),LTH=8,                                      +        
               ATTR=(NOPROT,MOD)                                                
CMD4     DFLD  POS=(15,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
ORDER4   DFLD  POS=(15,6),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
PRODNR4  DFLD  POS=(15,18),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
KOLLI4   DFLD  POS=(15,27),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
PSN4     DFLD  POS=(15,34),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
KLASS4   DFLD  POS=(15,41),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
KDKOLL4  DFLD  POS=(15,47),LTH=8,                                      +        
               ATTR=(NOPROT,MOD)                                                
VIKT4    DFLD  POS=(15,56),LTH=8,                                      +        
               ATTR=(NOPROT,MOD)                                                
CMD5     DFLD  POS=(16,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
ORDER5   DFLD  POS=(16,6),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
PRODNR5  DFLD  POS=(16,18),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
KOLLI5   DFLD  POS=(16,27),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
PSN5     DFLD  POS=(16,34),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
KLASS5   DFLD  POS=(16,41),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
KDKOLL5  DFLD  POS=(16,47),LTH=8,                                      +        
               ATTR=(NOPROT,MOD)                                                
VIKT5    DFLD  POS=(16,56),LTH=8,                                      +        
               ATTR=(NOPROT,MOD)                                                
CMD6     DFLD  POS=(17,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
ORDER6   DFLD  POS=(17,6),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
PRODNR6  DFLD  POS=(17,18),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
KOLLI6   DFLD  POS=(17,27),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
PSN6     DFLD  POS=(17,34),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
KLASS6   DFLD  POS=(17,41),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
KDKOLL6  DFLD  POS=(17,47),LTH=8,                                      +        
               ATTR=(NOPROT,MOD)                                                
VIKT6    DFLD  POS=(17,56),LTH=8,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Update a case (A=add, D=delete):',                     +        
               POS=(19,2),LTH=32,                                      +        
               ATTR=(PROT)                                                      
CMD      DFLD  POS=(20,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
ORDER    DFLD  POS=(20,9),LTH=7,                                       +        
               ATTR=(NOPROT,MOD)                                                
PRODNR   DFLD  POS=(20,21),LTH=7,                                      +        
               ATTR=(NOPROT,MOD)                                                
KOLLI    DFLD  POS=(20,29),LTH=5,                                      +        
               ATTR=(NOPROT,MOD)                                                
PSN      DFLD  POS=(20,35),LTH=3,                                      +        
               ATTR=(NOPROT,MOD)                                                
KLASS    DFLD  POS=(20,41),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
KDKOLLI  DFLD  POS=(20,47),LTH=8,                                      +        
               ATTR=(NOPROT,MOD)                                                
VIKT     DFLD  POS=(20,60),LTH=8,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'F7=First        F8=Forward     F10=WHELP',             +        
               POS=(22,2),LTH=40,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'F11=Update    F12=Logoff',                             +        
               POS=(22,47),LTH=24,                                     +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O669N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N669,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I669N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4N669,                                             +        
               NXT=W4I669N1                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  DATIN,                                                  +        
               LTH=6                                                            
         MFLD  DATUT,                                                  +        
               LTH=6                                                            
         MFLD  TRPTIN,                                                 +        
               LTH=3                                                            
         MFLD  TRPTUT,                                                 +        
               LTH=3                                                            
         MFLD  LBBIN,                                                  +        
               LTH=12                                                           
         MFLD  LBBUT,                                                  +        
               LTH=12                                                           
         MFLD  DISTRIN,                                                +        
               LTH=4                                                            
         MFLD  DISTRUT,                                                +        
               LTH=4                                                            
         MFLD  KUNDIN,                                                 +        
               LTH=6                                                            
         MFLD  KUNDUT,                                                 +        
               LTH=6                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  RAD1IN,                                                 +        
               LTH=35                                                           
         MFLD  RAD1UT,                                                 +        
               LTH=35                                                           
         MFLD  RAD2IN,                                                 +        
               LTH=35                                                           
         MFLD  RAD2UT,                                                 +        
               LTH=35                                                           
         MFLD  GATAIN,                                                 +        
               LTH=35                                                           
         MFLD  GATAUT,                                                 +        
               LTH=35                                                           
         MFLD  PADRIN,                                                 +        
               LTH=35                                                           
         MFLD  PADRUT,                                                 +        
               LTH=35                                                           
         MFLD  CMD1,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORDER1,                                                 +        
               LTH=7                                                            
         MFLD  PRODNR1,                                                +        
               LTH=7                                                            
         MFLD  KOLLI1,                                                 +        
               LTH=5                                                            
         MFLD  PSN1,                                                   +        
               LTH=3                                                            
         MFLD  KLASS1,                                                 +        
               LTH=1                                                            
         MFLD  KDKOLL1,                                                +        
               LTH=8                                                            
         MFLD  VIKT1,                                                  +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  CMD2,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORDER2,                                                 +        
               LTH=7                                                            
         MFLD  PRODNR2,                                                +        
               LTH=7                                                            
         MFLD  KOLLI2,                                                 +        
               LTH=5                                                            
         MFLD  PSN2,                                                   +        
               LTH=3                                                            
         MFLD  KLASS2,                                                 +        
               LTH=1                                                            
         MFLD  KDKOLL2,                                                +        
               LTH=8                                                            
         MFLD  VIKT2,                                                  +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  CMD3,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORDER3,                                                 +        
               LTH=7                                                            
         MFLD  PRODNR3,                                                +        
               LTH=7                                                            
         MFLD  KOLLI3,                                                 +        
               LTH=5                                                            
         MFLD  PSN3,                                                   +        
               LTH=3                                                            
         MFLD  KLASS3,                                                 +        
               LTH=1                                                            
         MFLD  KDKOLL3,                                                +        
               LTH=8                                                            
         MFLD  VIKT3,                                                  +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  CMD4,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORDER4,                                                 +        
               LTH=7                                                            
         MFLD  PRODNR4,                                                +        
               LTH=7                                                            
         MFLD  KOLLI4,                                                 +        
               LTH=5                                                            
         MFLD  PSN4,                                                   +        
               LTH=3                                                            
         MFLD  KLASS4,                                                 +        
               LTH=1                                                            
         MFLD  KDKOLL4,                                                +        
               LTH=8                                                            
         MFLD  VIKT4,                                                  +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  CMD5,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORDER5,                                                 +        
               LTH=7                                                            
         MFLD  PRODNR5,                                                +        
               LTH=7                                                            
         MFLD  KOLLI5,                                                 +        
               LTH=5                                                            
         MFLD  PSN5,                                                   +        
               LTH=3                                                            
         MFLD  KLASS5,                                                 +        
               LTH=1                                                            
         MFLD  KDKOLL5,                                                +        
               LTH=8                                                            
         MFLD  VIKT5,                                                  +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  CMD6,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORDER6,                                                 +        
               LTH=7                                                            
         MFLD  PRODNR6,                                                +        
               LTH=7                                                            
         MFLD  KOLLI6,                                                 +        
               LTH=5                                                            
         MFLD  PSN6,                                                   +        
               LTH=3                                                            
         MFLD  KLASS6,                                                 +        
               LTH=1                                                            
         MFLD  KDKOLL6,                                                +        
               LTH=8                                                            
         MFLD  VIKT6,                                                  +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  CMD,                                                    +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ORDER,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRODNR,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLI,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PSN,                                                    +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KLASS,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDKOLLI,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  VIKT,                                                   +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I669N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N669),                                           +        
               OPT=2,                                                  +        
               NXT=W4O669N1                                                     
MID      LPAGE SOR=(W4N669),                                           +        
               NXT=W4O669N1                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F9'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '46692',                                                +        
               LTH=5                                                            
         MFLD  (DATIN,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DATUT,                                                  +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TRPTIN,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  TRPTUT,                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LBBIN,                                                 +        
               '++++++++++++'),                                        +        
               LTH=12,                                                 +        
               FILL=X'40'                                                       
         MFLD  LBBUT,                                                  +        
               LTH=12,                                                 +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DISTRIN,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DISTRUT,                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KUNDIN,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KUNDUT,                                                 +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  IDDCUT,                                                 +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RAD1IN,                                                +        
               '+++++++++++++++++++++++++++++++++++'),                 +        
               LTH=35,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  RAD1UT,                                                 +        
               LTH=35,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (RAD2IN,                                                +        
               '+++++++++++++++++++++++++++++++++++'),                 +        
               LTH=35,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  RAD2UT,                                                 +        
               LTH=35,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (GATAIN,                                                +        
               '+++++++++++++++++++++++++++++++++++'),                 +        
               LTH=35,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  GATAUT,                                                 +        
               LTH=35,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (PADRIN,                                                +        
               '+++++++++++++++++++++++++++++++++++'),                 +        
               LTH=35,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  PADRUT,                                                 +        
               LTH=35,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (CMD1,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  ORDER1,                                                 +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  PRODNR1,                                                +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KOLLI1,                                                 +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  PSN1,                                                   +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KLASS1,                                                 +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KDKOLL1,                                                +        
               LTH=8,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  VIKT1,                                                  +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CMD2,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  ORDER2,                                                 +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  PRODNR2,                                                +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KOLLI2,                                                 +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  PSN2,                                                   +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KLASS2,                                                 +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KDKOLL2,                                                +        
               LTH=8,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  VIKT2,                                                  +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CMD3,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  ORDER3,                                                 +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  PRODNR3,                                                +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KOLLI3,                                                 +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  PSN3,                                                   +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KLASS3,                                                 +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KDKOLL3,                                                +        
               LTH=8,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  VIKT3,                                                  +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CMD4,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  ORDER4,                                                 +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  PRODNR4,                                                +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KOLLI4,                                                 +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  PSN4,                                                   +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KLASS4,                                                 +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KDKOLL4,                                                +        
               LTH=8,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  VIKT4,                                                  +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CMD5,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  ORDER5,                                                 +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  PRODNR5,                                                +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KOLLI5,                                                 +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  PSN5,                                                   +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KLASS5,                                                 +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KDKOLL5,                                                +        
               LTH=8,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  VIKT5,                                                  +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CMD6,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  ORDER6,                                                 +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  PRODNR6,                                                +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KOLLI6,                                                 +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  PSN6,                                                   +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KLASS6,                                                 +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KDKOLL6,                                                +        
               LTH=8,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  VIKT6,                                                  +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CMD,                                                   +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (ORDER,                                                 +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PRODNR,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOLLI,                                                 +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PSN,                                                   +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KLASS,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDKOLLI,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (VIKT,                                                  +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
