***********************************************************************         
* CREATED BY V0C2425   ON 02/06/18  AT 17:20                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'SHIPMENT PER DISTRITC           '                               
W4N623   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T623 7',                                           +        
               8='W4T623 8',                                           +        
               9='W4T623 9',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4N623   DPAGE CURSOR=((2,08)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'SHIPMENT PER DISTRICT',                                +        
               POS=(1,11),LTH=21,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Distr',                                                +        
               POS=(2,2),LTH=5,                                        +        
               ATTR=(NUM,PROT)                                                  
DISTIN   DFLD  POS=(2,8),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Cust',                                                 +        
               POS=(2,16),LTH=4,                                       +        
               ATTR=(PROT)                                                      
CUSTIN   DFLD  POS=(2,21),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,32),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDDCIN   DFLD  POS=(2,36),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
DISTUT   DFLD  POS=(3,8),LTH=4,                                        +        
               ATTR=(PROT)                                                      
CUSTUT   DFLD  POS=(3,21),LTH=6,                                       +        
               ATTR=(PROT)                                                      
IDDCUT   DFLD  POS=(3,36),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Cmd   Ship No   Transp Id',                            +        
               POS=(5,2),LTH=25,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Carri-Type',                                           +        
               POS=(5,32),LTH=10,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Time',                                                 +        
               POS=(5,47),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'date',                                                 +        
               POS=(5,58),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KDCMD01  DFLD  POS=(6,3),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDSHIP01 DFLD  POS=(6,8),LTH=7,                                        +        
               ATTR=(PROT)                                                      
IDTRPT01 DFLD  POS=(6,24),LTH=3,                                       +        
               ATTR=(PROT)                                                      
IDLBBE01 DFLD  POS=(6,30),LTH=12,                                      +        
               ATTR=(PROT)                                                      
TISKPT01 DFLD  POS=(6,45),LTH=6,                                       +        
               ATTR=(PROT)                                                      
TISKEP01 DFLD  POS=(6,56),LTH=6,                                       +        
               ATTR=(PROT)                                                      
KDCMD02  DFLD  POS=(7,3),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDSHIP02 DFLD  POS=(7,8),LTH=7,                                        +        
               ATTR=(PROT)                                                      
IDTRPT02 DFLD  POS=(7,24),LTH=3,                                       +        
               ATTR=(PROT)                                                      
IDLBBE02 DFLD  POS=(7,30),LTH=12,                                      +        
               ATTR=(PROT)                                                      
TISKPT02 DFLD  POS=(7,45),LTH=6,                                       +        
               ATTR=(PROT)                                                      
TISKEP02 DFLD  POS=(7,56),LTH=6,                                       +        
               ATTR=(PROT)                                                      
KDCMD03  DFLD  POS=(8,3),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDSHIP03 DFLD  POS=(8,8),LTH=7,                                        +        
               ATTR=(PROT)                                                      
IDTRPT03 DFLD  POS=(8,24),LTH=3,                                       +        
               ATTR=(PROT)                                                      
IDLBBE03 DFLD  POS=(8,30),LTH=12,                                      +        
               ATTR=(PROT)                                                      
TISKPT03 DFLD  POS=(8,45),LTH=6,                                       +        
               ATTR=(PROT)                                                      
TISKEP03 DFLD  POS=(8,56),LTH=6,                                       +        
               ATTR=(PROT)                                                      
KDCMD04  DFLD  POS=(9,3),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDSHIP04 DFLD  POS=(9,8),LTH=7,                                        +        
               ATTR=(PROT)                                                      
IDTRPT04 DFLD  POS=(9,24),LTH=3,                                       +        
               ATTR=(PROT)                                                      
IDLBBE04 DFLD  POS=(9,30),LTH=12,                                      +        
               ATTR=(PROT)                                                      
TISKPT04 DFLD  POS=(9,45),LTH=6,                                       +        
               ATTR=(PROT)                                                      
TISKEP04 DFLD  POS=(9,56),LTH=7,                                       +        
               ATTR=(PROT)                                                      
KDCMD05  DFLD  POS=(10,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDSHIP05 DFLD  POS=(10,8),LTH=7,                                       +        
               ATTR=(PROT)                                                      
IDTRPT05 DFLD  POS=(10,24),LTH=3,                                      +        
               ATTR=(PROT)                                                      
IDLBBE05 DFLD  POS=(10,30),LTH=12,                                     +        
               ATTR=(PROT)                                                      
TISKPT05 DFLD  POS=(10,45),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TISKEP05 DFLD  POS=(10,56),LTH=7,                                      +        
               ATTR=(PROT)                                                      
KDCMD06  DFLD  POS=(11,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDSHIP06 DFLD  POS=(11,8),LTH=7,                                       +        
               ATTR=(PROT)                                                      
IDTRPT06 DFLD  POS=(11,24),LTH=3,                                      +        
               ATTR=(PROT)                                                      
IDLBBE06 DFLD  POS=(11,30),LTH=12,                                     +        
               ATTR=(PROT)                                                      
TISKPT06 DFLD  POS=(11,45),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TISKEP06 DFLD  POS=(11,56),LTH=7,                                      +        
               ATTR=(PROT)                                                      
KDCMD07  DFLD  POS=(12,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDSHIP07 DFLD  POS=(12,8),LTH=7,                                       +        
               ATTR=(PROT)                                                      
IDTRPT07 DFLD  POS=(12,24),LTH=3,                                      +        
               ATTR=(PROT)                                                      
IDLBBE07 DFLD  POS=(12,30),LTH=12,                                     +        
               ATTR=(PROT)                                                      
TISKPT07 DFLD  POS=(12,45),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TISKEP07 DFLD  POS=(12,56),LTH=7,                                      +        
               ATTR=(PROT)                                                      
KDCMD08  DFLD  POS=(13,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDSHIP08 DFLD  POS=(13,8),LTH=7,                                       +        
               ATTR=(PROT)                                                      
IDTRPT08 DFLD  POS=(13,24),LTH=3,                                      +        
               ATTR=(PROT)                                                      
IDLBBE08 DFLD  POS=(13,30),LTH=12,                                     +        
               ATTR=(PROT)                                                      
TISKPT08 DFLD  POS=(13,45),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TISKEP08 DFLD  POS=(13,56),LTH=7,                                      +        
               ATTR=(PROT)                                                      
KDCMD09  DFLD  POS=(14,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDSHIP09 DFLD  POS=(14,8),LTH=7,                                       +        
               ATTR=(PROT)                                                      
IDTRPT09 DFLD  POS=(14,24),LTH=3,                                      +        
               ATTR=(PROT)                                                      
IDLBBE09 DFLD  POS=(14,30),LTH=12,                                     +        
               ATTR=(PROT)                                                      
TISKPT09 DFLD  POS=(14,45),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TISKEP09 DFLD  POS=(14,56),LTH=7,                                      +        
               ATTR=(PROT)                                                      
KDCMD10  DFLD  POS=(15,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDSHIP10 DFLD  POS=(15,8),LTH=7,                                       +        
               ATTR=(PROT)                                                      
IDTRPT10 DFLD  POS=(15,24),LTH=3,                                      +        
               ATTR=(PROT)                                                      
IDLBBE10 DFLD  POS=(15,30),LTH=12,                                     +        
               ATTR=(PROT)                                                      
TISKPT10 DFLD  POS=(15,45),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TISKEP10 DFLD  POS=(15,56),LTH=7,                                      +        
               ATTR=(PROT)                                                      
KDCMD11  DFLD  POS=(16,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDSHIP11 DFLD  POS=(16,8),LTH=7,                                       +        
               ATTR=(PROT)                                                      
IDTRPT11 DFLD  POS=(16,24),LTH=3,                                      +        
               ATTR=(PROT)                                                      
IDLBBE11 DFLD  POS=(16,30),LTH=12,                                     +        
               ATTR=(PROT)                                                      
TISKPT11 DFLD  POS=(16,45),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TISKEP11 DFLD  POS=(16,56),LTH=7,                                      +        
               ATTR=(PROT)                                                      
KDCMD12  DFLD  POS=(17,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDSHIP12 DFLD  POS=(17,8),LTH=7,                                       +        
               ATTR=(PROT)                                                      
IDTRPT12 DFLD  POS=(17,24),LTH=3,                                      +        
               ATTR=(PROT)                                                      
IDLBBE12 DFLD  POS=(17,30),LTH=12,                                     +        
               ATTR=(PROT)                                                      
TISKPT12 DFLD  POS=(17,45),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TISKEP12 DFLD  POS=(17,56),LTH=7,                                      +        
               ATTR=(PROT)                                                      
KDCMD13  DFLD  POS=(18,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDSHIP13 DFLD  POS=(18,8),LTH=7,                                       +        
               ATTR=(PROT)                                                      
IDTRPT13 DFLD  POS=(18,24),LTH=3,                                      +        
               ATTR=(PROT)                                                      
IDLBBE13 DFLD  POS=(18,30),LTH=12,                                     +        
               ATTR=(PROT)                                                      
TISKPT13 DFLD  POS=(18,45),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TISKEP13 DFLD  POS=(18,56),LTH=7,                                      +        
               ATTR=(PROT)                                                      
KDCMD14  DFLD  POS=(19,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDSHIP14 DFLD  POS=(19,8),LTH=7,                                       +        
               ATTR=(PROT)                                                      
IDTRPT14 DFLD  POS=(19,24),LTH=3,                                      +        
               ATTR=(PROT)                                                      
IDLBBE14 DFLD  POS=(19,30),LTH=12,                                     +        
               ATTR=(PROT)                                                      
TISKPT14 DFLD  POS=(19,45),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TISKEP14 DFLD  POS=(19,56),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'F7=First',                                             +        
               POS=(21,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'F8=Next',                                              +        
               POS=(21,18),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'F9=Booking Information',                               +        
               POS=(21,34),LTH=22,                                     +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O623N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N623,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I623N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4N623                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  DISTIN,                                                 +        
               LTH=4                                                            
         MFLD  DISTUT,                                                 +        
               LTH=4                                                            
         MFLD  CUSTIN,                                                 +        
               LTH=6                                                            
         MFLD  CUSTUT,                                                 +        
               LTH=6                                                            
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  KDCMD01,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDSHIP01,                                               +        
               LTH=7                                                            
         MFLD  IDTRPT01,                                               +        
               LTH=3                                                            
         MFLD  IDLBBE01,                                               +        
               LTH=12                                                           
         MFLD  TISKPT01,                                               +        
               LTH=6                                                            
         MFLD  TISKEP01,                                               +        
               LTH=6                                                            
         MFLD  KDCMD02,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDSHIP02,                                               +        
               LTH=7                                                            
         MFLD  IDTRPT02,                                               +        
               LTH=3                                                            
         MFLD  IDLBBE02,                                               +        
               LTH=12                                                           
         MFLD  TISKPT02,                                               +        
               LTH=6                                                            
         MFLD  TISKEP02,                                               +        
               LTH=6                                                            
         MFLD  KDCMD03,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDSHIP03,                                               +        
               LTH=7                                                            
         MFLD  IDTRPT03,                                               +        
               LTH=3                                                            
         MFLD  IDLBBE03,                                               +        
               LTH=12                                                           
         MFLD  TISKPT03,                                               +        
               LTH=6                                                            
         MFLD  TISKEP03,                                               +        
               LTH=6                                                            
         MFLD  KDCMD04,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDSHIP04,                                               +        
               LTH=7                                                            
         MFLD  IDTRPT04,                                               +        
               LTH=3                                                            
         MFLD  IDLBBE04,                                               +        
               LTH=12                                                           
         MFLD  TISKPT04,                                               +        
               LTH=6                                                            
         MFLD  TISKEP04,                                               +        
               LTH=6                                                            
         MFLD  KDCMD05,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDSHIP05,                                               +        
               LTH=7                                                            
         MFLD  IDTRPT05,                                               +        
               LTH=3                                                            
         MFLD  IDLBBE05,                                               +        
               LTH=12                                                           
         MFLD  TISKPT05,                                               +        
               LTH=6                                                            
         MFLD  TISKEP05,                                               +        
               LTH=6                                                            
         MFLD  KDCMD06,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDSHIP06,                                               +        
               LTH=7                                                            
         MFLD  IDTRPT06,                                               +        
               LTH=3                                                            
         MFLD  IDLBBE06,                                               +        
               LTH=12                                                           
         MFLD  TISKPT06,                                               +        
               LTH=6                                                            
         MFLD  TISKEP06,                                               +        
               LTH=6                                                            
         MFLD  KDCMD07,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDSHIP07,                                               +        
               LTH=7                                                            
         MFLD  IDTRPT07,                                               +        
               LTH=3                                                            
         MFLD  IDLBBE07,                                               +        
               LTH=12                                                           
         MFLD  TISKPT07,                                               +        
               LTH=6                                                            
         MFLD  TISKEP07,                                               +        
               LTH=6                                                            
         MFLD  KDCMD08,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDSHIP08,                                               +        
               LTH=7                                                            
         MFLD  IDTRPT08,                                               +        
               LTH=3                                                            
         MFLD  IDLBBE08,                                               +        
               LTH=12                                                           
         MFLD  TISKPT08,                                               +        
               LTH=6                                                            
         MFLD  TISKEP08,                                               +        
               LTH=6                                                            
         MFLD  KDCMD09,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDSHIP09,                                               +        
               LTH=7                                                            
         MFLD  IDTRPT09,                                               +        
               LTH=3                                                            
         MFLD  IDLBBE09,                                               +        
               LTH=12                                                           
         MFLD  TISKPT09,                                               +        
               LTH=6                                                            
         MFLD  TISKEP09,                                               +        
               LTH=6                                                            
         MFLD  KDCMD10,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDSHIP10,                                               +        
               LTH=7                                                            
         MFLD  IDTRPT10,                                               +        
               LTH=3                                                            
         MFLD  IDLBBE10,                                               +        
               LTH=12                                                           
         MFLD  TISKPT10,                                               +        
               LTH=6                                                            
         MFLD  TISKEP10,                                               +        
               LTH=6                                                            
         MFLD  KDCMD11,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDSHIP11,                                               +        
               LTH=7                                                            
         MFLD  IDTRPT11,                                               +        
               LTH=3                                                            
         MFLD  IDLBBE11,                                               +        
               LTH=12                                                           
         MFLD  TISKPT11,                                               +        
               LTH=6                                                            
         MFLD  TISKEP11,                                               +        
               LTH=6                                                            
         MFLD  KDCMD12,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDSHIP12,                                               +        
               LTH=7                                                            
         MFLD  IDTRPT12,                                               +        
               LTH=3                                                            
         MFLD  IDLBBE12,                                               +        
               LTH=12                                                           
         MFLD  TISKPT12,                                               +        
               LTH=6                                                            
         MFLD  TISKEP12,                                               +        
               LTH=6                                                            
         MFLD  KDCMD13,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDSHIP13,                                               +        
               LTH=7                                                            
         MFLD  IDTRPT13,                                               +        
               LTH=3                                                            
         MFLD  IDLBBE13,                                               +        
               LTH=12                                                           
         MFLD  TISKPT13,                                               +        
               LTH=6                                                            
         MFLD  TISKEP13,                                               +        
               LTH=6                                                            
         MFLD  KDCMD14,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDSHIP14,                                               +        
               LTH=7                                                            
         MFLD  IDTRPT14,                                               +        
               LTH=3                                                            
         MFLD  IDLBBE14,                                               +        
               LTH=12                                                           
         MFLD  TISKPT14,                                               +        
               LTH=6                                                            
         MFLD  TISKEP14,                                               +        
               LTH=6                                                            
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I623N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N623),                                           +        
               OPT=2,                                                  +        
               NXT=W4O623N1                                                     
MID      LPAGE SOR=(W4N623)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '46232',                                                +        
               LTH=5                                                            
         MFLD  (DISTIN,                                                +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CUSTIN,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDCMD01,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDCMD02,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDCMD03,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDCMD04,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDCMD05,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDCMD06,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDCMD07,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDCMD08,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDCMD09,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDCMD10,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDCMD11,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDCMD12,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDCMD13,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDCMD14,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
