***********************************************************************         
* CREATED BY PCC6483   ON 97/03/24  AT 12:33                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'ORDERPLANNING PER TRANSPORT     '                               
W4N653   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W4T653  ',                                           +        
               4='W4T654  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T653 7',                                           +        
               8='W4T653 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W4T653  ',                                          +        
               16='W4T654  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,5)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'ORDER PLANNING PER TRANSPORT',                         +        
               POS=(1,11),LTH=28,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'DC',                                                   +        
               POS=(2,2),LTH=2,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDDCIN   DFLD  POS=(2,5),LTH=2,                                        +        
               ATTR=(NOPROT)                                                    
         DFLD  'RFS',                                                  +        
               POS=(2,9),LTH=3,                                        +        
               ATTR=(PROT)                                                      
TIRFSIN  DFLD  POS=(2,13),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Transport no. from',                                   +        
               POS=(2,22),LTH=18,                                      +        
               ATTR=(PROT)                                                      
IDTRPFIN DFLD  POS=(2,41),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'to',                                                   +        
               POS=(2,46),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDTRPTIN DFLD  POS=(2,49),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
IDDCUT   DFLD  POS=(3,5),LTH=2,                                        +        
               ATTR=(PROT,MOD)                                                  
TIRFSUT  DFLD  POS=(3,13),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
IDTRPFUT DFLD  POS=(3,41),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
IDTRPTUT DFLD  POS=(3,49),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Transp.  Ordq. l.   Printed   %  Packed    %  Cases  * +        
                Loaded    %    Inv    %',                              +        
               POS=(5,2),LTH=79,                                       +        
               ATTR=(PROT)                                                      
IDTRP1   DFLD  POS=(6,4),LTH=3,                                        +        
               ATTR=(PROT)                                                      
KVRAD1   DFLD  POS=(6,13),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KVPR1    DFLD  POS=(6,23),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KVPRPR1  DFLD  POS=(6,30),LTH=3,                                       +        
               ATTR=(PROT)                                                      
KVPA1    DFLD  POS=(6,36),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KVPAPR1  DFLD  POS=(6,43),LTH=3,                                       +        
               ATTR=(PROT)                                                      
KVKOLL1  DFLD  POS=(6,49),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FILL1    DFLD  POS=(6,55),LTH=1,                                       +        
               ATTR=(PROT)                                                      
KVLAST1  DFLD  POS=(6,59),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KVLAPR1  DFLD  POS=(6,66),LTH=3,                                       +        
               ATTR=(PROT)                                                      
KVFAKT1  DFLD  POS=(6,72),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KVFAPR1  DFLD  POS=(6,78),LTH=3,                                       +        
               ATTR=(PROT)                                                      
IDTRP2   DFLD  POS=(7,4),LTH=3,                                        +        
               ATTR=(PROT)                                                      
KVRAD2   DFLD  POS=(7,13),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KVPR2    DFLD  POS=(7,23),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KVPRPR2  DFLD  POS=(7,30),LTH=3,                                       +        
               ATTR=(PROT)                                                      
KVPA2    DFLD  POS=(7,36),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KVPAPR2  DFLD  POS=(7,43),LTH=3,                                       +        
               ATTR=(PROT)                                                      
KVKOLL2  DFLD  POS=(7,49),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FILL2    DFLD  POS=(7,55),LTH=1,                                       +        
               ATTR=(PROT)                                                      
KVLAST2  DFLD  POS=(7,59),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KVLAPR2  DFLD  POS=(7,66),LTH=3,                                       +        
               ATTR=(PROT)                                                      
KVFAKT2  DFLD  POS=(7,72),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KVFAPR2  DFLD  POS=(7,78),LTH=3,                                       +        
               ATTR=(PROT)                                                      
IDTRP3   DFLD  POS=(8,4),LTH=3,                                        +        
               ATTR=(PROT)                                                      
KVRAD3   DFLD  POS=(8,13),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KVPR3    DFLD  POS=(8,23),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KVPRPR3  DFLD  POS=(8,30),LTH=3,                                       +        
               ATTR=(PROT)                                                      
KVPA3    DFLD  POS=(8,36),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KVPAPR3  DFLD  POS=(8,43),LTH=3,                                       +        
               ATTR=(PROT)                                                      
KVKOLL3  DFLD  POS=(8,49),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FILL3    DFLD  POS=(8,55),LTH=1,                                       +        
               ATTR=(PROT)                                                      
KVLAST3  DFLD  POS=(8,59),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KVLAPR3  DFLD  POS=(8,66),LTH=3,                                       +        
               ATTR=(PROT)                                                      
KVFAKT3  DFLD  POS=(8,72),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KVFAPR3  DFLD  POS=(8,78),LTH=3,                                       +        
               ATTR=(PROT)                                                      
IDTRP4   DFLD  POS=(9,4),LTH=3,                                        +        
               ATTR=(PROT)                                                      
KVRAD4   DFLD  POS=(9,13),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KVPR4    DFLD  POS=(9,23),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KVPRPR4  DFLD  POS=(9,30),LTH=3,                                       +        
               ATTR=(PROT)                                                      
KVPA4    DFLD  POS=(9,36),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KVPAPR4  DFLD  POS=(9,43),LTH=3,                                       +        
               ATTR=(PROT)                                                      
KVKOLL4  DFLD  POS=(9,49),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FILL4    DFLD  POS=(9,55),LTH=1,                                       +        
               ATTR=(PROT)                                                      
KVLAST4  DFLD  POS=(9,59),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KVLAPR4  DFLD  POS=(9,66),LTH=3,                                       +        
               ATTR=(PROT)                                                      
KVFAKT4  DFLD  POS=(9,72),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KVFAPR4  DFLD  POS=(9,78),LTH=3,                                       +        
               ATTR=(PROT)                                                      
IDTRP5   DFLD  POS=(10,4),LTH=3,                                       +        
               ATTR=(PROT)                                                      
KVRAD5   DFLD  POS=(10,13),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVPR5    DFLD  POS=(10,23),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVPRPR5  DFLD  POS=(10,30),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KVPA5    DFLD  POS=(10,36),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVPAPR5  DFLD  POS=(10,43),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KVKOLL5  DFLD  POS=(10,49),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FILL5    DFLD  POS=(10,55),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KVLAST5  DFLD  POS=(10,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KVLAPR5  DFLD  POS=(10,66),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KVFAKT5  DFLD  POS=(10,72),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KVFAPR5  DFLD  POS=(10,78),LTH=3,                                      +        
               ATTR=(PROT)                                                      
IDTRP6   DFLD  POS=(11,4),LTH=3,                                       +        
               ATTR=(PROT)                                                      
KVRAD6   DFLD  POS=(11,13),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVPR6    DFLD  POS=(11,23),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVPRPR6  DFLD  POS=(11,30),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KVPA6    DFLD  POS=(11,36),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVPAPR6  DFLD  POS=(11,43),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KVKOLL6  DFLD  POS=(11,49),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FILL6    DFLD  POS=(11,55),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KVLAST6  DFLD  POS=(11,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KVLAPR6  DFLD  POS=(11,66),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KVFAKT6  DFLD  POS=(11,72),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KVFAPR6  DFLD  POS=(11,78),LTH=3,                                      +        
               ATTR=(PROT)                                                      
IDTRP7   DFLD  POS=(12,4),LTH=3,                                       +        
               ATTR=(PROT)                                                      
KVRAD7   DFLD  POS=(12,13),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVPR7    DFLD  POS=(12,23),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVPRPR7  DFLD  POS=(12,30),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KVPA7    DFLD  POS=(12,36),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVPAPR7  DFLD  POS=(12,43),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KVKOLL7  DFLD  POS=(12,49),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FILL7    DFLD  POS=(12,55),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KVLAST7  DFLD  POS=(12,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KVLAPR7  DFLD  POS=(12,66),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KVFAKT7  DFLD  POS=(12,72),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KVFAPR7  DFLD  POS=(12,78),LTH=3,                                      +        
               ATTR=(PROT)                                                      
IDTRP8   DFLD  POS=(13,4),LTH=3,                                       +        
               ATTR=(PROT)                                                      
KVRAD8   DFLD  POS=(13,13),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVPR8    DFLD  POS=(13,23),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVPRPR8  DFLD  POS=(13,30),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KVPA8    DFLD  POS=(13,36),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVPAPR8  DFLD  POS=(13,43),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KVKOLL8  DFLD  POS=(13,49),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FILL8    DFLD  POS=(13,55),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KVLAST8  DFLD  POS=(13,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KVLAPR8  DFLD  POS=(13,66),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KVFAKT8  DFLD  POS=(13,72),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KVFAPR8  DFLD  POS=(13,78),LTH=3,                                      +        
               ATTR=(PROT)                                                      
IDTRP9   DFLD  POS=(14,4),LTH=3,                                       +        
               ATTR=(PROT)                                                      
KVRAD9   DFLD  POS=(14,13),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVPR9    DFLD  POS=(14,23),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVPRPR9  DFLD  POS=(14,30),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KVPA9    DFLD  POS=(14,36),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVPAPR9  DFLD  POS=(14,43),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KVKOLL9  DFLD  POS=(14,49),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FILL9    DFLD  POS=(14,55),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KVLAST9  DFLD  POS=(14,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KVLAPR9  DFLD  POS=(14,66),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KVFAKT9  DFLD  POS=(14,72),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KVFAPR9  DFLD  POS=(14,78),LTH=3,                                      +        
               ATTR=(PROT)                                                      
IDTRP10  DFLD  POS=(15,4),LTH=3,                                       +        
               ATTR=(PROT)                                                      
KVRAD10  DFLD  POS=(15,13),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVPR10   DFLD  POS=(15,23),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVPRPR10 DFLD  POS=(15,30),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KVPA10   DFLD  POS=(15,36),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVPAPR10 DFLD  POS=(15,43),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KVKOLL10 DFLD  POS=(15,49),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FILL10   DFLD  POS=(15,55),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KVLAST10 DFLD  POS=(15,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KVLAPR10 DFLD  POS=(15,66),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KVFAKT10 DFLD  POS=(15,72),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KVFAPR10 DFLD  POS=(15,78),LTH=3,                                      +        
               ATTR=(PROT)                                                      
IDTRP11  DFLD  POS=(16,4),LTH=3,                                       +        
               ATTR=(PROT)                                                      
KVRAD11  DFLD  POS=(16,13),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVPR11   DFLD  POS=(16,23),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVPRPR11 DFLD  POS=(16,30),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KVPA11   DFLD  POS=(16,36),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVPAPR11 DFLD  POS=(16,43),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KVKOLL11 DFLD  POS=(16,49),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FILL11   DFLD  POS=(16,55),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KVLAST11 DFLD  POS=(16,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KVLAPR11 DFLD  POS=(16,66),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KVFAKT11 DFLD  POS=(16,72),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KVFAPR11 DFLD  POS=(16,78),LTH=3,                                      +        
               ATTR=(PROT)                                                      
IDTRP12  DFLD  POS=(17,4),LTH=3,                                       +        
               ATTR=(PROT)                                                      
KVRAD12  DFLD  POS=(17,13),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVPR12   DFLD  POS=(17,23),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVPRPR12 DFLD  POS=(17,30),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KVPA12   DFLD  POS=(17,36),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVPAPR12 DFLD  POS=(17,43),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KVKOLL12 DFLD  POS=(17,49),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FILL12   DFLD  POS=(17,55),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KVLAST12 DFLD  POS=(17,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KVLAPR12 DFLD  POS=(17,66),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KVFAKT12 DFLD  POS=(17,72),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KVFAPR12 DFLD  POS=(17,78),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FILLT5   DFLD  POS=(19,2),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KVRADT   DFLD  POS=(19,13),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVPRT    DFLD  POS=(19,23),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVPRPRT  DFLD  POS=(19,30),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KVPAT    DFLD  POS=(19,36),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVPAPRT  DFLD  POS=(19,43),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KVKOLLT  DFLD  POS=(19,49),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FILLT1   DFLD  POS=(19,55),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KVLASTT  DFLD  POS=(19,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KVLAPRT  DFLD  POS=(19,66),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KVFAKTT  DFLD  POS=(19,72),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KVFAPRT  DFLD  POS=(19,78),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '13',                                                   +        
               POS=(21,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '14',                                                   +        
               POS=(21,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15 OrderPl./Trp 16 OrderPl./PRC 17',                   +        
               POS=(21,34),LTH=34,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W4O653N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N653,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I653N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  TIRFSIN,                                                +        
               LTH=6                                                            
         MFLD  TIRFSUT,                                                +        
               LTH=6                                                            
         MFLD  IDTRPFIN,                                               +        
               LTH=3                                                            
         MFLD  IDTRPFUT,                                               +        
               LTH=3                                                            
         MFLD  IDTRPTIN,                                               +        
               LTH=3                                                            
         MFLD  IDTRPTUT,                                               +        
               LTH=3                                                            
         MFLD  IDTRP1,                                                 +        
               LTH=3                                                            
         MFLD  KVRAD1,                                                 +        
               LTH=5                                                            
         MFLD  KVPR1,                                                  +        
               LTH=5                                                            
         MFLD  KVPRPR1,                                                +        
               LTH=3                                                            
         MFLD  KVPA1,                                                  +        
               LTH=5                                                            
         MFLD  KVPAPR1,                                                +        
               LTH=3                                                            
         MFLD  KVKOLL1,                                                +        
               LTH=4                                                            
         MFLD  FILL1,                                                  +        
               LTH=1                                                            
         MFLD  KVLAST1,                                                +        
               LTH=4                                                            
         MFLD  KVLAPR1,                                                +        
               LTH=3                                                            
         MFLD  KVFAKT1,                                                +        
               LTH=4                                                            
         MFLD  KVFAPR1,                                                +        
               LTH=3                                                            
         MFLD  IDTRP2,                                                 +        
               LTH=3                                                            
         MFLD  KVRAD2,                                                 +        
               LTH=5                                                            
         MFLD  KVPR2,                                                  +        
               LTH=5                                                            
         MFLD  KVPRPR2,                                                +        
               LTH=3                                                            
         MFLD  KVPA2,                                                  +        
               LTH=5                                                            
         MFLD  KVPAPR2,                                                +        
               LTH=3                                                            
         MFLD  KVKOLL2,                                                +        
               LTH=4                                                            
         MFLD  FILL2,                                                  +        
               LTH=1                                                            
         MFLD  KVLAST2,                                                +        
               LTH=4                                                            
         MFLD  KVLAPR2,                                                +        
               LTH=3                                                            
         MFLD  KVFAKT2,                                                +        
               LTH=4                                                            
         MFLD  KVFAPR2,                                                +        
               LTH=3                                                            
         MFLD  IDTRP3,                                                 +        
               LTH=3                                                            
         MFLD  KVRAD3,                                                 +        
               LTH=5                                                            
         MFLD  KVPR3,                                                  +        
               LTH=5                                                            
         MFLD  KVPRPR3,                                                +        
               LTH=3                                                            
         MFLD  KVPA3,                                                  +        
               LTH=5                                                            
         MFLD  KVPAPR3,                                                +        
               LTH=3                                                            
         MFLD  KVKOLL3,                                                +        
               LTH=4                                                            
         MFLD  FILL3,                                                  +        
               LTH=1                                                            
         MFLD  KVLAST3,                                                +        
               LTH=4                                                            
         MFLD  KVLAPR3,                                                +        
               LTH=3                                                            
         MFLD  KVFAKT3,                                                +        
               LTH=4                                                            
         MFLD  KVFAPR3,                                                +        
               LTH=3                                                            
         MFLD  IDTRP4,                                                 +        
               LTH=3                                                            
         MFLD  KVRAD4,                                                 +        
               LTH=5                                                            
         MFLD  KVPR4,                                                  +        
               LTH=5                                                            
         MFLD  KVPRPR4,                                                +        
               LTH=3                                                            
         MFLD  KVPA4,                                                  +        
               LTH=5                                                            
         MFLD  KVPAPR4,                                                +        
               LTH=3                                                            
         MFLD  KVKOLL4,                                                +        
               LTH=4                                                            
         MFLD  FILL4,                                                  +        
               LTH=1                                                            
         MFLD  KVLAST4,                                                +        
               LTH=4                                                            
         MFLD  KVLAPR4,                                                +        
               LTH=3                                                            
         MFLD  KVFAKT4,                                                +        
               LTH=4                                                            
         MFLD  KVFAPR4,                                                +        
               LTH=3                                                            
         MFLD  IDTRP5,                                                 +        
               LTH=3                                                            
         MFLD  KVRAD5,                                                 +        
               LTH=5                                                            
         MFLD  KVPR5,                                                  +        
               LTH=5                                                            
         MFLD  KVPRPR5,                                                +        
               LTH=3                                                            
         MFLD  KVPA5,                                                  +        
               LTH=5                                                            
         MFLD  KVPAPR5,                                                +        
               LTH=3                                                            
         MFLD  KVKOLL5,                                                +        
               LTH=4                                                            
         MFLD  FILL5,                                                  +        
               LTH=1                                                            
         MFLD  KVLAST5,                                                +        
               LTH=4                                                            
         MFLD  KVLAPR5,                                                +        
               LTH=3                                                            
         MFLD  KVFAKT5,                                                +        
               LTH=4                                                            
         MFLD  KVFAPR5,                                                +        
               LTH=3                                                            
         MFLD  IDTRP6,                                                 +        
               LTH=3                                                            
         MFLD  KVRAD6,                                                 +        
               LTH=5                                                            
         MFLD  KVPR6,                                                  +        
               LTH=5                                                            
         MFLD  KVPRPR6,                                                +        
               LTH=3                                                            
         MFLD  KVPA6,                                                  +        
               LTH=5                                                            
         MFLD  KVPAPR6,                                                +        
               LTH=3                                                            
         MFLD  KVKOLL6,                                                +        
               LTH=4                                                            
         MFLD  FILL6,                                                  +        
               LTH=1                                                            
         MFLD  KVLAST6,                                                +        
               LTH=4                                                            
         MFLD  KVLAPR6,                                                +        
               LTH=3                                                            
         MFLD  KVFAKT6,                                                +        
               LTH=4                                                            
         MFLD  KVFAPR6,                                                +        
               LTH=3                                                            
         MFLD  IDTRP7,                                                 +        
               LTH=3                                                            
         MFLD  KVRAD7,                                                 +        
               LTH=5                                                            
         MFLD  KVPR7,                                                  +        
               LTH=5                                                            
         MFLD  KVPRPR7,                                                +        
               LTH=3                                                            
         MFLD  KVPA7,                                                  +        
               LTH=5                                                            
         MFLD  KVPAPR7,                                                +        
               LTH=3                                                            
         MFLD  KVKOLL7,                                                +        
               LTH=4                                                            
         MFLD  FILL7,                                                  +        
               LTH=1                                                            
         MFLD  KVLAST7,                                                +        
               LTH=4                                                            
         MFLD  KVLAPR7,                                                +        
               LTH=3                                                            
         MFLD  KVFAKT7,                                                +        
               LTH=4                                                            
         MFLD  KVFAPR7,                                                +        
               LTH=3                                                            
         MFLD  IDTRP8,                                                 +        
               LTH=3                                                            
         MFLD  KVRAD8,                                                 +        
               LTH=5                                                            
         MFLD  KVPR8,                                                  +        
               LTH=5                                                            
         MFLD  KVPRPR8,                                                +        
               LTH=3                                                            
         MFLD  KVPA8,                                                  +        
               LTH=5                                                            
         MFLD  KVPAPR8,                                                +        
               LTH=3                                                            
         MFLD  KVKOLL8,                                                +        
               LTH=4                                                            
         MFLD  FILL8,                                                  +        
               LTH=1                                                            
         MFLD  KVLAST8,                                                +        
               LTH=4                                                            
         MFLD  KVLAPR8,                                                +        
               LTH=3                                                            
         MFLD  KVFAKT8,                                                +        
               LTH=4                                                            
         MFLD  KVFAPR8,                                                +        
               LTH=3                                                            
         MFLD  IDTRP9,                                                 +        
               LTH=3                                                            
         MFLD  KVRAD9,                                                 +        
               LTH=5                                                            
         MFLD  KVPR9,                                                  +        
               LTH=5                                                            
         MFLD  KVPRPR9,                                                +        
               LTH=3                                                            
         MFLD  KVPA9,                                                  +        
               LTH=5                                                            
         MFLD  KVPAPR9,                                                +        
               LTH=3                                                            
         MFLD  KVKOLL9,                                                +        
               LTH=4                                                            
         MFLD  FILL9,                                                  +        
               LTH=1                                                            
         MFLD  KVLAST9,                                                +        
               LTH=4                                                            
         MFLD  KVLAPR9,                                                +        
               LTH=3                                                            
         MFLD  KVFAKT9,                                                +        
               LTH=4                                                            
         MFLD  KVFAPR9,                                                +        
               LTH=3                                                            
         MFLD  IDTRP10,                                                +        
               LTH=3                                                            
         MFLD  KVRAD10,                                                +        
               LTH=5                                                            
         MFLD  KVPR10,                                                 +        
               LTH=5                                                            
         MFLD  KVPRPR10,                                               +        
               LTH=3                                                            
         MFLD  KVPA10,                                                 +        
               LTH=5                                                            
         MFLD  KVPAPR10,                                               +        
               LTH=3                                                            
         MFLD  KVKOLL10,                                               +        
               LTH=4                                                            
         MFLD  FILL10,                                                 +        
               LTH=1                                                            
         MFLD  KVLAST10,                                               +        
               LTH=4                                                            
         MFLD  KVLAPR10,                                               +        
               LTH=3                                                            
         MFLD  KVFAKT10,                                               +        
               LTH=4                                                            
         MFLD  KVFAPR10,                                               +        
               LTH=3                                                            
         MFLD  IDTRP11,                                                +        
               LTH=3                                                            
         MFLD  KVRAD11,                                                +        
               LTH=5                                                            
         MFLD  KVPR11,                                                 +        
               LTH=5                                                            
         MFLD  KVPRPR11,                                               +        
               LTH=3                                                            
         MFLD  KVPA11,                                                 +        
               LTH=5                                                            
         MFLD  KVPAPR11,                                               +        
               LTH=3                                                            
         MFLD  KVKOLL11,                                               +        
               LTH=4                                                            
         MFLD  FILL11,                                                 +        
               LTH=1                                                            
         MFLD  KVLAST11,                                               +        
               LTH=4                                                            
         MFLD  KVLAPR11,                                               +        
               LTH=3                                                            
         MFLD  KVFAKT11,                                               +        
               LTH=4                                                            
         MFLD  KVFAPR11,                                               +        
               LTH=3                                                            
         MFLD  IDTRP12,                                                +        
               LTH=3                                                            
         MFLD  KVRAD12,                                                +        
               LTH=5                                                            
         MFLD  KVPR12,                                                 +        
               LTH=5                                                            
         MFLD  KVPRPR12,                                               +        
               LTH=3                                                            
         MFLD  KVPA12,                                                 +        
               LTH=5                                                            
         MFLD  KVPAPR12,                                               +        
               LTH=3                                                            
         MFLD  KVKOLL12,                                               +        
               LTH=4                                                            
         MFLD  FILL12,                                                 +        
               LTH=1                                                            
         MFLD  KVLAST12,                                               +        
               LTH=4                                                            
         MFLD  KVLAPR12,                                               +        
               LTH=3                                                            
         MFLD  KVFAKT12,                                               +        
               LTH=4                                                            
         MFLD  KVFAPR12,                                               +        
               LTH=3                                                            
         MFLD  FILLT5,                                                 +        
               LTH=5                                                            
         MFLD  KVRADT,                                                 +        
               LTH=5                                                            
         MFLD  KVPRT,                                                  +        
               LTH=5                                                            
         MFLD  KVPRPRT,                                                +        
               LTH=3                                                            
         MFLD  KVPAT,                                                  +        
               LTH=5                                                            
         MFLD  KVPAPRT,                                                +        
               LTH=3                                                            
         MFLD  KVKOLLT,                                                +        
               LTH=4                                                            
         MFLD  FILLT1,                                                 +        
               LTH=1                                                            
         MFLD  KVLASTT,                                                +        
               LTH=4                                                            
         MFLD  KVLAPRT,                                                +        
               LTH=3                                                            
         MFLD  KVFAKTT,                                                +        
               LTH=4                                                            
         MFLD  KVFAPRT,                                                +        
               LTH=3                                                            
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I653N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N653),                                           +        
               OPT=2,                                                  +        
               NXT=W4O653N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '46532',                                                +        
               LTH=5                                                            
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R                                                           
         MFLD  IDDCUT,                                                 +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (TIRFSIN,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R                                                           
         MFLD  TIRFSUT,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (IDTRPFIN,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDTRPFUT,                                               +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (IDTRPTIN,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDTRPTUT,                                               +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
