*          DATA SET W4N645FII0 AT LEVEL 001 AS OF 82/03/16                      
         PRINT NOGEN                                                            
W4N645   FMT                                                                    
         DEV   TYPE=(3270,2),                                          *        
               FEAT=IGNORE,                                            *        
               PFK=(FLDPFK,'W0T501  ','W0T501  ','W0T501  ','W0T501  ',*        
               'W4T645  ','W0T501  ','W0T501  ','W0T501  ','W0T501  ', *        
               'WHELP   ','W0T501  ','/RCL.   ','W0T501  ','W0T501  ', *        
               'W0T501  ','W0T501  ','W4T645  ','W0T501  ','W0T501  ', *        
               'W0T501  ','W0T501  ','WHELP   ','W0T501  ','/RCL.   '),*        
               DSCA=X'0080',SYSMSG=FSYSMSG                                      
         DIV   TYPE=INOUT                                                       
         DPAGE CURSOR=((01,02)),                                       *        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(01,02),LTH=0001,ATTR=(ALPHA,NOPROT,MOD)                     
FLD0104  DFLD  POS=(01,04),LTH=0001,ATTR=(NUM,MOD)                              
FLD0106  DFLD  POS=(01,06),LTH=0001,ATTR=(NUM,MOD)                              
FLD0108  DFLD  POS=(01,08),LTH=0001,ATTR=(NUM,MOD)                              
         DFLD  'REGISTRERING ARBEIDSTIJD C2',                          *        
               POS=(01,11),LTH=0027,ATTR=(NUM,PROT)                             
FLD0141  DFLD  POS=(01,41),LTH=0040,ATTR=(NUM,PROT,HI)                          
         DFLD  'NORM. WERKTIJD PER WEEK  ',                            *        
               POS=(02,04),LTH=0025,ATTR=(NUM,PROT)                             
FLD0230  DFLD  POS=(02,30),LTH=0004,ATTR=(NUM)                                  
FLD0330  DFLD  POS=(03,30),LTH=0004,ATTR=(NUM,PROT)                             
FLD0402  DFLD  POS=(04,02),LTH=0001,ATTR=(NUM,MOD,PROT,NODISP)                  
         DFLD  'AFWIJKING AFWIJKING',                                  *        
               POS=(05,16),LTH=0019,ATTR=(NUM,PROT)                             
         DFLD  'AFWIJKING AFWIJKING',                                  *        
               POS=(05,54),LTH=0019,ATTR=(NUM,PROT)                             
         DFLD  'ARBEID. WEG.  WEEK     DAG  +/-',                      *        
               POS=(06,04),LTH=0031,ATTR=(NUM,PROT)                             
         DFLD  'ARBEID. WEG.  WEEK     DAG  +/-',                      *        
               POS=(06,42),LTH=0031,ATTR=(NUM,PROT)                             
FLD0705  DFLD  POS=(07,05),LTH=0005,ATTR=(NUM,MOD,PROT)                         
FLD0712  DFLD  POS=(07,12),LTH=0003,ATTR=(ALPHA)                                
FLD0718  DFLD  POS=(07,18),LTH=0005,ATTR=(NUM,PROT)                             
FLD0727  DFLD  POS=(07,27),LTH=0004,ATTR=(NUM)                                  
FLD0733  DFLD  POS=(07,33),LTH=0001,ATTR=(ALPHA)                                
FLD0743  DFLD  POS=(07,43),LTH=0005,ATTR=(NUM,MOD,PROT)                         
FLD0750  DFLD  POS=(07,50),LTH=0003,ATTR=(ALPHA)                                
FLD0756  DFLD  POS=(07,56),LTH=0005,ATTR=(NUM,PROT)                             
FLD0765  DFLD  POS=(07,65),LTH=0004,ATTR=(NUM)                                  
FLD0771  DFLD  POS=(07,71),LTH=0001,ATTR=(ALPHA)                                
FLD0805  DFLD  POS=(08,05),LTH=0005,ATTR=(NUM,MOD,PROT)                         
FLD0812  DFLD  POS=(08,12),LTH=0003,ATTR=(ALPHA)                                
FLD0818  DFLD  POS=(08,18),LTH=0005,ATTR=(NUM,PROT)                             
FLD0827  DFLD  POS=(08,27),LTH=0004,ATTR=(NUM)                                  
FLD0833  DFLD  POS=(08,33),LTH=0001,ATTR=(ALPHA)                                
FLD0843  DFLD  POS=(08,43),LTH=0005,ATTR=(NUM,MOD,PROT)                         
FLD0850  DFLD  POS=(08,50),LTH=0003,ATTR=(ALPHA)                                
FLD0856  DFLD  POS=(08,56),LTH=0005,ATTR=(NUM,PROT)                             
FLD0865  DFLD  POS=(08,65),LTH=0004,ATTR=(NUM)                                  
FLD0871  DFLD  POS=(08,71),LTH=0001,ATTR=(ALPHA)                                
FLD0905  DFLD  POS=(09,05),LTH=0005,ATTR=(NUM,MOD,PROT)                         
FLD0912  DFLD  POS=(09,12),LTH=0003,ATTR=(ALPHA)                                
FLD0918  DFLD  POS=(09,18),LTH=0005,ATTR=(NUM,PROT)                             
FLD0927  DFLD  POS=(09,27),LTH=0004,ATTR=(NUM)                                  
FLD0933  DFLD  POS=(09,33),LTH=0001,ATTR=(ALPHA)                                
FLD0943  DFLD  POS=(09,43),LTH=0005,ATTR=(NUM,MOD,PROT)                         
FLD0950  DFLD  POS=(09,50),LTH=0003,ATTR=(ALPHA)                                
FLD0956  DFLD  POS=(09,56),LTH=0005,ATTR=(NUM,PROT)                             
FLD0965  DFLD  POS=(09,65),LTH=0004,ATTR=(NUM)                                  
FLD0971  DFLD  POS=(09,71),LTH=0001,ATTR=(ALPHA)                                
FLD1005  DFLD  POS=(10,05),LTH=0005,ATTR=(NUM,MOD,PROT)                         
FLD1012  DFLD  POS=(10,12),LTH=0003,ATTR=(ALPHA)                                
FLD1018  DFLD  POS=(10,18),LTH=0005,ATTR=(NUM,PROT)                             
FLD1027  DFLD  POS=(10,27),LTH=0004,ATTR=(NUM)                                  
FLD1033  DFLD  POS=(10,33),LTH=0001,ATTR=(ALPHA)                                
FLD1043  DFLD  POS=(10,43),LTH=0005,ATTR=(NUM,MOD,PROT)                         
FLD1050  DFLD  POS=(10,50),LTH=0003,ATTR=(ALPHA)                                
FLD1056  DFLD  POS=(10,56),LTH=0005,ATTR=(NUM,PROT)                             
FLD1065  DFLD  POS=(10,65),LTH=0004,ATTR=(NUM)                                  
FLD1071  DFLD  POS=(10,71),LTH=0001,ATTR=(ALPHA)                                
FLD1105  DFLD  POS=(11,05),LTH=0005,ATTR=(NUM,MOD,PROT)                         
FLD1112  DFLD  POS=(11,12),LTH=0003,ATTR=(ALPHA)                                
FLD1118  DFLD  POS=(11,18),LTH=0005,ATTR=(NUM,PROT)                             
FLD1127  DFLD  POS=(11,27),LTH=0004,ATTR=(NUM)                                  
FLD1133  DFLD  POS=(11,33),LTH=0001,ATTR=(ALPHA)                                
FLD1143  DFLD  POS=(11,43),LTH=0005,ATTR=(NUM,MOD,PROT)                         
FLD1150  DFLD  POS=(11,50),LTH=0003,ATTR=(ALPHA)                                
FLD1156  DFLD  POS=(11,56),LTH=0005,ATTR=(NUM,PROT)                             
FLD1165  DFLD  POS=(11,65),LTH=0004,ATTR=(NUM)                                  
FLD1171  DFLD  POS=(11,71),LTH=0001,ATTR=(ALPHA)                                
FLD1205  DFLD  POS=(12,05),LTH=0005,ATTR=(NUM,MOD,PROT)                         
FLD1212  DFLD  POS=(12,12),LTH=0003,ATTR=(ALPHA)                                
FLD1218  DFLD  POS=(12,18),LTH=0005,ATTR=(NUM,PROT)                             
FLD1227  DFLD  POS=(12,27),LTH=0004,ATTR=(NUM)                                  
FLD1233  DFLD  POS=(12,33),LTH=0001,ATTR=(ALPHA)                                
FLD1243  DFLD  POS=(12,43),LTH=0005,ATTR=(NUM,MOD,PROT)                         
FLD1250  DFLD  POS=(12,50),LTH=0003,ATTR=(ALPHA)                                
FLD1256  DFLD  POS=(12,56),LTH=0005,ATTR=(NUM,PROT)                             
FLD1265  DFLD  POS=(12,65),LTH=0004,ATTR=(NUM)                                  
FLD1271  DFLD  POS=(12,71),LTH=0001,ATTR=(ALPHA)                                
FLD1305  DFLD  POS=(13,05),LTH=0005,ATTR=(NUM,MOD,PROT)                         
FLD1312  DFLD  POS=(13,12),LTH=0003,ATTR=(ALPHA)                                
FLD1318  DFLD  POS=(13,18),LTH=0005,ATTR=(NUM,PROT)                             
FLD1327  DFLD  POS=(13,27),LTH=0004,ATTR=(NUM)                                  
FLD1333  DFLD  POS=(13,33),LTH=0001,ATTR=(ALPHA)                                
FLD1343  DFLD  POS=(13,43),LTH=0005,ATTR=(NUM,MOD,PROT)                         
FLD1350  DFLD  POS=(13,50),LTH=0003,ATTR=(ALPHA)                                
FLD1356  DFLD  POS=(13,56),LTH=0005,ATTR=(NUM,PROT)                             
FLD1365  DFLD  POS=(13,65),LTH=0004,ATTR=(NUM)                                  
FLD1371  DFLD  POS=(13,71),LTH=0001,ATTR=(ALPHA)                                
FLD1405  DFLD  POS=(14,05),LTH=0005,ATTR=(NUM,MOD,PROT)                         
FLD1412  DFLD  POS=(14,12),LTH=0003,ATTR=(ALPHA)                                
FLD1418  DFLD  POS=(14,18),LTH=0005,ATTR=(NUM,PROT)                             
FLD1427  DFLD  POS=(14,27),LTH=0004,ATTR=(NUM)                                  
FLD1433  DFLD  POS=(14,33),LTH=0001,ATTR=(ALPHA)                                
FLD1443  DFLD  POS=(14,43),LTH=0005,ATTR=(NUM,MOD,PROT)                         
FLD1450  DFLD  POS=(14,50),LTH=0003,ATTR=(ALPHA)                                
FLD1456  DFLD  POS=(14,56),LTH=0005,ATTR=(NUM,PROT)                             
FLD1465  DFLD  POS=(14,65),LTH=0004,ATTR=(NUM)                                  
FLD1471  DFLD  POS=(14,71),LTH=0001,ATTR=(ALPHA)                                
FLD1505  DFLD  POS=(15,05),LTH=0005,ATTR=(NUM,MOD,PROT)                         
FLD1512  DFLD  POS=(15,12),LTH=0003,ATTR=(ALPHA)                                
FLD1518  DFLD  POS=(15,18),LTH=0005,ATTR=(NUM,PROT)                             
FLD1527  DFLD  POS=(15,27),LTH=0004,ATTR=(NUM)                                  
FLD1533  DFLD  POS=(15,33),LTH=0001,ATTR=(ALPHA)                                
FLD1543  DFLD  POS=(15,43),LTH=0005,ATTR=(NUM,MOD,PROT)                         
FLD1550  DFLD  POS=(15,50),LTH=0003,ATTR=(ALPHA)                                
FLD1556  DFLD  POS=(15,56),LTH=0005,ATTR=(NUM,PROT)                             
FLD1565  DFLD  POS=(15,65),LTH=0004,ATTR=(NUM)                                  
FLD1571  DFLD  POS=(15,71),LTH=0001,ATTR=(ALPHA)                                
FLD1605  DFLD  POS=(16,05),LTH=0005,ATTR=(NUM,MOD,PROT)                         
FLD1612  DFLD  POS=(16,12),LTH=0003,ATTR=(ALPHA)                                
FLD1618  DFLD  POS=(16,18),LTH=0005,ATTR=(NUM,PROT)                             
FLD1627  DFLD  POS=(16,27),LTH=0004,ATTR=(NUM)                                  
FLD1633  DFLD  POS=(16,33),LTH=0001,ATTR=(ALPHA)                                
FLD1643  DFLD  POS=(16,43),LTH=0005,ATTR=(NUM,MOD,PROT)                         
FLD1650  DFLD  POS=(16,50),LTH=0003,ATTR=(ALPHA)                                
FLD1656  DFLD  POS=(16,56),LTH=0005,ATTR=(NUM,PROT)                             
FLD1665  DFLD  POS=(16,65),LTH=0004,ATTR=(NUM)                                  
FLD1671  DFLD  POS=(16,71),LTH=0001,ATTR=(ALPHA)                                
FLD1705  DFLD  POS=(17,05),LTH=0005,ATTR=(NUM,MOD,PROT)                         
FLD1712  DFLD  POS=(17,12),LTH=0003,ATTR=(ALPHA)                                
FLD1718  DFLD  POS=(17,18),LTH=0005,ATTR=(NUM,PROT)                             
FLD1727  DFLD  POS=(17,27),LTH=0004,ATTR=(NUM)                                  
FLD1733  DFLD  POS=(17,33),LTH=0001,ATTR=(ALPHA)                                
FLD1743  DFLD  POS=(17,43),LTH=0005,ATTR=(NUM,MOD,PROT)                         
FLD1750  DFLD  POS=(17,50),LTH=0003,ATTR=(ALPHA)                                
FLD1756  DFLD  POS=(17,56),LTH=0005,ATTR=(NUM,PROT)                             
FLD1765  DFLD  POS=(17,65),LTH=0004,ATTR=(NUM)                                  
FLD1771  DFLD  POS=(17,71),LTH=0001,ATTR=(ALPHA)                                
FLD1805  DFLD  POS=(18,05),LTH=0005,ATTR=(NUM,MOD,PROT)                         
FLD1812  DFLD  POS=(18,12),LTH=0003,ATTR=(ALPHA)                                
FLD1818  DFLD  POS=(18,18),LTH=0005,ATTR=(NUM,PROT)                             
FLD1827  DFLD  POS=(18,27),LTH=0004,ATTR=(NUM)                                  
FLD1833  DFLD  POS=(18,33),LTH=0001,ATTR=(ALPHA)                                
FLD1843  DFLD  POS=(18,43),LTH=0005,ATTR=(NUM,MOD,PROT)                         
FLD1850  DFLD  POS=(18,50),LTH=0003,ATTR=(ALPHA)                                
FLD1856  DFLD  POS=(18,56),LTH=0005,ATTR=(NUM,PROT)                             
FLD1865  DFLD  POS=(18,65),LTH=0004,ATTR=(NUM)                                  
FLD1871  DFLD  POS=(18,71),LTH=0001,ATTR=(ALPHA)                                
FLD1905  DFLD  POS=(19,05),LTH=0005,ATTR=(NUM,MOD,PROT)                         
FLD1912  DFLD  POS=(19,12),LTH=0003,ATTR=(ALPHA)                                
FLD1918  DFLD  POS=(19,18),LTH=0005,ATTR=(NUM,PROT)                             
FLD1927  DFLD  POS=(19,27),LTH=0004,ATTR=(NUM)                                  
FLD1933  DFLD  POS=(19,33),LTH=0001,ATTR=(ALPHA)                                
FLD1943  DFLD  POS=(19,43),LTH=0005,ATTR=(NUM,MOD,PROT)                         
FLD1950  DFLD  POS=(19,50),LTH=0003,ATTR=(ALPHA)                                
FLD1956  DFLD  POS=(19,56),LTH=0005,ATTR=(NUM,PROT)                             
FLD1965  DFLD  POS=(19,65),LTH=0004,ATTR=(NUM)                                  
FLD1971  DFLD  POS=(19,71),LTH=0001,ATTR=(ALPHA)                                
         DFLD  '1               2               3               4      *        
                        5 REG ARB.TIJD  6               7              *        
                8               9               10 WHELP',             *        
               POS=(21,02),LTH=0152,ATTR=(NUM,PROT)                             
FLD2302  DFLD  POS=(23,02),LTH=0055,ATTR=(NUM,PROT,HI)                          
         DFLD  ' VCAS',POS=(23,58)                                              
FSYSMSG  DFLD  POS=(24,02),LTH=0079,ATTR=(NUM,PROT,HI)                          
         FMTEND                                                                 
         EJECT                                                                  
W4O645N1 MSG   TYPE=OUTPUT,                                            *        
               SOR=(W4N645,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W4I645N1,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  FLD0102,LTH=0001                                                 
         MFLD  FLD0104,LTH=0001                                                 
         MFLD  FLD0106,LTH=0001                                                 
         MFLD  FLD0108,LTH=0001                                                 
         MFLD  FLD0141,LTH=0040                                                 
         MFLD  FLD0230,LTH=0006,ATTR=YES                                        
         MFLD  FLD0330,LTH=0004                                                 
         MFLD  FLD0402,LTH=0001                                                 
         MFLD  FLD0705,LTH=0007,ATTR=YES                                        
         MFLD  FLD0712,LTH=0005,ATTR=YES                                        
         MFLD  FLD0718,LTH=0005                                                 
         MFLD  FLD0727,LTH=0006,ATTR=YES                                        
         MFLD  FLD0733,LTH=0003,ATTR=YES                                        
         MFLD  FLD0743,LTH=0007,ATTR=YES                                        
         MFLD  FLD0750,LTH=0005,ATTR=YES                                        
         MFLD  FLD0756,LTH=0005                                                 
         MFLD  FLD0765,LTH=0006,ATTR=YES                                        
         MFLD  FLD0771,LTH=0003,ATTR=YES                                        
         MFLD  FLD0805,LTH=0007,ATTR=YES                                        
         MFLD  FLD0812,LTH=0005,ATTR=YES                                        
         MFLD  FLD0818,LTH=0005                                                 
         MFLD  FLD0827,LTH=0006,ATTR=YES                                        
         MFLD  FLD0833,LTH=0003,ATTR=YES                                        
         MFLD  FLD0843,LTH=0007,ATTR=YES                                        
         MFLD  FLD0850,LTH=0005,ATTR=YES                                        
         MFLD  FLD0856,LTH=0005                                                 
         MFLD  FLD0865,LTH=0006,ATTR=YES                                        
         MFLD  FLD0871,LTH=0003,ATTR=YES                                        
         MFLD  FLD0905,LTH=0007,ATTR=YES                                        
         MFLD  FLD0912,LTH=0005,ATTR=YES                                        
         MFLD  FLD0918,LTH=0005                                                 
         MFLD  FLD0927,LTH=0006,ATTR=YES                                        
         MFLD  FLD0933,LTH=0003,ATTR=YES                                        
         MFLD  FLD0943,LTH=0007,ATTR=YES                                        
         MFLD  FLD0950,LTH=0005,ATTR=YES                                        
         MFLD  FLD0956,LTH=0005                                                 
         MFLD  FLD0965,LTH=0006,ATTR=YES                                        
         MFLD  FLD0971,LTH=0003,ATTR=YES                                        
         MFLD  FLD1005,LTH=0007,ATTR=YES                                        
         MFLD  FLD1012,LTH=0005,ATTR=YES                                        
         MFLD  FLD1018,LTH=0005                                                 
         MFLD  FLD1027,LTH=0006,ATTR=YES                                        
         MFLD  FLD1033,LTH=0003,ATTR=YES                                        
         MFLD  FLD1043,LTH=0007,ATTR=YES                                        
         MFLD  FLD1050,LTH=0005,ATTR=YES                                        
         MFLD  FLD1056,LTH=0005                                                 
         MFLD  FLD1065,LTH=0006,ATTR=YES                                        
         MFLD  FLD1071,LTH=0003,ATTR=YES                                        
         MFLD  FLD1105,LTH=0007,ATTR=YES                                        
         MFLD  FLD1112,LTH=0005,ATTR=YES                                        
         MFLD  FLD1118,LTH=0005                                                 
         MFLD  FLD1127,LTH=0006,ATTR=YES                                        
         MFLD  FLD1133,LTH=0003,ATTR=YES                                        
         MFLD  FLD1143,LTH=0007,ATTR=YES                                        
         MFLD  FLD1150,LTH=0005,ATTR=YES                                        
         MFLD  FLD1156,LTH=0005                                                 
         MFLD  FLD1165,LTH=0006,ATTR=YES                                        
         MFLD  FLD1171,LTH=0003,ATTR=YES                                        
         MFLD  FLD1205,LTH=0007,ATTR=YES                                        
         MFLD  FLD1212,LTH=0005,ATTR=YES                                        
         MFLD  FLD1218,LTH=0005                                                 
         MFLD  FLD1227,LTH=0006,ATTR=YES                                        
         MFLD  FLD1233,LTH=0003,ATTR=YES                                        
         MFLD  FLD1243,LTH=0007,ATTR=YES                                        
         MFLD  FLD1250,LTH=0005,ATTR=YES                                        
         MFLD  FLD1256,LTH=0005                                                 
         MFLD  FLD1265,LTH=0006,ATTR=YES                                        
         MFLD  FLD1271,LTH=0003,ATTR=YES                                        
         MFLD  FLD1305,LTH=0007,ATTR=YES                                        
         MFLD  FLD1312,LTH=0005,ATTR=YES                                        
         MFLD  FLD1318,LTH=0005                                                 
         MFLD  FLD1327,LTH=0006,ATTR=YES                                        
         MFLD  FLD1333,LTH=0003,ATTR=YES                                        
         MFLD  FLD1343,LTH=0007,ATTR=YES                                        
         MFLD  FLD1350,LTH=0005,ATTR=YES                                        
         MFLD  FLD1356,LTH=0005                                                 
         MFLD  FLD1365,LTH=0006,ATTR=YES                                        
         MFLD  FLD1371,LTH=0003,ATTR=YES                                        
         MFLD  FLD1405,LTH=0007,ATTR=YES                                        
         MFLD  FLD1412,LTH=0005,ATTR=YES                                        
         MFLD  FLD1418,LTH=0005                                                 
         MFLD  FLD1427,LTH=0006,ATTR=YES                                        
         MFLD  FLD1433,LTH=0003,ATTR=YES                                        
         MFLD  FLD1443,LTH=0007,ATTR=YES                                        
         MFLD  FLD1450,LTH=0005,ATTR=YES                                        
         MFLD  FLD1456,LTH=0005                                                 
         MFLD  FLD1465,LTH=0006,ATTR=YES                                        
         MFLD  FLD1471,LTH=0003,ATTR=YES                                        
         MFLD  FLD1505,LTH=0007,ATTR=YES                                        
         MFLD  FLD1512,LTH=0005,ATTR=YES                                        
         MFLD  FLD1518,LTH=0005                                                 
         MFLD  FLD1527,LTH=0006,ATTR=YES                                        
         MFLD  FLD1533,LTH=0003,ATTR=YES                                        
         MFLD  FLD1543,LTH=0007,ATTR=YES                                        
         MFLD  FLD1550,LTH=0005,ATTR=YES                                        
         MFLD  FLD1556,LTH=0005                                                 
         MFLD  FLD1565,LTH=0006,ATTR=YES                                        
         MFLD  FLD1571,LTH=0003,ATTR=YES                                        
         MFLD  FLD1605,LTH=0007,ATTR=YES                                        
         MFLD  FLD1612,LTH=0005,ATTR=YES                                        
         MFLD  FLD1618,LTH=0005                                                 
         MFLD  FLD1627,LTH=0006,ATTR=YES                                        
         MFLD  FLD1633,LTH=0003,ATTR=YES                                        
         MFLD  FLD1643,LTH=0007,ATTR=YES                                        
         MFLD  FLD1650,LTH=0005,ATTR=YES                                        
         MFLD  FLD1656,LTH=0005                                                 
         MFLD  FLD1665,LTH=0006,ATTR=YES                                        
         MFLD  FLD1671,LTH=0003,ATTR=YES                                        
         MFLD  FLD1705,LTH=0007,ATTR=YES                                        
         MFLD  FLD1712,LTH=0005,ATTR=YES                                        
         MFLD  FLD1718,LTH=0005                                                 
         MFLD  FLD1727,LTH=0006,ATTR=YES                                        
         MFLD  FLD1733,LTH=0003,ATTR=YES                                        
         MFLD  FLD1743,LTH=0007,ATTR=YES                                        
         MFLD  FLD1750,LTH=0005,ATTR=YES                                        
         MFLD  FLD1756,LTH=0005                                                 
         MFLD  FLD1765,LTH=0006,ATTR=YES                                        
         MFLD  FLD1771,LTH=0003,ATTR=YES                                        
         MFLD  FLD1805,LTH=0007,ATTR=YES                                        
         MFLD  FLD1812,LTH=0005,ATTR=YES                                        
         MFLD  FLD1818,LTH=0005                                                 
         MFLD  FLD1827,LTH=0006,ATTR=YES                                        
         MFLD  FLD1833,LTH=0003,ATTR=YES                                        
         MFLD  FLD1843,LTH=0007,ATTR=YES                                        
         MFLD  FLD1850,LTH=0005,ATTR=YES                                        
         MFLD  FLD1856,LTH=0005                                                 
         MFLD  FLD1865,LTH=0006,ATTR=YES                                        
         MFLD  FLD1871,LTH=0003,ATTR=YES                                        
         MFLD  FLD1905,LTH=0007,ATTR=YES                                        
         MFLD  FLD1912,LTH=0005,ATTR=YES                                        
         MFLD  FLD1918,LTH=0005                                                 
         MFLD  FLD1927,LTH=0006,ATTR=YES                                        
         MFLD  FLD1933,LTH=0003,ATTR=YES                                        
         MFLD  FLD1943,LTH=0007,ATTR=YES                                        
         MFLD  FLD1950,LTH=0005,ATTR=YES                                        
         MFLD  FLD1956,LTH=0005                                                 
         MFLD  FLD1965,LTH=0006,ATTR=YES                                        
         MFLD  FLD1971,LTH=0003,ATTR=YES                                        
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W4I645N1 MSG   TYPE=INPUT,                                             *        
               SOR=W4N645,                                             *        
               OPT=2,                                                  *        
               NXT=W4O645N1                                                     
         SEG                                                                    
         MFLD  FLDPFK,LTH=0008,FILL=NULL                                        
         MFLD  'W',LTH=0001                                                     
         MFLD  FLD0102,LTH=0001,FILL=C'4'                                       
         MFLD  'T',LTH=0001                                                     
         MFLD  FLD0104,LTH=0001,FILL=C'6'                                       
         MFLD  FLD0106,LTH=0001,FILL=C'4'                                       
         MFLD  FLD0108,LTH=0001,FILL=C'5'                                       
         MFLD  '  ',LTH=0002                                                    
         MFLD  '46452',LTH=0005                                                 
         MFLD  (FLD0230,'++++'),LTH=0004,FILL=C'0',JUST=R                       
         MFLD  FLD0402,LTH=0001,FILL=C' '                                       
         MFLD  FLD0705,LTH=0005,FILL=C'0',JUST=R                                
         MFLD  (FLD0712,'+++'),LTH=0003,FILL=C' '                               
         MFLD  (FLD0727,'++++'),LTH=0004,FILL=C'0',JUST=R                       
         MFLD  (FLD0733,' '),LTH=0001,FILL=C' '                                 
         MFLD  FLD0743,LTH=0005,FILL=C'0',JUST=R                                
         MFLD  (FLD0750,'+++'),LTH=0003,FILL=C' '                               
         MFLD  (FLD0765,'++++'),LTH=0004,FILL=C'0',JUST=R                       
         MFLD  (FLD0771,' '),LTH=0001,FILL=C' '                                 
         MFLD  FLD0805,LTH=0005,FILL=C'0',JUST=R                                
         MFLD  (FLD0812,'+++'),LTH=0003,FILL=C' '                               
         MFLD  (FLD0827,'++++'),LTH=0004,FILL=C'0',JUST=R                       
         MFLD  (FLD0833,' '),LTH=0001,FILL=C' '                                 
         MFLD  FLD0843,LTH=0005,FILL=C'0',JUST=R                                
         MFLD  (FLD0850,'+++'),LTH=0003,FILL=C' '                               
         MFLD  (FLD0865,'++++'),LTH=0004,FILL=C'0',JUST=R                       
         MFLD  (FLD0871,' '),LTH=0001,FILL=C' '                                 
         MFLD  FLD0905,LTH=0005,FILL=C'0',JUST=R                                
         MFLD  (FLD0912,'+++'),LTH=0003,FILL=C' '                               
         MFLD  (FLD0927,'++++'),LTH=0004,FILL=C'0',JUST=R                       
         MFLD  (FLD0933,' '),LTH=0001,FILL=C' '                                 
         MFLD  FLD0943,LTH=0005,FILL=C'0',JUST=R                                
         MFLD  (FLD0950,'+++'),LTH=0003,FILL=C' '                               
         MFLD  (FLD0965,'++++'),LTH=0004,FILL=C'0',JUST=R                       
         MFLD  (FLD0971,' '),LTH=0001,FILL=C' '                                 
         MFLD  FLD1005,LTH=0005,FILL=C'0',JUST=R                                
         MFLD  (FLD1012,'+++'),LTH=0003,FILL=C' '                               
         MFLD  (FLD1027,'++++'),LTH=0004,FILL=C'0',JUST=R                       
         MFLD  (FLD1033,' '),LTH=0001,FILL=C' '                                 
         MFLD  FLD1043,LTH=0005,FILL=C'0',JUST=R                                
         MFLD  (FLD1050,'+++'),LTH=0003,FILL=C' '                               
         MFLD  (FLD1065,'++++'),LTH=0004,FILL=C'0',JUST=R                       
         MFLD  (FLD1071,' '),LTH=0001,FILL=C' '                                 
         MFLD  FLD1105,LTH=0005,FILL=C'0',JUST=R                                
         MFLD  (FLD1112,'+++'),LTH=0003,FILL=C' '                               
         MFLD  (FLD1127,'++++'),LTH=0004,FILL=C'0',JUST=R                       
         MFLD  (FLD1133,' '),LTH=0001,FILL=C' '                                 
         MFLD  FLD1143,LTH=0005,FILL=C'0',JUST=R                                
         MFLD  (FLD1150,'+++'),LTH=0003,FILL=C' '                               
         MFLD  (FLD1165,'++++'),LTH=0004,FILL=C'0',JUST=R                       
         MFLD  (FLD1171,' '),LTH=0001,FILL=C' '                                 
         MFLD  FLD1205,LTH=0005,FILL=C'0',JUST=R                                
         MFLD  (FLD1212,'+++'),LTH=0003,FILL=C' '                               
         MFLD  (FLD1227,'++++'),LTH=0004,FILL=C'0',JUST=R                       
         MFLD  (FLD1233,' '),LTH=0001,FILL=C' '                                 
         MFLD  FLD1243,LTH=0005,FILL=C'0',JUST=R                                
         MFLD  (FLD1250,'+++'),LTH=0003,FILL=C' '                               
         MFLD  (FLD1265,'++++'),LTH=0004,FILL=C'0',JUST=R                       
         MFLD  (FLD1271,' '),LTH=0001,FILL=C' '                                 
         MFLD  FLD1305,LTH=0005,FILL=C'0',JUST=R                                
         MFLD  (FLD1312,'+++'),LTH=0003,FILL=C' '                               
         MFLD  (FLD1327,'++++'),LTH=0004,FILL=C'0',JUST=R                       
         MFLD  (FLD1333,' '),LTH=0001,FILL=C' '                                 
         MFLD  FLD1343,LTH=0005,FILL=C'0',JUST=R                                
         MFLD  (FLD1350,'+++'),LTH=0003,FILL=C' '                               
         MFLD  (FLD1365,'++++'),LTH=0004,FILL=C'0',JUST=R                       
         MFLD  (FLD1371,' '),LTH=0001,FILL=C' '                                 
         MFLD  FLD1405,LTH=0005,FILL=C'0',JUST=R                                
         MFLD  (FLD1412,'+++'),LTH=0003,FILL=C' '                               
         MFLD  (FLD1427,'++++'),LTH=0004,FILL=C'0',JUST=R                       
         MFLD  (FLD1433,' '),LTH=0001,FILL=C' '                                 
         MFLD  FLD1443,LTH=0005,FILL=C'0',JUST=R                                
         MFLD  (FLD1450,'+++'),LTH=0003,FILL=C' '                               
         MFLD  (FLD1465,'++++'),LTH=0004,FILL=C'0',JUST=R                       
         MFLD  (FLD1471,' '),LTH=0001,FILL=C' '                                 
         MFLD  FLD1505,LTH=0005,FILL=C'0',JUST=R                                
         MFLD  (FLD1512,'+++'),LTH=0003,FILL=C' '                               
         MFLD  (FLD1527,'++++'),LTH=0004,FILL=C'0',JUST=R                       
         MFLD  (FLD1533,' '),LTH=0001,FILL=C' '                                 
         MFLD  FLD1543,LTH=0005,FILL=C'0',JUST=R                                
         MFLD  (FLD1550,'+++'),LTH=0003,FILL=C' '                               
         MFLD  (FLD1565,'++++'),LTH=0004,FILL=C'0',JUST=R                       
         MFLD  (FLD1571,' '),LTH=0001,FILL=C' '                                 
         MFLD  FLD1605,LTH=0005,FILL=C'0',JUST=R                                
         MFLD  (FLD1612,'+++'),LTH=0003,FILL=C' '                               
         MFLD  (FLD1627,'++++'),LTH=0004,FILL=C'0',JUST=R                       
         MFLD  (FLD1633,' '),LTH=0001,FILL=C' '                                 
         MFLD  FLD1643,LTH=0005,FILL=C'0',JUST=R                                
         MFLD  (FLD1650,'+++'),LTH=0003,FILL=C' '                               
         MFLD  (FLD1665,'++++'),LTH=0004,FILL=C'0',JUST=R                       
         MFLD  (FLD1671,' '),LTH=0001,FILL=C' '                                 
         MFLD  FLD1705,LTH=0005,FILL=C'0',JUST=R                                
         MFLD  (FLD1712,'+++'),LTH=0003,FILL=C' '                               
         MFLD  (FLD1727,'++++'),LTH=0004,FILL=C'0',JUST=R                       
         MFLD  (FLD1733,' '),LTH=0001,FILL=C' '                                 
         MFLD  FLD1743,LTH=0005,FILL=C'0',JUST=R                                
         MFLD  (FLD1750,'+++'),LTH=0003,FILL=C' '                               
         MFLD  (FLD1765,'++++'),LTH=0004,FILL=C'0',JUST=R                       
         MFLD  (FLD1771,' '),LTH=0001,FILL=C' '                                 
         MFLD  FLD1805,LTH=0005,FILL=C'0',JUST=R                                
         MFLD  (FLD1812,'+++'),LTH=0003,FILL=C' '                               
         MFLD  (FLD1827,'++++'),LTH=0004,FILL=C'0',JUST=R                       
         MFLD  (FLD1833,' '),LTH=0001,FILL=C' '                                 
         MFLD  FLD1843,LTH=0005,FILL=C'0',JUST=R                                
         MFLD  (FLD1850,'+++'),LTH=0003,FILL=C' '                               
         MFLD  (FLD1865,'++++'),LTH=0004,FILL=C'0',JUST=R                       
         MFLD  (FLD1871,' '),LTH=0001,FILL=C' '                                 
         MFLD  FLD1905,LTH=0005,FILL=C'0',JUST=R                                
         MFLD  (FLD1912,'+++'),LTH=0003,FILL=C' '                               
         MFLD  (FLD1927,'++++'),LTH=0004,FILL=C'0',JUST=R                       
         MFLD  (FLD1933,' '),LTH=0001,FILL=C' '                                 
         MFLD  FLD1943,LTH=0005,FILL=C'0',JUST=R                                
         MFLD  (FLD1950,'+++'),LTH=0003,FILL=C' '                               
         MFLD  (FLD1965,'++++'),LTH=0004,FILL=C'0',JUST=R                       
         MFLD  (FLD1971,' '),LTH=0001,FILL=C' '                                 
         MSGEND                                                                 
         EJECT                                                                  
         END                                                                    
