*          DATA SET W4N671FII0 AT LEVEL 001 AS OF 86/09/01                      
*                                                                               
         PRINT NOGEN                                                            
W4N671   FMT                                                                    
         DEV   TYPE=(3270,2),                                          *        
               FEAT=IGNORE,                                            *        
               PFK=(FLDPFK,'W0T501  ','W0T501  ','W0T501  ','W0T501  ',*        
               'W0T501  ','W0T501  ','W4T671 7','W4T671 8','W0T501  ', *        
               'WHELP   ','W0T501  ','/RCL.   ','W4T671  ','W4T672  ', *        
               'W0T501  ','W0T501  ','W0T501  ','W0T501  ','W0T501  ', *        
               'W0T501  ','W0T501  ','WHELP   ','W0T501  ','/RCL.   '),*        
               DSCA=X'0080',SYSMSG=FSYSMSG                                      
         DIV   TYPE=INOUT                                                       
         DPAGE CURSOR=((02,15)),                                       *        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(01,02),LTH=0001,ATTR=(ALPHA,NOPROT,MOD)                     
FLD0104  DFLD  POS=(01,04),LTH=0001,ATTR=(NUM,MOD)                              
FLD0106  DFLD  POS=(01,06),LTH=0001,ATTR=(NUM,MOD)                              
FLD0108  DFLD  POS=(01,08),LTH=0001,ATTR=(NUM,MOD)                              
         DFLD  'NT TERUGGERAP. LADINGEN 1',                            *        
               POS=(01,11),LTH=0025,ATTR=(NUM,PROT)                             
FLD0141  DFLD  POS=(01,41),LTH=0040,ATTR=(NUM,PROT,HI)                          
         DFLD  'BESTEMMING ',                                          *        
               POS=(02,02),LTH=0011,ATTR=(NUM,PROT)                             
FLD0215  DFLD  POS=(02,15),LTH=0025,ATTR=(ALPHA)                                
         DFLD  'TRP-NAAM',                                             *        
               POS=(02,42),LTH=0008,ATTR=(NUM,PROT)                             
FLD0252  DFLD  POS=(02,52),LTH=0015,ATTR=(ALPHA)                                
FLD0315  DFLD  POS=(03,15),LTH=0025,ATTR=(NUM,PROT,MOD)                         
FLD0352  DFLD  POS=(03,52),LTH=0015,ATTR=(NUM,PROT,MOD)                         
FLD0402  DFLD  POS=(04,02),LTH=0025,ATTR=(NUM,PROT,MOD,NODISP)                  
FLD0428  DFLD  POS=(04,28),LTH=0015,ATTR=(NUM,PROT,MOD,NODISP)                  
         DFLD  'KIE',                                                  *        
               POS=(05,02),LTH=0003,ATTR=(NUM,PROT)                             
         DFLD  'BESTEMMING ',                                          *        
               POS=(05,06),LTH=0011,ATTR=(NUM,PROT)                             
         DFLD  'TRANSPORT',                                            *        
               POS=(05,36),LTH=0009,ATTR=(NUM,PROT)                             
         DO    14,SUF=06                                                        
COL03    DFLD  POS=(06,03),LTH=0001,ATTR=(ALPHA,PROT)                           
COL06    DFLD  POS=(06,06),LTH=0025,ATTR=(NUM,PROT,MOD)                         
COL36    DFLD  POS=(06,36),LTH=0015,ATTR=(NUM,PROT,MOD)                         
         ENDDO                                                                  
         DFLD  '13 TRPT-1        14 TRPT 2        15             16    *        
                         17             18               19            *        
                  20             21              10 WHELP',            *        
               POS=(21,02),LTH=0153,ATTR=(NUM,PROT)                             
FLD2302  DFLD  POS=(23,02),LTH=0055,ATTR=(NUM,PROT,HI)                          
         DFLD  ' VCAS',POS=(23,58)                                              
FLD2364  DFLD  POS=(23,64),LTH=0008,ATTR=(NUM,PROT)                             
FLD2373  DFLD  POS=(23,73),LTH=0008,ATTR=(NUM,PROT)                             
FSYSMSG  DFLD  POS=(24,02),LTH=0079,ATTR=(NUM,PROT,HI)                          
         FMTEND                                                                 
         EJECT                                                                  
W4O671N1 MSG   TYPE=OUTPUT,                                            *        
               SOR=(W4N671,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W4I671N1,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  FLD0102,LTH=0001                                                 
         MFLD  FLD0104,LTH=0001                                                 
         MFLD  FLD0106,LTH=0001                                                 
         MFLD  FLD0108,LTH=0001                                                 
         MFLD  FLD0141,LTH=0040                                                 
         MFLD  FLD0215,LTH=0002                                                 
         MFLD  FLD0315,LTH=0025                                                 
         MFLD  FLD0252,LTH=0002                                                 
         MFLD  FLD0352,LTH=0015                                                 
         MFLD  FLD0402,LTH=0025                                                 
         MFLD  FLD0428,LTH=0015                                                 
         DO    14,SUF=06                                                        
         MFLD  COL03,LTH=0003,ATTR=YES                                          
         MFLD  COL06,LTH=0025                                                   
         MFLD  COL36,LTH=0015                                                   
         ENDDO                                                                  
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=1                                              
         MSGEND                                                                 
         EJECT                                                                  
W4I671N1 MSG   TYPE=INPUT,                                             *        
               SOR=W4N671,                                             *        
               OPT=2,                                                  *        
               NXT=W4O671N1                                                     
         SEG                                                                    
         MFLD  FLDPFK,LTH=0008,FILL=NULL                                        
         MFLD  'W',LTH=1                                                        
         MFLD  FLD0102,LTH=0001,FILL=C'4'                                       
         MFLD  'T',LTH=1                                                        
         MFLD  FLD0104,LTH=0001,FILL=C'6'                                       
         MFLD  FLD0106,LTH=0001,FILL=C'7'                                       
         MFLD  FLD0108,LTH=0001,FILL=C'1'                                       
         MFLD  '  ',LTH=2                                                       
         MFLD  '46712',LTH=5                                                    
         MFLD  (FLD0215,'+++++++++++++++++++++++++'),LTH=0025,FILL=C' '         
         MFLD  FLD0315,LTH=0025,FILL=C' '                                       
         MFLD  (FLD0252,'+++++++++++++++'),LTH=0015,FILL=C' '                   
         MFLD  FLD0352,LTH=0015,FILL=C' '                                       
         MFLD  (FLD0402,'+++++++++++++++++++++++++'),LTH=0025,FILL=C' '         
         MFLD  (FLD0428,'+++++++++++++++'),LTH=0015,FILL=C' '                   
         DO    14,SUF=06                                                        
         MFLD  (COL03,'+'),LTH=0001,FILL=C' '                                   
         MFLD  (COL06,'+++++++++++++++++++++++++'),LTH=0025,FILL=C' '           
         MFLD  (COL36,'+++++++++++++++'),LTH=0015,FILL=C' '                     
         ENDDO                                                                  
         MSGEND                                                                 
         EJECT                                                                  
         END                                                                    
