***********************************************************************         
* CREATED BY PC35324   ON 97/04/15  AT 17:59                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'FAKTURAKOMPLETTERING TRANSPORT  '                               
W4N665   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T665 7',                                           +        
               8='W4T665 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T665U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4N665   DPAGE CURSOR=((7,30)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(PROT,MOD)                                                  
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  'INVOICE SUPPLEMENT TRANSPORT',                         +        
               POS=(1,11),LTH=28,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
DGIA0099 DFLD  POS=(2,12),LTH=3,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0098 DFLD  POS=(2,28),LTH=12,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0000 DFLD  POS=(2,55),LTH=1,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
IDDCIN   DFLD  POS=(2,61),LTH=2,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Transport',                                            +        
               POS=(3,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
DGIA0097 DFLD  POS=(3,12),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Carrier',                                              +        
               POS=(3,17),LTH=7,                                       +        
               ATTR=(PROT)                                                      
DGIA0096 DFLD  POS=(3,28),LTH=12,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Dang. goods',                                          +        
               POS=(3,42),LTH=11,                                      +        
               ATTR=(PROT)                                                      
DGIA0001 DFLD  POS=(3,55),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'DC',                                                   +        
               POS=(3,58),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDDCUT   DFLD  POS=(3,61),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDISTE  DFLD  POS=(4,2),LTH=4,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
IDKUNDE  DFLD  POS=(4,7),LTH=6,                                        +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KDFAKTE  DFLD  POS=(4,14),LTH=1,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDDISTN  DFLD  POS=(4,16),LTH=4,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDKUNDN  DFLD  POS=(4,21),LTH=6,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KDFAKTN  DFLD  POS=(4,28),LTH=1,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDSKEPPO DFLD  POS=(4,30),LTH=7,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         DFLD  'Invoice',                                              +        
               POS=(5,20),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Freight',                                              +        
               POS=(5,32),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Ins.',                                                 +        
               POS=(5,46),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Ins.    Overins.',                                     +        
               POS=(5,58),LTH=16,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'CMD Dist.  Cust.  type',                               +        
               POS=(6,2),LTH=22,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'cost',                                                 +        
               POS=(6,35),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'prem.',                                                +        
               POS=(6,46),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'prem.%',                                               +        
               POS=(6,57),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'prem.',                                                +        
               POS=(6,68),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KDCMD6   DFLD  POS=(7,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDDISTR6 DFLD  POS=(7,6),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0022 DFLD  POS=(7,12),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
FAKTYP6  DFLD  POS=(7,22),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
PRFRAK6  DFLD  POS=(7,30),LTH=10,                                      +        
               ATTR=(NUM,NOPROT)                                                
PRFOER6  DFLD  POS=(7,43),LTH=10,                                      +        
               ATTR=(NUM,NOPROT)                                                
REFOER6  DFLD  POS=(7,57),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
REOVFOE6 DFLD  POS=(7,68),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
KDCMD7   DFLD  POS=(8,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDDISTR7 DFLD  POS=(8,6),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0023 DFLD  POS=(8,12),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
FAKTYP7  DFLD  POS=(8,22),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
PRFRAK7  DFLD  POS=(8,30),LTH=10,                                      +        
               ATTR=(NUM,NOPROT)                                                
PRFOER7  DFLD  POS=(8,43),LTH=10,                                      +        
               ATTR=(NUM,NOPROT)                                                
REFOER7  DFLD  POS=(8,57),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
REOVFOE7 DFLD  POS=(8,68),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
KDCMD8   DFLD  POS=(9,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDDISTR8 DFLD  POS=(9,6),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0024 DFLD  POS=(9,12),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
FAKTYP8  DFLD  POS=(9,22),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
PRFRAK8  DFLD  POS=(9,30),LTH=10,                                      +        
               ATTR=(NUM,NOPROT)                                                
PRFOER8  DFLD  POS=(9,43),LTH=10,                                      +        
               ATTR=(NUM,NOPROT)                                                
REFOER8  DFLD  POS=(9,57),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
REOVFOE8 DFLD  POS=(9,68),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
KDCMD9   DFLD  POS=(10,2),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDDISTR9 DFLD  POS=(10,6),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0025 DFLD  POS=(10,12),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
FAKTYP9  DFLD  POS=(10,22),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
PRFRAK9  DFLD  POS=(10,30),LTH=10,                                     +        
               ATTR=(NUM,NOPROT)                                                
PRFOER9  DFLD  POS=(10,43),LTH=10,                                     +        
               ATTR=(NUM,NOPROT)                                                
REFOER9  DFLD  POS=(10,57),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
REOVFOE9 DFLD  POS=(10,68),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
KDCMD10  DFLD  POS=(11,2),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDDIST10 DFLD  POS=(11,6),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0026 DFLD  POS=(11,12),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
FAKTYP10 DFLD  POS=(11,22),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
PRFRAK10 DFLD  POS=(11,30),LTH=10,                                     +        
               ATTR=(NUM,NOPROT)                                                
PRFOER10 DFLD  POS=(11,43),LTH=10,                                     +        
               ATTR=(NUM,NOPROT)                                                
REFOER10 DFLD  POS=(11,57),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
REOVFO10 DFLD  POS=(11,68),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
KDCMD11  DFLD  POS=(12,2),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDDIST11 DFLD  POS=(12,6),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0027 DFLD  POS=(12,12),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
FAKTYP11 DFLD  POS=(12,22),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
PRFRAK11 DFLD  POS=(12,30),LTH=10,                                     +        
               ATTR=(NUM,NOPROT)                                                
PRFOER11 DFLD  POS=(12,43),LTH=10,                                     +        
               ATTR=(NUM,NOPROT)                                                
REFOER11 DFLD  POS=(12,57),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
REOVFO11 DFLD  POS=(12,68),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
KDCMD12  DFLD  POS=(13,2),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDDIST12 DFLD  POS=(13,6),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0028 DFLD  POS=(13,12),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
FAKTYP12 DFLD  POS=(13,22),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
PRFRAK12 DFLD  POS=(13,30),LTH=10,                                     +        
               ATTR=(NUM,NOPROT)                                                
PRFOER12 DFLD  POS=(13,43),LTH=10,                                     +        
               ATTR=(NUM,NOPROT)                                                
REFOER12 DFLD  POS=(13,57),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
REOVFO12 DFLD  POS=(13,68),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
KDCMD13  DFLD  POS=(14,2),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDDIST13 DFLD  POS=(14,6),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0029 DFLD  POS=(14,12),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
FAKTYP13 DFLD  POS=(14,22),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
PRFRAK13 DFLD  POS=(14,30),LTH=10,                                     +        
               ATTR=(NUM,NOPROT)                                                
PRFOER13 DFLD  POS=(14,43),LTH=10,                                     +        
               ATTR=(NUM,NOPROT)                                                
REFOER13 DFLD  POS=(14,57),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
REOVFO13 DFLD  POS=(14,68),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
KDCMD14  DFLD  POS=(15,2),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDDIST14 DFLD  POS=(15,6),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0030 DFLD  POS=(15,12),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
FAKTYP14 DFLD  POS=(15,22),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
PRFRAK14 DFLD  POS=(15,30),LTH=10,                                     +        
               ATTR=(NUM,NOPROT)                                                
PRFOER14 DFLD  POS=(15,43),LTH=10,                                     +        
               ATTR=(NUM,NOPROT)                                                
REFOER14 DFLD  POS=(15,57),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
REOVFO14 DFLD  POS=(15,68),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
KDCMD15  DFLD  POS=(16,2),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDDIST15 DFLD  POS=(16,6),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0031 DFLD  POS=(16,12),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
FAKTYP15 DFLD  POS=(16,22),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
PRFRAK15 DFLD  POS=(16,30),LTH=10,                                     +        
               ATTR=(NUM,NOPROT)                                                
PRFOER15 DFLD  POS=(16,43),LTH=10,                                     +        
               ATTR=(NUM,NOPROT)                                                
REFOER15 DFLD  POS=(16,57),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
REOVFO15 DFLD  POS=(16,68),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
KDCMD16  DFLD  POS=(17,2),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDDIST16 DFLD  POS=(17,6),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0032 DFLD  POS=(17,12),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
FAKTYP16 DFLD  POS=(17,22),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
PRFRAK16 DFLD  POS=(17,30),LTH=10,                                     +        
               ATTR=(NUM,NOPROT)                                                
PRFOER16 DFLD  POS=(17,43),LTH=10,                                     +        
               ATTR=(NUM,NOPROT)                                                
REFOER16 DFLD  POS=(17,57),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
REOVFO16 DFLD  POS=(17,68),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
KDCMD17  DFLD  POS=(18,2),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDDIST17 DFLD  POS=(18,6),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0033 DFLD  POS=(18,12),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
FAKTYP17 DFLD  POS=(18,22),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
PRFRAK17 DFLD  POS=(18,30),LTH=10,                                     +        
               ATTR=(NUM,NOPROT)                                                
PRFOER17 DFLD  POS=(18,43),LTH=10,                                     +        
               ATTR=(NUM,NOPROT)                                                
REFOER17 DFLD  POS=(18,57),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
REOVFO17 DFLD  POS=(18,68),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
KDCMD18  DFLD  POS=(19,2),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDDIST18 DFLD  POS=(19,6),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0034 DFLD  POS=(19,12),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
FAKTYP18 DFLD  POS=(19,22),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
PRFRAK18 DFLD  POS=(19,30),LTH=10,                                     +        
               ATTR=(NUM,NOPROT)                                                
PRFOER18 DFLD  POS=(19,43),LTH=10,                                     +        
               ATTR=(NUM,NOPROT)                                                
REFOER18 DFLD  POS=(19,57),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
REOVFO18 DFLD  POS=(19,68),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
KDCMD19  DFLD  POS=(20,2),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
IDDIST19 DFLD  POS=(20,6),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0035 DFLD  POS=(20,12),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
FAKTYP19 DFLD  POS=(20,22),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
PRFRAK19 DFLD  POS=(20,30),LTH=10,                                     +        
               ATTR=(NUM,NOPROT)                                                
PRFOER19 DFLD  POS=(20,43),LTH=10,                                     +        
               ATTR=(NUM,NOPROT)                                                
REFOER19 DFLD  POS=(20,57),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
REOVFO19 DFLD  POS=(20,68),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'F7=First',                                             +        
               POS=(21,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'F8=Next',                                              +        
               POS=(21,18),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '                                 ',                    +        
               POS=(21,28),LTH=33,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'F11=Update',                                           +        
               POS=(21,65),LTH=10,                                     +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O665N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N665,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I665N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4N665                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  DGIA0099,                                               +        
               LTH=3                                                            
         MFLD  DGIA0097,                                               +        
               LTH=3                                                            
         MFLD  DGIA0098,                                               +        
               LTH=12                                                           
         MFLD  DGIA0096,                                               +        
               LTH=12                                                           
         MFLD  DGIA0000,                                               +        
               LTH=1                                                            
         MFLD  DGIA0001,                                               +        
               LTH=1                                                            
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  IDDISTE,                                                +        
               LTH=4                                                            
         MFLD  IDKUNDE,                                                +        
               LTH=6                                                            
         MFLD  KDFAKTE,                                                +        
               LTH=1                                                            
         MFLD  IDDISTN,                                                +        
               LTH=4                                                            
         MFLD  IDKUNDN,                                                +        
               LTH=6                                                            
         MFLD  KDFAKTN,                                                +        
               LTH=1                                                            
         MFLD  IDSKEPPO,                                               +        
               LTH=7                                                            
         MFLD  KDCMD6,                                                 +        
               LTH=1                                                            
         MFLD  IDDISTR6,                                               +        
               LTH=4                                                            
         MFLD  DGIA0022,                                               +        
               LTH=6                                                            
         MFLD  FAKTYP6,                                                +        
               LTH=1                                                            
         MFLD  PRFRAK6,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  PRFOER6,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  REFOER6,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  REOVFOE6,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD7,                                                 +        
               LTH=1                                                            
         MFLD  IDDISTR7,                                               +        
               LTH=4                                                            
         MFLD  DGIA0023,                                               +        
               LTH=6                                                            
         MFLD  FAKTYP7,                                                +        
               LTH=1                                                            
         MFLD  PRFRAK7,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  PRFOER7,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  REFOER7,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  REOVFOE7,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD8,                                                 +        
               LTH=1                                                            
         MFLD  IDDISTR8,                                               +        
               LTH=4                                                            
         MFLD  DGIA0024,                                               +        
               LTH=6                                                            
         MFLD  FAKTYP8,                                                +        
               LTH=1                                                            
         MFLD  PRFRAK8,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  PRFOER8,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  REFOER8,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  REOVFOE8,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD9,                                                 +        
               LTH=1                                                            
         MFLD  IDDISTR9,                                               +        
               LTH=4                                                            
         MFLD  DGIA0025,                                               +        
               LTH=6                                                            
         MFLD  FAKTYP9,                                                +        
               LTH=1                                                            
         MFLD  PRFRAK9,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  PRFOER9,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  REFOER9,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  REOVFOE9,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD10,                                                +        
               LTH=1                                                            
         MFLD  IDDIST10,                                               +        
               LTH=4                                                            
         MFLD  DGIA0026,                                               +        
               LTH=6                                                            
         MFLD  FAKTYP10,                                               +        
               LTH=1                                                            
         MFLD  PRFRAK10,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  PRFOER10,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  REFOER10,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  REOVFO10,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD11,                                                +        
               LTH=1                                                            
         MFLD  IDDIST11,                                               +        
               LTH=4                                                            
         MFLD  DGIA0027,                                               +        
               LTH=6                                                            
         MFLD  FAKTYP11,                                               +        
               LTH=1                                                            
         MFLD  PRFRAK11,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  PRFOER11,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  REFOER11,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  REOVFO11,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD12,                                                +        
               LTH=1                                                            
         MFLD  IDDIST12,                                               +        
               LTH=4                                                            
         MFLD  DGIA0028,                                               +        
               LTH=6                                                            
         MFLD  FAKTYP12,                                               +        
               LTH=1                                                            
         MFLD  PRFRAK12,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  PRFOER12,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  REFOER12,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  REOVFO12,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD13,                                                +        
               LTH=1                                                            
         MFLD  IDDIST13,                                               +        
               LTH=4                                                            
         MFLD  DGIA0029,                                               +        
               LTH=6                                                            
         MFLD  FAKTYP13,                                               +        
               LTH=1                                                            
         MFLD  PRFRAK13,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  PRFOER13,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  REFOER13,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  REOVFO13,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD14,                                                +        
               LTH=1                                                            
         MFLD  IDDIST14,                                               +        
               LTH=4                                                            
         MFLD  DGIA0030,                                               +        
               LTH=6                                                            
         MFLD  FAKTYP14,                                               +        
               LTH=1                                                            
         MFLD  PRFRAK14,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  PRFOER14,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  REFOER14,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  REOVFO14,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD15,                                                +        
               LTH=1                                                            
         MFLD  IDDIST15,                                               +        
               LTH=4                                                            
         MFLD  DGIA0031,                                               +        
               LTH=6                                                            
         MFLD  FAKTYP15,                                               +        
               LTH=1                                                            
         MFLD  PRFRAK15,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  PRFOER15,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  REFOER15,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  REOVFO15,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD16,                                                +        
               LTH=1                                                            
         MFLD  IDDIST16,                                               +        
               LTH=4                                                            
         MFLD  DGIA0032,                                               +        
               LTH=6                                                            
         MFLD  FAKTYP16,                                               +        
               LTH=1                                                            
         MFLD  PRFRAK16,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  PRFOER16,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  REFOER16,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  REOVFO16,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD17,                                                +        
               LTH=1                                                            
         MFLD  IDDIST17,                                               +        
               LTH=4                                                            
         MFLD  DGIA0033,                                               +        
               LTH=6                                                            
         MFLD  FAKTYP17,                                               +        
               LTH=1                                                            
         MFLD  PRFRAK17,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  PRFOER17,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  REFOER17,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  REOVFO17,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD18,                                                +        
               LTH=1                                                            
         MFLD  IDDIST18,                                               +        
               LTH=4                                                            
         MFLD  DGIA0034,                                               +        
               LTH=6                                                            
         MFLD  FAKTYP18,                                               +        
               LTH=1                                                            
         MFLD  PRFRAK18,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  PRFOER18,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  REFOER18,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  REOVFO18,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD19,                                                +        
               LTH=1                                                            
         MFLD  IDDIST19,                                               +        
               LTH=4                                                            
         MFLD  DGIA0035,                                               +        
               LTH=6                                                            
         MFLD  FAKTYP19,                                               +        
               LTH=1                                                            
         MFLD  PRFRAK19,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  PRFOER19,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  REFOER19,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  REOVFO19,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I665N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N665),                                           +        
               OPT=2,                                                  +        
               NXT=W4O665N1                                                     
MID      LPAGE SOR=(W4N665)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '46652',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0099,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0097,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0098,                                              +        
               '++++++++++++'),                                        +        
               LTH=12,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0096,                                              +        
               '++++++++++++'),                                        +        
               LTH=12,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0000,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0001,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDDCUT,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDISTE,                                                +        
               LTH=4                                                            
         MFLD  IDKUNDE,                                                +        
               LTH=6                                                            
         MFLD  KDFAKTE,                                                +        
               LTH=1                                                            
         MFLD  IDDISTN,                                                +        
               LTH=4                                                            
         MFLD  IDKUNDN,                                                +        
               LTH=6                                                            
         MFLD  KDFAKTN,                                                +        
               LTH=1                                                            
         MFLD  IDSKEPPO,                                               +        
               LTH=7                                                            
         MFLD  KDCMD6,                                                 +        
               LTH=1                                                            
         MFLD  IDDISTR6,                                               +        
               LTH=4                                                            
         MFLD  DGIA0022,                                               +        
               LTH=6                                                            
         MFLD  FAKTYP6,                                                +        
               LTH=1                                                            
         MFLD  KDCMD7,                                                 +        
               LTH=1                                                            
         MFLD  IDDISTR7,                                               +        
               LTH=4                                                            
         MFLD  DGIA0023,                                               +        
               LTH=6                                                            
         MFLD  FAKTYP7,                                                +        
               LTH=1                                                            
         MFLD  KDCMD8,                                                 +        
               LTH=1                                                            
         MFLD  IDDISTR8,                                               +        
               LTH=4                                                            
         MFLD  DGIA0024,                                               +        
               LTH=6                                                            
         MFLD  FAKTYP8,                                                +        
               LTH=1                                                            
         MFLD  KDCMD9,                                                 +        
               LTH=1                                                            
         MFLD  IDDISTR9,                                               +        
               LTH=4                                                            
         MFLD  DGIA0025,                                               +        
               LTH=6                                                            
         MFLD  FAKTYP9,                                                +        
               LTH=1                                                            
         MFLD  KDCMD10,                                                +        
               LTH=1                                                            
         MFLD  IDDIST10,                                               +        
               LTH=4                                                            
         MFLD  DGIA0026,                                               +        
               LTH=6                                                            
         MFLD  FAKTYP10,                                               +        
               LTH=1                                                            
         MFLD  KDCMD11,                                                +        
               LTH=1                                                            
         MFLD  IDDIST11,                                               +        
               LTH=4                                                            
         MFLD  DGIA0027,                                               +        
               LTH=6                                                            
         MFLD  FAKTYP11,                                               +        
               LTH=1                                                            
         MFLD  KDCMD12,                                                +        
               LTH=1                                                            
         MFLD  IDDIST12,                                               +        
               LTH=4                                                            
         MFLD  DGIA0028,                                               +        
               LTH=6                                                            
         MFLD  FAKTYP12,                                               +        
               LTH=1                                                            
         MFLD  KDCMD13,                                                +        
               LTH=1                                                            
         MFLD  IDDIST13,                                               +        
               LTH=4                                                            
         MFLD  DGIA0029,                                               +        
               LTH=6                                                            
         MFLD  FAKTYP13,                                               +        
               LTH=1                                                            
         MFLD  KDCMD14,                                                +        
               LTH=1                                                            
         MFLD  IDDIST14,                                               +        
               LTH=4                                                            
         MFLD  DGIA0030,                                               +        
               LTH=6                                                            
         MFLD  FAKTYP14,                                               +        
               LTH=1                                                            
         MFLD  KDCMD15,                                                +        
               LTH=1                                                            
         MFLD  IDDIST15,                                               +        
               LTH=4                                                            
         MFLD  DGIA0031,                                               +        
               LTH=6                                                            
         MFLD  FAKTYP15,                                               +        
               LTH=1                                                            
         MFLD  KDCMD16,                                                +        
               LTH=1                                                            
         MFLD  IDDIST16,                                               +        
               LTH=4                                                            
         MFLD  DGIA0032,                                               +        
               LTH=6                                                            
         MFLD  FAKTYP16,                                               +        
               LTH=1                                                            
         MFLD  KDCMD17,                                                +        
               LTH=1                                                            
         MFLD  IDDIST17,                                               +        
               LTH=4                                                            
         MFLD  DGIA0033,                                               +        
               LTH=6                                                            
         MFLD  FAKTYP17,                                               +        
               LTH=1                                                            
         MFLD  KDCMD18,                                                +        
               LTH=1                                                            
         MFLD  IDDIST18,                                               +        
               LTH=4                                                            
         MFLD  DGIA0034,                                               +        
               LTH=6                                                            
         MFLD  FAKTYP18,                                               +        
               LTH=1                                                            
         MFLD  KDCMD19,                                                +        
               LTH=1                                                            
         MFLD  IDDIST19,                                               +        
               LTH=4                                                            
         MFLD  DGIA0035,                                               +        
               LTH=6                                                            
         MFLD  FAKTYP19,                                               +        
               LTH=1                                                            
         MFLD  (PRFRAK6,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PRFOER6,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (REFOER6,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (REOVFOE6,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PRFRAK7,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PRFOER7,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (REFOER7,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (REOVFOE7,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PRFRAK8,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PRFOER8,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (REFOER8,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (REOVFOE8,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PRFRAK9,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PRFOER9,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (REFOER9,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (REOVFOE9,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PRFRAK10,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PRFOER10,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (REFOER10,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (REOVFO10,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PRFRAK11,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PRFOER11,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (REFOER11,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (REOVFO11,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PRFRAK12,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PRFOER12,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (REFOER12,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (REOVFO12,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PRFRAK13,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PRFOER13,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (REFOER13,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (REOVFO13,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PRFRAK14,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PRFOER14,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (REFOER14,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (REOVFO14,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PRFRAK15,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PRFOER15,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (REFOER15,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (REOVFO15,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PRFRAK16,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PRFOER16,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (REFOER16,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (REOVFO16,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PRFRAK17,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PRFOER17,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (REFOER17,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (REOVFO17,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PRFRAK18,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PRFOER18,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (REFOER18,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (REOVFO18,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PRFRAK19,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PRFOER19,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (REFOER19,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (REOVFO19,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
