***********************************************************************         
* CREATED BY PC35324   ON 95/02/24  AT 13:54                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W4N661   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W4T661 6',                                           +        
               7='W4T661 7',                                           +        
               8='W4T661 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T661U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T661  ',                                          +        
               14='W4T662  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W4T661U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DEFINE    TRANSPORT',                                  +        
               POS=(1,13),LTH=19,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Transport',                                            +        
               POS=(2,2),LTH=9,                                        +        
               ATTR=(NUM,PROT)                                                  
FLD0212  DFLD  POS=(2,12),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Geo. area',                                            +        
               POS=(2,17),LTH=9,                                       +        
               ATTR=(PROT)                                                      
FLD0227  DFLD  POS=(2,27),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Load-area',                                            +        
               POS=(2,32),LTH=9,                                       +        
               ATTR=(PROT)                                                      
FLD0241  DFLD  POS=(2,42),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,46),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DCI      DFLD  POS=(2,50),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
FLD0312  DFLD  POS=(3,12),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0327  DFLD  POS=(3,27),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0341  DFLD  POS=(3,41),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
DCO      DFLD  POS=(3,50),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0402  DFLD  POS=(4,2),LTH=4,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0409  DFLD  POS=(4,9),LTH=6,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0418  DFLD  POS=(4,18),LTH=2,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0423  DFLD  POS=(4,23),LTH=1,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0435  DFLD  POS=(4,35),LTH=4,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0442  DFLD  POS=(4,42),LTH=6,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0451  DFLD  POS=(4,51),LTH=2,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0456  DFLD  POS=(4,56),LTH=1,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Load area Y/N :',                                      +        
               POS=(5,2),LTH=15,                                       +        
               ATTR=(PROT)                                                      
FLD0518  DFLD  POS=(5,18),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Geo. area',                                            +        
               POS=(5,21),LTH=9,                                       +        
               ATTR=(PROT)                                                      
FLD0532  DFLD  POS=(5,32),LTH=3,                                       +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Load-area',                                            +        
               POS=(5,37),LTH=9,                                       +        
               ATTR=(PROT)                                                      
FLD0548  DFLD  POS=(5,48),LTH=3,                                       +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Square',                                               +        
               POS=(5,53),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0561  DFLD  POS=(5,61),LTH=3,                                       +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Send To TMS',                                          +        
               POS=(5,66),LTH=11,                                      +        
               ATTR=(PROT)                                                      
FLD0578  DFLD  POS=(5,78),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
         DFLD  'Cd  Distr from   to Cust  from',                       +        
               POS=(6,2),LTH=30,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'to  Fc  Cl  DCC       Free text',                      +        
               POS=(6,35),LTH=31,                                      +        
               ATTR=(PROT)                                                      
COL0307  DFLD  POS=(7,3),LTH=1,                                        +        
               ATTR=(PROT)                                                      
COL1207  DFLD  POS=(7,12),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1707  DFLD  POS=(7,17),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL2407  DFLD  POS=(7,24),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
COL3107  DFLD  POS=(7,31),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL3907  DFLD  POS=(7,39),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
COL4407  DFLD  POS=(7,44),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
COL4707  DFLD  POS=(7,47),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
COL5107  DFLD  POS=(7,51),LTH=20,                                      +        
               ATTR=(PROT)                                                      
COL0308  DFLD  POS=(8,3),LTH=1,                                        +        
               ATTR=(PROT)                                                      
COL1208  DFLD  POS=(8,12),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1708  DFLD  POS=(8,17),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL2408  DFLD  POS=(8,24),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
COL3108  DFLD  POS=(8,31),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL3908  DFLD  POS=(8,39),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
COL4408  DFLD  POS=(8,44),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
COL4708  DFLD  POS=(8,47),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
COL5108  DFLD  POS=(8,51),LTH=20,                                      +        
               ATTR=(PROT)                                                      
COL0309  DFLD  POS=(9,3),LTH=1,                                        +        
               ATTR=(PROT)                                                      
COL1209  DFLD  POS=(9,12),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1709  DFLD  POS=(9,17),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL2409  DFLD  POS=(9,24),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
COL3109  DFLD  POS=(9,31),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
COL3909  DFLD  POS=(9,39),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
COL4409  DFLD  POS=(9,44),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
COL4709  DFLD  POS=(9,47),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
COL5109  DFLD  POS=(9,51),LTH=20,                                      +        
               ATTR=(PROT)                                                      
COL0310  DFLD  POS=(10,3),LTH=1,                                       +        
               ATTR=(PROT)                                                      
COL1210  DFLD  POS=(10,12),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1710  DFLD  POS=(10,17),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2410  DFLD  POS=(10,24),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL3110  DFLD  POS=(10,31),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL3910  DFLD  POS=(10,39),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
COL4410  DFLD  POS=(10,44),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
COL4710  DFLD  POS=(10,47),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
COL5110  DFLD  POS=(10,51),LTH=20,                                     +        
               ATTR=(PROT)                                                      
COL0311  DFLD  POS=(11,3),LTH=1,                                       +        
               ATTR=(PROT)                                                      
COL1211  DFLD  POS=(11,12),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1711  DFLD  POS=(11,17),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2411  DFLD  POS=(11,24),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL3111  DFLD  POS=(11,31),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL3911  DFLD  POS=(11,39),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
COL4411  DFLD  POS=(11,44),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
COL4711  DFLD  POS=(11,47),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
COL5111  DFLD  POS=(11,51),LTH=20,                                     +        
               ATTR=(PROT)                                                      
COL0312  DFLD  POS=(12,3),LTH=1,                                       +        
               ATTR=(PROT)                                                      
COL1212  DFLD  POS=(12,12),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1712  DFLD  POS=(12,17),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2412  DFLD  POS=(12,24),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL3112  DFLD  POS=(12,31),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL3912  DFLD  POS=(12,39),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
COL4412  DFLD  POS=(12,44),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
COL4712  DFLD  POS=(12,47),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
COL5112  DFLD  POS=(12,51),LTH=20,                                     +        
               ATTR=(PROT)                                                      
COL0313  DFLD  POS=(13,3),LTH=1,                                       +        
               ATTR=(PROT)                                                      
COL1213  DFLD  POS=(13,12),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1713  DFLD  POS=(13,17),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2413  DFLD  POS=(13,24),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL3113  DFLD  POS=(13,31),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL3913  DFLD  POS=(13,39),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
COL4413  DFLD  POS=(13,44),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
COL4713  DFLD  POS=(13,47),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
COL5113  DFLD  POS=(13,51),LTH=20,                                     +        
               ATTR=(PROT)                                                      
COL0314  DFLD  POS=(14,3),LTH=1,                                       +        
               ATTR=(PROT)                                                      
COL1214  DFLD  POS=(14,12),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1714  DFLD  POS=(14,17),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2414  DFLD  POS=(14,24),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL3114  DFLD  POS=(14,31),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL3914  DFLD  POS=(14,39),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
COL4414  DFLD  POS=(14,44),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
COL4714  DFLD  POS=(14,47),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
COL5114  DFLD  POS=(14,51),LTH=20,                                     +        
               ATTR=(PROT)                                                      
COL0315  DFLD  POS=(15,3),LTH=1,                                       +        
               ATTR=(PROT)                                                      
COL1215  DFLD  POS=(15,12),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1715  DFLD  POS=(15,17),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2415  DFLD  POS=(15,24),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL3115  DFLD  POS=(15,31),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL3915  DFLD  POS=(15,39),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
COL4415  DFLD  POS=(15,44),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
COL4715  DFLD  POS=(15,47),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
COL5115  DFLD  POS=(15,51),LTH=20,                                     +        
               ATTR=(PROT)                                                      
COL0316  DFLD  POS=(16,3),LTH=1,                                       +        
               ATTR=(PROT)                                                      
COL1216  DFLD  POS=(16,12),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1716  DFLD  POS=(16,17),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2416  DFLD  POS=(16,24),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL3116  DFLD  POS=(16,31),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL3916  DFLD  POS=(16,39),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
COL4416  DFLD  POS=(16,44),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
COL4716  DFLD  POS=(16,47),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
COL5116  DFLD  POS=(16,51),LTH=20,                                     +        
               ATTR=(PROT)                                                      
COL0317  DFLD  POS=(17,3),LTH=1,                                       +        
               ATTR=(PROT)                                                      
COL1217  DFLD  POS=(17,12),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1717  DFLD  POS=(17,17),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2417  DFLD  POS=(17,24),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL3117  DFLD  POS=(17,31),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL3917  DFLD  POS=(17,39),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
COL4417  DFLD  POS=(17,44),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
COL4717  DFLD  POS=(17,47),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
COL5117  DFLD  POS=(17,51),LTH=20,                                     +        
               ATTR=(PROT)                                                      
COL0318  DFLD  POS=(18,3),LTH=1,                                       +        
               ATTR=(PROT)                                                      
COL1218  DFLD  POS=(18,12),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1718  DFLD  POS=(18,17),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL2418  DFLD  POS=(18,24),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
COL3118  DFLD  POS=(18,31),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
COL3918  DFLD  POS=(18,39),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
COL4418  DFLD  POS=(18,44),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
COL4718  DFLD  POS=(18,47),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
COL5118  DFLD  POS=(18,51),LTH=20,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'N',                                                    +        
               POS=(19,3),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD1912  DFLD  POS=(19,12),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
FLD1917  DFLD  POS=(19,17),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
FLD1924  DFLD  POS=(19,24),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
FLD1931  DFLD  POS=(19,31),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
FLD1939  DFLD  POS=(19,39),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
FLD1944  DFLD  POS=(19,44),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
FLD1947  DFLD  POS=(19,47),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
FLD1951  DFLD  POS=(19,51),LTH=20,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  '13 Def. transp  14 Load. transp. 15',                  +        
               POS=(21,2),LTH=35,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,35),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O661N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N661,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I661N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0212,                                                +        
               LTH=2                                                            
         MFLD  FLD0312,                                                +        
               LTH=3                                                            
         MFLD  FLD0227,                                                +        
               LTH=2                                                            
         MFLD  FLD0327,                                                +        
               LTH=3                                                            
         MFLD  FLD0241,                                                +        
               LTH=2                                                            
         MFLD  FLD0341,                                                +        
               LTH=3                                                            
         MFLD  DCI,                                                    +        
               LTH=2                                                            
         MFLD  DCO,                                                    +        
               LTH=2                                                            
         MFLD  FLD0402,                                                +        
               LTH=4                                                            
         MFLD  FLD0409,                                                +        
               LTH=6                                                            
         MFLD  FLD0418,                                                +        
               LTH=2                                                            
         MFLD  FLD0423,                                                +        
               LTH=1                                                            
         MFLD  FLD0435,                                                +        
               LTH=4                                                            
         MFLD  FLD0442,                                                +        
               LTH=6                                                            
         MFLD  FLD0451,                                                +        
               LTH=2                                                            
         MFLD  FLD0456,                                                +        
               LTH=1                                                            
         MFLD  FLD0518,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0532,                                                +        
               LTH=3                                                            
         MFLD  FLD0548,                                                +        
               LTH=3                                                            
         MFLD  FLD0561,                                                +        
               LTH=3                                                            
         MFLD  FLD0578,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0307,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1207,                                                +        
               LTH=4                                                            
         MFLD  COL1707,                                                +        
               LTH=4                                                            
         MFLD  COL2407,                                                +        
               LTH=6                                                            
         MFLD  COL3107,                                                +        
               LTH=6                                                            
         MFLD  COL3907,                                                +        
               LTH=2                                                            
         MFLD  COL4407,                                                +        
               LTH=1                                                            
         MFLD  COL4707,                                                +        
               LTH=2                                                            
         MFLD  COL5107,                                                +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0308,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1208,                                                +        
               LTH=4                                                            
         MFLD  COL1708,                                                +        
               LTH=4                                                            
         MFLD  COL2408,                                                +        
               LTH=6                                                            
         MFLD  COL3108,                                                +        
               LTH=6                                                            
         MFLD  COL3908,                                                +        
               LTH=2                                                            
         MFLD  COL4408,                                                +        
               LTH=1                                                            
         MFLD  COL4708,                                                +        
               LTH=2                                                            
         MFLD  COL5108,                                                +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0309,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1209,                                                +        
               LTH=4                                                            
         MFLD  COL1709,                                                +        
               LTH=4                                                            
         MFLD  COL2409,                                                +        
               LTH=6                                                            
         MFLD  COL3109,                                                +        
               LTH=6                                                            
         MFLD  COL3909,                                                +        
               LTH=2                                                            
         MFLD  COL4409,                                                +        
               LTH=1                                                            
         MFLD  COL4709,                                                +        
               LTH=2                                                            
         MFLD  COL5109,                                                +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0310,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1210,                                                +        
               LTH=4                                                            
         MFLD  COL1710,                                                +        
               LTH=4                                                            
         MFLD  COL2410,                                                +        
               LTH=6                                                            
         MFLD  COL3110,                                                +        
               LTH=6                                                            
         MFLD  COL3910,                                                +        
               LTH=2                                                            
         MFLD  COL4410,                                                +        
               LTH=1                                                            
         MFLD  COL4710,                                                +        
               LTH=2                                                            
         MFLD  COL5110,                                                +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0311,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1211,                                                +        
               LTH=4                                                            
         MFLD  COL1711,                                                +        
               LTH=4                                                            
         MFLD  COL2411,                                                +        
               LTH=6                                                            
         MFLD  COL3111,                                                +        
               LTH=6                                                            
         MFLD  COL3911,                                                +        
               LTH=2                                                            
         MFLD  COL4411,                                                +        
               LTH=1                                                            
         MFLD  COL4711,                                                +        
               LTH=2                                                            
         MFLD  COL5111,                                                +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0312,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1212,                                                +        
               LTH=4                                                            
         MFLD  COL1712,                                                +        
               LTH=4                                                            
         MFLD  COL2412,                                                +        
               LTH=6                                                            
         MFLD  COL3112,                                                +        
               LTH=6                                                            
         MFLD  COL3912,                                                +        
               LTH=2                                                            
         MFLD  COL4412,                                                +        
               LTH=1                                                            
         MFLD  COL4712,                                                +        
               LTH=2                                                            
         MFLD  COL5112,                                                +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0313,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1213,                                                +        
               LTH=4                                                            
         MFLD  COL1713,                                                +        
               LTH=4                                                            
         MFLD  COL2413,                                                +        
               LTH=6                                                            
         MFLD  COL3113,                                                +        
               LTH=6                                                            
         MFLD  COL3913,                                                +        
               LTH=2                                                            
         MFLD  COL4413,                                                +        
               LTH=1                                                            
         MFLD  COL4713,                                                +        
               LTH=2                                                            
         MFLD  COL5113,                                                +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0314,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1214,                                                +        
               LTH=4                                                            
         MFLD  COL1714,                                                +        
               LTH=4                                                            
         MFLD  COL2414,                                                +        
               LTH=6                                                            
         MFLD  COL3114,                                                +        
               LTH=6                                                            
         MFLD  COL3914,                                                +        
               LTH=2                                                            
         MFLD  COL4414,                                                +        
               LTH=1                                                            
         MFLD  COL4714,                                                +        
               LTH=2                                                            
         MFLD  COL5114,                                                +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0315,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1215,                                                +        
               LTH=4                                                            
         MFLD  COL1715,                                                +        
               LTH=4                                                            
         MFLD  COL2415,                                                +        
               LTH=6                                                            
         MFLD  COL3115,                                                +        
               LTH=6                                                            
         MFLD  COL3915,                                                +        
               LTH=2                                                            
         MFLD  COL4415,                                                +        
               LTH=1                                                            
         MFLD  COL4715,                                                +        
               LTH=2                                                            
         MFLD  COL5115,                                                +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0316,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1216,                                                +        
               LTH=4                                                            
         MFLD  COL1716,                                                +        
               LTH=4                                                            
         MFLD  COL2416,                                                +        
               LTH=6                                                            
         MFLD  COL3116,                                                +        
               LTH=6                                                            
         MFLD  COL3916,                                                +        
               LTH=2                                                            
         MFLD  COL4416,                                                +        
               LTH=1                                                            
         MFLD  COL4716,                                                +        
               LTH=2                                                            
         MFLD  COL5116,                                                +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0317,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1217,                                                +        
               LTH=4                                                            
         MFLD  COL1717,                                                +        
               LTH=4                                                            
         MFLD  COL2417,                                                +        
               LTH=6                                                            
         MFLD  COL3117,                                                +        
               LTH=6                                                            
         MFLD  COL3917,                                                +        
               LTH=2                                                            
         MFLD  COL4417,                                                +        
               LTH=1                                                            
         MFLD  COL4717,                                                +        
               LTH=2                                                            
         MFLD  COL5117,                                                +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0318,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1218,                                                +        
               LTH=4                                                            
         MFLD  COL1718,                                                +        
               LTH=4                                                            
         MFLD  COL2418,                                                +        
               LTH=6                                                            
         MFLD  COL3118,                                                +        
               LTH=6                                                            
         MFLD  COL3918,                                                +        
               LTH=2                                                            
         MFLD  COL4418,                                                +        
               LTH=1                                                            
         MFLD  COL4718,                                                +        
               LTH=2                                                            
         MFLD  COL5118,                                                +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1912,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1917,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1924,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1931,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1939,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1944,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1947,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1951,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I661N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N661),                                           +        
               OPT=2,                                                  +        
               NXT=W4O661N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '46612',                                                +        
               LTH=5                                                            
         MFLD  (FLD0212,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0312,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0227,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLD0327,                                                +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0241,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0341,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (DCI,                                                   +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  DCO,                                                    +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLD0402,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0409,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0418,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0423,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0435,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0442,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0451,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0456,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0518,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0578,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL0307,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL1207,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1707,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2407,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL3107,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL3907,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4407,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4707,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL5107,                                               +        
               '++++++++++++++++++++'),                                +        
               LTH=20,                                                 +        
               FILL=X'40'                                                       
         MFLD  (COL0308,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL1208,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1708,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2408,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL3108,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL3908,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4408,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4708,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL5108,                                               +        
               '++++++++++++++++++++'),                                +        
               LTH=20,                                                 +        
               FILL=X'40'                                                       
         MFLD  (COL0309,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL1209,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1709,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2409,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL3109,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL3909,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4409,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4709,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL5109,                                               +        
               '++++++++++++++++++++'),                                +        
               LTH=20,                                                 +        
               FILL=X'40'                                                       
         MFLD  (COL0310,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL1210,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1710,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2410,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL3110,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL3910,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4410,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4710,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL5110,                                               +        
               '++++++++++++++++++++'),                                +        
               LTH=20,                                                 +        
               FILL=X'40'                                                       
         MFLD  (COL0311,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL1211,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1711,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2411,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL3111,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL3911,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4411,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4711,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL5111,                                               +        
               '++++++++++++++++++++'),                                +        
               LTH=20,                                                 +        
               FILL=X'40'                                                       
         MFLD  (COL0312,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL1212,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1712,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2412,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL3112,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL3912,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4412,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4712,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL5112,                                               +        
               '++++++++++++++++++++'),                                +        
               LTH=20,                                                 +        
               FILL=X'40'                                                       
         MFLD  (COL0313,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL1213,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1713,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2413,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL3113,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL3913,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4413,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4713,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL5113,                                               +        
               '++++++++++++++++++++'),                                +        
               LTH=20,                                                 +        
               FILL=X'40'                                                       
         MFLD  (COL0314,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL1214,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1714,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2414,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL3114,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL3914,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4414,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4714,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL5114,                                               +        
               '++++++++++++++++++++'),                                +        
               LTH=20,                                                 +        
               FILL=X'40'                                                       
         MFLD  (COL0315,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL1215,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1715,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2415,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL3115,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL3915,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4415,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4715,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL5115,                                               +        
               '++++++++++++++++++++'),                                +        
               LTH=20,                                                 +        
               FILL=X'40'                                                       
         MFLD  (COL0316,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL1216,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1716,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2416,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL3116,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL3916,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4416,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4716,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL5116,                                               +        
               '++++++++++++++++++++'),                                +        
               LTH=20,                                                 +        
               FILL=X'40'                                                       
         MFLD  (COL0317,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL1217,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1717,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2417,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL3117,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL3917,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4417,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4717,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL5117,                                               +        
               '++++++++++++++++++++'),                                +        
               LTH=20,                                                 +        
               FILL=X'40'                                                       
         MFLD  (COL0318,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL1218,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL1718,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL2418,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL3118,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL3918,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4418,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL4718,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL5118,                                               +        
               '++++++++++++++++++++'),                                +        
               LTH=20,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLD1912,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1917,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1924,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1931,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1939,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1944,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1947,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1951,                                               +        
               '++++++++++++++++++++'),                                +        
               LTH=20,                                                 +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
