***********************************************************************         
* CREATED BY V0C2425   ON 02/09/18  AT 17:43                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'Shipping Info Bill-it Markets   '                               
W4N621   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W4T621 3',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T621 7',                                           +        
               8='W4T621 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4N621   DPAGE FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(PROT)                                                      
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(PROT)                                                      
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(PROT)                                                      
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Shipping Info Bill-it Market',                         +        
               POS=(1,10),LTH=28,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
IDSHIPIN DFLD  POS=(2,10),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Idshipm',                                              +        
               POS=(3,2),LTH=7,                                        +        
               ATTR=(PROT)                                                      
IDSHIPUT DFLD  POS=(3,10),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Dist',                                                 +        
               POS=(5,4),LTH=4,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Customer',                                             +        
               POS=(5,14),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Order',                                                +        
               POS=(5,28),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Case',                                                 +        
               POS=(5,40),LTH=4,                                       +        
               ATTR=(PROT)                                                      
IDDIST01 DFLD  POS=(6,4),LTH=4,                                        +        
               ATTR=(PROT)                                                      
IDKUND01 DFLD  POS=(6,16),LTH=6,                                       +        
               ATTR=(PROT)                                                      
ORDNR501 DFLD  POS=(6,28),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KOLLI01  DFLD  POS=(6,39),LTH=5,                                       +        
               ATTR=(PROT)                                                      
IDDIST02 DFLD  POS=(7,4),LTH=4,                                        +        
               ATTR=(PROT)                                                      
IDKUND02 DFLD  POS=(7,16),LTH=6,                                       +        
               ATTR=(PROT)                                                      
ORDNR502 DFLD  POS=(7,28),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KOLLI02  DFLD  POS=(7,39),LTH=5,                                       +        
               ATTR=(PROT)                                                      
IDDIST03 DFLD  POS=(8,4),LTH=4,                                        +        
               ATTR=(PROT)                                                      
IDKUND03 DFLD  POS=(8,16),LTH=6,                                       +        
               ATTR=(PROT)                                                      
ORDNR503 DFLD  POS=(8,28),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KOLLI03  DFLD  POS=(8,39),LTH=5,                                       +        
               ATTR=(PROT)                                                      
IDDIST04 DFLD  POS=(9,4),LTH=4,                                        +        
               ATTR=(PROT)                                                      
IDKUND04 DFLD  POS=(9,16),LTH=6,                                       +        
               ATTR=(PROT)                                                      
ORDNR504 DFLD  POS=(9,28),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KOLLI04  DFLD  POS=(9,39),LTH=5,                                       +        
               ATTR=(PROT)                                                      
IDDIST05 DFLD  POS=(10,4),LTH=4,                                       +        
               ATTR=(PROT)                                                      
IDKUND05 DFLD  POS=(10,16),LTH=6,                                      +        
               ATTR=(PROT)                                                      
ORDNR505 DFLD  POS=(10,28),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KOLLI05  DFLD  POS=(10,39),LTH=5,                                      +        
               ATTR=(PROT)                                                      
IDDIST06 DFLD  POS=(11,4),LTH=4,                                       +        
               ATTR=(PROT)                                                      
IDKUND06 DFLD  POS=(11,16),LTH=6,                                      +        
               ATTR=(PROT)                                                      
ORDNR506 DFLD  POS=(11,28),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KOLLI06  DFLD  POS=(11,39),LTH=5,                                      +        
               ATTR=(PROT)                                                      
IDDIST07 DFLD  POS=(12,4),LTH=4,                                       +        
               ATTR=(PROT)                                                      
IDKUND07 DFLD  POS=(12,16),LTH=6,                                      +        
               ATTR=(PROT)                                                      
ORDNR507 DFLD  POS=(12,28),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KOLLI07  DFLD  POS=(12,39),LTH=5,                                      +        
               ATTR=(PROT)                                                      
IDDIST08 DFLD  POS=(13,4),LTH=4,                                       +        
               ATTR=(PROT)                                                      
IDKUND08 DFLD  POS=(13,16),LTH=6,                                      +        
               ATTR=(PROT)                                                      
ORDNR508 DFLD  POS=(13,28),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KOLLI08  DFLD  POS=(13,39),LTH=5,                                      +        
               ATTR=(PROT)                                                      
IDDIST09 DFLD  POS=(14,4),LTH=4,                                       +        
               ATTR=(PROT)                                                      
IDKUND09 DFLD  POS=(14,16),LTH=6,                                      +        
               ATTR=(PROT)                                                      
ORDNR509 DFLD  POS=(14,28),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KOLLI09  DFLD  POS=(14,39),LTH=5,                                      +        
               ATTR=(PROT)                                                      
IDDIST10 DFLD  POS=(15,4),LTH=4,                                       +        
               ATTR=(PROT)                                                      
IDKUND10 DFLD  POS=(15,16),LTH=6,                                      +        
               ATTR=(PROT)                                                      
ORDNR510 DFLD  POS=(15,28),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KOLLI10  DFLD  POS=(15,39),LTH=5,                                      +        
               ATTR=(PROT)                                                      
IDDIST11 DFLD  POS=(16,4),LTH=4,                                       +        
               ATTR=(PROT)                                                      
IDKUND11 DFLD  POS=(16,16),LTH=6,                                      +        
               ATTR=(PROT)                                                      
ORDNR511 DFLD  POS=(16,28),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KOLLI11  DFLD  POS=(16,39),LTH=5,                                      +        
               ATTR=(PROT)                                                      
IDDIST12 DFLD  POS=(17,4),LTH=4,                                       +        
               ATTR=(PROT)                                                      
IDKUND12 DFLD  POS=(17,16),LTH=6,                                      +        
               ATTR=(PROT)                                                      
ORDNR512 DFLD  POS=(17,28),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KOLLI12  DFLD  POS=(17,39),LTH=5,                                      +        
               ATTR=(PROT)                                                      
IDDIST13 DFLD  POS=(18,4),LTH=4,                                       +        
               ATTR=(PROT)                                                      
IDKUND13 DFLD  POS=(18,16),LTH=6,                                      +        
               ATTR=(PROT)                                                      
ORDNR513 DFLD  POS=(18,28),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KOLLI13  DFLD  POS=(18,39),LTH=5,                                      +        
               ATTR=(PROT)                                                      
IDDIST14 DFLD  POS=(19,4),LTH=4,                                       +        
               ATTR=(PROT)                                                      
IDKUND14 DFLD  POS=(19,16),LTH=6,                                      +        
               ATTR=(PROT)                                                      
ORDNR514 DFLD  POS=(19,28),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KOLLI14  DFLD  POS=(19,39),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'F3=Jump to 4622    F7=First',                          +        
               POS=(21,2),LTH=27,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'F8=Next',                                              +        
               POS=(21,35),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O621N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N621,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I621N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4N621                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  IDSHIPIN,                                               +        
               LTH=7                                                            
         MFLD  IDSHIPUT,                                               +        
               LTH=7                                                            
         MFLD  IDDIST01,                                               +        
               LTH=4                                                            
         MFLD  IDKUND01,                                               +        
               LTH=6                                                            
         MFLD  ORDNR501,                                               +        
               LTH=5                                                            
         MFLD  KOLLI01,                                                +        
               LTH=5                                                            
         MFLD  IDDIST02,                                               +        
               LTH=4                                                            
         MFLD  IDKUND02,                                               +        
               LTH=6                                                            
         MFLD  ORDNR502,                                               +        
               LTH=5                                                            
         MFLD  KOLLI02,                                                +        
               LTH=5                                                            
         MFLD  IDDIST03,                                               +        
               LTH=4                                                            
         MFLD  IDKUND03,                                               +        
               LTH=6                                                            
         MFLD  ORDNR503,                                               +        
               LTH=5                                                            
         MFLD  KOLLI03,                                                +        
               LTH=5                                                            
         MFLD  IDDIST04,                                               +        
               LTH=4                                                            
         MFLD  IDKUND04,                                               +        
               LTH=6                                                            
         MFLD  ORDNR504,                                               +        
               LTH=5                                                            
         MFLD  KOLLI04,                                                +        
               LTH=5                                                            
         MFLD  IDDIST05,                                               +        
               LTH=4                                                            
         MFLD  IDKUND05,                                               +        
               LTH=6                                                            
         MFLD  ORDNR505,                                               +        
               LTH=5                                                            
         MFLD  KOLLI05,                                                +        
               LTH=5                                                            
         MFLD  IDDIST06,                                               +        
               LTH=4                                                            
         MFLD  IDKUND06,                                               +        
               LTH=6                                                            
         MFLD  ORDNR506,                                               +        
               LTH=5                                                            
         MFLD  KOLLI06,                                                +        
               LTH=5                                                            
         MFLD  IDDIST07,                                               +        
               LTH=4                                                            
         MFLD  IDKUND07,                                               +        
               LTH=6                                                            
         MFLD  ORDNR507,                                               +        
               LTH=5                                                            
         MFLD  KOLLI07,                                                +        
               LTH=5                                                            
         MFLD  IDDIST08,                                               +        
               LTH=4                                                            
         MFLD  IDKUND08,                                               +        
               LTH=6                                                            
         MFLD  ORDNR508,                                               +        
               LTH=5                                                            
         MFLD  KOLLI08,                                                +        
               LTH=5                                                            
         MFLD  IDDIST09,                                               +        
               LTH=4                                                            
         MFLD  IDKUND09,                                               +        
               LTH=6                                                            
         MFLD  ORDNR509,                                               +        
               LTH=5                                                            
         MFLD  KOLLI09,                                                +        
               LTH=5                                                            
         MFLD  IDDIST10,                                               +        
               LTH=4                                                            
         MFLD  IDKUND10,                                               +        
               LTH=6                                                            
         MFLD  ORDNR510,                                               +        
               LTH=5                                                            
         MFLD  KOLLI10,                                                +        
               LTH=5                                                            
         MFLD  IDDIST11,                                               +        
               LTH=4                                                            
         MFLD  IDKUND11,                                               +        
               LTH=6                                                            
         MFLD  ORDNR511,                                               +        
               LTH=5                                                            
         MFLD  KOLLI11,                                                +        
               LTH=5                                                            
         MFLD  IDDIST12,                                               +        
               LTH=4                                                            
         MFLD  IDKUND12,                                               +        
               LTH=6                                                            
         MFLD  ORDNR512,                                               +        
               LTH=5                                                            
         MFLD  KOLLI12,                                                +        
               LTH=5                                                            
         MFLD  IDDIST13,                                               +        
               LTH=4                                                            
         MFLD  IDKUND13,                                               +        
               LTH=6                                                            
         MFLD  ORDNR513,                                               +        
               LTH=5                                                            
         MFLD  KOLLI13,                                                +        
               LTH=5                                                            
         MFLD  IDDIST14,                                               +        
               LTH=4                                                            
         MFLD  IDKUND14,                                               +        
               LTH=6                                                            
         MFLD  ORDNR514,                                               +        
               LTH=5                                                            
         MFLD  KOLLI14,                                                +        
               LTH=5                                                            
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I621N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N621),                                           +        
               OPT=2,                                                  +        
               NXT=W4O621N1                                                     
MID      LPAGE SOR=(W4N621)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '46212',                                                +        
               LTH=5                                                            
         MFLD  (IDSHIPIN,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
