***********************************************************************         
* CREATED BY V0C2425   ON 02/06/28  AT 17:05                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'SHIPMENT PER DISTRITC           '                               
W4N624   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T624 7',                                           +        
               8='W4T624 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4N624   DPAGE CURSOR=((2,8)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Booking Information',                                  +        
               POS=(1,11),LTH=19,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Distr',                                                +        
               POS=(2,2),LTH=5,                                        +        
               ATTR=(NUM,PROT)                                                  
IDDISTIN DFLD  POS=(2,8),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Cust',                                                 +        
               POS=(2,15),LTH=4,                                       +        
               ATTR=(PROT)                                                      
IDKUNDIN DFLD  POS=(2,20),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Shipm No',                                             +        
               POS=(2,29),LTH=8,                                       +        
               ATTR=(PROT)                                                      
IDSHIPIN DFLD  POS=(2,38),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Transport',                                            +        
               POS=(2,48),LTH=9,                                       +        
               ATTR=(PROT)                                                      
IDTRPTIN DFLD  POS=(2,58),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,64),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDDCIN   DFLD  POS=(2,67),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
IDDISTUT DFLD  POS=(3,8),LTH=4,                                        +        
               ATTR=(PROT)                                                      
IDKUNDUT DFLD  POS=(3,20),LTH=6,                                       +        
               ATTR=(PROT)                                                      
IDSHIPUT DFLD  POS=(3,38),LTH=7,                                       +        
               ATTR=(PROT)                                                      
IDTRPTUT DFLD  POS=(3,58),LTH=3,                                       +        
               ATTR=(PROT)                                                      
IDDCUT   DFLD  POS=(3,67),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'TotNo Cse',                                            +        
               POS=(5,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
TOTNOCSE DFLD  POS=(5,12),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'GrWt',                                                 +        
               POS=(5,18),LTH=4,                                       +        
               ATTR=(PROT)                                                      
SUMVKBTO DFLD  POS=(5,23),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'GrVol',                                                +        
               POS=(5,32),LTH=5,                                       +        
               ATTR=(PROT)                                                      
SUMVLBTO DFLD  POS=(5,38),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Value',                                                +        
               POS=(5,47),LTH=5,                                       +        
               ATTR=(PROT)                                                      
SUMSUORD DFLD  POS=(5,53),LTH=12,                                      +        
               ATTR=(PROT)                                                      
SUASTERX DFLD  POS=(5,66),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'NtWt',                                                 +        
               POS=(5,68),LTH=4,                                       +        
               ATTR=(PROT)                                                      
SUMVKNTO DFLD  POS=(5,73),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Cust   Order   Cse Customs-Id',                        +        
               POS=(6,2),LTH=29,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'L   W   H',                                            +        
               POS=(7,27),LTH=9,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'GrWt    GrVol',                                        +        
               POS=(7,41),LTH=13,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Value',                                                +        
               POS=(7,62),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'NetWt HZ',                                             +        
               POS=(7,73),LTH=8,                                       +        
               ATTR=(PROT)                                                      
IDKUND01 DFLD  POS=(8,2),LTH=6,                                        +        
               ATTR=(PROT)                                                      
ORDNR501 DFLD  POS=(8,9),LTH=5,                                        +        
               ATTR=(PROT)                                                      
KOLLI01  DFLD  POS=(8,15),LTH=5,                                       +        
               ATTR=(PROT)                                                      
IDTULL01 DFLD  POS=(8,21),LTH=10,                                      +        
               ATTR=(PROT)                                                      
KOLLIL01 DFLD  POS=(9,24),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KOLLIB01 DFLD  POS=(9,29),LTH=3,                                       +        
               ATTR=(PROT)                                                      
KOLLIH01 DFLD  POS=(9,33),LTH=3,                                       +        
               ATTR=(PROT)                                                      
VKBTO01  DFLD  POS=(9,37),LTH=8,                                       +        
               ATTR=(PROT)                                                      
VLBTO01  DFLD  POS=(9,46),LTH=8,                                       +        
               ATTR=(PROT)                                                      
SUORDV01 DFLD  POS=(9,55),LTH=12,                                      +        
               ATTR=(PROT)                                                      
TEASTX01 DFLD  POS=(9,68),LTH=1,                                       +        
               ATTR=(PROT)                                                      
VKNTO01  DFLD  POS=(9,70),LTH=8,                                       +        
               ATTR=(PROT)                                                      
HZ01     DFLD  POS=(9,79),LTH=1,                                       +        
               ATTR=(PROT)                                                      
IDKUND02 DFLD  POS=(10,2),LTH=6,                                       +        
               ATTR=(PROT)                                                      
ORDNR502 DFLD  POS=(10,9),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KOLLI02  DFLD  POS=(10,15),LTH=5,                                      +        
               ATTR=(PROT)                                                      
IDTULL02 DFLD  POS=(10,21),LTH=10,                                     +        
               ATTR=(PROT)                                                      
KOLLIL02 DFLD  POS=(11,24),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KOLLIB02 DFLD  POS=(11,29),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KOLLIH02 DFLD  POS=(11,33),LTH=3,                                      +        
               ATTR=(PROT)                                                      
VKBTO02  DFLD  POS=(11,37),LTH=8,                                      +        
               ATTR=(PROT)                                                      
VLBTO02  DFLD  POS=(11,46),LTH=8,                                      +        
               ATTR=(PROT)                                                      
SUORDV02 DFLD  POS=(11,55),LTH=12,                                     +        
               ATTR=(PROT)                                                      
TEASTX02 DFLD  POS=(11,68),LTH=1,                                      +        
               ATTR=(PROT)                                                      
VKNTO02  DFLD  POS=(11,70),LTH=8,                                      +        
               ATTR=(PROT)                                                      
HZ02     DFLD  POS=(11,79),LTH=1,                                      +        
               ATTR=(PROT)                                                      
IDKUND03 DFLD  POS=(12,2),LTH=6,                                       +        
               ATTR=(PROT)                                                      
ORDNR503 DFLD  POS=(12,9),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KOLLI03  DFLD  POS=(12,15),LTH=5,                                      +        
               ATTR=(PROT)                                                      
IDTULL03 DFLD  POS=(12,21),LTH=10,                                     +        
               ATTR=(PROT)                                                      
KOLLIL03 DFLD  POS=(13,24),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KOLLIB03 DFLD  POS=(13,29),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KOLLIH03 DFLD  POS=(13,33),LTH=3,                                      +        
               ATTR=(PROT)                                                      
VKBTO03  DFLD  POS=(13,37),LTH=8,                                      +        
               ATTR=(PROT)                                                      
VLBTO03  DFLD  POS=(13,46),LTH=8,                                      +        
               ATTR=(PROT)                                                      
SUORDV03 DFLD  POS=(13,55),LTH=12,                                     +        
               ATTR=(PROT)                                                      
TEASTX03 DFLD  POS=(13,68),LTH=1,                                      +        
               ATTR=(PROT)                                                      
VKNTO03  DFLD  POS=(13,70),LTH=8,                                      +        
               ATTR=(PROT)                                                      
HZ03     DFLD  POS=(13,79),LTH=1,                                      +        
               ATTR=(PROT)                                                      
IDKUND04 DFLD  POS=(14,2),LTH=6,                                       +        
               ATTR=(PROT)                                                      
ORDNR504 DFLD  POS=(14,9),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KOLLI04  DFLD  POS=(14,15),LTH=5,                                      +        
               ATTR=(PROT)                                                      
IDTULL04 DFLD  POS=(14,21),LTH=10,                                     +        
               ATTR=(PROT)                                                      
KOLLIL04 DFLD  POS=(15,24),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KOLLIB04 DFLD  POS=(15,29),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KOLLIH04 DFLD  POS=(15,33),LTH=3,                                      +        
               ATTR=(PROT)                                                      
VKBTO04  DFLD  POS=(15,37),LTH=8,                                      +        
               ATTR=(PROT)                                                      
VLBTO04  DFLD  POS=(15,46),LTH=8,                                      +        
               ATTR=(PROT)                                                      
SUORDV04 DFLD  POS=(15,55),LTH=12,                                     +        
               ATTR=(PROT)                                                      
TEASTX04 DFLD  POS=(15,68),LTH=1,                                      +        
               ATTR=(PROT)                                                      
VKNTO04  DFLD  POS=(15,70),LTH=8,                                      +        
               ATTR=(PROT)                                                      
HZ04     DFLD  POS=(15,79),LTH=1,                                      +        
               ATTR=(PROT)                                                      
IDKUND05 DFLD  POS=(16,2),LTH=6,                                       +        
               ATTR=(PROT)                                                      
ORDNR505 DFLD  POS=(16,9),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KOLLI05  DFLD  POS=(16,15),LTH=5,                                      +        
               ATTR=(PROT)                                                      
IDTULL05 DFLD  POS=(16,21),LTH=10,                                     +        
               ATTR=(PROT)                                                      
KOLLIL05 DFLD  POS=(17,24),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KOLLIB05 DFLD  POS=(17,29),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KOLLIH05 DFLD  POS=(17,33),LTH=3,                                      +        
               ATTR=(PROT)                                                      
VKBTO05  DFLD  POS=(17,37),LTH=8,                                      +        
               ATTR=(PROT)                                                      
VLBTO05  DFLD  POS=(17,46),LTH=8,                                      +        
               ATTR=(PROT)                                                      
SUORDV05 DFLD  POS=(17,55),LTH=12,                                     +        
               ATTR=(PROT)                                                      
TEASTX05 DFLD  POS=(17,68),LTH=1,                                      +        
               ATTR=(PROT)                                                      
VKNTO05  DFLD  POS=(17,70),LTH=8,                                      +        
               ATTR=(PROT)                                                      
HZ05     DFLD  POS=(17,79),LTH=1,                                      +        
               ATTR=(PROT)                                                      
IDKUND06 DFLD  POS=(18,2),LTH=6,                                       +        
               ATTR=(PROT)                                                      
ORDNR506 DFLD  POS=(18,9),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KOLLI06  DFLD  POS=(18,15),LTH=5,                                      +        
               ATTR=(PROT)                                                      
IDTULL06 DFLD  POS=(18,21),LTH=10,                                     +        
               ATTR=(PROT)                                                      
KOLLIL06 DFLD  POS=(19,24),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KOLLIB06 DFLD  POS=(19,29),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KOLLIH06 DFLD  POS=(19,33),LTH=3,                                      +        
               ATTR=(PROT)                                                      
VKBTO06  DFLD  POS=(19,37),LTH=8,                                      +        
               ATTR=(PROT)                                                      
VLBTO06  DFLD  POS=(19,46),LTH=8,                                      +        
               ATTR=(PROT)                                                      
SUORDV06 DFLD  POS=(19,55),LTH=12,                                     +        
               ATTR=(PROT)                                                      
TEASTX06 DFLD  POS=(19,68),LTH=1,                                      +        
               ATTR=(PROT)                                                      
VKNTO06  DFLD  POS=(19,70),LTH=8,                                      +        
               ATTR=(PROT)                                                      
HZ06     DFLD  POS=(19,79),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'F7=First',                                             +        
               POS=(21,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'F8=Next',                                              +        
               POS=(21,18),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'F10=Whelp',                                            +        
               POS=(21,34),LTH=9,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4I624N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N624),                                           +        
               OPT=2,                                                  +        
               NXT=W4O624N1                                                     
MID      LPAGE SOR=(W4N624)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '46242',                                                +        
               LTH=5                                                            
         MFLD  (IDDISTIN,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDKUNDIN,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDSHIPIN,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDTRPTIN,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
W4O624N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N624,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I624N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4N624                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  IDDISTIN,                                               +        
               LTH=4                                                            
         MFLD  IDDISTUT,                                               +        
               LTH=4                                                            
         MFLD  IDKUNDIN,                                               +        
               LTH=6                                                            
         MFLD  IDKUNDUT,                                               +        
               LTH=6                                                            
         MFLD  IDSHIPIN,                                               +        
               LTH=7                                                            
         MFLD  IDSHIPUT,                                               +        
               LTH=7                                                            
         MFLD  IDTRPTIN,                                               +        
               LTH=3                                                            
         MFLD  IDTRPTUT,                                               +        
               LTH=3                                                            
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  TOTNOCSE,                                               +        
               LTH=5                                                            
         MFLD  SUMVKBTO,                                               +        
               LTH=8                                                            
         MFLD  SUMVLBTO,                                               +        
               LTH=8                                                            
         MFLD  SUMSUORD,                                               +        
               LTH=12                                                           
         MFLD  SUASTERX,                                               +        
               LTH=1                                                            
         MFLD  SUMVKNTO,                                               +        
               LTH=8                                                            
         MFLD  IDKUND01,                                               +        
               LTH=6                                                            
         MFLD  ORDNR501,                                               +        
               LTH=5                                                            
         MFLD  KOLLI01,                                                +        
               LTH=5                                                            
         MFLD  IDTULL01,                                               +        
               LTH=10                                                           
         MFLD  KOLLIL01,                                               +        
               LTH=4                                                            
         MFLD  KOLLIB01,                                               +        
               LTH=3                                                            
         MFLD  KOLLIH01,                                               +        
               LTH=3                                                            
         MFLD  VKBTO01,                                                +        
               LTH=8                                                            
         MFLD  VLBTO01,                                                +        
               LTH=8                                                            
         MFLD  SUORDV01,                                               +        
               LTH=12                                                           
         MFLD  TEASTX01,                                               +        
               LTH=1                                                            
         MFLD  VKNTO01,                                                +        
               LTH=8                                                            
         MFLD  HZ01,                                                   +        
               LTH=1                                                            
         MFLD  IDKUND02,                                               +        
               LTH=6                                                            
         MFLD  ORDNR502,                                               +        
               LTH=5                                                            
         MFLD  KOLLI02,                                                +        
               LTH=5                                                            
         MFLD  IDTULL02,                                               +        
               LTH=10                                                           
         MFLD  KOLLIL02,                                               +        
               LTH=4                                                            
         MFLD  KOLLIB02,                                               +        
               LTH=3                                                            
         MFLD  KOLLIH02,                                               +        
               LTH=3                                                            
         MFLD  VKBTO02,                                                +        
               LTH=8                                                            
         MFLD  VLBTO02,                                                +        
               LTH=8                                                            
         MFLD  SUORDV02,                                               +        
               LTH=12                                                           
         MFLD  TEASTX02,                                               +        
               LTH=1                                                            
         MFLD  VKNTO02,                                                +        
               LTH=8                                                            
         MFLD  HZ02,                                                   +        
               LTH=1                                                            
         MFLD  IDKUND03,                                               +        
               LTH=6                                                            
         MFLD  ORDNR503,                                               +        
               LTH=5                                                            
         MFLD  KOLLI03,                                                +        
               LTH=5                                                            
         MFLD  IDTULL03,                                               +        
               LTH=10                                                           
         MFLD  KOLLIL03,                                               +        
               LTH=4                                                            
         MFLD  KOLLIB03,                                               +        
               LTH=3                                                            
         MFLD  KOLLIH03,                                               +        
               LTH=3                                                            
         MFLD  VKBTO03,                                                +        
               LTH=8                                                            
         MFLD  VLBTO03,                                                +        
               LTH=8                                                            
         MFLD  SUORDV03,                                               +        
               LTH=12                                                           
         MFLD  TEASTX03,                                               +        
               LTH=1                                                            
         MFLD  VKNTO03,                                                +        
               LTH=8                                                            
         MFLD  HZ03,                                                   +        
               LTH=1                                                            
         MFLD  IDKUND04,                                               +        
               LTH=6                                                            
         MFLD  ORDNR504,                                               +        
               LTH=5                                                            
         MFLD  KOLLI04,                                                +        
               LTH=5                                                            
         MFLD  IDTULL04,                                               +        
               LTH=10                                                           
         MFLD  KOLLIL04,                                               +        
               LTH=4                                                            
         MFLD  KOLLIB04,                                               +        
               LTH=3                                                            
         MFLD  KOLLIH04,                                               +        
               LTH=3                                                            
         MFLD  VKBTO04,                                                +        
               LTH=8                                                            
         MFLD  VLBTO04,                                                +        
               LTH=8                                                            
         MFLD  SUORDV04,                                               +        
               LTH=12                                                           
         MFLD  TEASTX04,                                               +        
               LTH=1                                                            
         MFLD  VKNTO04,                                                +        
               LTH=8                                                            
         MFLD  HZ04,                                                   +        
               LTH=1                                                            
         MFLD  IDKUND05,                                               +        
               LTH=6                                                            
         MFLD  ORDNR505,                                               +        
               LTH=5                                                            
         MFLD  KOLLI05,                                                +        
               LTH=5                                                            
         MFLD  IDTULL05,                                               +        
               LTH=10                                                           
         MFLD  KOLLIL05,                                               +        
               LTH=4                                                            
         MFLD  KOLLIB05,                                               +        
               LTH=3                                                            
         MFLD  KOLLIH05,                                               +        
               LTH=3                                                            
         MFLD  VKBTO05,                                                +        
               LTH=8                                                            
         MFLD  VLBTO05,                                                +        
               LTH=8                                                            
         MFLD  SUORDV05,                                               +        
               LTH=12                                                           
         MFLD  TEASTX05,                                               +        
               LTH=1                                                            
         MFLD  VKNTO05,                                                +        
               LTH=8                                                            
         MFLD  HZ05,                                                   +        
               LTH=1                                                            
         MFLD  IDKUND06,                                               +        
               LTH=6                                                            
         MFLD  ORDNR506,                                               +        
               LTH=5                                                            
         MFLD  KOLLI06,                                                +        
               LTH=5                                                            
         MFLD  IDTULL06,                                               +        
               LTH=10                                                           
         MFLD  KOLLIL06,                                               +        
               LTH=4                                                            
         MFLD  KOLLIB06,                                               +        
               LTH=3                                                            
         MFLD  KOLLIH06,                                               +        
               LTH=3                                                            
         MFLD  VKBTO06,                                                +        
               LTH=8                                                            
         MFLD  VLBTO06,                                                +        
               LTH=8                                                            
         MFLD  SUORDV06,                                               +        
               LTH=12                                                           
         MFLD  TEASTX06,                                               +        
               LTH=1                                                            
         MFLD  VKNTO06,                                                +        
               LTH=8                                                            
         MFLD  HZ06,                                                   +        
               LTH=1                                                            
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
