***********************************************************************         
* CREATED BY PCC6483   ON 97/03/24  AT 12:33                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'ORDERPLANNING PER PRC           '                               
W4N654   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W4T653  ',                                           +        
               4='W4T654  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T654 7',                                           +        
               8='W4T654 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W4T653  ',                                          +        
               16='W4T654  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,5)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'ORDER PLANNING PER PRC',                               +        
               POS=(1,11),LTH=22,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'DC',                                                   +        
               POS=(2,2),LTH=2,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDDCIN   DFLD  POS=(2,5),LTH=2,                                        +        
               ATTR=(NOPROT)                                                    
         DFLD  'RFS',                                                  +        
               POS=(2,9),LTH=3,                                        +        
               ATTR=(PROT)                                                      
TIRFSIN  DFLD  POS=(2,13),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'PRC from',                                             +        
               POS=(2,21),LTH=8,                                       +        
               ATTR=(PROT)                                                      
IDPRCFIN DFLD  POS=(2,30),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'to',                                                   +        
               POS=(2,36),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDPRCTIN DFLD  POS=(2,39),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
IDDCUT   DFLD  POS=(3,5),LTH=2,                                        +        
               ATTR=(PROT,MOD)                                                  
TIRFSUT  DFLD  POS=(3,13),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
IDPRCFUT DFLD  POS=(3,30),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
IDPRCTUT DFLD  POS=(3,39),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'PRC    Ordq. lines  Printed   %  Packed    %',         +        
               POS=(5,2),LTH=44,                                       +        
               ATTR=(PROT)                                                      
IDPRC1   DFLD  POS=(6,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
KVRAD1   DFLD  POS=(6,11),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KVPR1    DFLD  POS=(6,23),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KVPRPR1  DFLD  POS=(6,30),LTH=3,                                       +        
               ATTR=(PROT)                                                      
KVPA1    DFLD  POS=(6,36),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KVPAPR1  DFLD  POS=(6,43),LTH=3,                                       +        
               ATTR=(PROT)                                                      
IDPRC2   DFLD  POS=(7,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
KVRAD2   DFLD  POS=(7,11),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KVPR2    DFLD  POS=(7,23),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KVPRPR2  DFLD  POS=(7,30),LTH=3,                                       +        
               ATTR=(PROT)                                                      
KVPA2    DFLD  POS=(7,36),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KVPAPR2  DFLD  POS=(7,43),LTH=3,                                       +        
               ATTR=(PROT)                                                      
IDPRC3   DFLD  POS=(8,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
KVRAD3   DFLD  POS=(8,11),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KVPR3    DFLD  POS=(8,23),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KVPRPR3  DFLD  POS=(8,30),LTH=3,                                       +        
               ATTR=(PROT)                                                      
KVPA3    DFLD  POS=(8,36),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KVPAPR3  DFLD  POS=(8,43),LTH=3,                                       +        
               ATTR=(PROT)                                                      
IDPRC4   DFLD  POS=(9,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
KVRAD4   DFLD  POS=(9,11),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KVPR4    DFLD  POS=(9,23),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KVPRPR4  DFLD  POS=(9,30),LTH=3,                                       +        
               ATTR=(PROT)                                                      
KVPA4    DFLD  POS=(9,36),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KVPAPR4  DFLD  POS=(9,43),LTH=3,                                       +        
               ATTR=(PROT)                                                      
IDPRC5   DFLD  POS=(10,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KVRAD5   DFLD  POS=(10,11),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVPR5    DFLD  POS=(10,23),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVPRPR5  DFLD  POS=(10,30),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KVPA5    DFLD  POS=(10,36),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVPAPR5  DFLD  POS=(10,43),LTH=3,                                      +        
               ATTR=(PROT)                                                      
IDPRC6   DFLD  POS=(11,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KVRAD6   DFLD  POS=(11,11),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVPR6    DFLD  POS=(11,23),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVPRPR6  DFLD  POS=(11,30),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KVPA6    DFLD  POS=(11,36),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVPAPR6  DFLD  POS=(11,43),LTH=3,                                      +        
               ATTR=(PROT)                                                      
IDPRC7   DFLD  POS=(12,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KVRAD7   DFLD  POS=(12,11),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVPR7    DFLD  POS=(12,23),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVPRPR7  DFLD  POS=(12,30),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KVPA7    DFLD  POS=(12,36),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVPAPR7  DFLD  POS=(12,43),LTH=3,                                      +        
               ATTR=(PROT)                                                      
IDPRC8   DFLD  POS=(13,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KVRAD8   DFLD  POS=(13,11),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVPR8    DFLD  POS=(13,23),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVPRPR8  DFLD  POS=(13,30),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KVPA8    DFLD  POS=(13,36),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVPAPR8  DFLD  POS=(13,43),LTH=3,                                      +        
               ATTR=(PROT)                                                      
IDPRC9   DFLD  POS=(14,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KVRAD9   DFLD  POS=(14,11),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVPR9    DFLD  POS=(14,23),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVPRPR9  DFLD  POS=(14,30),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KVPA9    DFLD  POS=(14,36),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVPAPR9  DFLD  POS=(14,43),LTH=3,                                      +        
               ATTR=(PROT)                                                      
IDPRC10  DFLD  POS=(15,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KVRAD10  DFLD  POS=(15,11),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVPR10   DFLD  POS=(15,23),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVPRPR10 DFLD  POS=(15,30),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KVPA10   DFLD  POS=(15,36),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVPAPR10 DFLD  POS=(15,43),LTH=3,                                      +        
               ATTR=(PROT)                                                      
IDPRC11  DFLD  POS=(16,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KVRAD11  DFLD  POS=(16,11),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVPR11   DFLD  POS=(16,23),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVPRPR11 DFLD  POS=(16,30),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KVPA11   DFLD  POS=(16,36),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVPAPR11 DFLD  POS=(16,43),LTH=3,                                      +        
               ATTR=(PROT)                                                      
IDPRC12  DFLD  POS=(17,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KVRAD12  DFLD  POS=(17,11),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVPR12   DFLD  POS=(17,23),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVPRPR12 DFLD  POS=(17,30),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KVPA12   DFLD  POS=(17,36),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVPAPR12 DFLD  POS=(17,43),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'TOTAL',                                                +        
               POS=(19,2),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KVRADT   DFLD  POS=(19,11),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVPRT    DFLD  POS=(19,23),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVPRPRT  DFLD  POS=(19,30),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KVPAT    DFLD  POS=(19,36),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVPAPRT  DFLD  POS=(19,43),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '13',                                                   +        
               POS=(21,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '14',                                                   +        
               POS=(21,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15 OrderPl./Trp 16 OrderPl./PRC 17',                   +        
               POS=(21,34),LTH=34,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W4O654N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N654,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I654N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  TIRFSIN,                                                +        
               LTH=6                                                            
         MFLD  TIRFSUT,                                                +        
               LTH=6                                                            
         MFLD  IDPRCFIN,                                               +        
               LTH=4                                                            
         MFLD  IDPRCFUT,                                               +        
               LTH=4                                                            
         MFLD  IDPRCTIN,                                               +        
               LTH=4                                                            
         MFLD  IDPRCTUT,                                               +        
               LTH=4                                                            
         MFLD  IDPRC1,                                                 +        
               LTH=4                                                            
         MFLD  KVRAD1,                                                 +        
               LTH=5                                                            
         MFLD  KVPR1,                                                  +        
               LTH=5                                                            
         MFLD  KVPRPR1,                                                +        
               LTH=3                                                            
         MFLD  KVPA1,                                                  +        
               LTH=5                                                            
         MFLD  KVPAPR1,                                                +        
               LTH=3                                                            
         MFLD  IDPRC2,                                                 +        
               LTH=4                                                            
         MFLD  KVRAD2,                                                 +        
               LTH=5                                                            
         MFLD  KVPR2,                                                  +        
               LTH=5                                                            
         MFLD  KVPRPR2,                                                +        
               LTH=3                                                            
         MFLD  KVPA2,                                                  +        
               LTH=5                                                            
         MFLD  KVPAPR2,                                                +        
               LTH=3                                                            
         MFLD  IDPRC3,                                                 +        
               LTH=4                                                            
         MFLD  KVRAD3,                                                 +        
               LTH=5                                                            
         MFLD  KVPR3,                                                  +        
               LTH=5                                                            
         MFLD  KVPRPR3,                                                +        
               LTH=3                                                            
         MFLD  KVPA3,                                                  +        
               LTH=5                                                            
         MFLD  KVPAPR3,                                                +        
               LTH=3                                                            
         MFLD  IDPRC4,                                                 +        
               LTH=4                                                            
         MFLD  KVRAD4,                                                 +        
               LTH=5                                                            
         MFLD  KVPR4,                                                  +        
               LTH=5                                                            
         MFLD  KVPRPR4,                                                +        
               LTH=3                                                            
         MFLD  KVPA4,                                                  +        
               LTH=5                                                            
         MFLD  KVPAPR4,                                                +        
               LTH=3                                                            
         MFLD  IDPRC5,                                                 +        
               LTH=4                                                            
         MFLD  KVRAD5,                                                 +        
               LTH=5                                                            
         MFLD  KVPR5,                                                  +        
               LTH=5                                                            
         MFLD  KVPRPR5,                                                +        
               LTH=3                                                            
         MFLD  KVPA5,                                                  +        
               LTH=5                                                            
         MFLD  KVPAPR5,                                                +        
               LTH=3                                                            
         MFLD  IDPRC6,                                                 +        
               LTH=4                                                            
         MFLD  KVRAD6,                                                 +        
               LTH=5                                                            
         MFLD  KVPR6,                                                  +        
               LTH=5                                                            
         MFLD  KVPRPR6,                                                +        
               LTH=3                                                            
         MFLD  KVPA6,                                                  +        
               LTH=5                                                            
         MFLD  KVPAPR6,                                                +        
               LTH=3                                                            
         MFLD  IDPRC7,                                                 +        
               LTH=4                                                            
         MFLD  KVRAD7,                                                 +        
               LTH=5                                                            
         MFLD  KVPR7,                                                  +        
               LTH=5                                                            
         MFLD  KVPRPR7,                                                +        
               LTH=3                                                            
         MFLD  KVPA7,                                                  +        
               LTH=5                                                            
         MFLD  KVPAPR7,                                                +        
               LTH=3                                                            
         MFLD  IDPRC8,                                                 +        
               LTH=4                                                            
         MFLD  KVRAD8,                                                 +        
               LTH=5                                                            
         MFLD  KVPR8,                                                  +        
               LTH=5                                                            
         MFLD  KVPRPR8,                                                +        
               LTH=3                                                            
         MFLD  KVPA8,                                                  +        
               LTH=5                                                            
         MFLD  KVPAPR8,                                                +        
               LTH=3                                                            
         MFLD  IDPRC9,                                                 +        
               LTH=4                                                            
         MFLD  KVRAD9,                                                 +        
               LTH=5                                                            
         MFLD  KVPR9,                                                  +        
               LTH=5                                                            
         MFLD  KVPRPR9,                                                +        
               LTH=3                                                            
         MFLD  KVPA9,                                                  +        
               LTH=5                                                            
         MFLD  KVPAPR9,                                                +        
               LTH=3                                                            
         MFLD  IDPRC10,                                                +        
               LTH=4                                                            
         MFLD  KVRAD10,                                                +        
               LTH=5                                                            
         MFLD  KVPR10,                                                 +        
               LTH=5                                                            
         MFLD  KVPRPR10,                                               +        
               LTH=3                                                            
         MFLD  KVPA10,                                                 +        
               LTH=5                                                            
         MFLD  KVPAPR10,                                               +        
               LTH=3                                                            
         MFLD  IDPRC11,                                                +        
               LTH=4                                                            
         MFLD  KVRAD11,                                                +        
               LTH=5                                                            
         MFLD  KVPR11,                                                 +        
               LTH=5                                                            
         MFLD  KVPRPR11,                                               +        
               LTH=3                                                            
         MFLD  KVPA11,                                                 +        
               LTH=5                                                            
         MFLD  KVPAPR11,                                               +        
               LTH=3                                                            
         MFLD  IDPRC12,                                                +        
               LTH=4                                                            
         MFLD  KVRAD12,                                                +        
               LTH=5                                                            
         MFLD  KVPR12,                                                 +        
               LTH=5                                                            
         MFLD  KVPRPR12,                                               +        
               LTH=3                                                            
         MFLD  KVPA12,                                                 +        
               LTH=5                                                            
         MFLD  KVPAPR12,                                               +        
               LTH=3                                                            
         MFLD  KVRADT,                                                 +        
               LTH=5                                                            
         MFLD  KVPRT,                                                  +        
               LTH=5                                                            
         MFLD  KVPRPRT,                                                +        
               LTH=3                                                            
         MFLD  KVPAT,                                                  +        
               LTH=5                                                            
         MFLD  KVPAPRT,                                                +        
               LTH=3                                                            
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I654N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N654),                                           +        
               OPT=2,                                                  +        
               NXT=W4O654N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '46542',                                                +        
               LTH=5                                                            
         MFLD  (IDDCIN,                                                +        
               '++++'),                                                +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDCUT,                                                 +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (TIRFSIN,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  TIRFSUT,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (IDPRCFIN,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDPRCFUT,                                               +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (IDPRCTIN,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDPRCTUT,                                               +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
