***********************************************************************         
* CREATED BY V070375   ON 08/05/21  AT 13:42                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'PRICE THE HANDLING FEE          '                               
W4N707   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T707U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W00501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W4T707U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,11)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'PRICE THE HANDLING FEE',                               +        
               POS=(1,11),LTH=22,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'District',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(PROT)                                                      
DISTIN   DFLD  POS=(2,11),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Customer',                                             +        
               POS=(2,16),LTH=8,                                       +        
               ATTR=(PROT)                                                      
KUNDIN   DFLD  POS=(2,25),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
DISTUT   DFLD  POS=(3,11),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
KUNDUT   DFLD  POS=(3,25),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Parma No',                                             +        
               POS=(3,33),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
IDPARTUT DFLD  POS=(3,42),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'CC',                                                   +        
               POS=(3,52),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
IDFTGUT  DFLD  POS=(3,55),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Customer  Code  Invoice Fee    Price   Fee LDC',       +        
               POS=(5,2),LTH=46,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Price LDC  Updated by  Date',                          +        
               POS=(5,49),LTH=27,                                      +        
               ATTR=(PROT)                                                      
KUND1    DFLD  POS=(6,3),LTH=6,                                        +        
               ATTR=(NUM,PROT)                                                  
KOD1     DFLD  POS=(6,13),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
FLFEE1   DFLD  POS=(6,22),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
PRICE1   DFLD  POS=(6,31),LTH=10,                                      +        
               ATTR=(NUM,PROT)                                                  
FLLDC1   DFLD  POS=(6,43),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
PRLDC1   DFLD  POS=(6,48),LTH=10,                                      +        
               ATTR=(NUM,PROT)                                                  
IDUSER1  DFLD  POS=(6,61),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
DATUM1   DFLD  POS=(6,71),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
KUND2    DFLD  POS=(7,3),LTH=6,                                        +        
               ATTR=(NUM,PROT)                                                  
KOD2     DFLD  POS=(7,13),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
FLFEE2   DFLD  POS=(7,22),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
PRICE2   DFLD  POS=(7,31),LTH=10,                                      +        
               ATTR=(NUM,PROT)                                                  
FLLDC2   DFLD  POS=(7,43),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
PRLDC2   DFLD  POS=(7,48),LTH=10,                                      +        
               ATTR=(NUM,PROT)                                                  
IDUSER2  DFLD  POS=(7,61),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
DATUM2   DFLD  POS=(7,71),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
KUND3    DFLD  POS=(8,3),LTH=6,                                        +        
               ATTR=(NUM,PROT)                                                  
KOD3     DFLD  POS=(8,13),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
FLFEE3   DFLD  POS=(8,22),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
PRICE3   DFLD  POS=(8,31),LTH=10,                                      +        
               ATTR=(NUM,PROT)                                                  
FLLDC3   DFLD  POS=(8,43),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
PRLDC3   DFLD  POS=(8,48),LTH=10,                                      +        
               ATTR=(NUM,PROT)                                                  
IDUSER3  DFLD  POS=(8,61),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
DATUM3   DFLD  POS=(8,71),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
KUND4    DFLD  POS=(9,3),LTH=6,                                        +        
               ATTR=(NUM,PROT)                                                  
KOD4     DFLD  POS=(9,13),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
FLFEE4   DFLD  POS=(9,22),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
PRICE4   DFLD  POS=(9,31),LTH=10,                                      +        
               ATTR=(NUM,PROT)                                                  
FLLDC4   DFLD  POS=(9,43),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
PRLDC4   DFLD  POS=(9,48),LTH=10,                                      +        
               ATTR=(NUM,PROT)                                                  
IDUSER4  DFLD  POS=(9,61),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
DATUM4   DFLD  POS=(9,71),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
         DFLD  '   Cmd    Code  Invoice Fee    Price   Fee LDC',       +        
               POS=(10,2),LTH=46,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Price LDC',                                            +        
               POS=(10,49),LTH=10,                                     +        
               ATTR=(PROT)                                                      
KDCMDUPD DFLD  POS=(11,6),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
KODUPD   DFLD  POS=(11,13),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
FLFEEUPD DFLD  POS=(11,22),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
PRICEUPD DFLD  POS=(11,31),LTH=10,                                     +        
               ATTR=(NUM,NOPROT)                                                
FLLDCUPD DFLD  POS=(11,43),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
PRLDCUPD DFLD  POS=(11,48),LTH=10,                                     +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'VALUE LIMIT DESCREPANCY',                              +        
               POS=(13,11),LTH=23,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Customer   Code   Price Min   Fee LDC   ',             +        
               POS=(14,2),LTH=40,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Price LDC Min   Updated by    Date',                   +        
               POS=(14,43),LTH=34,                                     +        
               ATTR=(PROT)                                                      
KUND1F   DFLD  POS=(15,2),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
KOD1F    DFLD  POS=(15,14),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
PRICE1F  DFLD  POS=(15,20),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
FLLDC1F  DFLD  POS=(15,35),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PRLDC1F  DFLD  POS=(15,44),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
IDUSER1F DFLD  POS=(15,60),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
DATUM1F  DFLD  POS=(15,72),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
KUND2F   DFLD  POS=(16,2),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
KOD2F    DFLD  POS=(16,14),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
PRICE2F  DFLD  POS=(16,20),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
FLLDC2F  DFLD  POS=(16,35),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PRLDC2F  DFLD  POS=(16,44),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
IDUSER2F DFLD  POS=(16,60),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
DATUM2F  DFLD  POS=(16,72),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
KUND3F   DFLD  POS=(17,2),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
KOD3F    DFLD  POS=(17,14),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
PRICE3F  DFLD  POS=(17,20),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
FLLDC3F  DFLD  POS=(17,35),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PRLDC3F  DFLD  POS=(17,44),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
IDUSER3F DFLD  POS=(17,60),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
DATUM3F  DFLD  POS=(17,72),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
KUND4F   DFLD  POS=(18,2),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
KOD4F    DFLD  POS=(18,14),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
PRICE4F  DFLD  POS=(18,20),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
FLLDC4F  DFLD  POS=(18,35),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
PRLDC4F  DFLD  POS=(18,44),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
IDUSER4F DFLD  POS=(18,60),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
DATUM4F  DFLD  POS=(18,72),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  '   Cmd     Code   Price Min   Fee LDC   ',             +        
               POS=(19,2),LTH=40,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Price LDC Min',                                        +        
               POS=(19,43),LTH=13,                                     +        
               ATTR=(PROT)                                                      
KDCMDUPF DFLD  POS=(20,6),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
KODUPF   DFLD  POS=(20,14),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
PRICEUPF DFLD  POS=(20,20),LTH=10,                                     +        
               ATTR=(NUM,NOPROT)                                                
FLLDCUPF DFLD  POS=(20,35),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
PRLDCUPF DFLD  POS=(20,44),LTH=10,                                     +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'F10=WHELP  F11=Update   F12=Logoff',                   +        
               POS=(22,2),LTH=34,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O707N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N707,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I707N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  DISTIN,                                                 +        
               LTH=4                                                            
         MFLD  DISTUT,                                                 +        
               LTH=4                                                            
         MFLD  KUNDIN,                                                 +        
               LTH=6                                                            
         MFLD  KUNDUT,                                                 +        
               LTH=6                                                            
         MFLD  IDPARTUT,                                               +        
               LTH=9                                                            
         MFLD  IDFTGUT,                                                +        
               LTH=2                                                            
         MFLD  KUND1,                                                  +        
               LTH=6                                                            
         MFLD  KOD1,                                                   +        
               LTH=2                                                            
         MFLD  FLFEE1,                                                 +        
               LTH=1                                                            
         MFLD  PRICE1,                                                 +        
               LTH=10                                                           
         MFLD  FLLDC1,                                                 +        
               LTH=1                                                            
         MFLD  PRLDC1,                                                 +        
               LTH=10                                                           
         MFLD  IDUSER1,                                                +        
               LTH=8                                                            
         MFLD  DATUM1,                                                 +        
               LTH=8                                                            
         MFLD  KUND2,                                                  +        
               LTH=6                                                            
         MFLD  KOD2,                                                   +        
               LTH=2                                                            
         MFLD  FLFEE2,                                                 +        
               LTH=1                                                            
         MFLD  PRICE2,                                                 +        
               LTH=10                                                           
         MFLD  FLLDC2,                                                 +        
               LTH=1                                                            
         MFLD  PRLDC2,                                                 +        
               LTH=10                                                           
         MFLD  IDUSER2,                                                +        
               LTH=8                                                            
         MFLD  DATUM2,                                                 +        
               LTH=8                                                            
         MFLD  KUND3,                                                  +        
               LTH=6                                                            
         MFLD  KOD3,                                                   +        
               LTH=2                                                            
         MFLD  FLFEE3,                                                 +        
               LTH=1                                                            
         MFLD  PRICE3,                                                 +        
               LTH=10                                                           
         MFLD  FLLDC3,                                                 +        
               LTH=1                                                            
         MFLD  PRLDC3,                                                 +        
               LTH=10                                                           
         MFLD  IDUSER3,                                                +        
               LTH=8                                                            
         MFLD  DATUM3,                                                 +        
               LTH=8                                                            
         MFLD  KUND4,                                                  +        
               LTH=6                                                            
         MFLD  KOD4,                                                   +        
               LTH=2                                                            
         MFLD  FLFEE4,                                                 +        
               LTH=1                                                            
         MFLD  PRICE4,                                                 +        
               LTH=10                                                           
         MFLD  FLLDC4,                                                 +        
               LTH=1                                                            
         MFLD  PRLDC4,                                                 +        
               LTH=10                                                           
         MFLD  IDUSER4,                                                +        
               LTH=8                                                            
         MFLD  DATUM4,                                                 +        
               LTH=8                                                            
         MFLD  KDCMDUPD,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KODUPD,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLFEEUPD,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRICEUPD,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLLDCUPD,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRLDCUPD,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KUND1F,                                                 +        
               LTH=6                                                            
         MFLD  KOD1F,                                                  +        
               LTH=2                                                            
         MFLD  PRICE1F,                                                +        
               LTH=10                                                           
         MFLD  FLLDC1F,                                                +        
               LTH=1                                                            
         MFLD  PRLDC1F,                                                +        
               LTH=10                                                           
         MFLD  IDUSER1F,                                               +        
               LTH=8                                                            
         MFLD  DATUM1F,                                                +        
               LTH=8                                                            
         MFLD  KUND2F,                                                 +        
               LTH=6                                                            
         MFLD  KOD2F,                                                  +        
               LTH=2                                                            
         MFLD  PRICE2F,                                                +        
               LTH=10                                                           
         MFLD  FLLDC2F,                                                +        
               LTH=1                                                            
         MFLD  PRLDC2F,                                                +        
               LTH=10                                                           
         MFLD  IDUSER2F,                                               +        
               LTH=8                                                            
         MFLD  DATUM2F,                                                +        
               LTH=8                                                            
         MFLD  KUND3F,                                                 +        
               LTH=6                                                            
         MFLD  KOD3F,                                                  +        
               LTH=2                                                            
         MFLD  PRICE3F,                                                +        
               LTH=10                                                           
         MFLD  FLLDC3F,                                                +        
               LTH=1                                                            
         MFLD  PRLDC3F,                                                +        
               LTH=10                                                           
         MFLD  IDUSER3F,                                               +        
               LTH=8                                                            
         MFLD  DATUM3F,                                                +        
               LTH=8                                                            
         MFLD  KUND4F,                                                 +        
               LTH=6                                                            
         MFLD  KOD4F,                                                  +        
               LTH=2                                                            
         MFLD  PRICE4F,                                                +        
               LTH=10                                                           
         MFLD  FLLDC4F,                                                +        
               LTH=1                                                            
         MFLD  PRLDC4F,                                                +        
               LTH=10                                                           
         MFLD  IDUSER4F,                                               +        
               LTH=8                                                            
         MFLD  DATUM4F,                                                +        
               LTH=8                                                            
         MFLD  KDCMDUPF,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KODUPF,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRICEUPF,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLLDCUPF,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRLDCUPF,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I707N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N707),                                           +        
               OPT=2,                                                  +        
               NXT=W4O707N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '47072',                                                +        
               LTH=5                                                            
         MFLD  (DISTIN,                                                +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KUNDIN,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDCMDUPD,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (KODUPD,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLFEEUPD,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (PRICEUPD,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLLDCUPD,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (PRLDCUPD,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDCMDUPF,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (KODUPF,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (PRICEUPF,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLLDCUPF,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (PRLDCUPF,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
