***********************************************************************         
* CREATED BY PC22543   ON 95/08/30  AT 14:50                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'RECEIVING RETURNS - RETURN.TERM.'                               
W4N741   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T741U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T741  ',                                          +        
               14='W4T742  ',                                          +        
               15='W4T743  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W4T741U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4F741   DPAGE CURSOR=((2,8)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'RECEIVING RETURNS - RT',                               +        
               POS=(1,11),LTH=22,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Distr',                                                +        
               POS=(2,2),LTH=5,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDDISTRI DFLD  POS=(2,8),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDDISTRU DFLD  POS=(3,8),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Cust   DR-No. No.Dlr cases DN/V-No.',                  +        
               POS=(5,4),LTH=35,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Remarks',                                              +        
               POS=(5,48),LTH=7,                                       +        
               ATTR=(PROT)                                                      
IDKUND1  DFLD  POS=(6,2),LTH=6,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDRAPP1  DFLD  POS=(6,10),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
KVKLIA1  DFLD  POS=(6,25),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDFRAS1  DFLD  POS=(6,31),LTH=15,                                      +        
               ATTR=(NOPROT)                                                    
TENOTE1  DFLD  POS=(6,48),LTH=20,                                      +        
               ATTR=(NOPROT)                                                    
IDKUND2  DFLD  POS=(7,2),LTH=6,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDRAPP2  DFLD  POS=(7,10),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
KVKLIA2  DFLD  POS=(7,25),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDFRAS2  DFLD  POS=(7,31),LTH=15,                                      +        
               ATTR=(NOPROT)                                                    
TENOTE2  DFLD  POS=(7,48),LTH=20,                                      +        
               ATTR=(NOPROT)                                                    
IDKUND3  DFLD  POS=(8,2),LTH=6,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDRAPP3  DFLD  POS=(8,10),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
KVKLIA3  DFLD  POS=(8,25),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDFRAS3  DFLD  POS=(8,31),LTH=15,                                      +        
               ATTR=(NOPROT)                                                    
TENOTE3  DFLD  POS=(8,48),LTH=20,                                      +        
               ATTR=(NOPROT)                                                    
IDKUND4  DFLD  POS=(9,2),LTH=6,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDRAPP4  DFLD  POS=(9,10),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
KVKLIA4  DFLD  POS=(9,25),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDFRAS4  DFLD  POS=(9,31),LTH=15,                                      +        
               ATTR=(NOPROT)                                                    
TENOTE4  DFLD  POS=(9,48),LTH=20,                                      +        
               ATTR=(NOPROT)                                                    
IDKUND5  DFLD  POS=(10,2),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDRAPP5  DFLD  POS=(10,10),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
KVKLIA5  DFLD  POS=(10,25),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
IDFRAS5  DFLD  POS=(10,31),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
TENOTE5  DFLD  POS=(10,48),LTH=20,                                     +        
               ATTR=(NOPROT)                                                    
IDKUND6  DFLD  POS=(11,2),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDRAPP6  DFLD  POS=(11,10),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
KVKLIA6  DFLD  POS=(11,25),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
IDFRAS6  DFLD  POS=(11,31),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
TENOTE6  DFLD  POS=(11,48),LTH=20,                                     +        
               ATTR=(NOPROT)                                                    
IDKUND7  DFLD  POS=(12,2),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDRAPP7  DFLD  POS=(12,10),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
KVKLIA7  DFLD  POS=(12,25),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
IDFRAS7  DFLD  POS=(12,31),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
TENOTE7  DFLD  POS=(12,48),LTH=20,                                     +        
               ATTR=(NOPROT)                                                    
IDKUND8  DFLD  POS=(13,2),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDRAPP8  DFLD  POS=(13,10),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
KVKLIA8  DFLD  POS=(13,25),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
IDFRAS8  DFLD  POS=(13,31),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
TENOTE8  DFLD  POS=(13,48),LTH=20,                                     +        
               ATTR=(NOPROT)                                                    
IDKUND9  DFLD  POS=(14,2),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDRAPP9  DFLD  POS=(14,10),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
KVKLIA9  DFLD  POS=(14,25),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
IDFRAS9  DFLD  POS=(14,31),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
TENOTE9  DFLD  POS=(14,48),LTH=20,                                     +        
               ATTR=(NOPROT)                                                    
IDKUND10 DFLD  POS=(15,2),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDRAPP10 DFLD  POS=(15,10),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
KVKLIA10 DFLD  POS=(15,25),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
IDFRAS10 DFLD  POS=(15,31),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
TENOTE10 DFLD  POS=(15,48),LTH=20,                                     +        
               ATTR=(NOPROT)                                                    
IDKUND11 DFLD  POS=(16,2),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDRAPP11 DFLD  POS=(16,10),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
KVKLIA11 DFLD  POS=(16,25),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
IDFRAS11 DFLD  POS=(16,31),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
TENOTE11 DFLD  POS=(16,48),LTH=20,                                     +        
               ATTR=(NOPROT)                                                    
IDKUND12 DFLD  POS=(17,2),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDRAPP12 DFLD  POS=(17,10),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
KVKLIA12 DFLD  POS=(17,25),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
IDFRAS12 DFLD  POS=(17,31),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
TENOTE12 DFLD  POS=(17,48),LTH=20,                                     +        
               ATTR=(NOPROT)                                                    
IDKUND13 DFLD  POS=(18,2),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDRAPP13 DFLD  POS=(18,10),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
KVKLIA13 DFLD  POS=(18,25),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
IDFRAS13 DFLD  POS=(18,31),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
TENOTE13 DFLD  POS=(18,48),LTH=20,                                     +        
               ATTR=(NOPROT)                                                    
IDKUND14 DFLD  POS=(19,2),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDRAPP14 DFLD  POS=(19,10),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
KVKLIA14 DFLD  POS=(19,25),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
IDFRAS14 DFLD  POS=(19,31),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
TENOTE14 DFLD  POS=(19,48),LTH=20,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  '13 Rec returns  14 Confirm cases  15 Shipping rel 16 Ex+        
               ternal Que 17',                                         +        
               POS=(21,2),LTH=68,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,36),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,52),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 Whelp',                                             +        
               POS=(22,68),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W4O741N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N741,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I741N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4F741                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDDISTRI,                                               +        
               LTH=4                                                            
         MFLD  IDDISTRU,                                               +        
               LTH=4                                                            
         MFLD  IDKUND1,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDRAPP1,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVKLIA1,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDFRAS1,                                                +        
               LTH=17,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TENOTE1,                                                +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDKUND2,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDRAPP2,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVKLIA2,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDFRAS2,                                                +        
               LTH=17,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TENOTE2,                                                +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDKUND3,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDRAPP3,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVKLIA3,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDFRAS3,                                                +        
               LTH=17,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TENOTE3,                                                +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDKUND4,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDRAPP4,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVKLIA4,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDFRAS4,                                                +        
               LTH=17,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TENOTE4,                                                +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDKUND5,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDRAPP5,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVKLIA5,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDFRAS5,                                                +        
               LTH=17,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TENOTE5,                                                +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDKUND6,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDRAPP6,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVKLIA6,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDFRAS6,                                                +        
               LTH=17,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TENOTE6,                                                +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDKUND7,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDRAPP7,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVKLIA7,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDFRAS7,                                                +        
               LTH=17,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TENOTE7,                                                +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDKUND8,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDRAPP8,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVKLIA8,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDFRAS8,                                                +        
               LTH=17,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TENOTE8,                                                +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDKUND9,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDRAPP9,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVKLIA9,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDFRAS9,                                                +        
               LTH=17,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TENOTE9,                                                +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDKUND10,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDRAPP10,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVKLIA10,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDFRAS10,                                               +        
               LTH=17,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TENOTE10,                                               +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDKUND11,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDRAPP11,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVKLIA11,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDFRAS11,                                               +        
               LTH=17,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TENOTE11,                                               +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDKUND12,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDRAPP12,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVKLIA12,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDFRAS12,                                               +        
               LTH=17,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TENOTE12,                                               +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDKUND13,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDRAPP13,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVKLIA13,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDFRAS13,                                               +        
               LTH=17,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TENOTE13,                                               +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDKUND14,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDRAPP14,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVKLIA14,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDFRAS14,                                               +        
               LTH=17,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TENOTE14,                                               +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I741N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N741),                                           +        
               OPT=2,                                                  +        
               NXT=W4O741N1                                                     
MID      LPAGE SOR=(W4F741)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '47412',                                                +        
               LTH=5                                                            
         MFLD  (IDDISTRI,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDISTRU,                                               +        
               LTH=4                                                            
         MFLD  (IDKUND1,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDRAPP1,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVKLIA1,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDFRAS1,                                               +        
               '+++++++++++++++'),                                     +        
               LTH=15                                                           
         MFLD  (TENOTE1,                                               +        
               '++++++++++++++++++++'),                                +        
               LTH=20                                                           
         MFLD  (IDKUND2,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDRAPP2,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVKLIA2,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDFRAS2,                                               +        
               '+++++++++++++++'),                                     +        
               LTH=15                                                           
         MFLD  (TENOTE2,                                               +        
               '++++++++++++++++++++'),                                +        
               LTH=20                                                           
         MFLD  (IDKUND3,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDRAPP3,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVKLIA3,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDFRAS3,                                               +        
               '+++++++++++++++'),                                     +        
               LTH=15                                                           
         MFLD  (TENOTE3,                                               +        
               '++++++++++++++++++++'),                                +        
               LTH=20                                                           
         MFLD  (IDKUND4,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDRAPP4,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVKLIA4,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDFRAS4,                                               +        
               '+++++++++++++++'),                                     +        
               LTH=15                                                           
         MFLD  (TENOTE4,                                               +        
               '++++++++++++++++++++'),                                +        
               LTH=20                                                           
         MFLD  (IDKUND5,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDRAPP5,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVKLIA5,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDFRAS5,                                               +        
               '+++++++++++++++'),                                     +        
               LTH=15                                                           
         MFLD  (TENOTE5,                                               +        
               '++++++++++++++++++++'),                                +        
               LTH=20                                                           
         MFLD  (IDKUND6,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDRAPP6,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVKLIA6,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDFRAS6,                                               +        
               '+++++++++++++++'),                                     +        
               LTH=15                                                           
         MFLD  (TENOTE6,                                               +        
               '++++++++++++++++++++'),                                +        
               LTH=20                                                           
         MFLD  (IDKUND7,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDRAPP7,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVKLIA7,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDFRAS7,                                               +        
               '+++++++++++++++'),                                     +        
               LTH=15                                                           
         MFLD  (TENOTE7,                                               +        
               '++++++++++++++++++++'),                                +        
               LTH=20                                                           
         MFLD  (IDKUND8,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDRAPP8,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVKLIA8,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDFRAS8,                                               +        
               '+++++++++++++++'),                                     +        
               LTH=15                                                           
         MFLD  (TENOTE8,                                               +        
               '++++++++++++++++++++'),                                +        
               LTH=20                                                           
         MFLD  (IDKUND9,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDRAPP9,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVKLIA9,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDFRAS9,                                               +        
               '+++++++++++++++'),                                     +        
               LTH=15                                                           
         MFLD  (TENOTE9,                                               +        
               '++++++++++++++++++++'),                                +        
               LTH=20                                                           
         MFLD  (IDKUND10,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDRAPP10,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVKLIA10,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDFRAS10,                                              +        
               '+++++++++++++++'),                                     +        
               LTH=15                                                           
         MFLD  (TENOTE10,                                              +        
               '++++++++++++++++++++'),                                +        
               LTH=20                                                           
         MFLD  (IDKUND11,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDRAPP11,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVKLIA11,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDFRAS11,                                              +        
               '+++++++++++++++'),                                     +        
               LTH=15                                                           
         MFLD  (TENOTE11,                                              +        
               '++++++++++++++++++++'),                                +        
               LTH=20                                                           
         MFLD  (IDKUND12,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDRAPP12,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVKLIA12,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDFRAS12,                                              +        
               '+++++++++++++++'),                                     +        
               LTH=15                                                           
         MFLD  (TENOTE12,                                              +        
               '++++++++++++++++++++'),                                +        
               LTH=20                                                           
         MFLD  (IDKUND13,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDRAPP13,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVKLIA13,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDFRAS13,                                              +        
               '+++++++++++++++'),                                     +        
               LTH=15                                                           
         MFLD  (TENOTE13,                                              +        
               '++++++++++++++++++++'),                                +        
               LTH=20                                                           
         MFLD  (IDKUND14,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDRAPP14,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVKLIA14,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDFRAS14,                                              +        
               '+++++++++++++++'),                                     +        
               LTH=15                                                           
         MFLD  (TENOTE14,                                              +        
               '++++++++++++++++++++'),                                +        
               LTH=20                                                           
         MFLD  IDKUND1,                                                +        
               LTH=8,                                                  +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  IDRAPP1,                                                +        
               LTH=9,                                                  +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  KVKLIA1,                                                +        
               LTH=6,                                                  +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  IDFRAS1,                                                +        
               LTH=17,                                                 +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  TENOTE1,                                                +        
               LTH=22,                                                 +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  IDKUND2,                                                +        
               LTH=8,                                                  +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  IDRAPP2,                                                +        
               LTH=9,                                                  +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  KVKLIA2,                                                +        
               LTH=6,                                                  +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  IDFRAS2,                                                +        
               LTH=17,                                                 +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  TENOTE2,                                                +        
               LTH=22,                                                 +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  IDKUND3,                                                +        
               LTH=8,                                                  +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  IDRAPP3,                                                +        
               LTH=9,                                                  +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  KVKLIA3,                                                +        
               LTH=6,                                                  +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  IDFRAS3,                                                +        
               LTH=17,                                                 +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  TENOTE3,                                                +        
               LTH=22,                                                 +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  IDKUND4,                                                +        
               LTH=8,                                                  +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  IDRAPP4,                                                +        
               LTH=9,                                                  +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  KVKLIA4,                                                +        
               LTH=6,                                                  +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  IDFRAS4,                                                +        
               LTH=17,                                                 +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  TENOTE4,                                                +        
               LTH=22,                                                 +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  IDKUND5,                                                +        
               LTH=8,                                                  +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  IDRAPP5,                                                +        
               LTH=9,                                                  +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  KVKLIA5,                                                +        
               LTH=6,                                                  +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  IDFRAS5,                                                +        
               LTH=17,                                                 +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  TENOTE5,                                                +        
               LTH=22,                                                 +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  IDKUND6,                                                +        
               LTH=8,                                                  +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  IDRAPP6,                                                +        
               LTH=9,                                                  +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  KVKLIA6,                                                +        
               LTH=6,                                                  +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  IDFRAS6,                                                +        
               LTH=17,                                                 +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  TENOTE6,                                                +        
               LTH=22,                                                 +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  IDKUND7,                                                +        
               LTH=8,                                                  +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  IDRAPP7,                                                +        
               LTH=9,                                                  +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  KVKLIA7,                                                +        
               LTH=6,                                                  +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  IDFRAS7,                                                +        
               LTH=17,                                                 +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  TENOTE7,                                                +        
               LTH=22,                                                 +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  IDKUND8,                                                +        
               LTH=8,                                                  +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  IDRAPP8,                                                +        
               LTH=9,                                                  +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  KVKLIA8,                                                +        
               LTH=6,                                                  +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  IDFRAS8,                                                +        
               LTH=17,                                                 +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  TENOTE8,                                                +        
               LTH=22,                                                 +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  IDKUND9,                                                +        
               LTH=8,                                                  +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  IDRAPP9,                                                +        
               LTH=9,                                                  +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  KVKLIA9,                                                +        
               LTH=6,                                                  +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  IDFRAS9,                                                +        
               LTH=17,                                                 +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  TENOTE9,                                                +        
               LTH=22,                                                 +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  IDKUND10,                                               +        
               LTH=8,                                                  +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  IDRAPP10,                                               +        
               LTH=9,                                                  +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  KVKLIA10,                                               +        
               LTH=6,                                                  +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  IDFRAS10,                                               +        
               LTH=17,                                                 +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  TENOTE10,                                               +        
               LTH=22,                                                 +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  IDKUND11,                                               +        
               LTH=8,                                                  +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  IDRAPP11,                                               +        
               LTH=9,                                                  +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  KVKLIA11,                                               +        
               LTH=6,                                                  +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  IDFRAS11,                                               +        
               LTH=17,                                                 +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  TENOTE11,                                               +        
               LTH=22,                                                 +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  IDKUND12,                                               +        
               LTH=8,                                                  +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  IDRAPP12,                                               +        
               LTH=9,                                                  +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  KVKLIA12,                                               +        
               LTH=6,                                                  +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  IDFRAS12,                                               +        
               LTH=17,                                                 +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  TENOTE12,                                               +        
               LTH=22,                                                 +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  IDKUND13,                                               +        
               LTH=8,                                                  +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  IDRAPP13,                                               +        
               LTH=9,                                                  +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  KVKLIA13,                                               +        
               LTH=6,                                                  +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  IDFRAS13,                                               +        
               LTH=17,                                                 +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  TENOTE13,                                               +        
               LTH=22,                                                 +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  IDKUND14,                                               +        
               LTH=8,                                                  +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  IDRAPP14,                                               +        
               LTH=9,                                                  +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  KVKLIA14,                                               +        
               LTH=6,                                                  +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  IDFRAS14,                                               +        
               LTH=17,                                                 +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MFLD  TENOTE14,                                               +        
               LTH=22,                                                 +        
               JUST=L,                                                 +        
               ATTR=(YES),                                             +        
               FILL=X'4E'                                                       
         MSGEND                                                                 
         END                                                                    
