***********************************************************************         
* CREATED BY V028439   ON 01/11/13  AT 09:50                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'LEADTIME CLAIM AND RETURNS      '                               
W4N753   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551u ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T753 7',                                           +        
               8='W4T753 8',                                           +        
               9='W4T753 9',                                           +        
               10='WHELP   ',                                          +        
               11='W4T753U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T753  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4N753   DPAGE CURSOR=((3,11)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'LEADTIME CLAIM AND RETURNS',                           +        
               POS=(1,13),LTH=26,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'District',                                             +        
               POS=(3,2),LTH=8,                                        +        
               ATTR=(ALPHA,PROT)                                                
DISTRIN  DFLD  POS=(3,11),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Customer',                                             +        
               POS=(3,17),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
KUNDNRIN DFLD  POS=(3,26),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Code',                                                 +        
               POS=(3,34),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
ANMORSIN DFLD  POS=(3,39),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Show all',                                             +        
               POS=(3,43),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
SHOWIN   DFLD  POS=(3,52),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DISTRUT  DFLD  POS=(4,11),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
KUNDNRUT DFLD  POS=(4,26),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
ANMORSUT DFLD  POS=(4,39),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
SHOWUT   DFLD  POS=(4,52),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  '----- Reminder -----',                                 +        
               POS=(4,60),LTH=20,                                      +        
               ATTR=(PROT)                                                      
         DFLD  ' -3 days       -1 day',                                +        
               POS=(5,59),LTH=21,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '------ Claim ------',                                  +        
               POS=(6,37),LTH=19,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '------ Return ------',                                 +        
               POS=(6,60),LTH=20,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'District     Customer   Code',                         +        
               POS=(7,6),LTH=28,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Trp Handl               Handl Trp',                    +        
               POS=(7,47),LTH=33,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Cmd From  To  From      To',                           +        
               POS=(8,02),LTH=26,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Trp Handl LDC  LDC',                                   +        
               POS=(8,37),LTH=18,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Handl Trp   LDC  LDC',                                 +        
               POS=(8,60),LTH=20,                                      +        
               ATTR=(PROT)                                                      
CMD01    DFLD  POS=(09,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
DISTF01  DFLD  POS=(09,6),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DISTT01  DFLD  POS=(09,11),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KUNDF01  DFLD  POS=(09,16),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KUNDT01  DFLD  POS=(09,23),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ANMORS01 DFLD  POS=(09,31),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CLTRP01  DFLD  POS=(09,37),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CLHND01  DFLD  POS=(09,42),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CLTRPL01 DFLD  POS=(09,47),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CLHNDL01 DFLD  POS=(09,52),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
REHND01  DFLD  POS=(09,61),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
RETRP01  DFLD  POS=(09,66),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
REHNDL01 DFLD  POS=(09,72),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
RETRPL01 DFLD  POS=(09,77),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD02    DFLD  POS=(10,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
DISTF02  DFLD  POS=(10,6),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DISTT02  DFLD  POS=(10,11),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KUNDF02  DFLD  POS=(10,16),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KUNDT02  DFLD  POS=(10,23),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ANMORS02 DFLD  POS=(10,31),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CLTRP02  DFLD  POS=(10,37),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CLHND02  DFLD  POS=(10,42),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CLTRPL02 DFLD  POS=(10,47),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CLHNDL02 DFLD  POS=(10,52),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
REHND02  DFLD  POS=(10,61),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
RETRP02  DFLD  POS=(10,66),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
REHNDL02 DFLD  POS=(10,72),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
RETRPL02 DFLD  POS=(10,77),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD03    DFLD  POS=(11,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
DISTF03  DFLD  POS=(11,6),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DISTT03  DFLD  POS=(11,11),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KUNDF03  DFLD  POS=(11,16),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KUNDT03  DFLD  POS=(11,23),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ANMORS03 DFLD  POS=(11,31),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CLTRP03  DFLD  POS=(11,37),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CLHND03  DFLD  POS=(11,42),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CLTRPL03 DFLD  POS=(11,47),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CLHNDL03 DFLD  POS=(11,52),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
REHND03  DFLD  POS=(11,61),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
RETRP03  DFLD  POS=(11,66),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
REHNDL03 DFLD  POS=(11,72),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
RETRPL03 DFLD  POS=(11,77),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD04    DFLD  POS=(12,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
DISTF04  DFLD  POS=(12,6),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DISTT04  DFLD  POS=(12,11),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KUNDF04  DFLD  POS=(12,16),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KUNDT04  DFLD  POS=(12,23),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ANMORS04 DFLD  POS=(12,31),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CLTRP04  DFLD  POS=(12,37),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CLHND04  DFLD  POS=(12,42),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CLTRPL04 DFLD  POS=(12,47),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CLHNDL04 DFLD  POS=(12,52),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
REHND04  DFLD  POS=(12,61),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
RETRP04  DFLD  POS=(12,66),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
REHNDL04 DFLD  POS=(12,72),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
RETRPL04 DFLD  POS=(12,77),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD05    DFLD  POS=(13,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
DISTF05  DFLD  POS=(13,6),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DISTT05  DFLD  POS=(13,11),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KUNDF05  DFLD  POS=(13,16),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KUNDT05  DFLD  POS=(13,23),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ANMORS05 DFLD  POS=(13,31),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CLTRP05  DFLD  POS=(13,37),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CLHND05  DFLD  POS=(13,42),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CLTRPL05 DFLD  POS=(13,47),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CLHNDL05 DFLD  POS=(13,52),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
REHND05  DFLD  POS=(13,61),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
RETRP05  DFLD  POS=(13,66),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
REHNDL05 DFLD  POS=(13,72),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
RETRPL05 DFLD  POS=(13,77),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD06    DFLD  POS=(14,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
DISTF06  DFLD  POS=(14,6),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DISTT06  DFLD  POS=(14,11),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KUNDF06  DFLD  POS=(14,16),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KUNDT06  DFLD  POS=(14,23),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ANMORS06 DFLD  POS=(14,31),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CLTRP06  DFLD  POS=(14,37),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CLHND06  DFLD  POS=(14,42),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CLTRPL06 DFLD  POS=(14,47),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CLHNDL06 DFLD  POS=(14,52),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
REHND06  DFLD  POS=(14,61),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
RETRP06  DFLD  POS=(14,66),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
REHNDL06 DFLD  POS=(14,72),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
RETRPL06 DFLD  POS=(14,77),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD07    DFLD  POS=(15,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
DISTF07  DFLD  POS=(15,6),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DISTT07  DFLD  POS=(15,11),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KUNDF07  DFLD  POS=(15,16),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KUNDT07  DFLD  POS=(15,23),LTH=6,                                      +        
               ATTR=(PROT,MOD,MOD)                                              
ANMORS07 DFLD  POS=(15,31),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CLTRP07  DFLD  POS=(15,37),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CLHND07  DFLD  POS=(15,42),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CLTRPL07 DFLD  POS=(15,47),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CLHNDL07 DFLD  POS=(15,52),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
REHND07  DFLD  POS=(15,61),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
RETRP07  DFLD  POS=(15,66),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
REHNDL07 DFLD  POS=(15,72),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
RETRPL07 DFLD  POS=(15,77),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CMD08    DFLD  POS=(16,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
DISTF08  DFLD  POS=(16,6),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DISTT08  DFLD  POS=(16,11),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KUNDF08  DFLD  POS=(16,16),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KUNDT08  DFLD  POS=(16,23),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ANMORS08 DFLD  POS=(16,31),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CLTRP08  DFLD  POS=(16,37),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CLHND08  DFLD  POS=(16,42),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CLTRPL08 DFLD  POS=(16,47),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CLHNDL08 DFLD  POS=(16,52),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
REHND08  DFLD  POS=(16,61),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
RETRP08  DFLD  POS=(16,66),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
REHNDL08 DFLD  POS=(16,72),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
RETRPL08 DFLD  POS=(16,77),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  'Default',                                              +        
               POS=(17,2),LTH=7,                                       +        
               ATTR=(PROT)                                                      
CMDDEF   DFLD  POS=(18,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
DISTFDEF DFLD  POS=(18,6),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DISTTDEF DFLD  POS=(18,11),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CLTRPDEF DFLD  POS=(18,37),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CLHNDDEF DFLD  POS=(18,42),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
REHNDDEF DFLD  POS=(18,61),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
RETRPDEF DFLD  POS=(18,66),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  'New/Change',                                           +        
               POS=(19,02),LTH=10,                                     +        
               ATTR=(PROT)                                                      
CMDUPD   DFLD  POS=(20,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
DISTFUPD DFLD  POS=(20,6),LTH=4,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
DISTTUPD DFLD  POS=(20,11),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
KUNDFUPD DFLD  POS=(20,16),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
KUNDTUPD DFLD  POS=(20,23),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
ANMORUPD DFLD  POS=(20,31),LTH=2,                                      +        
               ATTR=(NOPROT,MOD)                                                
CLTRPUPD DFLD  POS=(20,37),LTH=3,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
CLHNDUPD DFLD  POS=(20,42),LTH=3,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
CLTRLUPD DFLD  POS=(20,47),LTH=3,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
CLHNLUPD DFLD  POS=(20,52),LTH=3,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
REHNDUPD DFLD  POS=(20,61),LTH=3,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
RETRPUPD DFLD  POS=(20,66),LTH=3,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
REHNLUPD DFLD  POS=(20,72),LTH=3,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
RETRLUPD DFLD  POS=(20,77),LTH=3,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  '13',                                                   +        
               POS=(21,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '14',                                                   +        
               POS=(21,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15',                                                   +        
               POS=(21,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '05',                                                   +        
               POS=(21,76),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '22',                                                   +        
               POS=(22,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIMME    DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W4O753N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N753,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I753N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4N753                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DISTRIN,                                                +        
               LTH=4                                                            
         MFLD  DISTRUT,                                                +        
               LTH=4                                                            
         MFLD  KUNDNRIN,                                               +        
               LTH=6                                                            
         MFLD  KUNDNRUT,                                               +        
               LTH=6                                                            
         MFLD  ANMORSIN,                                               +        
               LTH=2                                                            
         MFLD  ANMORSUT,                                               +        
               LTH=2                                                            
         MFLD  SHOWIN,                                                 +        
               LTH=1                                                            
         MFLD  SHOWUT,                                                 +        
               LTH=1                                                            
         MFLD  CMD01,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISTF01,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISTT01,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KUNDF01,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KUNDT01,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANMORS01,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CLTRP01,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CLHND01,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CLTRPL01,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CLHNDL01,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  REHND01,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RETRP01,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  REHNDL01,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RETRPL01,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CMD02,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISTF02,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISTT02,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KUNDF02,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KUNDT02,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANMORS02,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CLTRP02,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CLHND02,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CLTRPL02,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CLHNDL02,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  REHND02,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RETRP02,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  REHNDL02,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RETRPL02,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CMD03,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISTF03,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISTT03,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KUNDF03,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KUNDT03,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANMORS03,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CLTRP03,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CLHND03,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CLTRPL03,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CLHNDL03,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  REHND03,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RETRP03,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  REHNDL03,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RETRPL03,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CMD04,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISTF04,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISTT04,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KUNDF04,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KUNDT04,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANMORS04,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CLTRP04,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CLHND04,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CLTRPL04,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CLHNDL04,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  REHND04,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RETRP04,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  REHNDL04,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RETRPL04,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CMD05,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISTF05,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISTT05,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KUNDF05,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KUNDT05,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANMORS05,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CLTRP05,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CLHND05,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CLTRPL05,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CLHNDL05,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  REHND05,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RETRP05,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  REHNDL05,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RETRPL05,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CMD06,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISTF06,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISTT06,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KUNDF06,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KUNDT06,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANMORS06,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CLTRP06,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CLHND06,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CLTRPL06,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CLHNDL06,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  REHND06,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RETRP06,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  REHNDL06,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RETRPL06,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CMD07,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISTF07,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISTT07,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KUNDF07,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KUNDT07,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANMORS07,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CLTRP07,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CLHND07,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CLTRPL07,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CLHNDL07,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  REHND07,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RETRP07,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  REHNDL07,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RETRPL07,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CMD08,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISTF08,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISTT08,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KUNDF08,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KUNDT08,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANMORS08,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CLTRP08,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CLHND08,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CLTRPL08,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CLHNDL08,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  REHND08,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RETRP08,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  REHNDL08,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RETRPL08,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CMDDEF,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISTFDEF,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISTTDEF,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CLTRPDEF,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CLHNDDEF,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  REHNDDEF,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RETRPDEF,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CMDUPD,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISTFUPD,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISTTUPD,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KUNDFUPD,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KUNDTUPD,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANMORUPD,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CLTRPUPD,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CLHNDUPD,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CLTRLUPD,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CLHNLUPD,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  REHNDUPD,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RETRPUPD,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  REHNLUPD,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RETRLUPD,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIMME,                                                 +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I753N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N753),                                           +        
               OPT=2,                                                  +        
               NXT=W4O753N1                                                     
MID      LPAGE SOR=(W4N753)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '47532',                                                +        
               LTH=5                                                            
         MFLD  (DISTRIN,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DISTRUT,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (KUNDNRIN,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KUNDNRUT,                                               +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (ANMORSIN,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  ANMORSUT,                                               +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (SHOWIN,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  SHOWUT,                                                 +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD01,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD02,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD03,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD04,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD05,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD06,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD07,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD08,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMDDEF,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMDUPD,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DISTFUPD,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DISTTUPD,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KUNDFUPD,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KUNDTUPD,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANMORUPD,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CLTRPUPD,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CLHNDUPD,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CLTRLUPD,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CLHNLUPD,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (REHNDUPD,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RETRPUPD,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (REHNLUPD,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RETRLUPD,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DISTF01,                                                +        
               LTH=4                                                            
         MFLD  DISTT01,                                                +        
               LTH=4                                                            
         MFLD  KUNDF01,                                                +        
               LTH=6                                                            
         MFLD  KUNDT01,                                                +        
               LTH=6                                                            
         MFLD  ANMORS01,                                               +        
               LTH=2                                                            
         MFLD  CLTRP01,                                                +        
               LTH=3                                                            
         MFLD  CLHND01,                                                +        
               LTH=3                                                            
         MFLD  CLTRPL01,                                               +        
               LTH=3                                                            
         MFLD  CLHNDL01,                                               +        
               LTH=3                                                            
         MFLD  REHND01,                                                +        
               LTH=3                                                            
         MFLD  RETRP01,                                                +        
               LTH=3                                                            
         MFLD  REHNDL01,                                               +        
               LTH=3                                                            
         MFLD  RETRPL01,                                               +        
               LTH=3                                                            
         MFLD  DISTF02,                                                +        
               LTH=4                                                            
         MFLD  DISTT02,                                                +        
               LTH=4                                                            
         MFLD  KUNDF02,                                                +        
               LTH=6                                                            
         MFLD  KUNDT02,                                                +        
               LTH=6                                                            
         MFLD  ANMORS02,                                               +        
               LTH=2                                                            
         MFLD  CLTRP02,                                                +        
               LTH=3                                                            
         MFLD  CLHND02,                                                +        
               LTH=3                                                            
         MFLD  CLTRPL02,                                               +        
               LTH=3                                                            
         MFLD  CLHNDL02,                                               +        
               LTH=3                                                            
         MFLD  REHND02,                                                +        
               LTH=3                                                            
         MFLD  RETRP02,                                                +        
               LTH=3                                                            
         MFLD  REHNDL02,                                               +        
               LTH=3                                                            
         MFLD  RETRPL02,                                               +        
               LTH=3                                                            
         MFLD  DISTF03,                                                +        
               LTH=4                                                            
         MFLD  DISTT03,                                                +        
               LTH=4                                                            
         MFLD  KUNDF03,                                                +        
               LTH=6                                                            
         MFLD  KUNDT03,                                                +        
               LTH=6                                                            
         MFLD  ANMORS03,                                               +        
               LTH=2                                                            
         MFLD  CLTRP03,                                                +        
               LTH=3                                                            
         MFLD  CLHND03,                                                +        
               LTH=3                                                            
         MFLD  CLTRPL03,                                               +        
               LTH=3                                                            
         MFLD  CLHNDL03,                                               +        
               LTH=3                                                            
         MFLD  REHND03,                                                +        
               LTH=3                                                            
         MFLD  RETRP03,                                                +        
               LTH=3                                                            
         MFLD  REHNDL03,                                               +        
               LTH=3                                                            
         MFLD  RETRPL03,                                               +        
               LTH=3                                                            
         MFLD  DISTF04,                                                +        
               LTH=4                                                            
         MFLD  DISTT04,                                                +        
               LTH=4                                                            
         MFLD  KUNDF04,                                                +        
               LTH=6                                                            
         MFLD  KUNDT04,                                                +        
               LTH=6                                                            
         MFLD  ANMORS04,                                               +        
               LTH=2                                                            
         MFLD  CLTRP04,                                                +        
               LTH=3                                                            
         MFLD  CLHND04,                                                +        
               LTH=3                                                            
         MFLD  CLTRPL04,                                               +        
               LTH=3                                                            
         MFLD  CLHNDL04,                                               +        
               LTH=3                                                            
         MFLD  REHND04,                                                +        
               LTH=3                                                            
         MFLD  RETRP04,                                                +        
               LTH=3                                                            
         MFLD  REHNDL04,                                               +        
               LTH=3                                                            
         MFLD  RETRPL04,                                               +        
               LTH=3                                                            
         MFLD  DISTF05,                                                +        
               LTH=4                                                            
         MFLD  DISTT05,                                                +        
               LTH=4                                                            
         MFLD  KUNDF05,                                                +        
               LTH=6                                                            
         MFLD  KUNDT05,                                                +        
               LTH=6                                                            
         MFLD  ANMORS05,                                               +        
               LTH=2                                                            
         MFLD  CLTRP05,                                                +        
               LTH=3                                                            
         MFLD  CLHND05,                                                +        
               LTH=3                                                            
         MFLD  CLTRPL05,                                               +        
               LTH=3                                                            
         MFLD  CLHNDL05,                                               +        
               LTH=3                                                            
         MFLD  REHND05,                                                +        
               LTH=3                                                            
         MFLD  RETRP05,                                                +        
               LTH=3                                                            
         MFLD  REHNDL05,                                               +        
               LTH=3                                                            
         MFLD  RETRPL05,                                               +        
               LTH=3                                                            
         MFLD  DISTF06,                                                +        
               LTH=4                                                            
         MFLD  DISTT06,                                                +        
               LTH=4                                                            
         MFLD  KUNDF06,                                                +        
               LTH=6                                                            
         MFLD  KUNDT06,                                                +        
               LTH=6                                                            
         MFLD  ANMORS06,                                               +        
               LTH=2                                                            
         MFLD  CLTRP06,                                                +        
               LTH=3                                                            
         MFLD  CLHND06,                                                +        
               LTH=3                                                            
         MFLD  CLTRPL06,                                               +        
               LTH=3                                                            
         MFLD  CLHNDL06,                                               +        
               LTH=3                                                            
         MFLD  REHND06,                                                +        
               LTH=3                                                            
         MFLD  RETRP06,                                                +        
               LTH=3                                                            
         MFLD  REHNDL06,                                               +        
               LTH=3                                                            
         MFLD  RETRPL06,                                               +        
               LTH=3                                                            
         MFLD  DISTF07,                                                +        
               LTH=4                                                            
         MFLD  DISTT07,                                                +        
               LTH=4                                                            
         MFLD  KUNDF07,                                                +        
               LTH=6                                                            
         MFLD  KUNDT07,                                                +        
               LTH=6                                                            
         MFLD  ANMORS07,                                               +        
               LTH=2                                                            
         MFLD  CLTRP07,                                                +        
               LTH=3                                                            
         MFLD  CLHND07,                                                +        
               LTH=3                                                            
         MFLD  CLTRPL07,                                               +        
               LTH=3                                                            
         MFLD  CLHNDL07,                                               +        
               LTH=3                                                            
         MFLD  REHND07,                                                +        
               LTH=3                                                            
         MFLD  RETRP07,                                                +        
               LTH=3                                                            
         MFLD  REHNDL07,                                               +        
               LTH=3                                                            
         MFLD  RETRPL07,                                               +        
               LTH=3                                                            
         MFLD  DISTF08,                                                +        
               LTH=4                                                            
         MFLD  DISTT08,                                                +        
               LTH=4                                                            
         MFLD  KUNDF08,                                                +        
               LTH=6                                                            
         MFLD  KUNDT08,                                                +        
               LTH=6                                                            
         MFLD  ANMORS08,                                               +        
               LTH=2                                                            
         MFLD  CLTRP08,                                                +        
               LTH=3                                                            
         MFLD  CLHND08,                                                +        
               LTH=3                                                            
         MFLD  CLTRPL08,                                               +        
               LTH=3                                                            
         MFLD  CLHNDL08,                                               +        
               LTH=3                                                            
         MFLD  REHND08,                                                +        
               LTH=3                                                            
         MFLD  RETRP08,                                                +        
               LTH=3                                                            
         MFLD  REHNDL08,                                               +        
               LTH=3                                                            
         MFLD  RETRPL08,                                               +        
               LTH=3                                                            
         MFLD  DISTFDEF,                                               +        
               LTH=4                                                            
         MFLD  DISTTDEF,                                               +        
               LTH=4                                                            
         MFLD  CLTRPDEF,                                               +        
               LTH=3                                                            
         MFLD  CLHNDDEF,                                               +        
               LTH=3                                                            
         MFLD  REHNDDEF,                                               +        
               LTH=3                                                            
         MFLD  RETRPDEF,                                               +        
               LTH=3                                                            
         MSGEND                                                                 
         END                                                                    
