***********************************************************************         
* CREATED BY V070375   ON 02/09/03  AT 13:09                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'VALUE LIMITS FOR PRINT OF CN    '                               
W4N708   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T708 7',                                           +        
               8='W4T708 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T708U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W00501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W4T708U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,11)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'VALUE LIMITS FOR PRINT OF CN',                         +        
               POS=(1,11),LTH=28,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'District',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(NUM,PROT)                                                  
IDDISTIN DFLD  POS=(2,11),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'PC-id',                                                +        
               POS=(2,19),LTH=5,                                       +        
               ATTR=(PROT)                                                      
IDANSTIN DFLD  POS=(2,25),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDDISTUT DFLD  POS=(3,11),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
IDANSTUT DFLD  POS=(3,25),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'District  Value',                                      +        
               POS=(5,4),LTH=15,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'C From To   From   To',                                +        
               POS=(6,2),LTH=21,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Resp. Name',                                           +        
               POS=(6,28),LTH=10,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Print  Upd by   Date',                                 +        
               POS=(6,60),LTH=20,                                      +        
               ATTR=(PROT)                                                      
KDCMD1   DFLD  POS=(7,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
DISTRF1  DFLD  POS=(7,4),LTH=4,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
DISTRT1  DFLD  POS=(7,9),LTH=4,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
SUKREF1  DFLD  POS=(7,14),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
SUKRET1  DFLD  POS=(7,21),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
IDANST1  DFLD  POS=(7,28),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
BEANST1  DFLD  POS=(7,34),LTH=25,                                      +        
               ATTR=(NUM,PROT)                                                  
FLPRT1   DFLD  POS=(7,60),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
IDUPD1   DFLD  POS=(7,68),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
TIUPD1   DFLD  POS=(7,74),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
KDCMD2   DFLD  POS=(8,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
DISTRF2  DFLD  POS=(8,4),LTH=4,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
DISTRT2  DFLD  POS=(8,9),LTH=4,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
SUKREF2  DFLD  POS=(8,14),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
SUKRET2  DFLD  POS=(8,21),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
IDANST2  DFLD  POS=(8,28),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
BEANST2  DFLD  POS=(8,34),LTH=25,                                      +        
               ATTR=(NUM,PROT)                                                  
FLPRT2   DFLD  POS=(8,60),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
IDUPD2   DFLD  POS=(8,68),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
TIUPD2   DFLD  POS=(8,74),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
KDCMD3   DFLD  POS=(9,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
DISTRF3  DFLD  POS=(9,4),LTH=4,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
DISTRT3  DFLD  POS=(9,9),LTH=4,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
SUKREF3  DFLD  POS=(9,14),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
SUKRET3  DFLD  POS=(9,21),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
IDANST3  DFLD  POS=(9,28),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
BEANST3  DFLD  POS=(9,34),LTH=25,                                      +        
               ATTR=(NUM,PROT)                                                  
FLPRT3   DFLD  POS=(9,60),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
IDUPD3   DFLD  POS=(9,68),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
TIUPD3   DFLD  POS=(9,74),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
KDCMD4   DFLD  POS=(10,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DISTRF4  DFLD  POS=(10,4),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DISTRT4  DFLD  POS=(10,9),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
SUKREF4  DFLD  POS=(10,14),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
SUKRET4  DFLD  POS=(10,21),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
IDANST4  DFLD  POS=(10,28),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
BEANST4  DFLD  POS=(10,34),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
FLPRT4   DFLD  POS=(10,60),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
IDUPD4   DFLD  POS=(10,68),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
TIUPD4   DFLD  POS=(10,74),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
KDCMD5   DFLD  POS=(11,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DISTRF5  DFLD  POS=(11,4),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DISTRT5  DFLD  POS=(11,9),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
SUKREF5  DFLD  POS=(11,14),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
SUKRET5  DFLD  POS=(11,21),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
IDANST5  DFLD  POS=(11,28),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
BEANST5  DFLD  POS=(11,34),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
FLPRT5   DFLD  POS=(11,60),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
IDUPD5   DFLD  POS=(11,68),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
TIUPD5   DFLD  POS=(11,74),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
KDCMD6   DFLD  POS=(12,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DISTRF6  DFLD  POS=(12,4),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DISTRT6  DFLD  POS=(12,9),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
SUKREF6  DFLD  POS=(12,14),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
SUKRET6  DFLD  POS=(12,21),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
IDANST6  DFLD  POS=(12,28),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
BEANST6  DFLD  POS=(12,34),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
FLPRT6   DFLD  POS=(12,60),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
IDUPD6   DFLD  POS=(12,68),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
TIUPD6   DFLD  POS=(12,74),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
KDCMD7   DFLD  POS=(13,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DISTRF7  DFLD  POS=(13,4),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DISTRT7  DFLD  POS=(13,9),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
SUKREF7  DFLD  POS=(13,14),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
SUKRET7  DFLD  POS=(13,21),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
IDANST7  DFLD  POS=(13,28),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
BEANST7  DFLD  POS=(13,34),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
FLPRT7   DFLD  POS=(13,60),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
IDUPD7   DFLD  POS=(13,68),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
TIUPD7   DFLD  POS=(13,74),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
KDCMD8   DFLD  POS=(14,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DISTRF8  DFLD  POS=(14,4),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DISTRT8  DFLD  POS=(14,9),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
SUKREF8  DFLD  POS=(14,14),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
SUKRET8  DFLD  POS=(14,21),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
IDANST8  DFLD  POS=(14,28),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
BEANST8  DFLD  POS=(14,34),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
FLPRT8   DFLD  POS=(14,60),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
IDUPD8   DFLD  POS=(14,68),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
TIUPD8   DFLD  POS=(14,74),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
KDCMD9   DFLD  POS=(15,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DISTRF9  DFLD  POS=(15,4),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DISTRT9  DFLD  POS=(15,9),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
SUKREF9  DFLD  POS=(15,14),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
SUKRET9  DFLD  POS=(15,21),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
IDANST9  DFLD  POS=(15,28),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
BEANST9  DFLD  POS=(15,34),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
FLPRT9   DFLD  POS=(15,60),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
IDUPD9   DFLD  POS=(15,68),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
TIUPD9   DFLD  POS=(15,74),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
KDCMD10  DFLD  POS=(16,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DISTRF10 DFLD  POS=(16,4),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DISTRT10 DFLD  POS=(16,9),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
SUKREF10 DFLD  POS=(16,14),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
SUKRET10 DFLD  POS=(16,21),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
IDANST10 DFLD  POS=(16,28),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
BEANST10 DFLD  POS=(16,34),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
FLPRT10  DFLD  POS=(16,60),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
IDUPD10  DFLD  POS=(16,68),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
TIUPD10  DFLD  POS=(16,74),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'New/Change',                                           +        
               POS=(18,2),LTH=10,                                      +        
               ATTR=(PROT)                                                      
KDCMDUPD DFLD  POS=(19,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DISTFUPD DFLD  POS=(19,4),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
DISTTUPD DFLD  POS=(19,9),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
SUKREFUP DFLD  POS=(19,14),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
SUKRETUP DFLD  POS=(19,21),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
IDANSTUP DFLD  POS=(19,28),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
BEANSTUP DFLD  POS=(19,34),LTH=25,                                     +        
               ATTR=(NOPROT)                                                    
FLPRTUPD DFLD  POS=(19,60),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'F7=First   F8=Forward   F10=WHELP  F11=Update   F12=Log+        
               off',                                                   +        
               POS=(22,2),LTH=58,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O708N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N708,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I708N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  IDDISTIN,                                               +        
               LTH=2                                                            
         MFLD  IDDISTUT,                                               +        
               LTH=4                                                            
         MFLD  IDANSTIN,                                               +        
               LTH=2                                                            
         MFLD  IDANSTUT,                                               +        
               LTH=5                                                            
         MFLD  KDCMD1,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISTRF1,                                                +        
               LTH=4                                                            
         MFLD  DISTRT1,                                                +        
               LTH=4                                                            
         MFLD  SUKREF1,                                                +        
               LTH=6                                                            
         MFLD  SUKRET1,                                                +        
               LTH=6                                                            
         MFLD  IDANST1,                                                +        
               LTH=5                                                            
         MFLD  BEANST1,                                                +        
               LTH=25                                                           
         MFLD  FLPRT1,                                                 +        
               LTH=1                                                            
         MFLD  IDUPD1,                                                 +        
               LTH=5                                                            
         MFLD  TIUPD1,                                                 +        
               LTH=6                                                            
         MFLD  KDCMD2,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISTRF2,                                                +        
               LTH=4                                                            
         MFLD  DISTRT2,                                                +        
               LTH=4                                                            
         MFLD  SUKREF2,                                                +        
               LTH=6                                                            
         MFLD  SUKRET2,                                                +        
               LTH=6                                                            
         MFLD  IDANST2,                                                +        
               LTH=5                                                            
         MFLD  BEANST2,                                                +        
               LTH=25                                                           
         MFLD  FLPRT2,                                                 +        
               LTH=1                                                            
         MFLD  IDUPD2,                                                 +        
               LTH=5                                                            
         MFLD  TIUPD2,                                                 +        
               LTH=6                                                            
         MFLD  KDCMD3,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISTRF3,                                                +        
               LTH=4                                                            
         MFLD  DISTRT3,                                                +        
               LTH=4                                                            
         MFLD  SUKREF3,                                                +        
               LTH=6                                                            
         MFLD  SUKRET3,                                                +        
               LTH=6                                                            
         MFLD  IDANST3,                                                +        
               LTH=5                                                            
         MFLD  BEANST3,                                                +        
               LTH=25                                                           
         MFLD  FLPRT3,                                                 +        
               LTH=1                                                            
         MFLD  IDUPD3,                                                 +        
               LTH=5                                                            
         MFLD  TIUPD3,                                                 +        
               LTH=6                                                            
         MFLD  KDCMD4,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISTRF4,                                                +        
               LTH=4                                                            
         MFLD  DISTRT4,                                                +        
               LTH=4                                                            
         MFLD  SUKREF4,                                                +        
               LTH=6                                                            
         MFLD  SUKRET4,                                                +        
               LTH=6                                                            
         MFLD  IDANST4,                                                +        
               LTH=5                                                            
         MFLD  BEANST4,                                                +        
               LTH=25                                                           
         MFLD  FLPRT4,                                                 +        
               LTH=1                                                            
         MFLD  IDUPD4,                                                 +        
               LTH=5                                                            
         MFLD  TIUPD4,                                                 +        
               LTH=6                                                            
         MFLD  KDCMD5,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISTRF5,                                                +        
               LTH=4                                                            
         MFLD  DISTRT5,                                                +        
               LTH=4                                                            
         MFLD  SUKREF5,                                                +        
               LTH=6                                                            
         MFLD  SUKRET5,                                                +        
               LTH=6                                                            
         MFLD  IDANST5,                                                +        
               LTH=5                                                            
         MFLD  BEANST5,                                                +        
               LTH=25                                                           
         MFLD  FLPRT5,                                                 +        
               LTH=1                                                            
         MFLD  IDUPD5,                                                 +        
               LTH=5                                                            
         MFLD  TIUPD5,                                                 +        
               LTH=6                                                            
         MFLD  KDCMD6,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISTRF6,                                                +        
               LTH=4                                                            
         MFLD  DISTRT6,                                                +        
               LTH=4                                                            
         MFLD  SUKREF6,                                                +        
               LTH=6                                                            
         MFLD  SUKRET6,                                                +        
               LTH=6                                                            
         MFLD  IDANST6,                                                +        
               LTH=5                                                            
         MFLD  BEANST6,                                                +        
               LTH=25                                                           
         MFLD  FLPRT6,                                                 +        
               LTH=1                                                            
         MFLD  IDUPD6,                                                 +        
               LTH=5                                                            
         MFLD  TIUPD6,                                                 +        
               LTH=6                                                            
         MFLD  KDCMD7,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISTRF7,                                                +        
               LTH=4                                                            
         MFLD  DISTRT7,                                                +        
               LTH=4                                                            
         MFLD  SUKREF7,                                                +        
               LTH=6                                                            
         MFLD  SUKRET7,                                                +        
               LTH=6                                                            
         MFLD  IDANST7,                                                +        
               LTH=5                                                            
         MFLD  BEANST7,                                                +        
               LTH=25                                                           
         MFLD  FLPRT7,                                                 +        
               LTH=1                                                            
         MFLD  IDUPD7,                                                 +        
               LTH=5                                                            
         MFLD  TIUPD7,                                                 +        
               LTH=6                                                            
         MFLD  KDCMD8,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISTRF8,                                                +        
               LTH=4                                                            
         MFLD  DISTRT8,                                                +        
               LTH=4                                                            
         MFLD  SUKREF8,                                                +        
               LTH=6                                                            
         MFLD  SUKRET8,                                                +        
               LTH=6                                                            
         MFLD  IDANST8,                                                +        
               LTH=5                                                            
         MFLD  BEANST8,                                                +        
               LTH=25                                                           
         MFLD  FLPRT8,                                                 +        
               LTH=1                                                            
         MFLD  IDUPD8,                                                 +        
               LTH=5                                                            
         MFLD  TIUPD8,                                                 +        
               LTH=6                                                            
         MFLD  KDCMD9,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISTRF9,                                                +        
               LTH=4                                                            
         MFLD  DISTRT9,                                                +        
               LTH=4                                                            
         MFLD  SUKREF9,                                                +        
               LTH=6                                                            
         MFLD  SUKRET9,                                                +        
               LTH=6                                                            
         MFLD  IDANST9,                                                +        
               LTH=5                                                            
         MFLD  BEANST9,                                                +        
               LTH=25                                                           
         MFLD  FLPRT9,                                                 +        
               LTH=1                                                            
         MFLD  IDUPD9,                                                 +        
               LTH=5                                                            
         MFLD  TIUPD9,                                                 +        
               LTH=6                                                            
         MFLD  KDCMD10,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISTRF10,                                               +        
               LTH=4                                                            
         MFLD  DISTRT10,                                               +        
               LTH=4                                                            
         MFLD  SUKREF10,                                               +        
               LTH=6                                                            
         MFLD  SUKRET10,                                               +        
               LTH=6                                                            
         MFLD  IDANST10,                                               +        
               LTH=5                                                            
         MFLD  BEANST10,                                               +        
               LTH=25                                                           
         MFLD  FLPRT10,                                                +        
               LTH=1                                                            
         MFLD  IDUPD10,                                                +        
               LTH=5                                                            
         MFLD  TIUPD10,                                                +        
               LTH=6                                                            
         MFLD  KDCMDUPD,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISTFUPD,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISTTUPD,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SUKREFUP,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SUKRETUP,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDANSTUP,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BEANSTUP,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLPRTUPD,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I708N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N708),                                           +        
               OPT=2,                                                  +        
               NXT=W4O708N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F8'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '47082',                                                +        
               LTH=5                                                            
         MFLD  (IDDISTIN,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDANSTIN,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDCMD1,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  DISTRF1,                                                +        
               LTH=4                                                            
         MFLD  DISTRT1,                                                +        
               LTH=4                                                            
         MFLD  SUKREF1,                                                +        
               LTH=6                                                            
         MFLD  SUKRET1,                                                +        
               LTH=6                                                            
         MFLD  (KDCMD2,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  DISTRF2,                                                +        
               LTH=4                                                            
         MFLD  DISTRT2,                                                +        
               LTH=4                                                            
         MFLD  SUKREF2,                                                +        
               LTH=6                                                            
         MFLD  SUKRET2,                                                +        
               LTH=6                                                            
         MFLD  (KDCMD3,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  DISTRF3,                                                +        
               LTH=4                                                            
         MFLD  DISTRT3,                                                +        
               LTH=4                                                            
         MFLD  SUKREF3,                                                +        
               LTH=6                                                            
         MFLD  SUKRET3,                                                +        
               LTH=6                                                            
         MFLD  (KDCMD4,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  DISTRF4,                                                +        
               LTH=4                                                            
         MFLD  DISTRT4,                                                +        
               LTH=4                                                            
         MFLD  SUKREF4,                                                +        
               LTH=6                                                            
         MFLD  SUKRET4,                                                +        
               LTH=6                                                            
         MFLD  (KDCMD5,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  DISTRF5,                                                +        
               LTH=4                                                            
         MFLD  DISTRT5,                                                +        
               LTH=4                                                            
         MFLD  SUKREF5,                                                +        
               LTH=6                                                            
         MFLD  SUKRET5,                                                +        
               LTH=6                                                            
         MFLD  (KDCMD6,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  DISTRF6,                                                +        
               LTH=4                                                            
         MFLD  DISTRT6,                                                +        
               LTH=4                                                            
         MFLD  SUKREF6,                                                +        
               LTH=6                                                            
         MFLD  SUKRET6,                                                +        
               LTH=6                                                            
         MFLD  (KDCMD7,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  DISTRF7,                                                +        
               LTH=4                                                            
         MFLD  DISTRT7,                                                +        
               LTH=4                                                            
         MFLD  SUKREF7,                                                +        
               LTH=6                                                            
         MFLD  SUKRET7,                                                +        
               LTH=6                                                            
         MFLD  (KDCMD8,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  DISTRF8,                                                +        
               LTH=4                                                            
         MFLD  DISTRT8,                                                +        
               LTH=4                                                            
         MFLD  SUKREF8,                                                +        
               LTH=6                                                            
         MFLD  SUKRET8,                                                +        
               LTH=6                                                            
         MFLD  (KDCMD9,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  DISTRF9,                                                +        
               LTH=4                                                            
         MFLD  DISTRT9,                                                +        
               LTH=4                                                            
         MFLD  SUKREF9,                                                +        
               LTH=6                                                            
         MFLD  SUKRET9,                                                +        
               LTH=6                                                            
         MFLD  (KDCMD10,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  DISTRF10,                                               +        
               LTH=4                                                            
         MFLD  DISTRT10,                                               +        
               LTH=4                                                            
         MFLD  SUKREF10,                                               +        
               LTH=6                                                            
         MFLD  SUKRET10,                                               +        
               LTH=6                                                            
         MFLD  (KDCMDUPD,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (DISTFUPD,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DISTTUPD,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (SUKREFUP,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (SUKRETUP,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDANSTUP,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (BEANSTUP,                                              +        
               '+++++++++++++++++++++++++'),                           +        
               LTH=25,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLPRTUPD,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
