***********************************************************************         
* CREATED BY PC70375   ON 99/01/25  AT 13:33                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'RETURN PERMISSION UNPACKING     '                               
W4N705   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T701  ',                                          +        
               14='W4T702  ',                                          +        
               15='W4T703  ',                                          +        
               16='W4T704  ',                                          +        
               17='W4T705  ',                                          +        
               18='W4T706  ',                                          +        
               19='W4T707  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501   ',                                         +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4N705   DPAGE CURSOR=((2,9)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'RETURN PERMISSION UNPACKING',                          +        
               POS=(1,11),LTH=27,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Distr',                                                +        
               POS=(2,2),LTH=5,                                        +        
               ATTR=(NUM,PROT)                                                  
DISTRIN  DFLD  POS=(2,9),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Cust',                                                 +        
               POS=(2,16),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KUNDIN   DFLD  POS=(2,22),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Report No',                                            +        
               POS=(2,31),LTH=9,                                       +        
               ATTR=(PROT)                                                      
RAPPNRIN DFLD  POS=(2,42),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
DISTRUT  DFLD  POS=(3,9),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
KUNDUT   DFLD  POS=(3,22),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
RAPPNRUT DFLD  POS=(3,42),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Case',                                                 +        
               POS=(5,28),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'LC',                                                   +        
               POS=(5,37),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Freight    Insurance  Leg',                            +        
               POS=(5,44),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Order Inv.No  Prod.No  From  To',                      +        
               POS=(6,2),LTH=31,                                       +        
               ATTR=(PROT)                                                      
LC       DFLD  POS=(6,37),LTH=6,                                       +        
               ATTR=(NOPROT)                                                    
FRAKT    DFLD  POS=(6,44),LTH=10,                                      +        
               ATTR=(NUM,NOPROT)                                                
FORS     DFLD  POS=(6,55),LTH=10,                                      +        
               ATTR=(NUM,NOPROT)                                                
LEGAL    DFLD  POS=(6,66),LTH=10,                                      +        
               ATTR=(NUM,NOPROT)                                                
ORDERNR  DFLD  POS=(7,2),LTH=5,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDFAKT   DFLD  POS=(7,8),LTH=7,                                        +        
               ATTR=(NUM,NOPROT)                                                
PRODNR   DFLD  POS=(7,16),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
KOLLIF1  DFLD  POS=(7,24),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
KOLLIT1  DFLD  POS=(7,31),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
KOLLIF2  DFLD  POS=(8,24),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
KOLLIT2  DFLD  POS=(8,31),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
KOLLIF3  DFLD  POS=(9,24),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
KOLLIT3  DFLD  POS=(9,31),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
KOLLIF4  DFLD  POS=(10,24),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
KOLLIT4  DFLD  POS=(10,31),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
KOLLIF5  DFLD  POS=(11,24),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
KOLLIT5  DFLD  POS=(11,31),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
KOLLIF6  DFLD  POS=(12,24),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
KOLLIT6  DFLD  POS=(12,31),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
KOLLIF7  DFLD  POS=(13,24),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
KOLLIT7  DFLD  POS=(13,31),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
KOLLIF8  DFLD  POS=(14,24),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
KOLLIT8  DFLD  POS=(14,31),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
KOLLIF9  DFLD  POS=(15,24),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
KOLLIT9  DFLD  POS=(15,31),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
KOLLIF10 DFLD  POS=(16,24),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
KOLLIT10 DFLD  POS=(16,31),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
KOLLIF11 DFLD  POS=(17,24),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
KOLLIT11 DFLD  POS=(17,31),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
KOLLIF12 DFLD  POS=(18,24),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
KOLLIT12 DFLD  POS=(18,31),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
KOLLIF13 DFLD  POS=(19,24),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
KOLLIT13 DFLD  POS=(19,31),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '13 Resp. tabel  14 Analysis No  15 List Discr.  16 Reg.+        
                Discr.  17 Reg. Unpack.',                              +        
               POS=(21,2),LTH=79,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 Time limits  19',                                   +        
               POS=(22,2),LTH=18,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '22 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O705N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N705,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I705N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4N705                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DISTRIN,                                                +        
               LTH=4                                                            
         MFLD  DISTRUT,                                                +        
               LTH=4                                                            
         MFLD  KUNDIN,                                                 +        
               LTH=6                                                            
         MFLD  KUNDUT,                                                 +        
               LTH=6                                                            
         MFLD  RAPPNRIN,                                               +        
               LTH=7                                                            
         MFLD  RAPPNRUT,                                               +        
               LTH=7                                                            
         MFLD  LC,                                                     +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FRAKT,                                                  +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FORS,                                                   +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  LEGAL,                                                  +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ORDERNR,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDFAKT,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRODNR,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLIF1,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLIT1,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLIF2,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLIT2,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLIF3,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLIT3,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLIF4,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLIT4,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLIF5,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLIT5,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLIF6,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLIT6,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLIF7,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLIT7,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLIF8,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLIT8,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLIF9,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLIT9,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLIF10,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLIT10,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLIF11,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLIT11,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLIF12,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLIT12,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLIF13,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLIT13,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I705N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N705),                                           +        
               OPT=2,                                                  +        
               NXT=W4O705N1                                                     
MID      LPAGE SOR=(W4N705)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  (FLD0102,                                               +        
               '4'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  (FLD0104,                                               +        
               '7'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  (FLD0106,                                               +        
               '0'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0108,                                               +        
               '5'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '47052',                                                +        
               LTH=5                                                            
         MFLD  (DISTRIN,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DISTRUT,                                                +        
               LTH=4                                                            
         MFLD  (KUNDIN,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KUNDUT,                                                 +        
               LTH=6                                                            
         MFLD  (RAPPNRIN,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  RAPPNRUT,                                               +        
               LTH=7                                                            
         MFLD  (LC,                                                    +        
               '++++++'),                                              +        
               LTH=6                                                            
         MFLD  (FRAKT,                                                 +        
               '++++++++++'),                                          +        
               LTH=10                                                           
         MFLD  (FORS,                                                  +        
               '++++++++++'),                                          +        
               LTH=10                                                           
         MFLD  (LEGAL,                                                 +        
               '++++++++++'),                                          +        
               LTH=10                                                           
         MFLD  (ORDERNR,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDFAKT,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PRODNR,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOLLIF1,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOLLIT1,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOLLIF2,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOLLIT2,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOLLIF3,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOLLIT3,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOLLIF4,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOLLIT4,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOLLIF5,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOLLIT5,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOLLIF6,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOLLIT6,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOLLIF7,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOLLIT7,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOLLIF8,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOLLIT8,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOLLIF9,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOLLIT9,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOLLIF10,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOLLIT10,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOLLIF11,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOLLIT11,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOLLIF12,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOLLIT12,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOLLIF13,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOLLIT13,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
