***********************************************************************         
* CREATED BY VX70375   ON 09/10/27  AT 14:56                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'LEVERANSANM RAD - DETALJ        '                               
W4N722   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W4T722 4',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T722U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T721  ',                                          +        
               14='W4T722  ',                                          +        
               15='W4T723  ',                                          +        
               16='W4T724  ',                                          +        
               17='W4T725  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W4T722V ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4N722   DPAGE CURSOR=((2,8)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DISCR. LINE - DETAIL',                                 +        
               POS=(1,11),LTH=20,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Distr',                                                +        
               POS=(2,2),LTH=5,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDDISTRI DFLD  POS=(2,8),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Cust',                                                 +        
               POS=(2,14),LTH=4,                                       +        
               ATTR=(PROT)                                                      
IDKUNDNI DFLD  POS=(2,19),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DR No.',                                               +        
               POS=(2,27),LTH=6,                                       +        
               ATTR=(PROT)                                                      
IDRAPPNI DFLD  POS=(2,34),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Part No.',                                             +        
               POS=(2,42),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
IDARTNRI DFLD  POS=(2,51),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Line',                                                 +        
               POS=(2,61),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
IDRADNRI DFLD  POS=(2,66),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDDISTRU DFLD  POS=(3,8),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
IDKUNDNU DFLD  POS=(3,19),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
IDRAPPNU DFLD  POS=(3,34),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
IDARTNRU DFLD  POS=(3,51),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
IDRADNRU DFLD  POS=(3,65),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Trea.Code',                                            +        
               POS=(5,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
KDKREBEH DFLD  POS=(5,12),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Referral  (Y/N)',                                      +        
               POS=(5,16),LTH=15,                                      +        
               ATTR=(PROT)                                                      
FLSVAR   DFLD  POS=(5,32),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Resp',                                                 +        
               POS=(5,34),LTH=4,                                       +        
               ATTR=(PROT)                                                      
IDANSV   DFLD  POS=(5,39),LTH=6,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Printer',                                              +        
               POS=(5,46),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
IDPRT    DFLD  POS=(5,54),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Table',                                                +        
               POS=(5,58),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
IDBORD   DFLD  POS=(5,64),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Currency',                                             +        
               POS=(5,68),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
KDVALISO DFLD  POS=(5,77),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Description',                                          +        
               POS=(6,2),LTH=11,                                       +        
               ATTR=(PROT)                                                      
BEART    DFLD  POS=(6,14),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Return OK',                                            +        
               POS=(6,41),LTH=9,                                       +        
               ATTR=(PROT)                                                      
FLRET    DFLD  POS=(6,51),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'LPC',                                                  +        
               POS=(6,54),LTH=3,                                       +        
               ATTR=(PROT)                                                      
KDPSLLOC DFLD  POS=(6,74),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Code',                                                 +        
               POS=(7,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
KDANMORS DFLD  POS=(7,21),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KODIN    DFLD  POS=(7,25),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Ordered qty.',                                         +        
               POS=(7,31),LTH=12,                                      +        
               ATTR=(PROT)                                                      
KVBEART  DFLD  POS=(7,45),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Storage',                                              +        
               POS=(7,54),LTH=7,                                       +        
               ATTR=(PROT)                                                      
ADLAGOMR DFLD  POS=(7,65),LTH=2,                                       +        
               ATTR=(PROT)                                                      
ADGANG   DFLD  POS=(7,68),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
ADPLAT   DFLD  POS=(7,71),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Part No.',                                             +        
               POS=(8,2),LTH=8,                                        +        
               ATTR=(PROT)                                                      
IDARTNR  DFLD  POS=(8,13),LTH=10,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Delivered qty',                                        +        
               POS=(8,31),LTH=13,                                      +        
               ATTR=(PROT)                                                      
KVLEVANT DFLD  POS=(8,45),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Ls',                                                   +        
               POS=(8,54),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KVLS     DFLD  POS=(8,68),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Qty.',                                                 +        
               POS=(9,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
KVRETINL DFLD  POS=(9,17),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Gro. weight',                                          +        
               POS=(9,31),LTH=11,                                      +        
               ATTR=(PROT)                                                      
VKORDBTO DFLD  POS=(9,43),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Pb',                                                   +        
               POS=(9,54),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KVPB     DFLD  POS=(9,67),LTH=9,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Price',                                                +        
               POS=(10,2),LTH=5,                                       +        
               ATTR=(PROT)                                                      
PRARTNTO DFLD  POS=(10,9),LTH=10,                                      +        
               ATTR=(PROT)                                                      
DGIA0001 DFLD  POS=(10,20),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Net diff',                                             +        
               POS=(10,31),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
NTODIFF  DFLD  POS=(10,42),LTH=9,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Sup. code',                                            +        
               POS=(10,54),LTH=9,                                      +        
               ATTR=(PROT)                                                      
KDERS    DFLD  POS=(10,74),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Order',                                                +        
               POS=(11,2),LTH=5,                                       +        
               ATTR=(PROT)                                                      
IDORDER  DFLD  POS=(11,18),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Tare',                                                 +        
               POS=(11,31),LTH=4,                                      +        
               ATTR=(PROT)                                                      
VKTARA   DFLD  POS=(11,43),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Net weight',                                           +        
               POS=(11,54),LTH=10,                                     +        
               ATTR=(PROT)                                                      
VKART    DFLD  POS=(11,69),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Case',                                                 +        
               POS=(12,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
IDKOLLI  DFLD  POS=(12,18),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Case code',                                            +        
               POS=(12,31),LTH=9,                                      +        
               ATTR=(PROT)                                                      
KDKOLLI  DFLD  POS=(12,43),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Gro. price',                                           +        
               POS=(12,54),LTH=10,                                     +        
               ATTR=(PROT)                                                      
PRARTBTO DFLD  POS=(12,66),LTH=10,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Invoice',                                              +        
               POS=(13,2),LTH=7,                                       +        
               ATTR=(PROT)                                                      
IDFAKT   DFLD  POS=(13,10),LTH=9,                                      +        
               ATTR=(PROT)                                                      
DGIA0000 DFLD  POS=(13,20),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Class',                                                +        
               POS=(13,31),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KDORDKL  DFLD  POS=(13,50),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Cost price',                                           +        
               POS=(13,54),LTH=10,                                     +        
               ATTR=(PROT)                                                      
PRINK    DFLD  POS=(13,66),LTH=10,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Invoice date',                                         +        
               POS=(14,2),LTH=12,                                      +        
               ATTR=(PROT)                                                      
TIFAKT   DFLD  POS=(14,15),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0002 DFLD  POS=(14,22),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Dir. del.',                                            +        
               POS=(14,31),LTH=9,                                      +        
               ATTR=(PROT)                                                      
FLDIRLEV DFLD  POS=(14,50),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Prod grp.',                                            +        
               POS=(14,54),LTH=9,                                      +        
               ATTR=(PROT)                                                      
KDPRODSL DFLD  POS=(14,74),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Text exists',                                          +        
               POS=(15,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
FLTEXT   DFLD  POS=(15,22),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Packer',                                               +        
               POS=(15,31),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDUSERP  DFLD  POS=(15,43),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Func grp.',                                            +        
               POS=(15,54),LTH=9,                                      +        
               ATTR=(PROT)                                                      
IDKFNGRP DFLD  POS=(15,72),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'DC',                                                   +        
               POS=(16,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DC       DFLD  POS=(16,21),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Prodnr',                                               +        
               POS=(16,31),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDPRODNR DFLD  POS=(16,44),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Inv.date',                                             +        
               POS=(16,54),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIINVDAT DFLD  POS=(16,71),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Total qty.',                                           +        
               POS=(17,2),LTH=10,                                      +        
               ATTR=(PROT)                                                      
SUANM    DFLD  POS=(17,17),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Qty. lines',                                           +        
               POS=(17,31),LTH=10,                                     +        
               ATTR=(PROT)                                                      
KVRADER  DFLD  POS=(17,46),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Inv.qty',                                              +        
               POS=(17,54),LTH=7,                                      +        
               ATTR=(PROT)                                                      
KVINVS   DFLD  POS=(17,69),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Reg. resp',                                            +        
               POS=(18,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
REGANSV  DFLD  POS=(18,15),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Volume',                                               +        
               POS=(18,31),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KLIVOL   DFLD  POS=(18,43),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Procurer',                                             +        
               POS=(18,54),LTH=8,                                      +        
               ATTR=(PROT)                                                      
IDANSK   DFLD  POS=(18,73),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Reg. date',                                            +        
               POS=(19,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
REGDAT   DFLD  POS=(19,17),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Freight code',                                         +        
               POS=(19,31),LTH=12,                                     +        
               ATTR=(PROT)                                                      
KDFRAKT  DFLD  POS=(19,49),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Freight co.',                                          +        
               POS=(19,54),LTH=11,                                     +        
               ATTR=(PROT)                                                      
PRFRAKT  DFLD  POS=(19,66),LTH=10,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '13 Line queue   14 Descr. line   15 Discr. Text   16 Di+        
               scr. Part  17 Case-info',                               +        
               POS=(21,2),LTH=78,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,35),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,52),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 whelp',                                             +        
               POS=(22,68),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W4O722N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N722,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I722N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4N722                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDDISTRI,                                               +        
               LTH=4                                                            
         MFLD  IDKUNDNI,                                               +        
               LTH=6                                                            
         MFLD  IDRAPPNI,                                               +        
               LTH=7                                                            
         MFLD  IDARTNRI,                                               +        
               LTH=9                                                            
         MFLD  IDRADNRI,                                               +        
               LTH=4                                                            
         MFLD  IDDISTRU,                                               +        
               LTH=4                                                            
         MFLD  IDKUNDNU,                                               +        
               LTH=6                                                            
         MFLD  IDRAPPNU,                                               +        
               LTH=7                                                            
         MFLD  IDARTNRU,                                               +        
               LTH=9                                                            
         MFLD  IDRADNRU,                                               +        
               LTH=4                                                            
         MFLD  KDKREBEH,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLSVAR,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDANSV,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDPRT,                                                  +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDBORD,                                                 +        
               LTH=3                                                            
         MFLD  FLRET,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDVALISO,                                               +        
               LTH=3                                                            
         MFLD  BEART,                                                  +        
               LTH=25                                                           
         MFLD  KDPSLLOC,                                               +        
               LTH=2                                                            
         MFLD  KDANMORS,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KODIN,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTNR,                                                +        
               LTH=10                                                           
         MFLD  KVRETINL,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRARTNTO,                                               +        
               LTH=10                                                           
         MFLD  DGIA0001,                                               +        
               LTH=10                                                           
         MFLD  IDORDER,                                                +        
               LTH=5                                                            
         MFLD  IDKOLLI,                                                +        
               LTH=5                                                            
         MFLD  IDFAKT,                                                 +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0000,                                               +        
               LTH=9                                                            
         MFLD  TIFAKT,                                                 +        
               LTH=6                                                            
         MFLD  DGIA0002,                                               +        
               LTH=6                                                            
         MFLD  FLTEXT,                                                 +        
               LTH=1                                                            
         MFLD  DC,                                                     +        
               LTH=2                                                            
         MFLD  SUANM,                                                  +        
               LTH=6                                                            
         MFLD  REGANSV,                                                +        
               LTH=8                                                            
         MFLD  REGDAT,                                                 +        
               LTH=6                                                            
         MFLD  KVBEART,                                                +        
               LTH=6                                                            
         MFLD  KVLEVANT,                                               +        
               LTH=6                                                            
         MFLD  VKORDBTO,                                               +        
               LTH=8                                                            
         MFLD  NTODIFF,                                                +        
               LTH=9                                                            
         MFLD  VKTARA,                                                 +        
               LTH=8                                                            
         MFLD  KDKOLLI,                                                +        
               LTH=8                                                            
         MFLD  KDORDKL,                                                +        
               LTH=1                                                            
         MFLD  FLDIRLEV,                                               +        
               LTH=1                                                            
         MFLD  IDUSERP,                                                +        
               LTH=8                                                            
         MFLD  IDPRODNR,                                               +        
               LTH=7                                                            
         MFLD  KVRADER,                                                +        
               LTH=5                                                            
         MFLD  KLIVOL,                                                 +        
               LTH=8                                                            
         MFLD  KDFRAKT,                                                +        
               LTH=2                                                            
         MFLD  ADLAGOMR,                                               +        
               LTH=2                                                            
         MFLD  ADGANG,                                                 +        
               LTH=2                                                            
         MFLD  ADPLAT,                                                 +        
               LTH=5                                                            
         MFLD  KVLS,                                                   +        
               LTH=8                                                            
         MFLD  KVPB,                                                   +        
               LTH=9                                                            
         MFLD  KDERS,                                                  +        
               LTH=2                                                            
         MFLD  VKART,                                                  +        
               LTH=7                                                            
         MFLD  PRARTBTO,                                               +        
               LTH=10                                                           
         MFLD  PRINK,                                                  +        
               LTH=10                                                           
         MFLD  KDPRODSL,                                               +        
               LTH=2                                                            
         MFLD  IDKFNGRP,                                               +        
               LTH=4                                                            
         MFLD  TIINVDAT,                                               +        
               LTH=5                                                            
         MFLD  KVINVS,                                                 +        
               LTH=8                                                            
         MFLD  IDANSK,                                                 +        
               LTH=3                                                            
         MFLD  PRFRAKT,                                                +        
               LTH=10                                                           
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I722N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N722),                                           +        
               OPT=2,                                                  +        
               NXT=W4O722N1                                                     
MID      LPAGE SOR=(W4N722)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '47222',                                                +        
               LTH=5                                                            
         MFLD  (IDDISTRI,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDISTRU,                                               +        
               LTH=4                                                            
         MFLD  (IDKUNDNI,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDKUNDNU,                                               +        
               LTH=6                                                            
         MFLD  (IDRAPPNI,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDRAPPNU,                                               +        
               LTH=7                                                            
         MFLD  (IDARTNRI,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDARTNRU,                                               +        
               LTH=9                                                            
         MFLD  (IDRADNRI,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDRADNRU,                                               +        
               LTH=4                                                            
         MFLD  (KDKREBEH,                                              +        
               '+++'),                                                 +        
               LTH=3                                                            
         MFLD  (FLSVAR,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (IDANSV,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDPRT,                                                 +        
               '+++'),                                                 +        
               LTH=3                                                            
         MFLD  (KODIN,                                                 +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  (FLRET,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
