***********************************************************************         
* CREATED BY V070375   ON 08/07/15  AT 11:17                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'HANDLING FEE STEERING           '                               
W4N719   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T719 7',                                           +        
               8='W4T719 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T719U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W00501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W4T719U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,11)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'HANDLING FEE STEERING',                                +        
               POS=(1,11),LTH=21,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Parma No',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(NUM,PROT)                                                  
IDPARTIN DFLD  POS=(2,11),LTH=9,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'CC',                                                   +        
               POS=(2,21),LTH=2                                        +        
               ATTR=(NUM,PROT)                                                  
IDFTGIN  DFLD  POS=(2,24),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'District',                                             +        
               POS=(2,27),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DISTIN   DFLD  POS=(2,36),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Customer',                                             +        
               POS=(2,41),LTH=8,                                       +        
               ATTR=(PROT)                                                      
KUNDIN   DFLD  POS=(2,50),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDPARTUT DFLD  POS=(3,11),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
IDFTGUT  DFLD  POS=(3,24),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DISTUT   DFLD  POS=(3,36),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
KUNDUT   DFLD  POS=(3,50),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Invoice when total is',                                +        
               POS=(5,2),LTH=21,                                       +        
               ATTR=(NUM,PROT)                                                  
SUMMA    DFLD  POS=(5,25),LTH=10,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'SEK',                                                  +        
               POS=(5,38),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'or at the yearend',                                    +        
               POS=(5,49),LTH=17,                                      +        
               ATTR=(NUM,PROT)                                                  
SUMMAUPD DFLD  POS=(6,25),LTH=10,                                      +        
               ATTR=(NOPROT)                                                    
KDVALUPD DFLD  POS=(6,45),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'CMD Code District Customer Report id',                 +        
               POS=(7,2),LTH=36,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Price Currency Reg Date',                              +        
               POS=(7,50),LTH=23,                                      +        
               ATTR=(PROT)                                                      
KDBEHX1  DFLD  POS=(8,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
KOD1     DFLD  POS=(8,6),LTH=2,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
DIST1    DFLD  POS=(8,11),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KUND1    DFLD  POS=(8,20),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
REF1     DFLD  POS=(8,29),LTH=15,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
PRIS1    DFLD  POS=(8,45),LTH=10,                                      +        
               ATTR=(NUM,PROT)                                                  
KDVAL1   DFLD  POS=(8,56),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
DATUM1   DFLD  POS=(8,65),LTH=8,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KDBEHX2  DFLD  POS=(9,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
KOD2     DFLD  POS=(9,6),LTH=2,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
DIST2    DFLD  POS=(9,11),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KUND2    DFLD  POS=(9,20),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
REF2     DFLD  POS=(9,29),LTH=15,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
PRIS2    DFLD  POS=(9,45),LTH=10,                                      +        
               ATTR=(NUM,PROT)                                                  
KDVAL2   DFLD  POS=(9,56),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
DATUM2   DFLD  POS=(9,65),LTH=8,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KDBEHX3  DFLD  POS=(10,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
KOD3     DFLD  POS=(10,6),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DIST3    DFLD  POS=(10,11),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KUND3    DFLD  POS=(10,20),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
REF3     DFLD  POS=(10,29),LTH=15,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
PRIS3    DFLD  POS=(10,45),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
KDVAL3   DFLD  POS=(10,56),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
DATUM3   DFLD  POS=(10,65),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDBEHX4  DFLD  POS=(11,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
KOD4     DFLD  POS=(11,6),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DIST4    DFLD  POS=(11,11),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KUND4    DFLD  POS=(11,20),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
REF4     DFLD  POS=(11,29),LTH=15,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
PRIS4    DFLD  POS=(11,45),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
KDVAL4   DFLD  POS=(11,56),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
DATUM4   DFLD  POS=(11,65),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDBEHX5  DFLD  POS=(12,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
KOD5     DFLD  POS=(12,6),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DIST5    DFLD  POS=(12,11),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KUND5    DFLD  POS=(12,20),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
REF5     DFLD  POS=(12,29),LTH=15,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
PRIS5    DFLD  POS=(12,45),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
KDVAL5   DFLD  POS=(12,56),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
DATUM5   DFLD  POS=(12,65),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDBEHX6  DFLD  POS=(13,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
KOD6     DFLD  POS=(13,6),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DIST6    DFLD  POS=(13,11),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KUND6    DFLD  POS=(13,20),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
REF6     DFLD  POS=(13,29),LTH=15,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
PRIS6    DFLD  POS=(13,45),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
KDVAL6   DFLD  POS=(13,56),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
DATUM6   DFLD  POS=(13,65),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDBEHX7  DFLD  POS=(14,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
KOD7     DFLD  POS=(14,6),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DIST7    DFLD  POS=(14,11),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KUND7    DFLD  POS=(14,20),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
REF7     DFLD  POS=(14,29),LTH=15,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
PRIS7    DFLD  POS=(14,45),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
KDVAL7   DFLD  POS=(14,56),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
DATUM7   DFLD  POS=(14,65),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDBEHX8  DFLD  POS=(15,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
KOD8     DFLD  POS=(15,6),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DIST8    DFLD  POS=(15,11),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KUND8    DFLD  POS=(15,20),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
REF8     DFLD  POS=(15,29),LTH=15,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
PRIS8    DFLD  POS=(15,45),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
KDVAL8   DFLD  POS=(15,56),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
DATUM8   DFLD  POS=(15,65),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDBEHUP  DFLD  POS=(17,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Send all waiting lines for parma No above to be invoice+        
               d',                                                     +        
               POS=(17,6),LTH=56,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Total waiting to be invoiced:',                        +        
               POS=(18,2),LTH=29,                                      +        
               ATTR=(PROT)                                                      
SUM      DFLD  POS=(18,34),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
         DFLD  '72',                                                   +        
               POS=(19,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
PRIS72   DFLD  POS=(19,7),LTH=10,                                      +        
               ATTR=(NUM,PROT)                                                  
CURR72   DFLD  POS=(19,19),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  '98',                                                   +        
               POS=(19,26),LTH=2,                                      +        
               ATTR=(PROT)                                                      
PRIS98   DFLD  POS=(19,31),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
CURR98   DFLD  POS=(19,43),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'ROR',                                                  +        
               POS=(19,49),LTH=3,                                      +        
               ATTR=(PROT)                                                      
PRISRR   DFLD  POS=(19,55),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
CURRROR  DFLD  POS=(19,67),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'F10=WHELP  F11=Update   F12=Logoff',                   +        
               POS=(22,2),LTH=34,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O719N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N719,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I719N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  IDPARTIN,                                               +        
               LTH=2                                                            
         MFLD  IDPARTUT,                                               +        
               LTH=9                                                            
         MFLD  IDFTGIN,                                                +        
               LTH=2                                                            
         MFLD  IDFTGUT,                                                +        
               LTH=2                                                            
         MFLD  DISTIN,                                                 +        
               LTH=2                                                            
         MFLD  DISTUT,                                                 +        
               LTH=4                                                            
         MFLD  KUNDIN,                                                 +        
               LTH=2                                                            
         MFLD  KUNDUT,                                                 +        
               LTH=6                                                            
         MFLD  SUMMA,                                                  +        
               LTH=10                                                           
         MFLD  KDVALUT,                                                +        
               LTH=3                                                            
         MFLD  KDBEHX1,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOD1,                                                   +        
               LTH=2                                                            
         MFLD  DIST1,                                                  +        
               LTH=4                                                            
         MFLD  KUND1,                                                  +        
               LTH=6                                                            
         MFLD  REF1,                                                   +        
               LTH=15                                                           
         MFLD  PRIS1,                                                  +        
               LTH=10                                                           
         MFLD  KDVAL1,                                                 +        
               LTH=3                                                            
         MFLD  DATUM1,                                                 +        
               LTH=8                                                            
         MFLD  KDBEHX2,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOD2,                                                   +        
               LTH=2                                                            
         MFLD  DIST2,                                                  +        
               LTH=4                                                            
         MFLD  KUND2,                                                  +        
               LTH=6                                                            
         MFLD  REF2,                                                   +        
               LTH=15                                                           
         MFLD  PRIS2,                                                  +        
               LTH=10                                                           
         MFLD  KDVAL2,                                                 +        
               LTH=3                                                            
         MFLD  DATUM2,                                                 +        
               LTH=8                                                            
         MFLD  KDBEHX3,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOD3,                                                   +        
               LTH=2                                                            
         MFLD  DIST3,                                                  +        
               LTH=4                                                            
         MFLD  KUND3,                                                  +        
               LTH=6                                                            
         MFLD  REF3,                                                   +        
               LTH=15                                                           
         MFLD  PRIS3,                                                  +        
               LTH=10                                                           
         MFLD  KDVAL3,                                                 +        
               LTH=3                                                            
         MFLD  DATUM3,                                                 +        
               LTH=8                                                            
         MFLD  KDBEHX4,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOD4,                                                   +        
               LTH=2                                                            
         MFLD  DIST4,                                                  +        
               LTH=4                                                            
         MFLD  KUND4,                                                  +        
               LTH=6                                                            
         MFLD  REF4,                                                   +        
               LTH=15                                                           
         MFLD  PRIS4,                                                  +        
               LTH=10                                                           
         MFLD  KDVAL4,                                                 +        
               LTH=3                                                            
         MFLD  DATUM4,                                                 +        
               LTH=8                                                            
         MFLD  KDBEHX5,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOD5,                                                   +        
               LTH=2                                                            
         MFLD  DIST5,                                                  +        
               LTH=4                                                            
         MFLD  KUND5,                                                  +        
               LTH=6                                                            
         MFLD  REF5,                                                   +        
               LTH=15                                                           
         MFLD  PRIS5,                                                  +        
               LTH=10                                                           
         MFLD  KDVAL5,                                                 +        
               LTH=3                                                            
         MFLD  DATUM5,                                                 +        
               LTH=8                                                            
         MFLD  KDBEHX6,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOD6,                                                   +        
               LTH=2                                                            
         MFLD  DIST6,                                                  +        
               LTH=4                                                            
         MFLD  KUND6,                                                  +        
               LTH=6                                                            
         MFLD  REF6,                                                   +        
               LTH=15                                                           
         MFLD  PRIS6,                                                  +        
               LTH=10                                                           
         MFLD  KDVAL6,                                                 +        
               LTH=3                                                            
         MFLD  DATUM6,                                                 +        
               LTH=8                                                            
         MFLD  KDBEHX7,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOD7,                                                   +        
               LTH=2                                                            
         MFLD  DIST7,                                                  +        
               LTH=4                                                            
         MFLD  KUND7,                                                  +        
               LTH=6                                                            
         MFLD  REF7,                                                   +        
               LTH=15                                                           
         MFLD  PRIS7,                                                  +        
               LTH=10                                                           
         MFLD  KDVAL7,                                                 +        
               LTH=3                                                            
         MFLD  DATUM7,                                                 +        
               LTH=8                                                            
         MFLD  KDBEHX8,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOD8,                                                   +        
               LTH=2                                                            
         MFLD  DIST8,                                                  +        
               LTH=4                                                            
         MFLD  KUND8,                                                  +        
               LTH=6                                                            
         MFLD  REF8,                                                   +        
               LTH=15                                                           
         MFLD  PRIS8,                                                  +        
               LTH=10                                                           
         MFLD  KDVAL8,                                                 +        
               LTH=3                                                            
         MFLD  DATUM8,                                                 +        
               LTH=8                                                            
         MFLD  KDBEHUP,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SUMMAUPD,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDVALUPD,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SUM,                                                    +        
               LTH=10                                                           
         MFLD  PRIS72,                                                 +        
               LTH=10                                                           
         MFLD  CURR72,                                                 +        
               LTH=3                                                            
         MFLD  PRIS98,                                                 +        
               LTH=10                                                           
         MFLD  CURR98,                                                 +        
               LTH=3                                                            
         MFLD  PRISRR,                                                 +        
               LTH=10                                                           
         MFLD  CURRROR,                                                +        
               LTH=3                                                            
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I719N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N719),                                           +        
               OPT=2,                                                  +        
               NXT=W4O719N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F9'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '47192',                                                +        
               LTH=5                                                            
         MFLD  (IDPARTIN,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDFTGIN,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DISTIN,                                                +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KUNDIN,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDBEHX1,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  KOD1,                                                   +        
               LTH=2                                                            
         MFLD  DIST1,                                                  +        
               LTH=4                                                            
         MFLD  KUND1,                                                  +        
               LTH=6                                                            
         MFLD  REF1,                                                   +        
               LTH=15                                                           
         MFLD  DATUM1,                                                 +        
               LTH=8                                                            
         MFLD  (KDBEHX2,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  KOD2,                                                   +        
               LTH=2                                                            
         MFLD  DIST2,                                                  +        
               LTH=4                                                            
         MFLD  KUND2,                                                  +        
               LTH=6                                                            
         MFLD  REF2,                                                   +        
               LTH=15                                                           
         MFLD  DATUM2,                                                 +        
               LTH=8                                                            
         MFLD  (KDBEHX3,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  KOD3,                                                   +        
               LTH=2                                                            
         MFLD  DIST3,                                                  +        
               LTH=4                                                            
         MFLD  KUND3,                                                  +        
               LTH=6                                                            
         MFLD  REF3,                                                   +        
               LTH=15                                                           
         MFLD  DATUM3,                                                 +        
               LTH=8                                                            
         MFLD  (KDBEHX4,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  KOD4,                                                   +        
               LTH=2                                                            
         MFLD  DIST4,                                                  +        
               LTH=4                                                            
         MFLD  KUND4,                                                  +        
               LTH=6                                                            
         MFLD  REF4,                                                   +        
               LTH=15                                                           
         MFLD  DATUM4,                                                 +        
               LTH=8                                                            
         MFLD  (KDBEHX5,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  KOD5,                                                   +        
               LTH=2                                                            
         MFLD  DIST5,                                                  +        
               LTH=4                                                            
         MFLD  KUND5,                                                  +        
               LTH=6                                                            
         MFLD  REF5,                                                   +        
               LTH=15                                                           
         MFLD  DATUM5,                                                 +        
               LTH=8                                                            
         MFLD  (KDBEHX6,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  KOD6,                                                   +        
               LTH=2                                                            
         MFLD  DIST6,                                                  +        
               LTH=4                                                            
         MFLD  KUND6,                                                  +        
               LTH=6                                                            
         MFLD  REF6,                                                   +        
               LTH=15                                                           
         MFLD  DATUM6,                                                 +        
               LTH=8                                                            
         MFLD  (KDBEHX7,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  KOD7,                                                   +        
               LTH=2                                                            
         MFLD  DIST7,                                                  +        
               LTH=4                                                            
         MFLD  KUND7,                                                  +        
               LTH=6                                                            
         MFLD  REF7,                                                   +        
               LTH=15                                                           
         MFLD  DATUM7,                                                 +        
               LTH=8                                                            
         MFLD  (KDBEHX8,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  KOD8,                                                   +        
               LTH=2                                                            
         MFLD  DIST8,                                                  +        
               LTH=4                                                            
         MFLD  KUND8,                                                  +        
               LTH=6                                                            
         MFLD  REF8,                                                   +        
               LTH=15                                                           
         MFLD  DATUM8,                                                 +        
               LTH=8                                                            
         MFLD  (KDBEHUP,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (SUMMAUPD,                                              +        
               '++++++++++'),                                          +        
               LTH=10                                                           
         MFLD  (KDVALUPD,                                              +        
               '+++'),                                                 +        
               LTH=3                                                            
         MSGEND                                                                 
         END                                                                    
