***********************************************************************         
* CREATED BY V070375   ON 99/10/20  AT 07:59                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'Ivoiceinformation               '                               
W4N727   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T727 7',                                           +        
               8='W4T727 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T721  ',                                          +        
               14='W4T722  ',                                          +        
               15='W4T723  ',                                          +        
               16='W4T724  ',                                          +        
               17='W4T725  ',                                          +        
               18='W4T726  ',                                          +        
               19='W4T727  ',                                          +        
               20='W4T728  ',                                          +        
               21='W4T729  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4N727   DPAGE CURSOR=((2,6)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'QUERY INVOICE',                                        +        
               POS=(1,11),LTH=13,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Inv',                                                  +        
               POS=(2,2),LTH=3,                                        +        
               ATTR=(ALPHA,PROT)                                                
FAKTIN   DFLD  POS=(2,6),LTH=7,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Cust',                                                 +        
               POS=(2,14),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
KUNDIN   DFLD  POS=(2,19),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Order',                                                +        
               POS=(2,26),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
ORDERIN  DFLD  POS=(2,32),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Case',                                                 +        
               POS=(2,38),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
KOLLIIN  DFLD  POS=(2,43),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Prod',                                                 +        
               POS=(2,49),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
PRODIN   DFLD  POS=(2,54),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Part',                                                 +        
               POS=(2,62),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
ARTIN    DFLD  POS=(2,67),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
FAKTUT   DFLD  POS=(3,6),LTH=7,                                        +        
               ATTR=(PROT,MOD)                                                  
KUNDUT   DFLD  POS=(3,19),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
ORDERUT  DFLD  POS=(3,32),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
KOLLIUT  DFLD  POS=(3,43),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
PRODUT   DFLD  POS=(3,54),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
ARTUT    DFLD  POS=(3,67),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
PRODENT  DFLD  POS=(4,2),LTH=7,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
KOLLIE   DFLD  POS=(4,10),LTH=5,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
ARTNRE   DFLD  POS=(4,16),LTH=9,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
LOPENT   DFLD  POS=(4,26),LTH=3,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
PRODNEX  DFLD  POS=(4,30),LTH=7,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
KOLLIN   DFLD  POS=(4,38),LTH=5,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
ARTNRN   DFLD  POS=(4,44),LTH=9,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
LOPNEX   DFLD  POS=(4,54),LTH=3,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Distr   Cust   Order  Prod No DC  Case',               +        
               POS=(5,2),LTH=38,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Part  Ord Q   Prt Q Deliv. Dir.del',                   +        
               POS=(5,46),LTH=34,                                      +        
               ATTR=(PROT)                                                      
DIST1    DFLD  POS=(6,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
KUND1    DFLD  POS=(6,8),LTH=6,                                        +        
               ATTR=(PROT)                                                      
ORDNR1   DFLD  POS=(6,15),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
PRODNR1  DFLD  POS=(6,24),LTH=7,                                       +        
               ATTR=(PROT)                                                      
DC1      DFLD  POS=(6,32),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
KOLLI1   DFLD  POS=(6,35),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
ARTNR1   DFLD  POS=(6,41),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
KVBE1    DFLD  POS=(6,51),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
KVAVB1   DFLD  POS=(6,59),LTH=6,                                       +        
               ATTR=(PROT)                                                      
KVLEV1   DFLD  POS=(6,66),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
IDLEV1   DFLD  POS=(6,75),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DIST2    DFLD  POS=(7,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
KUND2    DFLD  POS=(7,8),LTH=6,                                        +        
               ATTR=(PROT)                                                      
ORDNR2   DFLD  POS=(7,15),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
PRODNR2  DFLD  POS=(7,24),LTH=7,                                       +        
               ATTR=(PROT)                                                      
DC2      DFLD  POS=(7,32),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
KOLLI2   DFLD  POS=(7,35),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
ARTNR2   DFLD  POS=(7,41),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
KVBE2    DFLD  POS=(7,51),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
KVAVB2   DFLD  POS=(7,59),LTH=6,                                       +        
               ATTR=(PROT)                                                      
KVLEV2   DFLD  POS=(7,66),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
IDLEV2   DFLD  POS=(7,75),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DIST3    DFLD  POS=(8,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
KUND3    DFLD  POS=(8,8),LTH=6,                                        +        
               ATTR=(PROT)                                                      
ORDNR3   DFLD  POS=(8,15),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
PRODNR3  DFLD  POS=(8,24),LTH=7,                                       +        
               ATTR=(PROT)                                                      
DC3      DFLD  POS=(8,32),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
KOLLI3   DFLD  POS=(8,35),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
ARTNR3   DFLD  POS=(8,41),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
KVBE3    DFLD  POS=(8,51),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
KVAVB3   DFLD  POS=(8,59),LTH=6,                                       +        
               ATTR=(PROT)                                                      
KVLEV3   DFLD  POS=(8,66),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
IDLEV3   DFLD  POS=(8,75),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DIST4    DFLD  POS=(9,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
KUND4    DFLD  POS=(9,8),LTH=6,                                        +        
               ATTR=(PROT)                                                      
ORDNR4   DFLD  POS=(9,15),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
PRODNR4  DFLD  POS=(9,24),LTH=7,                                       +        
               ATTR=(PROT)                                                      
DC4      DFLD  POS=(9,32),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
KOLLI4   DFLD  POS=(9,35),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
ARTNR4   DFLD  POS=(9,41),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
KVBE4    DFLD  POS=(9,51),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
KVAVB4   DFLD  POS=(9,59),LTH=6,                                       +        
               ATTR=(PROT)                                                      
KVLEV4   DFLD  POS=(9,66),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
IDLEV4   DFLD  POS=(9,75),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DIST5    DFLD  POS=(10,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KUND5    DFLD  POS=(10,8),LTH=6,                                       +        
               ATTR=(PROT)                                                      
ORDNR5   DFLD  POS=(10,15),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
PRODNR5  DFLD  POS=(10,24),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DC5      DFLD  POS=(10,32),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
KOLLI5   DFLD  POS=(10,35),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
ARTNR5   DFLD  POS=(10,41),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
KVBE5    DFLD  POS=(10,51),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
KVAVB5   DFLD  POS=(10,59),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KVLEV5   DFLD  POS=(10,66),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
IDLEV5   DFLD  POS=(10,75),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DIST6    DFLD  POS=(11,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KUND6    DFLD  POS=(11,8),LTH=6,                                       +        
               ATTR=(PROT)                                                      
ORDNR6   DFLD  POS=(11,15),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
PRODNR6  DFLD  POS=(11,24),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DC6      DFLD  POS=(11,32),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
KOLLI6   DFLD  POS=(11,35),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
ARTNR6   DFLD  POS=(11,41),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
KVBE6    DFLD  POS=(11,51),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
KVAVB6   DFLD  POS=(11,59),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KVLEV6   DFLD  POS=(11,66),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
IDLEV6   DFLD  POS=(11,75),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DIST7    DFLD  POS=(12,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KUND7    DFLD  POS=(12,8),LTH=6,                                       +        
               ATTR=(PROT)                                                      
ORDNR7   DFLD  POS=(12,15),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
PRODNR7  DFLD  POS=(12,24),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DC7      DFLD  POS=(12,32),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
KOLLI7   DFLD  POS=(12,35),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
ARTNR7   DFLD  POS=(12,41),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
KVBE7    DFLD  POS=(12,51),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
KVAVB7   DFLD  POS=(12,59),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KVLEV7   DFLD  POS=(12,66),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
IDLEV7   DFLD  POS=(12,75),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DIST8    DFLD  POS=(13,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KUND8    DFLD  POS=(13,8),LTH=6,                                       +        
               ATTR=(PROT)                                                      
ORDNR8   DFLD  POS=(13,15),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
PRODNR8  DFLD  POS=(13,24),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DC8      DFLD  POS=(13,32),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
KOLLI8   DFLD  POS=(13,35),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
ARTNR8   DFLD  POS=(13,41),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
KVBE8    DFLD  POS=(13,51),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
KVAVB8   DFLD  POS=(13,59),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KVLEV8   DFLD  POS=(13,66),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
IDLEV8   DFLD  POS=(13,75),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DIST9    DFLD  POS=(14,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KUND9    DFLD  POS=(14,8),LTH=6,                                       +        
               ATTR=(PROT)                                                      
ORDNR9   DFLD  POS=(14,15),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
PRODNR9  DFLD  POS=(14,24),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DC9      DFLD  POS=(14,32),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
KOLLI9   DFLD  POS=(14,35),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
ARTNR9   DFLD  POS=(14,41),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
KVBE9    DFLD  POS=(14,51),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
KVAVB9   DFLD  POS=(14,59),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KVLEV9   DFLD  POS=(14,66),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
IDLEV9   DFLD  POS=(14,75),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DIST10   DFLD  POS=(15,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KUND10   DFLD  POS=(15,8),LTH=6,                                       +        
               ATTR=(PROT)                                                      
ORDNR10  DFLD  POS=(15,15),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
PRODNR10 DFLD  POS=(15,24),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DC10     DFLD  POS=(15,32),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
KOLLI10  DFLD  POS=(15,35),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
ARTNR10  DFLD  POS=(15,41),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
KVBE10   DFLD  POS=(15,51),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
KVAVB10  DFLD  POS=(15,59),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KVLEV10  DFLD  POS=(15,66),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
IDLEV10  DFLD  POS=(15,75),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DIST11   DFLD  POS=(16,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KUND11   DFLD  POS=(16,8),LTH=6,                                       +        
               ATTR=(PROT)                                                      
ORDNR11  DFLD  POS=(16,15),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
PRODNR11 DFLD  POS=(16,24),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DC11     DFLD  POS=(16,32),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
KOLLI11  DFLD  POS=(16,35),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
ARTNR11  DFLD  POS=(16,41),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
KVBE11   DFLD  POS=(16,51),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
KVAVB11  DFLD  POS=(16,59),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KVLEV11  DFLD  POS=(16,66),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
IDLEV11  DFLD  POS=(16,75),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DIST12   DFLD  POS=(17,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KUND12   DFLD  POS=(17,8),LTH=6,                                       +        
               ATTR=(PROT)                                                      
ORDNR12  DFLD  POS=(17,15),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
PRODNR12 DFLD  POS=(17,24),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DC12     DFLD  POS=(17,32),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
KOLLI12  DFLD  POS=(17,35),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
ARTNR12  DFLD  POS=(17,41),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
KVBE12   DFLD  POS=(17,51),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
KVAVB12  DFLD  POS=(17,59),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KVLEV12  DFLD  POS=(17,66),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
IDLEV12  DFLD  POS=(17,75),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DIST13   DFLD  POS=(18,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KUND13   DFLD  POS=(18,8),LTH=6,                                       +        
               ATTR=(PROT)                                                      
ORDNR13  DFLD  POS=(18,15),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
PRODNR13 DFLD  POS=(18,24),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DC13     DFLD  POS=(18,32),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
KOLLI13  DFLD  POS=(18,35),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
ARTNR13  DFLD  POS=(18,41),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
KVBE13   DFLD  POS=(18,51),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
KVAVB13  DFLD  POS=(18,59),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KVLEV13  DFLD  POS=(18,66),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
IDLEV13  DFLD  POS=(18,75),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DIST14   DFLD  POS=(19,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KUND14   DFLD  POS=(19,8),LTH=6,                                       +        
               ATTR=(PROT)                                                      
ORDNR14  DFLD  POS=(19,15),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
PRODNR14 DFLD  POS=(19,24),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DC14     DFLD  POS=(19,32),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
KOLLI14  DFLD  POS=(19,35),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
ARTNR14  DFLD  POS=(19,41),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
KVBE14   DFLD  POS=(19,51),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
KVAVB14  DFLD  POS=(19,59),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KVLEV14  DFLD  POS=(19,66),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
IDLEV14  DFLD  POS=(19,75),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '13',                                                   +        
               POS=(21,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '14',                                                   +        
               POS=(21,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15',                                                   +        
               POS=(21,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '22 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W4O727N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N727,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I727N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4N727                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  FAKTIN,                                                 +        
               LTH=7                                                            
         MFLD  FAKTUT,                                                 +        
               LTH=7                                                            
         MFLD  KUNDIN,                                                 +        
               LTH=6                                                            
         MFLD  KUNDUT,                                                 +        
               LTH=6                                                            
         MFLD  ORDERIN,                                                +        
               LTH=5                                                            
         MFLD  ORDERUT,                                                +        
               LTH=5                                                            
         MFLD  KOLLIIN,                                                +        
               LTH=5                                                            
         MFLD  KOLLIUT,                                                +        
               LTH=5                                                            
         MFLD  PRODIN,                                                 +        
               LTH=7                                                            
         MFLD  PRODUT,                                                 +        
               LTH=7                                                            
         MFLD  ARTIN,                                                  +        
               LTH=9                                                            
         MFLD  ARTUT,                                                  +        
               LTH=9                                                            
         MFLD  PRODENT,                                                +        
               LTH=7                                                            
         MFLD  KOLLIE,                                                 +        
               LTH=5                                                            
         MFLD  ARTNRE,                                                 +        
               LTH=9                                                            
         MFLD  LOPENT,                                                 +        
               LTH=3                                                            
         MFLD  PRODNEX,                                                +        
               LTH=7                                                            
         MFLD  KOLLIN,                                                 +        
               LTH=5                                                            
         MFLD  ARTNRN,                                                 +        
               LTH=9                                                            
         MFLD  LOPNEX,                                                 +        
               LTH=3                                                            
         MFLD  DIST1,                                                  +        
               LTH=4                                                            
         MFLD  KUND1,                                                  +        
               LTH=6                                                            
         MFLD  ORDNR1,                                                 +        
               LTH=7                                                            
         MFLD  PRODNR1,                                                +        
               LTH=7                                                            
         MFLD  DC1,                                                    +        
               LTH=2                                                            
         MFLD  KOLLI1,                                                 +        
               LTH=5                                                            
         MFLD  ARTNR1,                                                 +        
               LTH=9                                                            
         MFLD  KVBE1,                                                  +        
               LTH=6                                                            
         MFLD  KVAVB1,                                                 +        
               LTH=6                                                            
         MFLD  KVLEV1,                                                 +        
               LTH=6                                                            
         MFLD  IDLEV1,                                                 +        
               LTH=5                                                            
         MFLD  DIST2,                                                  +        
               LTH=4                                                            
         MFLD  KUND2,                                                  +        
               LTH=6                                                            
         MFLD  ORDNR2,                                                 +        
               LTH=7                                                            
         MFLD  PRODNR2,                                                +        
               LTH=7                                                            
         MFLD  DC2,                                                    +        
               LTH=2                                                            
         MFLD  KOLLI2,                                                 +        
               LTH=5                                                            
         MFLD  ARTNR2,                                                 +        
               LTH=9                                                            
         MFLD  KVBE2,                                                  +        
               LTH=6                                                            
         MFLD  KVAVB2,                                                 +        
               LTH=6                                                            
         MFLD  KVLEV2,                                                 +        
               LTH=6                                                            
         MFLD  IDLEV2,                                                 +        
               LTH=5                                                            
         MFLD  DIST3,                                                  +        
               LTH=4                                                            
         MFLD  KUND3,                                                  +        
               LTH=6                                                            
         MFLD  ORDNR3,                                                 +        
               LTH=7                                                            
         MFLD  PRODNR3,                                                +        
               LTH=7                                                            
         MFLD  DC3,                                                    +        
               LTH=2                                                            
         MFLD  KOLLI3,                                                 +        
               LTH=5                                                            
         MFLD  ARTNR3,                                                 +        
               LTH=9                                                            
         MFLD  KVBE3,                                                  +        
               LTH=6                                                            
         MFLD  KVAVB3,                                                 +        
               LTH=6                                                            
         MFLD  KVLEV3,                                                 +        
               LTH=6                                                            
         MFLD  IDLEV3,                                                 +        
               LTH=5                                                            
         MFLD  DIST4,                                                  +        
               LTH=4                                                            
         MFLD  KUND4,                                                  +        
               LTH=6                                                            
         MFLD  ORDNR4,                                                 +        
               LTH=7                                                            
         MFLD  PRODNR4,                                                +        
               LTH=7                                                            
         MFLD  DC4,                                                    +        
               LTH=2                                                            
         MFLD  KOLLI4,                                                 +        
               LTH=5                                                            
         MFLD  ARTNR4,                                                 +        
               LTH=9                                                            
         MFLD  KVBE4,                                                  +        
               LTH=6                                                            
         MFLD  KVAVB4,                                                 +        
               LTH=6                                                            
         MFLD  KVLEV4,                                                 +        
               LTH=6                                                            
         MFLD  IDLEV4,                                                 +        
               LTH=5                                                            
         MFLD  DIST5,                                                  +        
               LTH=4                                                            
         MFLD  KUND5,                                                  +        
               LTH=6                                                            
         MFLD  ORDNR5,                                                 +        
               LTH=7                                                            
         MFLD  PRODNR5,                                                +        
               LTH=7                                                            
         MFLD  DC5,                                                    +        
               LTH=2                                                            
         MFLD  KOLLI5,                                                 +        
               LTH=5                                                            
         MFLD  ARTNR5,                                                 +        
               LTH=9                                                            
         MFLD  KVBE5,                                                  +        
               LTH=6                                                            
         MFLD  KVAVB5,                                                 +        
               LTH=6                                                            
         MFLD  KVLEV5,                                                 +        
               LTH=6                                                            
         MFLD  IDLEV5,                                                 +        
               LTH=5                                                            
         MFLD  DIST6,                                                  +        
               LTH=4                                                            
         MFLD  KUND6,                                                  +        
               LTH=6                                                            
         MFLD  ORDNR6,                                                 +        
               LTH=7                                                            
         MFLD  PRODNR6,                                                +        
               LTH=7                                                            
         MFLD  DC6,                                                    +        
               LTH=2                                                            
         MFLD  KOLLI6,                                                 +        
               LTH=5                                                            
         MFLD  ARTNR6,                                                 +        
               LTH=9                                                            
         MFLD  KVBE6,                                                  +        
               LTH=6                                                            
         MFLD  KVAVB6,                                                 +        
               LTH=6                                                            
         MFLD  KVLEV6,                                                 +        
               LTH=6                                                            
         MFLD  IDLEV6,                                                 +        
               LTH=5                                                            
         MFLD  DIST7,                                                  +        
               LTH=4                                                            
         MFLD  KUND7,                                                  +        
               LTH=6                                                            
         MFLD  ORDNR7,                                                 +        
               LTH=7                                                            
         MFLD  PRODNR7,                                                +        
               LTH=7                                                            
         MFLD  DC7,                                                    +        
               LTH=2                                                            
         MFLD  KOLLI7,                                                 +        
               LTH=5                                                            
         MFLD  ARTNR7,                                                 +        
               LTH=9                                                            
         MFLD  KVBE7,                                                  +        
               LTH=6                                                            
         MFLD  KVAVB7,                                                 +        
               LTH=6                                                            
         MFLD  KVLEV7,                                                 +        
               LTH=6                                                            
         MFLD  IDLEV7,                                                 +        
               LTH=5                                                            
         MFLD  DIST8,                                                  +        
               LTH=4                                                            
         MFLD  KUND8,                                                  +        
               LTH=6                                                            
         MFLD  ORDNR8,                                                 +        
               LTH=7                                                            
         MFLD  PRODNR8,                                                +        
               LTH=7                                                            
         MFLD  DC8,                                                    +        
               LTH=2                                                            
         MFLD  KOLLI8,                                                 +        
               LTH=5                                                            
         MFLD  ARTNR8,                                                 +        
               LTH=9                                                            
         MFLD  KVBE8,                                                  +        
               LTH=6                                                            
         MFLD  KVAVB8,                                                 +        
               LTH=6                                                            
         MFLD  KVLEV8,                                                 +        
               LTH=6                                                            
         MFLD  IDLEV8,                                                 +        
               LTH=5                                                            
         MFLD  DIST9,                                                  +        
               LTH=4                                                            
         MFLD  KUND9,                                                  +        
               LTH=6                                                            
         MFLD  ORDNR9,                                                 +        
               LTH=7                                                            
         MFLD  PRODNR9,                                                +        
               LTH=7                                                            
         MFLD  DC9,                                                    +        
               LTH=2                                                            
         MFLD  KOLLI9,                                                 +        
               LTH=5                                                            
         MFLD  ARTNR9,                                                 +        
               LTH=9                                                            
         MFLD  KVBE9,                                                  +        
               LTH=6                                                            
         MFLD  KVAVB9,                                                 +        
               LTH=6                                                            
         MFLD  KVLEV9,                                                 +        
               LTH=6                                                            
         MFLD  IDLEV9,                                                 +        
               LTH=5                                                            
         MFLD  DIST10,                                                 +        
               LTH=4                                                            
         MFLD  KUND10,                                                 +        
               LTH=6                                                            
         MFLD  ORDNR10,                                                +        
               LTH=7                                                            
         MFLD  PRODNR10,                                               +        
               LTH=7                                                            
         MFLD  DC10,                                                   +        
               LTH=2                                                            
         MFLD  KOLLI10,                                                +        
               LTH=5                                                            
         MFLD  ARTNR10,                                                +        
               LTH=9                                                            
         MFLD  KVBE10,                                                 +        
               LTH=6                                                            
         MFLD  KVAVB10,                                                +        
               LTH=6                                                            
         MFLD  KVLEV10,                                                +        
               LTH=6                                                            
         MFLD  IDLEV10,                                                +        
               LTH=5                                                            
         MFLD  DIST11,                                                 +        
               LTH=4                                                            
         MFLD  KUND11,                                                 +        
               LTH=6                                                            
         MFLD  ORDNR11,                                                +        
               LTH=7                                                            
         MFLD  PRODNR11,                                               +        
               LTH=7                                                            
         MFLD  DC11,                                                   +        
               LTH=2                                                            
         MFLD  KOLLI11,                                                +        
               LTH=5                                                            
         MFLD  ARTNR11,                                                +        
               LTH=9                                                            
         MFLD  KVBE11,                                                 +        
               LTH=6                                                            
         MFLD  KVAVB11,                                                +        
               LTH=6                                                            
         MFLD  KVLEV11,                                                +        
               LTH=6                                                            
         MFLD  IDLEV11,                                                +        
               LTH=5                                                            
         MFLD  DIST12,                                                 +        
               LTH=4                                                            
         MFLD  KUND12,                                                 +        
               LTH=6                                                            
         MFLD  ORDNR12,                                                +        
               LTH=7                                                            
         MFLD  PRODNR12,                                               +        
               LTH=7                                                            
         MFLD  DC12,                                                   +        
               LTH=2                                                            
         MFLD  KOLLI12,                                                +        
               LTH=5                                                            
         MFLD  ARTNR12,                                                +        
               LTH=9                                                            
         MFLD  KVBE12,                                                 +        
               LTH=6                                                            
         MFLD  KVAVB12,                                                +        
               LTH=6                                                            
         MFLD  KVLEV12,                                                +        
               LTH=6                                                            
         MFLD  IDLEV12,                                                +        
               LTH=5                                                            
         MFLD  DIST13,                                                 +        
               LTH=4                                                            
         MFLD  KUND13,                                                 +        
               LTH=6                                                            
         MFLD  ORDNR13,                                                +        
               LTH=7                                                            
         MFLD  PRODNR13,                                               +        
               LTH=7                                                            
         MFLD  DC13,                                                   +        
               LTH=2                                                            
         MFLD  KOLLI13,                                                +        
               LTH=5                                                            
         MFLD  ARTNR13,                                                +        
               LTH=9                                                            
         MFLD  KVBE13,                                                 +        
               LTH=6                                                            
         MFLD  KVAVB13,                                                +        
               LTH=6                                                            
         MFLD  KVLEV13,                                                +        
               LTH=6                                                            
         MFLD  IDLEV13,                                                +        
               LTH=5                                                            
         MFLD  DIST14,                                                 +        
               LTH=4                                                            
         MFLD  KUND14,                                                 +        
               LTH=6                                                            
         MFLD  ORDNR14,                                                +        
               LTH=7                                                            
         MFLD  PRODNR14,                                               +        
               LTH=7                                                            
         MFLD  DC14,                                                   +        
               LTH=2                                                            
         MFLD  KOLLI14,                                                +        
               LTH=5                                                            
         MFLD  ARTNR14,                                                +        
               LTH=9                                                            
         MFLD  KVBE14,                                                 +        
               LTH=6                                                            
         MFLD  KVAVB14,                                                +        
               LTH=6                                                            
         MFLD  KVLEV14,                                                +        
               LTH=6                                                            
         MFLD  IDLEV14,                                                +        
               LTH=5                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I727N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N727),                                           +        
               OPT=2,                                                  +        
               NXT=W4O727N1                                                     
MID      LPAGE SOR=(W4N727)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  (FLD0102,                                               +        
               '4'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  (FLD0104,                                               +        
               '7'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  (FLD0106,                                               +        
               '2'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  (FLD0108,                                               +        
               '7'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '47272',                                                +        
               LTH=5                                                            
         MFLD  (FAKTIN,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FAKTUT,                                                 +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (KUNDIN,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KUNDUT,                                                 +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (ORDERIN,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  ORDERUT,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (KOLLIIN,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KOLLIUT,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (PRODIN,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  PRODUT,                                                 +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (ARTIN,                                                 +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  ARTUT,                                                  +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  PRODENT,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  KOLLIE,                                                 +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  ARTNRE,                                                 +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  LOPENT,                                                 +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  PRODNEX,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  KOLLIN,                                                 +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  ARTNRN,                                                 +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  LOPNEX,                                                 +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
