***********************************************************************         
* CREATED BY PC36149   ON 96/09/06  AT 16:53                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W4N716   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T716 7',                                           +        
               8='W4T716 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T711  ',                                          +        
               14='W4T712  ',                                          +        
               15='W4T713  ',                                          +        
               16='W4T714  ',                                          +        
               17='W4T715  ',                                          +        
               18='W4T716  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,11)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'CREDIT/DEBIT - VCAS',                                  +        
               POS=(1,11),LTH=19,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'District',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(NUM,PROT)                                                  
FLD0211  DFLD  POS=(2,11),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Customer',                                             +        
               POS=(2,16),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0225  DFLD  POS=(2,25),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DN No.',                                               +        
               POS=(2,35),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0242  DFLD  POS=(2,42),LTH=7,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Part No.',                                             +        
               POS=(2,50),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
IDARTNRI DFLD  POS=(2,59),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Line',                                                 +        
               POS=(2,68),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
IDRADNRI DFLD  POS=(2,73),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD0311  DFLD  POS=(3,11),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0325  DFLD  POS=(3,25),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0342  DFLD  POS=(3,42),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
IDARTNRU DFLD  POS=(3,59),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
IDRADNRU DFLD  POS=(3,73),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
SUKRED   DFLD  POS=(4,2),LTH=11,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
SUDEB    DFLD  POS=(4,14),LTH=11,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDARTNRE DFLD  POS=(4,26),LTH=8,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDRADNRE DFLD  POS=(4,35),LTH=5,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDARTNRN DFLD  POS=(4,41),LTH=8,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDRADNRN DFLD  POS=(4,50),LTH=5,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         DFLD  'Cre.note/Order',                                       +        
               POS=(5,65),LTH=14,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Order No Part No. Code   Qty',                         +        
               POS=(6,2),LTH=28,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Price',                                                +        
               POS=(6,35),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Add.Cost',                                             +        
               POS=(6,45),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Value',                                                +        
               POS=(6,61),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'No   Date',                                            +        
               POS=(6,72),LTH=9,                                       +        
               ATTR=(PROT)                                                      
COL0407  DFLD  POS=(7,4),LTH=77,                                       +        
               ATTR=(PROT)                                                      
COL0408  DFLD  POS=(8,4),LTH=77,                                       +        
               ATTR=(PROT)                                                      
COL0409  DFLD  POS=(9,4),LTH=77,                                       +        
               ATTR=(PROT)                                                      
COL0410  DFLD  POS=(10,4),LTH=77,                                      +        
               ATTR=(PROT)                                                      
COL0411  DFLD  POS=(11,4),LTH=77,                                      +        
               ATTR=(PROT)                                                      
COL0412  DFLD  POS=(12,4),LTH=77,                                      +        
               ATTR=(PROT)                                                      
COL0413  DFLD  POS=(13,4),LTH=77,                                      +        
               ATTR=(PROT)                                                      
COL0414  DFLD  POS=(14,4),LTH=77,                                      +        
               ATTR=(PROT)                                                      
COL0415  DFLD  POS=(15,4),LTH=77,                                      +        
               ATTR=(PROT)                                                      
COL0416  DFLD  POS=(16,4),LTH=77,                                      +        
               ATTR=(PROT)                                                      
COL0417  DFLD  POS=(17,4),LTH=77,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Credited',                                             +        
               POS=(19,3),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD1914  DFLD  POS=(19,14),LTH=12,                                     +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Debited',                                              +        
               POS=(19,29),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1939  DFLD  POS=(19,39),LTH=12,                                     +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Currency',                                             +        
               POS=(19,55),LTH=8,                                      +        
               ATTR=(PROT)                                                      
KDVALISO DFLD  POS=(19,64),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '13 District/Sta 14 Discr.  1    15 Discr.  2    16 Add.+        
                costs   17 Returperm.',                                +        
               POS=(21,2),LTH=77,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 Cred/Deb',                                          +        
               POS=(22,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O716N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N716,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I716N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0211,                                                +        
               LTH=4                                                            
         MFLD  FLD0311,                                                +        
               LTH=4                                                            
         MFLD  FLD0225,                                                +        
               LTH=6                                                            
         MFLD  FLD0325,                                                +        
               LTH=6                                                            
         MFLD  FLD0242,                                                +        
               LTH=7                                                            
         MFLD  FLD0342,                                                +        
               LTH=7                                                            
         MFLD  IDARTNRI,                                               +        
               LTH=8                                                            
         MFLD  IDARTNRU,                                               +        
               LTH=8                                                            
         MFLD  IDRADNRI,                                               +        
               LTH=4                                                            
         MFLD  IDRADNRU,                                               +        
               LTH=4                                                            
         MFLD  SUKRED,                                                 +        
               LTH=11                                                           
         MFLD  SUDEB,                                                  +        
               LTH=11                                                           
         MFLD  IDARTNRE,                                               +        
               LTH=8                                                            
         MFLD  IDRADNRE,                                               +        
               LTH=5                                                            
         MFLD  IDARTNRN,                                               +        
               LTH=8                                                            
         MFLD  IDRADNRN,                                               +        
               LTH=5                                                            
         MFLD  COL0407,                                                +        
               LTH=77                                                           
         MFLD  COL0408,                                                +        
               LTH=77                                                           
         MFLD  COL0409,                                                +        
               LTH=77                                                           
         MFLD  COL0410,                                                +        
               LTH=77                                                           
         MFLD  COL0411,                                                +        
               LTH=77                                                           
         MFLD  COL0412,                                                +        
               LTH=77                                                           
         MFLD  COL0413,                                                +        
               LTH=77                                                           
         MFLD  COL0414,                                                +        
               LTH=77                                                           
         MFLD  COL0415,                                                +        
               LTH=77                                                           
         MFLD  COL0416,                                                +        
               LTH=77                                                           
         MFLD  COL0417,                                                +        
               LTH=77                                                           
         MFLD  FLD1914,                                                +        
               LTH=12                                                           
         MFLD  FLD1939,                                                +        
               LTH=12                                                           
         MFLD  KDVALISO,                                               +        
               LTH=3                                                            
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I716N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N716),                                           +        
               OPT=2,                                                  +        
               NXT=W4O716N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  (FLD0102,                                               +        
               '4'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  (FLD0104,                                               +        
               '7'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  (FLD0106,                                               +        
               '1'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  (FLD0108,                                               +        
               '6'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '47162',                                                +        
               LTH=5                                                            
         MFLD  (FLD0211,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0311,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0225,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0325,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0242,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0342,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (IDARTNRI,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDARTNRU,                                               +        
               LTH=8,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (IDRADNRI,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDRADNRU,                                               +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  IDARTNRE,                                               +        
               LTH=8                                                            
         MFLD  IDRADNRE,                                               +        
               LTH=5                                                            
         MFLD  IDARTNRN,                                               +        
               LTH=8                                                            
         MFLD  IDRADNRN,                                               +        
               LTH=5                                                            
         MFLD  SUKRED,                                                 +        
               LTH=11                                                           
         MFLD  SUDEB,                                                  +        
               LTH=11                                                           
         MSGEND                                                                 
         END                                                                    
