***********************************************************************         
* CREATED BY PC70375   ON 98/09/24  AT 17:19                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'SHOW RETURN PERMISSION QUEUE    '                               
W4N736   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W4T736 4',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T736 7',                                           +        
               8='W4T736 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T731  ',                                          +        
               14='W4T732  ',                                          +        
               15='W4T733  ',                                          +        
               16='W4T734  ',                                          +        
               17='W4T735  ',                                          +        
               18='W4T736  ',                                          +        
               19='W4T737  ',                                          +        
               20='W4T738  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4N736   DPAGE CURSOR=((2,7)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'SHOW RETURN PERMISSION QUEU',                          +        
               POS=(1,11),LTH=27,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Resp',                                                 +        
               POS=(2,2),LTH=4,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDANSVI  DFLD  POS=(2,7),LTH=6,                                        +        
               ATTR=(NOPROT)                                                    
         DFLD  'Distr',                                                +        
               POS=(2,14),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
IDDISTRI DFLD  POS=(2,20),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Cust',                                                 +        
               POS=(2,25),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0002 DFLD  POS=(2,30),LTH=6,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Status from',                                          +        
               POS=(2,37),LTH=11,                                      +        
               ATTR=(PROT)                                                      
DGIA0027 DFLD  POS=(2,49),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'to',                                                   +        
               POS=(2,51),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0042 DFLD  POS=(2,54),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Tot queue',                                            +        
               POS=(2,56),LTH=9,                                       +        
               ATTR=(PROT)                                                      
FLSUMI   DFLD  POS=(2,66),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'DC',                                                   +        
               POS=(2,68),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
IDDCIN   DFLD  POS=(2,71),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
IDANSVU  DFLD  POS=(3,7),LTH=6,                                        +        
               ATTR=(PROT,MOD)                                                  
IDDISTRU DFLD  POS=(3,20),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0003 DFLD  POS=(3,30),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0028 DFLD  POS=(3,49),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0043 DFLD  POS=(3,54),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
FLSUMU   DFLD  POS=(3,66),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDCUT   DFLD  POS=(3,71),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Qty RP',                                               +        
               POS=(5,2),LTH=6,                                        +        
               ATTR=(PROT)                                                      
KVRT     DFLD  POS=(5,9),LTH=5,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Qty RP-lines',                                         +        
               POS=(5,16),LTH=12,                                      +        
               ATTR=(PROT)                                                      
KVRTRAD  DFLD  POS=(5,29),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Printer',                                              +        
               POS=(5,36),LTH=7,                                       +        
               ATTR=(PROT)                                                      
DGIA0015 DFLD  POS=(5,45),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'RP',                                                   +        
               POS=(7,16),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Arr',                                                  +        
               POS=(7,23),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '*------- Q t y -----*',                                +        
               POS=(7,56),LTH=21,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Cmd  Resp',                                            +        
               POS=(8,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'date   date Distr   Cust   RP No Status Lines Untreated+        
                cases',                                                +        
               POS=(8,16),LTH=61,                                      +        
               ATTR=(PROT)                                                      
KDCMD1   DFLD  POS=(9,2),LTH=4,                                        +        
               ATTR=(NOPROT)                                                    
IDANSV1  DFLD  POS=(9,7),LTH=6,                                        +        
               ATTR=(NUM,PROT)                                                  
DGIA0031 DFLD  POS=(9,14),LTH=6,                                       +        
               ATTR=(PROT)                                                      
TILOSS1  DFLD  POS=(9,21),LTH=6,                                       +        
               ATTR=(PROT)                                                      
IDDISTR1 DFLD  POS=(9,29),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0004 DFLD  POS=(9,34),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0016 DFLD  POS=(9,41),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
STATUS1  DFLD  POS=(9,54),LTH=1,                                       +        
               ATTR=(PROT)                                                      
KVRADER1 DFLD  POS=(9,56),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KVRADO1  DFLD  POS=(9,66),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KVKOLLI1 DFLD  POS=(9,73),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KDCMD2   DFLD  POS=(10,2),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
IDANSV2  DFLD  POS=(10,7),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0032 DFLD  POS=(10,14),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TILOSS2  DFLD  POS=(10,21),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDDISTR2 DFLD  POS=(10,29),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0005 DFLD  POS=(10,34),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0017 DFLD  POS=(10,41),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
STATUS2  DFLD  POS=(10,54),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KVRADER2 DFLD  POS=(10,56),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVRADO2  DFLD  POS=(10,66),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVKOLLI2 DFLD  POS=(10,73),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KDCMD3   DFLD  POS=(11,2),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
IDANSV3  DFLD  POS=(11,7),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0033 DFLD  POS=(11,14),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TILOSS3  DFLD  POS=(11,21),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDDISTR3 DFLD  POS=(11,29),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0006 DFLD  POS=(11,34),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0018 DFLD  POS=(11,41),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
STATUS3  DFLD  POS=(11,54),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KVRADER3 DFLD  POS=(11,56),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVRADO3  DFLD  POS=(11,66),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVKOLLI3 DFLD  POS=(11,73),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KDCMD4   DFLD  POS=(12,2),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
IDANSV4  DFLD  POS=(12,7),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0034 DFLD  POS=(12,14),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TILOSS4  DFLD  POS=(12,21),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDDISTR4 DFLD  POS=(12,29),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0007 DFLD  POS=(12,34),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0019 DFLD  POS=(12,41),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
STATUS4  DFLD  POS=(12,54),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KVRADER4 DFLD  POS=(12,56),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVRADO4  DFLD  POS=(12,66),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVKOLLI4 DFLD  POS=(12,73),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KDCMD5   DFLD  POS=(13,2),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
IDANSV5  DFLD  POS=(13,7),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0035 DFLD  POS=(13,14),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TILOSS5  DFLD  POS=(13,21),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDDISTR5 DFLD  POS=(13,29),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0008 DFLD  POS=(13,34),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0020 DFLD  POS=(13,41),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
STATUS5  DFLD  POS=(13,54),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KVRADER5 DFLD  POS=(13,56),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVRADO5  DFLD  POS=(13,66),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVKOLLI5 DFLD  POS=(13,73),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KDCMD6   DFLD  POS=(14,2),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
IDANSV6  DFLD  POS=(14,7),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0036 DFLD  POS=(14,14),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TILOSS6  DFLD  POS=(14,21),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDDISTR6 DFLD  POS=(14,29),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0009 DFLD  POS=(14,34),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0021 DFLD  POS=(14,41),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
STATUS6  DFLD  POS=(14,54),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KVRADER6 DFLD  POS=(14,56),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVRADO6  DFLD  POS=(14,66),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVKOLLI6 DFLD  POS=(14,73),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KDCMD7   DFLD  POS=(15,2),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
IDANSV7  DFLD  POS=(15,7),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0037 DFLD  POS=(15,14),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TILOSS7  DFLD  POS=(15,21),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDDISTR7 DFLD  POS=(15,29),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0010 DFLD  POS=(15,34),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0022 DFLD  POS=(15,41),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
STATUS7  DFLD  POS=(15,54),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KVRADER7 DFLD  POS=(15,56),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVRADO7  DFLD  POS=(15,66),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVKOLLI7 DFLD  POS=(15,73),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KDCMD8   DFLD  POS=(16,2),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
IDANSV8  DFLD  POS=(16,7),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0038 DFLD  POS=(16,14),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TILOSS8  DFLD  POS=(16,21),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDDISTR8 DFLD  POS=(16,29),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0011 DFLD  POS=(16,34),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0023 DFLD  POS=(16,41),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
STATUS8  DFLD  POS=(16,54),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KVRADER8 DFLD  POS=(16,56),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVRADO8  DFLD  POS=(16,66),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVKOLLI8 DFLD  POS=(16,73),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KDCMD9   DFLD  POS=(17,2),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
IDANSV9  DFLD  POS=(17,7),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0039 DFLD  POS=(17,14),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TILOSS9  DFLD  POS=(17,21),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDDISTR9 DFLD  POS=(17,29),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0012 DFLD  POS=(17,34),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0024 DFLD  POS=(17,41),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
STATUS9  DFLD  POS=(17,54),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KVRADER9 DFLD  POS=(17,56),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVRADO9  DFLD  POS=(17,66),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVKOLLI9 DFLD  POS=(17,73),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KDCMD10  DFLD  POS=(18,2),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
IDANS10  DFLD  POS=(18,7),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0040 DFLD  POS=(18,14),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TILOSS10 DFLD  POS=(18,21),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0000 DFLD  POS=(18,29),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0013 DFLD  POS=(18,34),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0025 DFLD  POS=(18,41),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
STATUSA  DFLD  POS=(18,54),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0029 DFLD  POS=(18,56),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVRADO10 DFLD  POS=(18,66),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVKOLL10 DFLD  POS=(18,73),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KDCMD11  DFLD  POS=(19,2),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
IDANS11  DFLD  POS=(19,7),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0041 DFLD  POS=(19,14),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TILOSS11 DFLD  POS=(19,21),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0001 DFLD  POS=(19,29),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0014 DFLD  POS=(19,34),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0026 DFLD  POS=(19,41),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
STATUSB  DFLD  POS=(19,54),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0030 DFLD  POS=(19,56),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVRADO11 DFLD  POS=(19,66),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KVKOLL11 DFLD  POS=(19,73),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '13 Return queue   14 Loc  status   15 Reg  return   16 +        
               Case queue 17 Contents',                                +        
               POS=(21,2),LTH=77,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 Show RP queue  19 Treat RP',                        +        
               POS=(22,2),LTH=29,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20 Rep bin list  21',                                  +        
               POS=(22,37),LTH=19,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '10 Whelp',                                             +        
               POS=(22,68),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W4O736N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N736,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I736N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4N736                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDANSVI,                                                +        
               LTH=6                                                            
         MFLD  IDDISTRI,                                               +        
               LTH=4                                                            
         MFLD  DGIA0002,                                               +        
               LTH=6                                                            
         MFLD  DGIA0027,                                               +        
               LTH=1                                                            
         MFLD  DGIA0042,                                               +        
               LTH=1                                                            
         MFLD  FLSUMI,                                                 +        
               LTH=1                                                            
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  IDANSVU,                                                +        
               LTH=6                                                            
         MFLD  IDDISTRU,                                               +        
               LTH=4                                                            
         MFLD  DGIA0003,                                               +        
               LTH=6                                                            
         MFLD  DGIA0028,                                               +        
               LTH=1                                                            
         MFLD  DGIA0043,                                               +        
               LTH=1                                                            
         MFLD  FLSUMU,                                                 +        
               LTH=1                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  KVRT,                                                   +        
               LTH=5                                                            
         MFLD  KVRTRAD,                                                +        
               LTH=5                                                            
         MFLD  DGIA0015,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD1,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDANSV1,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0031,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TILOSS1,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDDISTR1,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0004,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0016,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  STATUS1,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVRADER1,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVRADO1,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVKOLLI1,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD2,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDANSV2,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0032,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TILOSS2,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDDISTR2,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0005,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0017,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  STATUS2,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVRADER2,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVRADO2,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVKOLLI2,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD3,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDANSV3,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0033,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TILOSS3,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDDISTR3,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0006,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0018,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  STATUS3,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVRADER3,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVRADO3,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVKOLLI3,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD4,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDANSV4,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0034,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TILOSS4,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDDISTR4,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0007,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0019,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  STATUS4,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVRADER4,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVRADO4,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVKOLLI4,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD5,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDANSV5,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0035,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TILOSS5,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDDISTR5,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0008,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0020,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  STATUS5,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVRADER5,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVRADO5,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVKOLLI5,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD6,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDANSV6,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0036,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TILOSS6,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDDISTR6,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0009,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0021,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  STATUS6,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVRADER6,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVRADO6,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVKOLLI6,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD7,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDANSV7,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0037,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TILOSS7,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDDISTR7,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0010,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0022,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  STATUS7,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVRADER7,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVRADO7,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVKOLLI7,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD8,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDANSV8,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0038,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TILOSS8,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDDISTR8,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0011,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0023,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  STATUS8,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVRADER8,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVRADO8,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVKOLLI8,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD9,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDANSV9,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0039,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TILOSS9,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDDISTR9,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0012,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0024,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  STATUS9,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVRADER9,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVRADO9,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVKOLLI9,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD10,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDANS10,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0040,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TILOSS10,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0000,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0013,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0025,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  STATUSA,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0029,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVRADO10,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVKOLL10,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD11,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDANS11,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0041,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TILOSS11,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0001,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0014,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0026,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  STATUSB,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0030,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVRADO11,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVKOLL11,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I736N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N736),                                           +        
               OPT=2,                                                  +        
               NXT=W4O736N1                                                     
MID      LPAGE SOR=(W4N736)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '47362',                                                +        
               LTH=5                                                            
         MFLD  (IDANSVI,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  IDANSVU,                                                +        
               LTH=6                                                            
         MFLD  (IDDISTRI,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDISTRU,                                               +        
               LTH=4                                                            
         MFLD  (DGIA0002,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0003,                                               +        
               LTH=6                                                            
         MFLD  (DGIA0027,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  DGIA0028,                                               +        
               LTH=1                                                            
         MFLD  (DGIA0042,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  DGIA0043,                                               +        
               LTH=1                                                            
         MFLD  (FLSUMI,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  FLSUMU,                                                 +        
               LTH=1                                                            
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  (DGIA0015,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KDCMD1,                                                +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (KDCMD2,                                                +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (KDCMD3,                                                +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (KDCMD4,                                                +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (KDCMD5,                                                +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (KDCMD6,                                                +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (KDCMD7,                                                +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (KDCMD8,                                                +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (KDCMD9,                                                +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (KDCMD10,                                               +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (KDCMD11,                                               +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  IDDISTR1,                                               +        
               LTH=4                                                            
         MFLD  DGIA0004,                                               +        
               LTH=6                                                            
         MFLD  DGIA0016,                                               +        
               LTH=7                                                            
         MFLD  IDDISTR2,                                               +        
               LTH=4                                                            
         MFLD  DGIA0005,                                               +        
               LTH=6                                                            
         MFLD  DGIA0017,                                               +        
               LTH=7                                                            
         MFLD  IDDISTR3,                                               +        
               LTH=4                                                            
         MFLD  DGIA0006,                                               +        
               LTH=6                                                            
         MFLD  DGIA0018,                                               +        
               LTH=7                                                            
         MFLD  IDDISTR4,                                               +        
               LTH=4                                                            
         MFLD  DGIA0007,                                               +        
               LTH=6                                                            
         MFLD  DGIA0019,                                               +        
               LTH=7                                                            
         MFLD  IDDISTR5,                                               +        
               LTH=4                                                            
         MFLD  DGIA0008,                                               +        
               LTH=6                                                            
         MFLD  DGIA0020,                                               +        
               LTH=7                                                            
         MFLD  IDDISTR6,                                               +        
               LTH=4                                                            
         MFLD  DGIA0009,                                               +        
               LTH=6                                                            
         MFLD  DGIA0021,                                               +        
               LTH=7                                                            
         MFLD  IDDISTR7,                                               +        
               LTH=4                                                            
         MFLD  DGIA0010,                                               +        
               LTH=6                                                            
         MFLD  DGIA0022,                                               +        
               LTH=7                                                            
         MFLD  IDDISTR8,                                               +        
               LTH=4                                                            
         MFLD  DGIA0011,                                               +        
               LTH=6                                                            
         MFLD  DGIA0023,                                               +        
               LTH=7                                                            
         MFLD  IDDISTR9,                                               +        
               LTH=4                                                            
         MFLD  DGIA0012,                                               +        
               LTH=6                                                            
         MFLD  DGIA0024,                                               +        
               LTH=7                                                            
         MFLD  DGIA0000,                                               +        
               LTH=4                                                            
         MFLD  DGIA0013,                                               +        
               LTH=6                                                            
         MFLD  DGIA0025,                                               +        
               LTH=7                                                            
         MFLD  DGIA0001,                                               +        
               LTH=4                                                            
         MFLD  DGIA0014,                                               +        
               LTH=6                                                            
         MFLD  DGIA0026,                                               +        
               LTH=7                                                            
         MSGEND                                                                 
         END                                                                    
