***********************************************************************         
* CREATED BY PC70375   ON 98/09/24  AT 13:13                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'KÖ OBEH. LEV-ANM-RADER          '                               
W4N721   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T721 7',                                           +        
               8='W4T721 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T721  ',                                          +        
               14='W4T722  ',                                          +        
               15='W4T723  ',                                          +        
               16='W4T724  ',                                          +        
               17='W4T725  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4F721   DPAGE CURSOR=((2,7)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'QUEUE REM. DISCR. LINES',                              +        
               POS=(1,11),LTH=23,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Resp',                                                 +        
               POS=(2,2),LTH=4,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDANSVI  DFLD  POS=(2,7),LTH=6,                                        +        
               ATTR=(NOPROT)                                                    
         DFLD  'Date-from',                                            +        
               POS=(2,14),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
TILEVANI DFLD  POS=(2,24),LTH=6,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Code',                                                 +        
               POS=(2,31),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
KDANMORI DFLD  POS=(2,36),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'TK',                                                   +        
               POS=(2,40),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KDKREBI  DFLD  POS=(2,43),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Sum queue',                                            +        
               POS=(2,48),LTH=9,                                       +        
               ATTR=(PROT)                                                      
FLSUMI   DFLD  POS=(2,59),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDANSVU  DFLD  POS=(3,7),LTH=6,                                        +        
               ATTR=(PROT,MOD)                                                  
TILEVANU DFLD  POS=(3,24),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
KDANMORU DFLD  POS=(3,36),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
KDKREBU  DFLD  POS=(3,43),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
FLSUMU   DFLD  POS=(3,59),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Qty lines in queue',                                   +        
               POS=(5,2),LTH=18,                                       +        
               ATTR=(PROT)                                                      
KVRTRAD  DFLD  POS=(5,23),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Cmd  Resp',                                            +        
               POS=(7,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Date Distr   Cust  DR No. Order Line Part No.    Qty Co+        
               de T  TK',                                              +        
               POS=(7,16),LTH=63,                                      +        
               ATTR=(PROT)                                                      
KDCMD1   DFLD  POS=(8,2),LTH=4,                                        +        
               ATTR=(NOPROT)                                                    
IDANSV1  DFLD  POS=(8,7),LTH=6,                                        +        
               ATTR=(NUM,PROT)                                                  
TILEVA1  DFLD  POS=(8,14),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
IDDISTR1 DFLD  POS=(8,22),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
IDKUNDN1 DFLD  POS=(8,27),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
IDRAPPN1 DFLD  POS=(8,34),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
IDORDNR1 DFLD  POS=(8,42),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
IDRADNR1 DFLD  POS=(8,48),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
IDARTNR1 DFLD  POS=(8,53),LTH=8,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KVLEVA1  DFLD  POS=(8,62),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
KDANMO1  DFLD  POS=(8,71),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLTEXT1  DFLD  POS=(8,74),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
KDKREB1  DFLD  POS=(8,77),LTH=3,                                       +        
               ATTR=(PROT)                                                      
KDCMD2   DFLD  POS=(9,2),LTH=4,                                        +        
               ATTR=(NOPROT)                                                    
IDANSV2  DFLD  POS=(9,7),LTH=6,                                        +        
               ATTR=(NUM,PROT)                                                  
TILEVA2  DFLD  POS=(9,14),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
IDDISTR2 DFLD  POS=(9,22),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
IDKUNDN2 DFLD  POS=(9,27),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
IDRAPPN2 DFLD  POS=(9,34),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
IDORDNR2 DFLD  POS=(9,42),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
IDRADNR2 DFLD  POS=(9,48),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
IDARTNR2 DFLD  POS=(9,53),LTH=8,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KVLEVA2  DFLD  POS=(9,62),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
KDANMO2  DFLD  POS=(9,71),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLTEXT2  DFLD  POS=(9,74),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
KDKREB2  DFLD  POS=(9,77),LTH=3,                                       +        
               ATTR=(PROT)                                                      
KDCMD3   DFLD  POS=(10,2),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
IDANSV3  DFLD  POS=(10,7),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
TILEVA3  DFLD  POS=(10,14),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
IDDISTR3 DFLD  POS=(10,22),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
IDKUNDN3 DFLD  POS=(10,27),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
IDRAPPN3 DFLD  POS=(10,34),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
IDORDNR3 DFLD  POS=(10,42),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
IDRADNR3 DFLD  POS=(10,48),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
IDARTNR3 DFLD  POS=(10,53),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KVLEVA3  DFLD  POS=(10,62),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
KDANMO3  DFLD  POS=(10,71),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLTEXT3  DFLD  POS=(10,74),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
KDKREB3  DFLD  POS=(10,77),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KDCMD4   DFLD  POS=(11,2),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
IDANSV4  DFLD  POS=(11,7),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
TILEVA4  DFLD  POS=(11,14),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
IDDISTR4 DFLD  POS=(11,22),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
IDKUNDN4 DFLD  POS=(11,27),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
IDRAPPN4 DFLD  POS=(11,34),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
IDORDNR4 DFLD  POS=(11,42),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
IDRADNR4 DFLD  POS=(11,48),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
IDARTNR4 DFLD  POS=(11,53),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KVLEVA4  DFLD  POS=(11,62),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
KDANMO4  DFLD  POS=(11,71),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLTEXT4  DFLD  POS=(11,74),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
KDKREB4  DFLD  POS=(11,77),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KDCMD5   DFLD  POS=(12,2),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
IDANSV5  DFLD  POS=(12,7),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
TILEVA5  DFLD  POS=(12,14),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
IDDISTR5 DFLD  POS=(12,22),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
IDKUNDN5 DFLD  POS=(12,27),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
IDRAPPN5 DFLD  POS=(12,34),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
IDORDNR5 DFLD  POS=(12,42),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
IDRADNR5 DFLD  POS=(12,48),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
IDARTNR5 DFLD  POS=(12,53),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KVLEVA5  DFLD  POS=(12,62),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
KDANMO5  DFLD  POS=(12,71),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLTEXT5  DFLD  POS=(12,74),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
KDKREB5  DFLD  POS=(12,77),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KDCMD6   DFLD  POS=(13,2),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
IDANSV6  DFLD  POS=(13,7),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
TILEVA6  DFLD  POS=(13,14),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
IDDISTR6 DFLD  POS=(13,22),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
IDKUNDN6 DFLD  POS=(13,27),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
IDRAPPN6 DFLD  POS=(13,34),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
IDORDNR6 DFLD  POS=(13,42),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
IDRADNR6 DFLD  POS=(13,48),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
IDARTNR6 DFLD  POS=(13,53),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KVLEVA6  DFLD  POS=(13,62),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
KDANMO6  DFLD  POS=(13,71),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLTEXT6  DFLD  POS=(13,74),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
KDKREB6  DFLD  POS=(13,77),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KDCMD7   DFLD  POS=(14,2),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
IDANSV7  DFLD  POS=(14,7),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
TILEVA7  DFLD  POS=(14,14),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
IDDISTR7 DFLD  POS=(14,22),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
IDKUNDN7 DFLD  POS=(14,27),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
IDRAPPN7 DFLD  POS=(14,34),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
IDORNR7  DFLD  POS=(14,42),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
IDRADNR7 DFLD  POS=(14,48),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
IDARTNR7 DFLD  POS=(14,53),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KVLEVA7  DFLD  POS=(14,62),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
KDANMO7  DFLD  POS=(14,71),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLTEXT7  DFLD  POS=(14,74),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
KDKREB7  DFLD  POS=(14,77),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KDCMD8   DFLD  POS=(15,2),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
IDANSV8  DFLD  POS=(15,7),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
TILEVA8  DFLD  POS=(15,14),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
IDDISTR8 DFLD  POS=(15,22),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
IDKUNDN8 DFLD  POS=(15,27),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
IDRAPPN8 DFLD  POS=(15,34),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
IDORDNR8 DFLD  POS=(15,42),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
IDRADNR8 DFLD  POS=(15,48),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
IDARTNR8 DFLD  POS=(15,53),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KVLEVA8  DFLD  POS=(15,62),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
KDANMO8  DFLD  POS=(15,71),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLTEXT8  DFLD  POS=(15,74),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
KDKREB8  DFLD  POS=(15,77),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KDCMD9   DFLD  POS=(16,2),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
IDANSV9  DFLD  POS=(16,7),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
TILEVA9  DFLD  POS=(16,14),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
IDDISTR9 DFLD  POS=(16,22),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
IDKUNDN9 DFLD  POS=(16,27),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
IDRAPPN9 DFLD  POS=(16,34),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
IDORDNR9 DFLD  POS=(16,42),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
IDRADNR9 DFLD  POS=(16,48),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
IDARTNR9 DFLD  POS=(16,53),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KVLEVA9  DFLD  POS=(16,62),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
KDANMO9  DFLD  POS=(16,71),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLTEXT9  DFLD  POS=(16,74),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
KDKREB9  DFLD  POS=(16,77),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KDCMD10  DFLD  POS=(17,2),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
IDANS10  DFLD  POS=(17,7),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
TILEVA10 DFLD  POS=(17,14),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
IDDIST10 DFLD  POS=(17,22),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
IDKUND10 DFLD  POS=(17,27),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
IDRAPP10 DFLD  POS=(17,34),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
IDORDN10 DFLD  POS=(17,42),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
IDRADN10 DFLD  POS=(17,48),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
IDARTN10 DFLD  POS=(17,53),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KVLEVA10 DFLD  POS=(17,62),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
KDANMO10 DFLD  POS=(17,71),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLTEXT10 DFLD  POS=(17,74),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
KDKREB10 DFLD  POS=(17,77),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KDCMD11  DFLD  POS=(18,2),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
IDANS11  DFLD  POS=(18,7),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
TILEVA11 DFLD  POS=(18,14),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
IDDIST11 DFLD  POS=(18,22),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
IDKUND11 DFLD  POS=(18,27),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
IDRAPP11 DFLD  POS=(18,34),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
IDORDN11 DFLD  POS=(18,42),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
IDRADN11 DFLD  POS=(18,48),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
IDARTN11 DFLD  POS=(18,53),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KVLEVA11 DFLD  POS=(18,62),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
KDANMO11 DFLD  POS=(18,71),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLTEXT11 DFLD  POS=(18,74),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
KDKREB11 DFLD  POS=(18,77),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KDCMD12  DFLD  POS=(19,2),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
IDANS12  DFLD  POS=(19,7),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
TILEVA12 DFLD  POS=(19,14),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
IDDIST12 DFLD  POS=(19,22),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
IDKUND12 DFLD  POS=(19,27),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
IDRAPP12 DFLD  POS=(19,34),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
IDORDN12 DFLD  POS=(19,42),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
IDRADN12 DFLD  POS=(19,48),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
IDARTN12 DFLD  POS=(19,53),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KVLEVA12 DFLD  POS=(19,62),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
KDANMO12 DFLD  POS=(19,71),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLTEXT12 DFLD  POS=(19,74),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
KDKREB12 DFLD  POS=(19,77),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '13 Line queue   14 Discr. line    15 Discr. Text  16 Di+        
               scr. Part  17 Case info',                               +        
               POS=(21,2),LTH=78,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,36),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,52),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 whelp',                                             +        
               POS=(22,68),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O721N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N721,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I721N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4F721                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDANSVI,                                                +        
               LTH=6                                                            
         MFLD  TILEVANI,                                               +        
               LTH=6                                                            
         MFLD  KDANMORI,                                               +        
               LTH=2                                                            
         MFLD  KDKREBI,                                                +        
               LTH=3                                                            
         MFLD  FLSUMI,                                                 +        
               LTH=1                                                            
         MFLD  IDANSVU,                                                +        
               LTH=6                                                            
         MFLD  TILEVANU,                                               +        
               LTH=6                                                            
         MFLD  KDANMORU,                                               +        
               LTH=2                                                            
         MFLD  KDKREBU,                                                +        
               LTH=3                                                            
         MFLD  FLSUMU,                                                 +        
               LTH=1                                                            
         MFLD  KVRTRAD,                                                +        
               LTH=5                                                            
         MFLD  KDCMD1,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD2,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD3,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD4,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD5,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD6,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD7,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD8,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD9,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD10,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD11,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD12,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDANSV1,                                                +        
               LTH=6                                                            
         MFLD  TILEVA1,                                                +        
               LTH=6                                                            
         MFLD  IDDISTR1,                                               +        
               LTH=4                                                            
         MFLD  IDKUNDN1,                                               +        
               LTH=6                                                            
         MFLD  IDRAPPN1,                                               +        
               LTH=7                                                            
         MFLD  IDORDNR1,                                               +        
               LTH=5                                                            
         MFLD  IDRADNR1,                                               +        
               LTH=4                                                            
         MFLD  IDARTNR1,                                               +        
               LTH=8                                                            
         MFLD  KVLEVA1,                                                +        
               LTH=6                                                            
         MFLD  KDANMO1,                                                +        
               LTH=2                                                            
         MFLD  FLTEXT1,                                                +        
               LTH=1                                                            
         MFLD  KDKREB1,                                                +        
               LTH=3                                                            
         MFLD  IDANSV2,                                                +        
               LTH=6                                                            
         MFLD  TILEVA2,                                                +        
               LTH=6                                                            
         MFLD  IDDISTR2,                                               +        
               LTH=4                                                            
         MFLD  IDKUNDN2,                                               +        
               LTH=6                                                            
         MFLD  IDRAPPN2,                                               +        
               LTH=7                                                            
         MFLD  IDORDNR2,                                               +        
               LTH=5                                                            
         MFLD  IDRADNR2,                                               +        
               LTH=4                                                            
         MFLD  IDARTNR2,                                               +        
               LTH=8                                                            
         MFLD  KVLEVA2,                                                +        
               LTH=6                                                            
         MFLD  KDANMO2,                                                +        
               LTH=2                                                            
         MFLD  FLTEXT2,                                                +        
               LTH=1                                                            
         MFLD  KDKREB2,                                                +        
               LTH=3                                                            
         MFLD  IDANSV3,                                                +        
               LTH=6                                                            
         MFLD  TILEVA3,                                                +        
               LTH=6                                                            
         MFLD  IDDISTR3,                                               +        
               LTH=4                                                            
         MFLD  IDKUNDN3,                                               +        
               LTH=6                                                            
         MFLD  IDRAPPN3,                                               +        
               LTH=7                                                            
         MFLD  IDORDNR3,                                               +        
               LTH=5                                                            
         MFLD  IDRADNR3,                                               +        
               LTH=4                                                            
         MFLD  IDARTNR3,                                               +        
               LTH=8                                                            
         MFLD  KVLEVA3,                                                +        
               LTH=6                                                            
         MFLD  KDANMO3,                                                +        
               LTH=2                                                            
         MFLD  FLTEXT3,                                                +        
               LTH=1                                                            
         MFLD  KDKREB3,                                                +        
               LTH=3                                                            
         MFLD  IDANSV4,                                                +        
               LTH=6                                                            
         MFLD  TILEVA4,                                                +        
               LTH=6                                                            
         MFLD  IDDISTR4,                                               +        
               LTH=4                                                            
         MFLD  IDKUNDN4,                                               +        
               LTH=6                                                            
         MFLD  IDRAPPN4,                                               +        
               LTH=7                                                            
         MFLD  IDORDNR4,                                               +        
               LTH=5                                                            
         MFLD  IDRADNR4,                                               +        
               LTH=4                                                            
         MFLD  IDARTNR4,                                               +        
               LTH=8                                                            
         MFLD  KVLEVA4,                                                +        
               LTH=6                                                            
         MFLD  KDANMO4,                                                +        
               LTH=2                                                            
         MFLD  FLTEXT4,                                                +        
               LTH=1                                                            
         MFLD  KDKREB4,                                                +        
               LTH=3                                                            
         MFLD  IDANSV5,                                                +        
               LTH=6                                                            
         MFLD  TILEVA5,                                                +        
               LTH=6                                                            
         MFLD  IDDISTR5,                                               +        
               LTH=4                                                            
         MFLD  IDKUNDN5,                                               +        
               LTH=6                                                            
         MFLD  IDRAPPN5,                                               +        
               LTH=7                                                            
         MFLD  IDORDNR5,                                               +        
               LTH=5                                                            
         MFLD  IDRADNR5,                                               +        
               LTH=4                                                            
         MFLD  IDARTNR5,                                               +        
               LTH=8                                                            
         MFLD  KVLEVA5,                                                +        
               LTH=6                                                            
         MFLD  KDANMO5,                                                +        
               LTH=2                                                            
         MFLD  FLTEXT5,                                                +        
               LTH=1                                                            
         MFLD  KDKREB5,                                                +        
               LTH=3                                                            
         MFLD  IDANSV6,                                                +        
               LTH=6                                                            
         MFLD  TILEVA6,                                                +        
               LTH=6                                                            
         MFLD  IDDISTR6,                                               +        
               LTH=4                                                            
         MFLD  IDKUNDN6,                                               +        
               LTH=6                                                            
         MFLD  IDRAPPN6,                                               +        
               LTH=7                                                            
         MFLD  IDORDNR6,                                               +        
               LTH=5                                                            
         MFLD  IDRADNR6,                                               +        
               LTH=4                                                            
         MFLD  IDARTNR6,                                               +        
               LTH=8                                                            
         MFLD  KVLEVA6,                                                +        
               LTH=6                                                            
         MFLD  KDANMO6,                                                +        
               LTH=2                                                            
         MFLD  FLTEXT6,                                                +        
               LTH=1                                                            
         MFLD  KDKREB6,                                                +        
               LTH=3                                                            
         MFLD  IDANSV7,                                                +        
               LTH=6                                                            
         MFLD  TILEVA7,                                                +        
               LTH=6                                                            
         MFLD  IDDISTR7,                                               +        
               LTH=4                                                            
         MFLD  IDKUNDN7,                                               +        
               LTH=6                                                            
         MFLD  IDRAPPN7,                                               +        
               LTH=7                                                            
         MFLD  IDORNR7,                                                +        
               LTH=5                                                            
         MFLD  IDRADNR7,                                               +        
               LTH=4                                                            
         MFLD  IDARTNR7,                                               +        
               LTH=8                                                            
         MFLD  KVLEVA7,                                                +        
               LTH=6                                                            
         MFLD  KDANMO7,                                                +        
               LTH=2                                                            
         MFLD  FLTEXT7,                                                +        
               LTH=1                                                            
         MFLD  KDKREB7,                                                +        
               LTH=3                                                            
         MFLD  IDANSV8,                                                +        
               LTH=6                                                            
         MFLD  TILEVA8,                                                +        
               LTH=6                                                            
         MFLD  IDDISTR8,                                               +        
               LTH=4                                                            
         MFLD  IDKUNDN8,                                               +        
               LTH=6                                                            
         MFLD  IDRAPPN8,                                               +        
               LTH=7                                                            
         MFLD  IDORDNR8,                                               +        
               LTH=5                                                            
         MFLD  IDRADNR8,                                               +        
               LTH=4                                                            
         MFLD  IDARTNR8,                                               +        
               LTH=8                                                            
         MFLD  KVLEVA8,                                                +        
               LTH=6                                                            
         MFLD  KDANMO8,                                                +        
               LTH=2                                                            
         MFLD  FLTEXT8,                                                +        
               LTH=1                                                            
         MFLD  KDKREB8,                                                +        
               LTH=3                                                            
         MFLD  IDANSV9,                                                +        
               LTH=6                                                            
         MFLD  TILEVA9,                                                +        
               LTH=6                                                            
         MFLD  IDDISTR9,                                               +        
               LTH=4                                                            
         MFLD  IDKUNDN9,                                               +        
               LTH=6                                                            
         MFLD  IDRAPPN9,                                               +        
               LTH=7                                                            
         MFLD  IDORDNR9,                                               +        
               LTH=5                                                            
         MFLD  IDRADNR9,                                               +        
               LTH=4                                                            
         MFLD  IDARTNR9,                                               +        
               LTH=8                                                            
         MFLD  KVLEVA9,                                                +        
               LTH=6                                                            
         MFLD  KDANMO9,                                                +        
               LTH=2                                                            
         MFLD  FLTEXT9,                                                +        
               LTH=1                                                            
         MFLD  KDKREB9,                                                +        
               LTH=3                                                            
         MFLD  IDANS10,                                                +        
               LTH=6                                                            
         MFLD  TILEVA10,                                               +        
               LTH=6                                                            
         MFLD  IDDIST10,                                               +        
               LTH=4                                                            
         MFLD  IDKUND10,                                               +        
               LTH=6                                                            
         MFLD  IDRAPP10,                                               +        
               LTH=7                                                            
         MFLD  IDORDN10,                                               +        
               LTH=5                                                            
         MFLD  IDRADN10,                                               +        
               LTH=4                                                            
         MFLD  IDARTN10,                                               +        
               LTH=8                                                            
         MFLD  KVLEVA10,                                               +        
               LTH=6                                                            
         MFLD  KDANMO10,                                               +        
               LTH=2                                                            
         MFLD  FLTEXT10,                                               +        
               LTH=1                                                            
         MFLD  KDKREB10,                                               +        
               LTH=3                                                            
         MFLD  IDANS11,                                                +        
               LTH=6                                                            
         MFLD  TILEVA11,                                               +        
               LTH=6                                                            
         MFLD  IDDIST11,                                               +        
               LTH=4                                                            
         MFLD  IDKUND11,                                               +        
               LTH=6                                                            
         MFLD  IDRAPP11,                                               +        
               LTH=7                                                            
         MFLD  IDORDN11,                                               +        
               LTH=5                                                            
         MFLD  IDRADN11,                                               +        
               LTH=4                                                            
         MFLD  IDARTN11,                                               +        
               LTH=8                                                            
         MFLD  KVLEVA11,                                               +        
               LTH=6                                                            
         MFLD  KDANMO11,                                               +        
               LTH=2                                                            
         MFLD  FLTEXT11,                                               +        
               LTH=1                                                            
         MFLD  KDKREB11,                                               +        
               LTH=3                                                            
         MFLD  IDANS12,                                                +        
               LTH=6                                                            
         MFLD  TILEVA12,                                               +        
               LTH=6                                                            
         MFLD  IDDIST12,                                               +        
               LTH=4                                                            
         MFLD  IDKUND12,                                               +        
               LTH=6                                                            
         MFLD  IDRAPP12,                                               +        
               LTH=7                                                            
         MFLD  IDORDN12,                                               +        
               LTH=5                                                            
         MFLD  IDRADN12,                                               +        
               LTH=4                                                            
         MFLD  IDARTN12,                                               +        
               LTH=8                                                            
         MFLD  KVLEVA12,                                               +        
               LTH=6                                                            
         MFLD  KDANMO12,                                               +        
               LTH=2                                                            
         MFLD  FLTEXT12,                                               +        
               LTH=1                                                            
         MFLD  KDKREB12,                                               +        
               LTH=3                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I721N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N721),                                           +        
               OPT=2,                                                  +        
               NXT=W4O721N1                                                     
MID      LPAGE SOR=(W4F721)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  (FLD0102,                                               +        
               '4'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  (FLD0104,                                               +        
               '7'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  (FLD0106,                                               +        
               '2'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  (FLD0108,                                               +        
               '1'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '47212',                                                +        
               LTH=5                                                            
         MFLD  (IDANSVI,                                               +        
               '++++++'),                                              +        
               LTH=6                                                            
         MFLD  IDANSVU,                                                +        
               LTH=6                                                            
         MFLD  (TILEVANI,                                              +        
               '++++++'),                                              +        
               LTH=6                                                            
         MFLD  TILEVANU,                                               +        
               LTH=6                                                            
         MFLD  (KDANMORI,                                              +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  KDANMORU,                                               +        
               LTH=2                                                            
         MFLD  (KDKREBI,                                               +        
               '+++'),                                                 +        
               LTH=3                                                            
         MFLD  KDKREBU,                                                +        
               LTH=3                                                            
         MFLD  (FLSUMI,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  FLSUMU,                                                 +        
               LTH=1                                                            
         MFLD  (KDCMD1,                                                +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (KDCMD2,                                                +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (KDCMD3,                                                +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (KDCMD4,                                                +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (KDCMD5,                                                +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (KDCMD6,                                                +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (KDCMD7,                                                +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (KDCMD8,                                                +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (KDCMD9,                                                +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (KDCMD10,                                               +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (KDCMD11,                                               +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (KDCMD12,                                               +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  IDDISTR1,                                               +        
               LTH=4                                                            
         MFLD  IDKUNDN1,                                               +        
               LTH=6                                                            
         MFLD  IDRAPPN1,                                               +        
               LTH=7                                                            
         MFLD  IDRADNR1,                                               +        
               LTH=4                                                            
         MFLD  IDARTNR1,                                               +        
               LTH=8                                                            
         MFLD  IDDISTR2,                                               +        
               LTH=4                                                            
         MFLD  IDKUNDN2,                                               +        
               LTH=6                                                            
         MFLD  IDRAPPN2,                                               +        
               LTH=7                                                            
         MFLD  IDRADNR2,                                               +        
               LTH=4                                                            
         MFLD  IDARTNR2,                                               +        
               LTH=8                                                            
         MFLD  IDDISTR3,                                               +        
               LTH=4                                                            
         MFLD  IDKUNDN3,                                               +        
               LTH=6                                                            
         MFLD  IDRAPPN3,                                               +        
               LTH=7                                                            
         MFLD  IDRADNR3,                                               +        
               LTH=4                                                            
         MFLD  IDARTNR3,                                               +        
               LTH=8                                                            
         MFLD  IDDISTR4,                                               +        
               LTH=4                                                            
         MFLD  IDKUNDN4,                                               +        
               LTH=6                                                            
         MFLD  IDRAPPN4,                                               +        
               LTH=7                                                            
         MFLD  IDRADNR4,                                               +        
               LTH=4                                                            
         MFLD  IDARTNR4,                                               +        
               LTH=8                                                            
         MFLD  IDDISTR5,                                               +        
               LTH=4                                                            
         MFLD  IDKUNDN5,                                               +        
               LTH=6                                                            
         MFLD  IDRAPPN5,                                               +        
               LTH=7                                                            
         MFLD  IDRADNR5,                                               +        
               LTH=4                                                            
         MFLD  IDARTNR5,                                               +        
               LTH=8                                                            
         MFLD  IDDISTR6,                                               +        
               LTH=4                                                            
         MFLD  IDKUNDN6,                                               +        
               LTH=6                                                            
         MFLD  IDRAPPN6,                                               +        
               LTH=7                                                            
         MFLD  IDRADNR6,                                               +        
               LTH=4                                                            
         MFLD  IDARTNR6,                                               +        
               LTH=8                                                            
         MFLD  IDDISTR7,                                               +        
               LTH=4                                                            
         MFLD  IDKUNDN7,                                               +        
               LTH=6                                                            
         MFLD  IDRAPPN7,                                               +        
               LTH=7                                                            
         MFLD  IDRADNR7,                                               +        
               LTH=4                                                            
         MFLD  IDARTNR7,                                               +        
               LTH=8                                                            
         MFLD  IDDISTR8,                                               +        
               LTH=4                                                            
         MFLD  IDKUNDN8,                                               +        
               LTH=6                                                            
         MFLD  IDRAPPN8,                                               +        
               LTH=7                                                            
         MFLD  IDRADNR8,                                               +        
               LTH=4                                                            
         MFLD  IDARTNR8,                                               +        
               LTH=8                                                            
         MFLD  IDDISTR9,                                               +        
               LTH=4                                                            
         MFLD  IDKUNDN9,                                               +        
               LTH=6                                                            
         MFLD  IDRAPPN9,                                               +        
               LTH=7                                                            
         MFLD  IDRADNR9,                                               +        
               LTH=4                                                            
         MFLD  IDARTNR9,                                               +        
               LTH=8                                                            
         MFLD  IDDIST10,                                               +        
               LTH=4                                                            
         MFLD  IDKUND10,                                               +        
               LTH=6                                                            
         MFLD  IDRAPP10,                                               +        
               LTH=7                                                            
         MFLD  IDRADN10,                                               +        
               LTH=4                                                            
         MFLD  IDARTN10,                                               +        
               LTH=8                                                            
         MFLD  IDDIST11,                                               +        
               LTH=4                                                            
         MFLD  IDKUND11,                                               +        
               LTH=6                                                            
         MFLD  IDRAPP11,                                               +        
               LTH=7                                                            
         MFLD  IDRADN11,                                               +        
               LTH=4                                                            
         MFLD  IDARTN11,                                               +        
               LTH=8                                                            
         MFLD  IDDIST12,                                               +        
               LTH=4                                                            
         MFLD  IDKUND12,                                               +        
               LTH=6                                                            
         MFLD  IDRAPP12,                                               +        
               LTH=7                                                            
         MFLD  IDRADN12,                                               +        
               LTH=4                                                            
         MFLD  IDARTN12,                                               +        
               LTH=8                                                            
         MSGEND                                                                 
         END                                                                    
