***********************************************************************         
* CREATED BY V070375   ON 08/09/25  AT 13:22                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'QUERY THE HANDLING FEE          '                               
W4N709   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T709 7',                                           +        
               8='W4T709 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W00501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,11)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'QUERY THE HANDLING FEE',                               +        
               POS=(1,11),LTH=22,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Parma No',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(NUM,PROT)                                                  
IDPARTIN DFLD  POS=(2,11),LTH=9,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'CC',                                                   +        
               POS=(2,21),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDFTGIN  DFLD  POS=(2,24),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'District',                                             +        
               POS=(2,27),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DISTIN   DFLD  POS=(2,36),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Customer',                                             +        
               POS=(2,41),LTH=8,                                       +        
               ATTR=(PROT)                                                      
KUNDIN   DFLD  POS=(2,50),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Status',                                               +        
               POS=(2,57),LTH=6,                                       +        
               ATTR=(PROT)                                                      
KDRIN    DFLD  POS=(2,64),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
IDPARTUT DFLD  POS=(3,11),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
IDFTGUT  DFLD  POS=(3,24),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DISTUT   DFLD  POS=(3,36),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
KUNDUT   DFLD  POS=(3,50),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
KDRUT    DFLD  POS=(3,64),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Cd Dist  Cust',                                        +        
               POS=(5,2),LTH=13,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Price CUR  Report',                                    +        
               POS=(5,23),LTH=17,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'St   Invoice Inv.Dt Upd by',                           +        
               POS=(5,45),LTH=26,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Date',                                                 +        
               POS=(5,76),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KOD1     DFLD  POS=(6,2),LTH=2,                                        +        
               ATTR=(NUM,PROT)                                                  
DIST1    DFLD  POS=(6,5),LTH=4,                                        +        
               ATTR=(NUM,PROT)                                                  
KUND1    DFLD  POS=(6,10),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
PRIS1    DFLD  POS=(6,18),LTH=10,                                      +        
               ATTR=(NUM,PROT)                                                  
CURR1    DFLD  POS=(6,29),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
RAPP1    DFLD  POS=(6,34),LTH=10,                                      +        
               ATTR=(NUM,PROT)                                                  
STAT1    DFLD  POS=(6,45),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
INV1     DFLD  POS=(6,48),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
INVDAT1  DFLD  POS=(6,58),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
USER1    DFLD  POS=(6,65),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
DT1      DFLD  POS=(6,74),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
KOD2     DFLD  POS=(7,2),LTH=2,                                        +        
               ATTR=(NUM,PROT)                                                  
DIST2    DFLD  POS=(7,5),LTH=4,                                        +        
               ATTR=(NUM,PROT)                                                  
KUND2    DFLD  POS=(7,10),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
PRIS2    DFLD  POS=(7,18),LTH=10,                                      +        
               ATTR=(NUM,PROT)                                                  
CURR2    DFLD  POS=(7,29),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
RAPP2    DFLD  POS=(7,34),LTH=10,                                      +        
               ATTR=(NUM,PROT)                                                  
STAT2    DFLD  POS=(7,45),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
INV2     DFLD  POS=(7,48),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
INVDAT2  DFLD  POS=(7,58),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
USER2    DFLD  POS=(7,65),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
DT2      DFLD  POS=(7,74),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
KOD3     DFLD  POS=(8,2),LTH=2,                                        +        
               ATTR=(NUM,PROT)                                                  
DIST3    DFLD  POS=(8,5),LTH=4,                                        +        
               ATTR=(NUM,PROT)                                                  
KUND3    DFLD  POS=(8,10),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
PRIS3    DFLD  POS=(8,18),LTH=10,                                      +        
               ATTR=(NUM,PROT)                                                  
CURR3    DFLD  POS=(8,29),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
RAPP3    DFLD  POS=(8,34),LTH=10,                                      +        
               ATTR=(NUM,PROT)                                                  
STAT3    DFLD  POS=(8,45),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
INV3     DFLD  POS=(8,48),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
INVDAT3  DFLD  POS=(8,58),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
USER3    DFLD  POS=(8,65),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
DT3      DFLD  POS=(8,74),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
KOD4     DFLD  POS=(9,2),LTH=2,                                        +        
               ATTR=(NUM,PROT)                                                  
DIST4    DFLD  POS=(9,5),LTH=4,                                        +        
               ATTR=(NUM,PROT)                                                  
KUND4    DFLD  POS=(9,10),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
PRIS4    DFLD  POS=(9,18),LTH=10,                                      +        
               ATTR=(NUM,PROT)                                                  
CURR4    DFLD  POS=(9,29),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
RAPP4    DFLD  POS=(9,34),LTH=10,                                      +        
               ATTR=(NUM,PROT)                                                  
STAT4    DFLD  POS=(9,45),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
INV4     DFLD  POS=(9,48),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
INVDAT4  DFLD  POS=(9,58),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
USER4    DFLD  POS=(9,65),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
DT4      DFLD  POS=(9,74),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
KOD5     DFLD  POS=(10,2),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DIST5    DFLD  POS=(10,5),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
KUND5    DFLD  POS=(10,10),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
PRIS5    DFLD  POS=(10,18),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
CURR5    DFLD  POS=(10,29),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
RAPP5    DFLD  POS=(10,34),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
STAT5    DFLD  POS=(10,45),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
INV5     DFLD  POS=(10,48),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
INVDAT5  DFLD  POS=(10,58),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
USER5    DFLD  POS=(10,65),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
DT5      DFLD  POS=(10,74),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD6     DFLD  POS=(11,2),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DIST6    DFLD  POS=(11,5),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
KUND6    DFLD  POS=(11,10),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
PRIS6    DFLD  POS=(11,18),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
CURR6    DFLD  POS=(11,29),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
RAPP6    DFLD  POS=(11,34),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
STAT6    DFLD  POS=(11,45),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
INV6     DFLD  POS=(11,48),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
INVDAT6  DFLD  POS=(11,58),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
USER6    DFLD  POS=(11,65),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
DT6      DFLD  POS=(11,74),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD7     DFLD  POS=(12,2),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DIST7    DFLD  POS=(12,5),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
KUND7    DFLD  POS=(12,10),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
PRIS7    DFLD  POS=(12,18),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
CURR7    DFLD  POS=(12,29),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
RAPP7    DFLD  POS=(12,34),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
STAT7    DFLD  POS=(12,45),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
INV7     DFLD  POS=(12,48),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
INVDAT7  DFLD  POS=(12,58),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
USER7    DFLD  POS=(12,65),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
DT7      DFLD  POS=(12,74),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD8     DFLD  POS=(13,2),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DIST8    DFLD  POS=(13,5),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
KUND8    DFLD  POS=(13,10),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
PRIS8    DFLD  POS=(13,18),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
CURR8    DFLD  POS=(13,29),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
RAPP8    DFLD  POS=(13,34),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
STAT8    DFLD  POS=(13,45),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
INV8     DFLD  POS=(13,48),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
INVDAT8  DFLD  POS=(13,58),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
USER8    DFLD  POS=(13,65),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
DT8      DFLD  POS=(13,74),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD9     DFLD  POS=(14,2),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DIST9    DFLD  POS=(14,5),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
KUND9    DFLD  POS=(14,10),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
PRIS9    DFLD  POS=(14,18),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
CURR9    DFLD  POS=(14,29),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
RAPP9    DFLD  POS=(14,34),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
STAT9    DFLD  POS=(14,45),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
INV9     DFLD  POS=(14,48),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
INVDAT9  DFLD  POS=(14,58),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
USER9    DFLD  POS=(14,65),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
DT9      DFLD  POS=(14,74),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD10    DFLD  POS=(15,2),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DIST10   DFLD  POS=(15,5),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
KUND10   DFLD  POS=(15,10),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
PRIS10   DFLD  POS=(15,18),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
CURR10   DFLD  POS=(15,29),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
RAPP10   DFLD  POS=(15,34),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
STAT10   DFLD  POS=(15,45),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
INV10    DFLD  POS=(15,48),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
INVDAT10 DFLD  POS=(15,58),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
USER10   DFLD  POS=(15,65),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
D10      DFLD  POS=(15,74),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
KOD11    DFLD  POS=(16,2),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DIST11   DFLD  POS=(16,5),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
KUND11   DFLD  POS=(16,10),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
PRIS11   DFLD  POS=(16,18),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
CURR11   DFLD  POS=(16,29),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
RAPP11   DFLD  POS=(16,34),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
STAT11   DFLD  POS=(16,45),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
INV11    DFLD  POS=(16,48),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
INVDAT11 DFLD  POS=(16,58),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
USER11   DFLD  POS=(16,65),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
D11      DFLD  POS=(16,74),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Total waiting to be invoiced:',                        +        
               POS=(18,2),LTH=29,                                      +        
               ATTR=(PROT)                                                      
SUM      DFLD  POS=(18,34),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
         DFLD  '72',                                                   +        
               POS=(19,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
PRIS72   DFLD  POS=(19,7),LTH=10,                                      +        
               ATTR=(NUM,PROT)                                                  
CURR72   DFLD  POS=(19,19),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  '98',                                                   +        
               POS=(19,26),LTH=2,                                      +        
               ATTR=(PROT)                                                      
PRIS98   DFLD  POS=(19,31),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
CURR98   DFLD  POS=(19,43),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'ROR',                                                  +        
               POS=(19,49),LTH=3,                                      +        
               ATTR=(PROT)                                                      
PRISRR   DFLD  POS=(19,55),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
CURRROR  DFLD  POS=(19,67),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'F10=WHELP  F11=Update   F12=Logoff',                   +        
               POS=(22,2),LTH=34,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O709N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N709,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I709N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  IDPARTIN,                                               +        
               LTH=2                                                            
         MFLD  IDPARTUT,                                               +        
               LTH=9                                                            
         MFLD  IDFTGIN,                                                +        
               LTH=2                                                            
         MFLD  IDFTGUT,                                                +        
               LTH=2                                                            
         MFLD  DISTIN,                                                 +        
               LTH=2                                                            
         MFLD  DISTUT,                                                 +        
               LTH=4                                                            
         MFLD  KUNDIN,                                                 +        
               LTH=2                                                            
         MFLD  KUNDUT,                                                 +        
               LTH=6                                                            
         MFLD  KDRIN,                                                  +        
               LTH=2                                                            
         MFLD  KDRUT,                                                  +        
               LTH=2                                                            
         MFLD  KOD1,                                                   +        
               LTH=2                                                            
         MFLD  DIST1,                                                  +        
               LTH=4                                                            
         MFLD  KUND1,                                                  +        
               LTH=6                                                            
         MFLD  PRIS1,                                                  +        
               LTH=10                                                           
         MFLD  CURR1,                                                  +        
               LTH=3                                                            
         MFLD  RAPP1,                                                  +        
               LTH=10                                                           
         MFLD  STAT1,                                                  +        
               LTH=2                                                            
         MFLD  INV1,                                                   +        
               LTH=9                                                            
         MFLD  INVDAT1,                                                +        
               LTH=6                                                            
         MFLD  USER1,                                                  +        
               LTH=8                                                            
         MFLD  DT1,                                                    +        
               LTH=6                                                            
         MFLD  KOD2,                                                   +        
               LTH=2                                                            
         MFLD  DIST2,                                                  +        
               LTH=4                                                            
         MFLD  KUND2,                                                  +        
               LTH=6                                                            
         MFLD  PRIS2,                                                  +        
               LTH=10                                                           
         MFLD  CURR2,                                                  +        
               LTH=3                                                            
         MFLD  RAPP2,                                                  +        
               LTH=10                                                           
         MFLD  STAT2,                                                  +        
               LTH=2                                                            
         MFLD  INV2,                                                   +        
               LTH=9                                                            
         MFLD  INVDAT2,                                                +        
               LTH=6                                                            
         MFLD  USER2,                                                  +        
               LTH=8                                                            
         MFLD  DT2,                                                    +        
               LTH=6                                                            
         MFLD  KOD3,                                                   +        
               LTH=2                                                            
         MFLD  DIST3,                                                  +        
               LTH=4                                                            
         MFLD  KUND3,                                                  +        
               LTH=6                                                            
         MFLD  PRIS3,                                                  +        
               LTH=10                                                           
         MFLD  CURR3,                                                  +        
               LTH=3                                                            
         MFLD  RAPP3,                                                  +        
               LTH=10                                                           
         MFLD  STAT3,                                                  +        
               LTH=2                                                            
         MFLD  INV3,                                                   +        
               LTH=9                                                            
         MFLD  INVDAT3,                                                +        
               LTH=6                                                            
         MFLD  USER3,                                                  +        
               LTH=8                                                            
         MFLD  DT3,                                                    +        
               LTH=6                                                            
         MFLD  KOD4,                                                   +        
               LTH=2                                                            
         MFLD  DIST4,                                                  +        
               LTH=4                                                            
         MFLD  KUND4,                                                  +        
               LTH=6                                                            
         MFLD  PRIS4,                                                  +        
               LTH=10                                                           
         MFLD  CURR4,                                                  +        
               LTH=3                                                            
         MFLD  RAPP4,                                                  +        
               LTH=10                                                           
         MFLD  STAT4,                                                  +        
               LTH=2                                                            
         MFLD  INV4,                                                   +        
               LTH=9                                                            
         MFLD  INVDAT4,                                                +        
               LTH=6                                                            
         MFLD  USER4,                                                  +        
               LTH=8                                                            
         MFLD  DT4,                                                    +        
               LTH=6                                                            
         MFLD  KOD5,                                                   +        
               LTH=2                                                            
         MFLD  DIST5,                                                  +        
               LTH=4                                                            
         MFLD  KUND5,                                                  +        
               LTH=6                                                            
         MFLD  PRIS5,                                                  +        
               LTH=10                                                           
         MFLD  CURR5,                                                  +        
               LTH=3                                                            
         MFLD  RAPP5,                                                  +        
               LTH=10                                                           
         MFLD  STAT5,                                                  +        
               LTH=2                                                            
         MFLD  INV5,                                                   +        
               LTH=9                                                            
         MFLD  INVDAT5,                                                +        
               LTH=6                                                            
         MFLD  USER5,                                                  +        
               LTH=8                                                            
         MFLD  DT5,                                                    +        
               LTH=6                                                            
         MFLD  KOD6,                                                   +        
               LTH=2                                                            
         MFLD  DIST6,                                                  +        
               LTH=4                                                            
         MFLD  KUND6,                                                  +        
               LTH=6                                                            
         MFLD  PRIS6,                                                  +        
               LTH=10                                                           
         MFLD  CURR6,                                                  +        
               LTH=3                                                            
         MFLD  RAPP6,                                                  +        
               LTH=10                                                           
         MFLD  STAT6,                                                  +        
               LTH=2                                                            
         MFLD  INV6,                                                   +        
               LTH=9                                                            
         MFLD  INVDAT6,                                                +        
               LTH=6                                                            
         MFLD  USER6,                                                  +        
               LTH=8                                                            
         MFLD  DT6,                                                    +        
               LTH=6                                                            
         MFLD  KOD7,                                                   +        
               LTH=2                                                            
         MFLD  DIST7,                                                  +        
               LTH=4                                                            
         MFLD  KUND7,                                                  +        
               LTH=6                                                            
         MFLD  PRIS7,                                                  +        
               LTH=10                                                           
         MFLD  CURR7,                                                  +        
               LTH=3                                                            
         MFLD  RAPP7,                                                  +        
               LTH=10                                                           
         MFLD  STAT7,                                                  +        
               LTH=2                                                            
         MFLD  INV7,                                                   +        
               LTH=9                                                            
         MFLD  INVDAT7,                                                +        
               LTH=6                                                            
         MFLD  USER7,                                                  +        
               LTH=8                                                            
         MFLD  DT7,                                                    +        
               LTH=6                                                            
         MFLD  KOD8,                                                   +        
               LTH=2                                                            
         MFLD  DIST8,                                                  +        
               LTH=4                                                            
         MFLD  KUND8,                                                  +        
               LTH=6                                                            
         MFLD  PRIS8,                                                  +        
               LTH=10                                                           
         MFLD  CURR8,                                                  +        
               LTH=3                                                            
         MFLD  RAPP8,                                                  +        
               LTH=10                                                           
         MFLD  STAT8,                                                  +        
               LTH=2                                                            
         MFLD  INV8,                                                   +        
               LTH=9                                                            
         MFLD  INVDAT8,                                                +        
               LTH=6                                                            
         MFLD  USER8,                                                  +        
               LTH=8                                                            
         MFLD  DT8,                                                    +        
               LTH=6                                                            
         MFLD  KOD9,                                                   +        
               LTH=2                                                            
         MFLD  DIST9,                                                  +        
               LTH=4                                                            
         MFLD  KUND9,                                                  +        
               LTH=6                                                            
         MFLD  PRIS9,                                                  +        
               LTH=10                                                           
         MFLD  CURR9,                                                  +        
               LTH=3                                                            
         MFLD  RAPP9,                                                  +        
               LTH=10                                                           
         MFLD  STAT9,                                                  +        
               LTH=2                                                            
         MFLD  INV9,                                                   +        
               LTH=9                                                            
         MFLD  INVDAT9,                                                +        
               LTH=6                                                            
         MFLD  USER9,                                                  +        
               LTH=8                                                            
         MFLD  DT9,                                                    +        
               LTH=6                                                            
         MFLD  KOD10,                                                  +        
               LTH=2                                                            
         MFLD  DIST10,                                                 +        
               LTH=4                                                            
         MFLD  KUND10,                                                 +        
               LTH=6                                                            
         MFLD  PRIS10,                                                 +        
               LTH=10                                                           
         MFLD  CURR10,                                                 +        
               LTH=3                                                            
         MFLD  RAPP10,                                                 +        
               LTH=10                                                           
         MFLD  STAT10,                                                 +        
               LTH=2                                                            
         MFLD  INV10,                                                  +        
               LTH=9                                                            
         MFLD  INVDAT10,                                               +        
               LTH=6                                                            
         MFLD  USER10,                                                 +        
               LTH=8                                                            
         MFLD  D10,                                                    +        
               LTH=6                                                            
         MFLD  KOD11,                                                  +        
               LTH=2                                                            
         MFLD  DIST11,                                                 +        
               LTH=4                                                            
         MFLD  KUND11,                                                 +        
               LTH=6                                                            
         MFLD  PRIS11,                                                 +        
               LTH=10                                                           
         MFLD  CURR11,                                                 +        
               LTH=3                                                            
         MFLD  RAPP11,                                                 +        
               LTH=10                                                           
         MFLD  STAT11,                                                 +        
               LTH=2                                                            
         MFLD  INV11,                                                  +        
               LTH=9                                                            
         MFLD  INVDAT11,                                               +        
               LTH=6                                                            
         MFLD  USER11,                                                 +        
               LTH=8                                                            
         MFLD  D11,                                                    +        
               LTH=6                                                            
         MFLD  SUM,                                                    +        
               LTH=10                                                           
         MFLD  PRIS72,                                                 +        
               LTH=10                                                           
         MFLD  CURR72,                                                 +        
               LTH=3                                                            
         MFLD  PRIS98,                                                 +        
               LTH=10                                                           
         MFLD  CURR98,                                                 +        
               LTH=3                                                            
         MFLD  PRISRR,                                                 +        
               LTH=10                                                           
         MFLD  CURRROR,                                                +        
               LTH=3                                                            
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I709N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N709),                                           +        
               OPT=2,                                                  +        
               NXT=W4O709N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F9'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '47092',                                                +        
               LTH=5                                                            
         MFLD  (IDPARTIN,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDFTGIN,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DISTIN,                                                +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KUNDIN,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KDRIN,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
