***********************************************************************         
* CREATED BY V0C9059   ON 09/10/28  AT 08:51                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'RETURN CODE MATRIX'                                             
W4N752   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               7='W4T752 7',                                           +        
               8='W4T752 8',                                           +        
               10='WHELP   ',                                          +        
               11='W4T752U ',                                          +        
               12='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((6,02)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Return Code Matrix       ',                            +        
               POS=(1,12),LTH=25,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'CMD',                                                  +        
               POS=(5,2),LTH=3,                                        +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  'Assortment',                                           +        
               POS=(5,6),LTH=10,                                       +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  '72',                                                   +        
               POS=(5,27),LTH=2,                                       +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  '98',                                                   +        
               POS=(5,31),LTH=2,                                       +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  '12',                                                   +        
               POS=(5,35),LTH=2,                                       +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  '22',                                                   +        
               POS=(5,39),LTH=2,                                       +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  '27',                                                   +        
               POS=(5,43),LTH=2,                                       +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  '42',                                                   +        
               POS=(5,47),LTH=2,                                       +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  '52',                                                   +        
               POS=(5,51),LTH=2,                                       +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  '54',                                                   +        
               POS=(5,55),LTH=2,                                       +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  '62',                                                   +        
               POS=(5,59),LTH=2,                                       +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  '74',                                                   +        
               POS=(5,63),LTH=2,                                       +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  '75',                                                   +        
               POS=(5,67),LTH=2,                                       +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  '82',                                                   +        
               POS=(5,71),LTH=2,                                       +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  '92',                                                   +        
               POS=(5,75),LTH=2,                                       +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  '94',                                                   +        
               POS=(5,79),LTH=2,                                       +        
               ATTR=(ALPHA,PROT)                                                
KDCMDV01 DFLD  POS=(6,2),LTH=1,                                        +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
BESORT01 DFLD  POS=(6,6),LTH=20,                                       +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETA01 DFLD  POS=(6,28),LTH=01,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETA02 DFLD  POS=(6,32),LTH=01,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETA03 DFLD  POS=(6,36),LTH=01,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETA04 DFLD  POS=(6,40),LTH=01,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETA05 DFLD  POS=(6,44),LTH=01,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETA06 DFLD  POS=(6,48),LTH=01,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETA07 DFLD  POS=(6,52),LTH=01,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETA08 DFLD  POS=(6,56),LTH=01,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETA09 DFLD  POS=(6,60),LTH=01,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETA10 DFLD  POS=(6,64),LTH=01,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETA11 DFLD  POS=(6,68),LTH=01,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETA12 DFLD  POS=(6,72),LTH=01,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETA13 DFLD  POS=(6,76),LTH=01,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETA14 DFLD  POS=(6,80),LTH=01,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDCMDV02 DFLD  POS=(7,2),LTH=1,                                        +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
BESORT02 DFLD  POS=(7,6),LTH=20,                                       +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETB01 DFLD  POS=(7,28),LTH=01,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETB02 DFLD  POS=(7,32),LTH=01,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETB03 DFLD  POS=(7,36),LTH=01,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETB04 DFLD  POS=(7,40),LTH=01,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETB05 DFLD  POS=(7,44),LTH=01,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETB06 DFLD  POS=(7,48),LTH=01,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETB07 DFLD  POS=(7,52),LTH=01,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETB08 DFLD  POS=(7,56),LTH=01,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETB09 DFLD  POS=(7,60),LTH=01,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETB10 DFLD  POS=(7,64),LTH=01,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETB11 DFLD  POS=(7,68),LTH=01,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETB12 DFLD  POS=(7,72),LTH=01,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETB13 DFLD  POS=(7,76),LTH=01,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETB14 DFLD  POS=(7,80),LTH=01,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDCMDV03 DFLD  POS=(8,2),LTH=1,                                        +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
BESORT03 DFLD  POS=(8,6),LTH=20,                                       +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETC01 DFLD  POS=(8,28),LTH=01,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETC02 DFLD  POS=(8,32),LTH=01,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETC03 DFLD  POS=(8,36),LTH=01,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETC04 DFLD  POS=(8,40),LTH=01,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETC05 DFLD  POS=(8,44),LTH=01,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETC06 DFLD  POS=(8,48),LTH=01,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETC07 DFLD  POS=(8,52),LTH=01,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETC08 DFLD  POS=(8,56),LTH=01,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETC09 DFLD  POS=(8,60),LTH=01,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETC10 DFLD  POS=(8,64),LTH=01,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETC11 DFLD  POS=(8,68),LTH=01,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETC12 DFLD  POS=(8,72),LTH=01,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETC13 DFLD  POS=(8,76),LTH=01,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETC14 DFLD  POS=(8,80),LTH=01,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDCMDV04 DFLD  POS=(9,2),LTH=1,                                        +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
BESORT04 DFLD  POS=(9,6),LTH=20,                                       +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETD01 DFLD  POS=(9,28),LTH=01,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETD02 DFLD  POS=(9,32),LTH=01,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETD03 DFLD  POS=(9,36),LTH=01,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETD04 DFLD  POS=(9,40),LTH=01,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETD05 DFLD  POS=(9,44),LTH=01,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETD06 DFLD  POS=(9,48),LTH=01,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETD07 DFLD  POS=(9,52),LTH=01,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETD08 DFLD  POS=(9,56),LTH=01,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETD09 DFLD  POS=(9,60),LTH=01,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETD10 DFLD  POS=(9,64),LTH=01,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETD11 DFLD  POS=(9,68),LTH=01,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETD12 DFLD  POS=(9,72),LTH=01,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETD13 DFLD  POS=(9,76),LTH=01,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETD14 DFLD  POS=(9,80),LTH=01,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDCMDV05 DFLD  POS=(10,2),LTH=1,                                       +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
BESORT05 DFLD  POS=(10,6),LTH=20,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETE01 DFLD  POS=(10,28),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETE02 DFLD  POS=(10,32),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETE03 DFLD  POS=(10,36),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETE04 DFLD  POS=(10,40),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETE05 DFLD  POS=(10,44),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETE06 DFLD  POS=(10,48),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETE07 DFLD  POS=(10,52),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETE08 DFLD  POS=(10,56),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETE09 DFLD  POS=(10,60),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETE10 DFLD  POS=(10,64),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETE11 DFLD  POS=(10,68),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETE12 DFLD  POS=(10,72),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETE13 DFLD  POS=(10,76),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETE14 DFLD  POS=(10,80),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDCMDV06 DFLD  POS=(11,2),LTH=1,                                       +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
BESORT06 DFLD  POS=(11,6),LTH=20,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETF01 DFLD  POS=(11,28),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETF02 DFLD  POS=(11,32),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETF03 DFLD  POS=(11,36),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETF04 DFLD  POS=(11,40),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETF05 DFLD  POS=(11,44),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETF06 DFLD  POS=(11,48),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETF07 DFLD  POS=(11,52),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETF08 DFLD  POS=(11,56),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETF09 DFLD  POS=(11,60),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETF10 DFLD  POS=(11,64),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETF11 DFLD  POS=(11,68),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETF12 DFLD  POS=(11,72),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETF13 DFLD  POS=(11,76),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETF14 DFLD  POS=(11,80),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDCMDV07 DFLD  POS=(12,2),LTH=1,                                       +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
BESORT07 DFLD  POS=(12,6),LTH=20,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETG01 DFLD  POS=(12,28),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETG02 DFLD  POS=(12,32),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETG03 DFLD  POS=(12,36),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETG04 DFLD  POS=(12,40),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETG05 DFLD  POS=(12,44),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETG06 DFLD  POS=(12,48),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETG07 DFLD  POS=(12,52),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETG08 DFLD  POS=(12,56),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETG09 DFLD  POS=(12,60),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETG10 DFLD  POS=(12,64),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETG11 DFLD  POS=(12,68),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETG12 DFLD  POS=(12,72),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETG13 DFLD  POS=(12,76),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETG14 DFLD  POS=(12,80),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDCMDV08 DFLD  POS=(13,2),LTH=1,                                       +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
BESORT08 DFLD  POS=(13,6),LTH=20,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETH01 DFLD  POS=(13,28),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETH02 DFLD  POS=(13,32),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETH03 DFLD  POS=(13,36),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETH04 DFLD  POS=(13,40),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETH05 DFLD  POS=(13,44),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETH06 DFLD  POS=(13,48),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETH07 DFLD  POS=(13,52),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETH08 DFLD  POS=(13,56),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETH09 DFLD  POS=(13,60),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETH10 DFLD  POS=(13,64),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETH11 DFLD  POS=(13,68),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETH12 DFLD  POS=(13,72),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETH13 DFLD  POS=(13,76),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETH14 DFLD  POS=(13,80),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDCMDV09 DFLD  POS=(14,2),LTH=1,                                       +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
BESORT09 DFLD  POS=(14,6),LTH=20,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETI01 DFLD  POS=(14,28),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETI02 DFLD  POS=(14,32),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETI03 DFLD  POS=(14,36),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETI04 DFLD  POS=(14,40),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETI05 DFLD  POS=(14,44),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETI06 DFLD  POS=(14,48),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETI07 DFLD  POS=(14,52),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETI08 DFLD  POS=(14,56),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETI09 DFLD  POS=(14,60),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETI10 DFLD  POS=(14,64),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETI11 DFLD  POS=(14,68),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETI12 DFLD  POS=(14,72),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETI13 DFLD  POS=(14,76),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETI14 DFLD  POS=(14,80),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDCMDV10 DFLD  POS=(15,2),LTH=1,                                       +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
BESORT10 DFLD  POS=(15,6),LTH=20,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETJ01 DFLD  POS=(15,28),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETJ02 DFLD  POS=(15,32),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETJ03 DFLD  POS=(15,36),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETJ04 DFLD  POS=(15,40),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETJ05 DFLD  POS=(15,44),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETJ06 DFLD  POS=(15,48),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETJ07 DFLD  POS=(15,52),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETJ08 DFLD  POS=(15,56),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETJ09 DFLD  POS=(15,60),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETJ10 DFLD  POS=(15,64),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETJ11 DFLD  POS=(15,68),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETJ12 DFLD  POS=(15,72),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETJ13 DFLD  POS=(15,76),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETJ14 DFLD  POS=(15,80),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDCMDV11 DFLD  POS=(16,2),LTH=1,                                       +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
BESORT11 DFLD  POS=(16,6),LTH=20,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETK01 DFLD  POS=(16,28),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETK02 DFLD  POS=(16,32),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETK03 DFLD  POS=(16,36),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETK04 DFLD  POS=(16,40),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETK05 DFLD  POS=(16,44),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETK06 DFLD  POS=(16,48),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETK07 DFLD  POS=(16,52),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETK08 DFLD  POS=(16,56),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETK09 DFLD  POS=(16,60),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETK10 DFLD  POS=(16,64),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETK11 DFLD  POS=(16,68),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETK12 DFLD  POS=(16,72),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETK13 DFLD  POS=(16,76),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETK14 DFLD  POS=(16,80),LTH=01,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
         DFLD  'CHANGE',                                               +        
               POS=(17,2),LTH=6,                                       +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  '72',                                                   +        
               POS=(17,27),LTH=2,                                      +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  '98',                                                   +        
               POS=(17,31),LTH=2,                                      +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  '12',                                                   +        
               POS=(17,35),LTH=2,                                      +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  '22',                                                   +        
               POS=(17,39),LTH=2,                                      +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  '27',                                                   +        
               POS=(17,43),LTH=2,                                      +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  '42',                                                   +        
               POS=(17,47),LTH=2,                                      +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  '52',                                                   +        
               POS=(17,51),LTH=2,                                      +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  '54',                                                   +        
               POS=(17,55),LTH=2,                                      +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  '62',                                                   +        
               POS=(17,59),LTH=2,                                      +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  '74',                                                   +        
               POS=(17,63),LTH=2,                                      +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  '75',                                                   +        
               POS=(17,67),LTH=2,                                      +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  '82',                                                   +        
               POS=(17,71),LTH=2,                                      +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  '92',                                                   +        
               POS=(17,75),LTH=2,                                      +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  '94',                                                   +        
               POS=(17,79),LTH=2,                                      +        
               ATTR=(ALPHA,PROT)                                                
BESORT12 DFLD  POS=(18,6),LTH=20,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
KDRETL01 DFLD  POS=(18,28),LTH=01,                                     +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
KDRETL02 DFLD  POS=(18,32),LTH=01,                                     +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
KDRETL03 DFLD  POS=(18,36),LTH=01,                                     +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
KDRETL04 DFLD  POS=(18,40),LTH=01,                                     +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
KDRETL05 DFLD  POS=(18,44),LTH=01,                                     +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
KDRETL06 DFLD  POS=(18,48),LTH=01,                                     +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
KDRETL07 DFLD  POS=(18,52),LTH=01,                                     +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
KDRETL08 DFLD  POS=(18,56),LTH=01,                                     +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
KDRETL09 DFLD  POS=(18,60),LTH=01,                                     +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
KDRETL10 DFLD  POS=(18,64),LTH=01,                                     +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
KDRETL11 DFLD  POS=(18,68),LTH=01,                                     +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
KDRETL12 DFLD  POS=(18,72),LTH=01,                                     +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
KDRETL13 DFLD  POS=(18,76),LTH=01,                                     +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
KDRETL14 DFLD  POS=(18,80),LTH=01,                                     +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
         DFLD  'CODES    S=Stopped    Q=To Disc Queue    A=Approved to +        
               Return',                                                +        
               POS=(20,2),LTH=70,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'F10=Whelp F7=First F8=Next F11=Update F12=Logoff',     +        
               POS=(22,2),LTH=70,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4I752N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N752),                                           +        
               OPT=2,                                                  +        
               NXT=W4O752N1                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS1,                                              +        
               '4'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS2,                                              +        
               '7'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  (IDTRANS3,                                              +        
               '5'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  (IDTRANS4,                                              +        
               '2'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '47522',                                                +        
               LTH=5                                                            
         MFLD  (KDCMDV01,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  BESORT01,                                               +        
               LTH=20                                                           
         MFLD  KDRETA01,                                               +        
               LTH=01                                                           
         MFLD  KDRETA02,                                               +        
               LTH=01                                                           
         MFLD  KDRETA03,                                               +        
               LTH=01                                                           
         MFLD  KDRETA04,                                               +        
               LTH=01                                                           
         MFLD  KDRETA05,                                               +        
               LTH=01                                                           
         MFLD  KDRETA06,                                               +        
               LTH=01                                                           
         MFLD  KDRETA07,                                               +        
               LTH=01                                                           
         MFLD  KDRETA08,                                               +        
               LTH=01                                                           
         MFLD  KDRETA09,                                               +        
               LTH=01                                                           
         MFLD  KDRETA10,                                               +        
               LTH=01                                                           
         MFLD  KDRETA11,                                               +        
               LTH=01                                                           
         MFLD  KDRETA12,                                               +        
               LTH=01                                                           
         MFLD  KDRETA13,                                               +        
               LTH=01                                                           
         MFLD  KDRETA14,                                               +        
               LTH=01                                                           
         MFLD  (KDCMDV02,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  BESORT02,                                               +        
               LTH=20                                                           
         MFLD  KDRETB01,                                               +        
               LTH=01                                                           
         MFLD  KDRETB02,                                               +        
               LTH=01                                                           
         MFLD  KDRETB03,                                               +        
               LTH=01                                                           
         MFLD  KDRETB04,                                               +        
               LTH=01                                                           
         MFLD  KDRETB05,                                               +        
               LTH=01                                                           
         MFLD  KDRETB06,                                               +        
               LTH=01                                                           
         MFLD  KDRETB07,                                               +        
               LTH=01                                                           
         MFLD  KDRETB08,                                               +        
               LTH=01                                                           
         MFLD  KDRETB09,                                               +        
               LTH=01                                                           
         MFLD  KDRETB10,                                               +        
               LTH=01                                                           
         MFLD  KDRETB11,                                               +        
               LTH=01                                                           
         MFLD  KDRETB12,                                               +        
               LTH=01                                                           
         MFLD  KDRETB13,                                               +        
               LTH=01                                                           
         MFLD  KDRETB14,                                               +        
               LTH=01                                                           
         MFLD  (KDCMDV03,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  BESORT03,                                               +        
               LTH=20                                                           
         MFLD  KDRETC01,                                               +        
               LTH=01                                                           
         MFLD  KDRETC02,                                               +        
               LTH=01                                                           
         MFLD  KDRETC03,                                               +        
               LTH=01                                                           
         MFLD  KDRETC04,                                               +        
               LTH=01                                                           
         MFLD  KDRETC05,                                               +        
               LTH=01                                                           
         MFLD  KDRETC06,                                               +        
               LTH=01                                                           
         MFLD  KDRETC07,                                               +        
               LTH=01                                                           
         MFLD  KDRETC08,                                               +        
               LTH=01                                                           
         MFLD  KDRETC09,                                               +        
               LTH=01                                                           
         MFLD  KDRETC10,                                               +        
               LTH=01                                                           
         MFLD  KDRETC11,                                               +        
               LTH=01                                                           
         MFLD  KDRETC12,                                               +        
               LTH=01                                                           
         MFLD  KDRETC13,                                               +        
               LTH=01                                                           
         MFLD  KDRETC14,                                               +        
               LTH=01                                                           
         MFLD  (KDCMDV04,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  BESORT04,                                               +        
               LTH=20                                                           
         MFLD  KDRETD01,                                               +        
               LTH=01                                                           
         MFLD  KDRETD02,                                               +        
               LTH=01                                                           
         MFLD  KDRETD03,                                               +        
               LTH=01                                                           
         MFLD  KDRETD04,                                               +        
               LTH=01                                                           
         MFLD  KDRETD05,                                               +        
               LTH=01                                                           
         MFLD  KDRETD06,                                               +        
               LTH=01                                                           
         MFLD  KDRETD07,                                               +        
               LTH=01                                                           
         MFLD  KDRETD08,                                               +        
               LTH=01                                                           
         MFLD  KDRETD09,                                               +        
               LTH=01                                                           
         MFLD  KDRETD10,                                               +        
               LTH=01                                                           
         MFLD  KDRETD11,                                               +        
               LTH=01                                                           
         MFLD  KDRETD12,                                               +        
               LTH=01                                                           
         MFLD  KDRETD13,                                               +        
               LTH=01                                                           
         MFLD  KDRETD14,                                               +        
               LTH=01                                                           
         MFLD  (KDCMDV05,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  BESORT05,                                               +        
               LTH=20                                                           
         MFLD  KDRETE01,                                               +        
               LTH=01                                                           
         MFLD  KDRETE02,                                               +        
               LTH=01                                                           
         MFLD  KDRETE03,                                               +        
               LTH=01                                                           
         MFLD  KDRETE04,                                               +        
               LTH=01                                                           
         MFLD  KDRETE05,                                               +        
               LTH=01                                                           
         MFLD  KDRETE06,                                               +        
               LTH=01                                                           
         MFLD  KDRETE07,                                               +        
               LTH=01                                                           
         MFLD  KDRETE08,                                               +        
               LTH=01                                                           
         MFLD  KDRETE09,                                               +        
               LTH=01                                                           
         MFLD  KDRETE10,                                               +        
               LTH=01                                                           
         MFLD  KDRETE11,                                               +        
               LTH=01                                                           
         MFLD  KDRETE12,                                               +        
               LTH=01                                                           
         MFLD  KDRETE13,                                               +        
               LTH=01                                                           
         MFLD  KDRETE14,                                               +        
               LTH=01                                                           
         MFLD  (KDCMDV06,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  BESORT06,                                               +        
               LTH=20                                                           
         MFLD  KDRETF01,                                               +        
               LTH=01                                                           
         MFLD  KDRETF02,                                               +        
               LTH=01                                                           
         MFLD  KDRETF03,                                               +        
               LTH=01                                                           
         MFLD  KDRETF04,                                               +        
               LTH=01                                                           
         MFLD  KDRETF05,                                               +        
               LTH=01                                                           
         MFLD  KDRETF06,                                               +        
               LTH=01                                                           
         MFLD  KDRETF07,                                               +        
               LTH=01                                                           
         MFLD  KDRETF08,                                               +        
               LTH=01                                                           
         MFLD  KDRETF09,                                               +        
               LTH=01                                                           
         MFLD  KDRETF10,                                               +        
               LTH=01                                                           
         MFLD  KDRETF11,                                               +        
               LTH=01                                                           
         MFLD  KDRETF12,                                               +        
               LTH=01                                                           
         MFLD  KDRETF13,                                               +        
               LTH=01                                                           
         MFLD  KDRETF14,                                               +        
               LTH=01                                                           
         MFLD  (KDCMDV07,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  BESORT07,                                               +        
               LTH=20                                                           
         MFLD  KDRETG01,                                               +        
               LTH=01                                                           
         MFLD  KDRETG02,                                               +        
               LTH=01                                                           
         MFLD  KDRETG03,                                               +        
               LTH=01                                                           
         MFLD  KDRETG04,                                               +        
               LTH=01                                                           
         MFLD  KDRETG05,                                               +        
               LTH=01                                                           
         MFLD  KDRETG06,                                               +        
               LTH=01                                                           
         MFLD  KDRETG07,                                               +        
               LTH=01                                                           
         MFLD  KDRETG08,                                               +        
               LTH=01                                                           
         MFLD  KDRETG09,                                               +        
               LTH=01                                                           
         MFLD  KDRETG10,                                               +        
               LTH=01                                                           
         MFLD  KDRETG11,                                               +        
               LTH=01                                                           
         MFLD  KDRETG12,                                               +        
               LTH=01                                                           
         MFLD  KDRETG13,                                               +        
               LTH=01                                                           
         MFLD  KDRETG14,                                               +        
               LTH=01                                                           
         MFLD  (KDCMDV08,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  BESORT08,                                               +        
               LTH=20                                                           
         MFLD  KDRETH01,                                               +        
               LTH=01                                                           
         MFLD  KDRETH02,                                               +        
               LTH=01                                                           
         MFLD  KDRETH03,                                               +        
               LTH=01                                                           
         MFLD  KDRETH04,                                               +        
               LTH=01                                                           
         MFLD  KDRETH05,                                               +        
               LTH=01                                                           
         MFLD  KDRETH06,                                               +        
               LTH=01                                                           
         MFLD  KDRETH07,                                               +        
               LTH=01                                                           
         MFLD  KDRETH08,                                               +        
               LTH=01                                                           
         MFLD  KDRETH09,                                               +        
               LTH=01                                                           
         MFLD  KDRETH10,                                               +        
               LTH=01                                                           
         MFLD  KDRETH11,                                               +        
               LTH=01                                                           
         MFLD  KDRETH12,                                               +        
               LTH=01                                                           
         MFLD  KDRETH13,                                               +        
               LTH=01                                                           
         MFLD  KDRETH14,                                               +        
               LTH=01                                                           
         MFLD  (KDCMDV09,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  BESORT09,                                               +        
               LTH=20                                                           
         MFLD  KDRETI01,                                               +        
               LTH=01                                                           
         MFLD  KDRETI02,                                               +        
               LTH=01                                                           
         MFLD  KDRETI03,                                               +        
               LTH=01                                                           
         MFLD  KDRETI04,                                               +        
               LTH=01                                                           
         MFLD  KDRETI05,                                               +        
               LTH=01                                                           
         MFLD  KDRETI06,                                               +        
               LTH=01                                                           
         MFLD  KDRETI07,                                               +        
               LTH=01                                                           
         MFLD  KDRETI08,                                               +        
               LTH=01                                                           
         MFLD  KDRETI09,                                               +        
               LTH=01                                                           
         MFLD  KDRETI10,                                               +        
               LTH=01                                                           
         MFLD  KDRETI11,                                               +        
               LTH=01                                                           
         MFLD  KDRETI12,                                               +        
               LTH=01                                                           
         MFLD  KDRETI13,                                               +        
               LTH=01                                                           
         MFLD  KDRETI14,                                               +        
               LTH=01                                                           
         MFLD  (KDCMDV10,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  BESORT10,                                               +        
               LTH=20                                                           
         MFLD  KDRETJ01,                                               +        
               LTH=01                                                           
         MFLD  KDRETJ02,                                               +        
               LTH=01                                                           
         MFLD  KDRETJ03,                                               +        
               LTH=01                                                           
         MFLD  KDRETJ04,                                               +        
               LTH=01                                                           
         MFLD  KDRETJ05,                                               +        
               LTH=01                                                           
         MFLD  KDRETJ06,                                               +        
               LTH=01                                                           
         MFLD  KDRETJ07,                                               +        
               LTH=01                                                           
         MFLD  KDRETJ08,                                               +        
               LTH=01                                                           
         MFLD  KDRETJ09,                                               +        
               LTH=01                                                           
         MFLD  KDRETJ10,                                               +        
               LTH=01                                                           
         MFLD  KDRETJ11,                                               +        
               LTH=01                                                           
         MFLD  KDRETJ12,                                               +        
               LTH=01                                                           
         MFLD  KDRETJ13,                                               +        
               LTH=01                                                           
         MFLD  KDRETJ14,                                               +        
               LTH=01                                                           
         MFLD  (KDCMDV11,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  BESORT11,                                               +        
               LTH=20                                                           
         MFLD  KDRETK01,                                               +        
               LTH=01                                                           
         MFLD  KDRETK02,                                               +        
               LTH=01                                                           
         MFLD  KDRETK03,                                               +        
               LTH=01                                                           
         MFLD  KDRETK04,                                               +        
               LTH=01                                                           
         MFLD  KDRETK05,                                               +        
               LTH=01                                                           
         MFLD  KDRETK06,                                               +        
               LTH=01                                                           
         MFLD  KDRETK07,                                               +        
               LTH=01                                                           
         MFLD  KDRETK08,                                               +        
               LTH=01                                                           
         MFLD  KDRETK09,                                               +        
               LTH=01                                                           
         MFLD  KDRETK10,                                               +        
               LTH=01                                                           
         MFLD  KDRETK11,                                               +        
               LTH=01                                                           
         MFLD  KDRETK12,                                               +        
               LTH=01                                                           
         MFLD  KDRETK13,                                               +        
               LTH=01                                                           
         MFLD  KDRETK14,                                               +        
               LTH=01                                                           
         MFLD  BESORT12,                                               +        
               LTH=20                                                           
         MFLD  (KDRETL01,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (KDRETL02,                                              +        
               '+'),                                                   +        
               LTH=01                                                           
         MFLD  (KDRETL03,                                              +        
               '+'),                                                   +        
               LTH=01                                                           
         MFLD  (KDRETL04,                                              +        
               '+'),                                                   +        
               LTH=01                                                           
         MFLD  (KDRETL05,                                              +        
               '+'),                                                   +        
               LTH=01                                                           
         MFLD  (KDRETL06,                                              +        
               '+'),                                                   +        
               LTH=01                                                           
         MFLD  (KDRETL07,                                              +        
               '+'),                                                   +        
               LTH=01                                                           
         MFLD  (KDRETL08,                                              +        
               '+'),                                                   +        
               LTH=01                                                           
         MFLD  (KDRETL09,                                              +        
               '+'),                                                   +        
               LTH=01                                                           
         MFLD  (KDRETL10,                                              +        
               '+'),                                                   +        
               LTH=01                                                           
         MFLD  (KDRETL11,                                              +        
               '+'),                                                   +        
               LTH=01                                                           
         MFLD  (KDRETL12,                                              +        
               '+'),                                                   +        
               LTH=01                                                           
         MFLD  (KDRETL13,                                              +        
               '+'),                                                   +        
               LTH=01                                                           
         MFLD  (KDRETL14,                                              +        
               '+'),                                                   +        
               LTH=01                                                           
         MSGEND                                                                 
W4O752N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N752,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I752N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  KDCMDV01,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  BESORT01,                                               +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETA01,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETA02,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETA03,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETA04,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETA05,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETA06,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETA07,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETA08,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETA09,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETA10,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETA11,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETA12,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETA13,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETA14,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDCMDV02,                                               +        
               ATTR=(YES),                                             +        
               LTH=03                                                           
         MFLD  BESORT02,                                               +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETB01,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETB02,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETB03,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETB04,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETB05,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETB06,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETB07,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETB08,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETB09,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETB10,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETB11,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETB12,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETB13,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETB14,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDCMDV03,                                               +        
               ATTR=(YES),                                             +        
               LTH=03                                                           
         MFLD  BESORT03,                                               +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETC01,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETC02,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETC03,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETC04,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETC05,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETC06,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETC07,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETC08,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETC09,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETC10,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETC11,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETC12,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETC13,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETC14,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDCMDV04,                                               +        
               ATTR=(YES),                                             +        
               LTH=03                                                           
         MFLD  BESORT04,                                               +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETD01,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETD02,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETD03,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETD04,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETD05,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETD06,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETD07,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETD08,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETD09,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETD10,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETD11,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETD12,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETD13,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETD14,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDCMDV05,                                               +        
               ATTR=(YES),                                             +        
               LTH=03                                                           
         MFLD  BESORT05,                                               +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETE01,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETE02,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETE03,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETE04,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETE05,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETE06,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETE07,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETE08,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETE09,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETE10,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETE11,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETE12,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETE13,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETE14,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDCMDV06,                                               +        
               ATTR=(YES),                                             +        
               LTH=03                                                           
         MFLD  BESORT06,                                               +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETF01,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETF02,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETF03,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETF04,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETF05,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETF06,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETF07,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETF08,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETF09,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETF10,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETF11,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETF12,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETF13,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETF14,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDCMDV07,                                               +        
               ATTR=(YES),                                             +        
               LTH=03                                                           
         MFLD  BESORT07,                                               +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETG01,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETG02,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETG03,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETG04,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETG05,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETG06,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETG07,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETG08,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETG09,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETG10,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETG11,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETG12,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETG13,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETG14,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDCMDV08,                                               +        
               ATTR=(YES),                                             +        
               LTH=03                                                           
         MFLD  BESORT08,                                               +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETH01,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETH02,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETH03,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETH04,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETH05,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETH06,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETH07,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETH08,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETH09,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETH10,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETH11,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETH12,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETH13,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETH14,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDCMDV09,                                               +        
               ATTR=(YES),                                             +        
               LTH=03                                                           
         MFLD  BESORT09,                                               +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETI01,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETI02,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETI03,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETI04,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETI05,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETI06,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETI07,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETI08,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETI09,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETI10,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETI11,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETI12,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETI13,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETI14,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDCMDV10,                                               +        
               ATTR=(YES),                                             +        
               LTH=03                                                           
         MFLD  BESORT10,                                               +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETJ01,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETJ02,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETJ03,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETJ04,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETJ05,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETJ06,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETJ07,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETJ08,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETJ09,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETJ10,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETJ11,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETJ12,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETJ13,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETJ14,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDCMDV11,                                               +        
               ATTR=(YES),                                             +        
               LTH=03                                                           
         MFLD  BESORT11,                                               +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETK01,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETK02,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETK03,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETK04,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETK05,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETK06,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETK07,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETK08,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETK09,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETK10,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETK11,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETK12,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETK13,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETK14,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  BESORT12,                                               +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDRETL01,                                               +        
               ATTR=(YES),                                             +        
               LTH=3                                                            
         MFLD  KDRETL02,                                               +        
               ATTR=(YES),                                             +        
               LTH=3                                                            
         MFLD  KDRETL03,                                               +        
               ATTR=(YES),                                             +        
               LTH=3                                                            
         MFLD  KDRETL04,                                               +        
               ATTR=(YES),                                             +        
               LTH=3                                                            
         MFLD  KDRETL05,                                               +        
               ATTR=(YES),                                             +        
               LTH=3                                                            
         MFLD  KDRETL06,                                               +        
               ATTR=(YES),                                             +        
               LTH=3                                                            
         MFLD  KDRETL07,                                               +        
               ATTR=(YES),                                             +        
               LTH=3                                                            
         MFLD  KDRETL08,                                               +        
               ATTR=(YES),                                             +        
               LTH=3                                                            
         MFLD  KDRETL09,                                               +        
               ATTR=(YES),                                             +        
               LTH=3                                                            
         MFLD  KDRETL10,                                               +        
               ATTR=(YES),                                             +        
               LTH=3                                                            
         MFLD  KDRETL11,                                               +        
               ATTR=(YES),                                             +        
               LTH=3                                                            
         MFLD  KDRETL12,                                               +        
               ATTR=(YES),                                             +        
               LTH=3                                                            
         MFLD  KDRETL13,                                               +        
               ATTR=(YES),                                             +        
               LTH=3                                                            
         MFLD  KDRETL14,                                               +        
               ATTR=(YES),                                             +        
               LTH=3                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
