***********************************************************************         
* CREATED BY PC36149   ON 97/04/15  AT 13:34                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'LEVERANSANM RAD - FRI TEXT      '                               
W4N723   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T723U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T721  ',                                          +        
               14='W4T722  ',                                          +        
               15='W4T723  ',                                          +        
               16='W4T724  ',                                          +        
               17='W4T725  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W4T723u ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4N723   DPAGE CURSOR=((2,8)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DISCREPANCY TEXT',                                     +        
               POS=(1,11),LTH=16,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Distr',                                                +        
               POS=(2,2),LTH=5,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDDISTRI DFLD  POS=(2,8),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Cust',                                                 +        
               POS=(2,14),LTH=4,                                       +        
               ATTR=(PROT)                                                      
IDKUNDNI DFLD  POS=(2,19),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DR No.',                                               +        
               POS=(2,27),LTH=6,                                       +        
               ATTR=(PROT)                                                      
IDRAPPNI DFLD  POS=(2,34),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Part No.',                                             +        
               POS=(2,42),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
IDARTNRI DFLD  POS=(2,51),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Line',                                                 +        
               POS=(2,61),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
IDRADNRI DFLD  POS=(2,66),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDDISTRU DFLD  POS=(3,8),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
IDKUNDNU DFLD  POS=(3,19),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
IDRAPPNU DFLD  POS=(3,34),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
IDARTNRU DFLD  POS=(3,51),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
IDRADNRU DFLD  POS=(3,66),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Vips/',                                                +        
               POS=(5,2),LTH=5,                                        +        
               ATTR=(PROT)                                                      
TEREG1   DFLD  POS=(5,10),LTH=70,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Puls',                                                 +        
               POS=(6,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
TEREG2   DFLD  POS=(6,10),LTH=70,                                      +        
               ATTR=(NOPROT,MOD)                                                
TEREG3   DFLD  POS=(7,10),LTH=70,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'To',                                                   +        
               POS=(8,2),LTH=2,                                        +        
               ATTR=(PROT)                                                      
TEDLR1   DFLD  POS=(8,10),LTH=70,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Dealer',                                               +        
               POS=(9,2),LTH=6,                                        +        
               ATTR=(PROT)                                                      
TEDLR2   DFLD  POS=(9,10),LTH=70,                                      +        
               ATTR=(NOPROT,MOD)                                                
TEDLR3   DFLD  POS=(10,10),LTH=70,                                     +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Adm.',                                                 +        
               POS=(11,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
TEADM1   DFLD  POS=(11,10),LTH=70,                                     +        
               ATTR=(NOPROT,MOD)                                                
TEADM2   DFLD  POS=(12,10),LTH=70,                                     +        
               ATTR=(NOPROT,MOD)                                                
TEADM3   DFLD  POS=(13,10),LTH=70,                                     +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Rem.',                                                 +        
               POS=(14,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
TEREM1   DFLD  POS=(14,10),LTH=70,                                     +        
               ATTR=(NOPROT,MOD)                                                
TEREM2   DFLD  POS=(15,10),LTH=70,                                     +        
               ATTR=(NOPROT,MOD)                                                
TEREM3   DFLD  POS=(16,10),LTH=70,                                     +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Returns',                                              +        
               POS=(17,2),LTH=7,                                       +        
               ATTR=(PROT)                                                      
TERET1   DFLD  POS=(17,10),LTH=70,                                     +        
               ATTR=(NOPROT,MOD)                                                
TERET2   DFLD  POS=(18,10),LTH=70,                                     +        
               ATTR=(NOPROT,MOD)                                                
TERET3   DFLD  POS=(19,10),LTH=70,                                     +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  '13 Line queue   14 Discr. lines  15 Discr. text   16 Di+        
               scr. Part  17 Case-info',                               +        
               POS=(21,2),LTH=78,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,35),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,52),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 whelp',                                             +        
               POS=(22,68),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W4O723N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N723,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I723N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4N723                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDDISTRI,                                               +        
               LTH=4                                                            
         MFLD  IDKUNDNI,                                               +        
               LTH=6                                                            
         MFLD  IDRAPPNI,                                               +        
               LTH=7                                                            
         MFLD  IDARTNRI,                                               +        
               LTH=9                                                            
         MFLD  IDRADNRI,                                               +        
               LTH=4                                                            
         MFLD  IDDISTRU,                                               +        
               LTH=4                                                            
         MFLD  IDKUNDNU,                                               +        
               LTH=6                                                            
         MFLD  IDRAPPNU,                                               +        
               LTH=7                                                            
         MFLD  IDARTNRU,                                               +        
               LTH=9                                                            
         MFLD  IDRADNRU,                                               +        
               LTH=4                                                            
         MFLD  TEREG1,                                                 +        
               LTH=70                                                           
         MFLD  TEREG2,                                                 +        
               LTH=70                                                           
         MFLD  TEREG3,                                                 +        
               LTH=70                                                           
         MFLD  TEDLR1,                                                 +        
               LTH=70                                                           
         MFLD  TEDLR2,                                                 +        
               LTH=70                                                           
         MFLD  TEDLR3,                                                 +        
               LTH=70                                                           
         MFLD  TEADM1,                                                 +        
               LTH=70                                                           
         MFLD  TEADM2,                                                 +        
               LTH=70                                                           
         MFLD  TEADM3,                                                 +        
               LTH=70                                                           
         MFLD  TEREM1,                                                 +        
               LTH=70                                                           
         MFLD  TEREM2,                                                 +        
               LTH=70                                                           
         MFLD  TEREM3,                                                 +        
               LTH=70                                                           
         MFLD  TERET1,                                                 +        
               LTH=70                                                           
         MFLD  TERET2,                                                 +        
               LTH=70                                                           
         MFLD  TERET3,                                                 +        
               LTH=70                                                           
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I723N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N723),                                           +        
               OPT=2,                                                  +        
               NXT=W4O723N1                                                     
MID      LPAGE SOR=(W4N723)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  (FLD0102,                                               +        
               '4'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  (FLD0104,                                               +        
               '7'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  (FLD0106,                                               +        
               '2'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  (FLD0108,                                               +        
               '3'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '47232',                                                +        
               LTH=5                                                            
         MFLD  (IDDISTRI,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDISTRU,                                               +        
               LTH=4                                                            
         MFLD  (IDKUNDNI,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDKUNDNU,                                               +        
               LTH=6                                                            
         MFLD  (IDRAPPNI,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDRAPPNU,                                               +        
               LTH=7                                                            
         MFLD  (IDARTNRI,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDARTNRU,                                               +        
               LTH=9                                                            
         MFLD  (IDRADNRI,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDRADNRU,                                               +        
               LTH=4                                                            
         MFLD  TEREG1,                                                 +        
               LTH=70                                                           
         MFLD  TEREG2,                                                 +        
               LTH=70                                                           
         MFLD  TEREG3,                                                 +        
               LTH=70                                                           
         MFLD  TEDLR1,                                                 +        
               LTH=70                                                           
         MFLD  TEDLR2,                                                 +        
               LTH=70                                                           
         MFLD  TEDLR3,                                                 +        
               LTH=70                                                           
         MFLD  TEADM1,                                                 +        
               LTH=70                                                           
         MFLD  TEADM2,                                                 +        
               LTH=70                                                           
         MFLD  TEADM3,                                                 +        
               LTH=70                                                           
         MFLD  TEREM1,                                                 +        
               LTH=70                                                           
         MFLD  TEREM2,                                                 +        
               LTH=70                                                           
         MFLD  TEREM3,                                                 +        
               LTH=70                                                           
         MFLD  TERET1,                                                 +        
               LTH=70                                                           
         MFLD  TERET2,                                                 +        
               LTH=70                                                           
         MFLD  TERET3,                                                 +        
               LTH=70                                                           
         MSGEND                                                                 
         END                                                                    
