***********************************************************************         
* CREATED BY PC70375   ON 98/09/24  AT 16:20                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'SHOW CASES QUEUE                '                               
W4N734   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T734 7',                                           +        
               8='W4T734 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T734U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T731  ',                                          +        
               14='W4T732  ',                                          +        
               15='W4T733  ',                                          +        
               16='W4T734  ',                                          +        
               17='W4T735  ',                                          +        
               18='W4T736  ',                                          +        
               19='W4T737  ',                                          +        
               20='W4T738  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W4T734U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W4N734   DPAGE CURSOR=((2,7)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'SHOW CASE QUEUE',                                      +        
               POS=(1,11),LTH=15,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Resp',                                                 +        
               POS=(2,2),LTH=4,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDANSVI  DFLD  POS=(2,7),LTH=6,                                        +        
               ATTR=(NOPROT)                                                    
         DFLD  'Return',                                               +        
               POS=(2,14),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0043 DFLD  POS=(2,23),LTH=6,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Case',                                                 +        
               POS=(2,30),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
IDKOLLII DFLD  POS=(2,35),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Distr',                                                +        
               POS=(2,41),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
IDDISTRI DFLD  POS=(2,47),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Show deviations (Y)',                                  +        
               POS=(2,52),LTH=19,                                      +        
               ATTR=(NUM,PROT)                                                  
FLVISAI  DFLD  POS=(2,72),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDANSVU  DFLD  POS=(3,7),LTH=6,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0044 DFLD  POS=(3,23),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
IDKOLLIU DFLD  POS=(3,35),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDISTRU DFLD  POS=(3,47),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
FLVISAU  DFLD  POS=(3,72),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Empl ID',                                              +        
               POS=(5,2),LTH=7,                                        +        
               ATTR=(PROT)                                                      
IDANSTNR DFLD  POS=(5,10),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Cmd   Return',                                         +        
               POS=(6,2),LTH=12,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Case  HM  Arrival date   Loc  Case Status',            +        
               POS=(6,20),LTH=41,                                      +        
               ATTR=(PROT)                                                      
KDCMD1   DFLD  POS=(7,2),LTH=4,                                        +        
               ATTR=(NOPROT)                                                    
IDSNDNR1 DFLD  POS=(7,8),LTH=6,                                        +        
               ATTR=(PROT,MOD)                                                  
IDKOLLI1 DFLD  POS=(7,19),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0026 DFLD  POS=(7,27),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0049 DFLD  POS=(7,36),LTH=6,                                       +        
               ATTR=(PROT)                                                      
DGIA0000 DFLD  POS=(7,44),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0013 DFLD  POS=(7,50),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KDCMD2   DFLD  POS=(8,2),LTH=4,                                        +        
               ATTR=(NOPROT)                                                    
IDSNDNR2 DFLD  POS=(8,8),LTH=6,                                        +        
               ATTR=(PROT,MOD)                                                  
IDKOLLI2 DFLD  POS=(8,19),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0027 DFLD  POS=(8,27),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0050 DFLD  POS=(8,36),LTH=6,                                       +        
               ATTR=(PROT)                                                      
DGIA0001 DFLD  POS=(8,44),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0014 DFLD  POS=(8,50),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KDCMD3   DFLD  POS=(9,2),LTH=4,                                        +        
               ATTR=(NOPROT)                                                    
IDSNDNR3 DFLD  POS=(9,8),LTH=6,                                        +        
               ATTR=(PROT,MOD)                                                  
IDKOLLI3 DFLD  POS=(9,19),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0028 DFLD  POS=(9,27),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0051 DFLD  POS=(9,36),LTH=6,                                       +        
               ATTR=(PROT)                                                      
DGIA0002 DFLD  POS=(9,44),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0015 DFLD  POS=(9,50),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KDCMD4   DFLD  POS=(10,2),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
IDSNDNR4 DFLD  POS=(10,8),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
IDKOLLI4 DFLD  POS=(10,19),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0029 DFLD  POS=(10,27),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0052 DFLD  POS=(10,36),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0003 DFLD  POS=(10,44),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0016 DFLD  POS=(10,50),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KDCMD5   DFLD  POS=(11,2),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
IDSNDNR5 DFLD  POS=(11,8),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
IDKOLLI5 DFLD  POS=(11,19),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0030 DFLD  POS=(11,27),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0053 DFLD  POS=(11,36),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0004 DFLD  POS=(11,44),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0017 DFLD  POS=(11,50),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KDCMD6   DFLD  POS=(12,2),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
IDSNDNR6 DFLD  POS=(12,8),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
IDKOLLI6 DFLD  POS=(12,19),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0031 DFLD  POS=(12,27),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0054 DFLD  POS=(12,36),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0005 DFLD  POS=(12,44),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0018 DFLD  POS=(12,50),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KDCMD7   DFLD  POS=(13,2),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
IDSNDNR7 DFLD  POS=(13,8),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
IDKOLLI7 DFLD  POS=(13,19),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0032 DFLD  POS=(13,27),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0055 DFLD  POS=(13,36),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0006 DFLD  POS=(13,44),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0019 DFLD  POS=(13,50),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KDCMD8   DFLD  POS=(14,2),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
IDSNDNR8 DFLD  POS=(14,8),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
IDKOLLI8 DFLD  POS=(14,19),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0033 DFLD  POS=(14,27),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0056 DFLD  POS=(14,36),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0007 DFLD  POS=(14,44),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0020 DFLD  POS=(14,50),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KDCMD9   DFLD  POS=(15,2),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
IDSNDNR9 DFLD  POS=(15,8),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
IDKOLLI9 DFLD  POS=(15,19),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0034 DFLD  POS=(15,27),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0057 DFLD  POS=(15,36),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0008 DFLD  POS=(15,44),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0021 DFLD  POS=(15,50),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KDCMD10  DFLD  POS=(16,2),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0045 DFLD  POS=(16,8),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0039 DFLD  POS=(16,19),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0035 DFLD  POS=(16,27),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0058 DFLD  POS=(16,36),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0009 DFLD  POS=(16,44),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0022 DFLD  POS=(16,50),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KDCMD11  DFLD  POS=(17,2),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0046 DFLD  POS=(17,8),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0040 DFLD  POS=(17,19),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0036 DFLD  POS=(17,27),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0059 DFLD  POS=(17,36),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0010 DFLD  POS=(17,44),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0023 DFLD  POS=(17,50),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KDCMD12  DFLD  POS=(18,2),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0047 DFLD  POS=(18,8),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0041 DFLD  POS=(18,19),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0037 DFLD  POS=(18,27),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0060 DFLD  POS=(18,36),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0011 DFLD  POS=(18,44),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0024 DFLD  POS=(18,50),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KDCMD13  DFLD  POS=(19,2),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0048 DFLD  POS=(19,8),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0042 DFLD  POS=(19,19),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0038 DFLD  POS=(19,27),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0061 DFLD  POS=(19,36),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0012 DFLD  POS=(19,44),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0025 DFLD  POS=(19,50),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '13 Return queue   14',                                 +        
               POS=(21,2),LTH=20,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Loc ',                                                 +        
               POS=(21,23),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'status   15',                                          +        
               POS=(21,28),LTH=11,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Reg ',                                                 +        
               POS=(21,40),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'return   16 Case queue 17 Contents',                   +        
               POS=(21,45),LTH=34,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '18 Show RP queue  19 Treat RP',                        +        
               POS=(22,2),LTH=29,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,37),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Rep bin list',                                         +        
               POS=(22,40),LTH=12,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,54),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 Whelp',                                             +        
               POS=(22,68),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W4O734N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N734,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I734N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W4N734                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDANSVI,                                                +        
               LTH=6                                                            
         MFLD  DGIA0043,                                               +        
               LTH=6                                                            
         MFLD  IDKOLLII,                                               +        
               LTH=5                                                            
         MFLD  IDDISTRI,                                               +        
               LTH=4                                                            
         MFLD  FLVISAI,                                                +        
               LTH=1                                                            
         MFLD  IDANSVU,                                                +        
               LTH=6                                                            
         MFLD  DGIA0044,                                               +        
               LTH=6                                                            
         MFLD  IDKOLLIU,                                               +        
               LTH=5                                                            
         MFLD  IDDISTRU,                                               +        
               LTH=4                                                            
         MFLD  FLVISAU,                                                +        
               LTH=1                                                            
         MFLD  IDANSTNR,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD1,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDSNDNR1,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKOLLI1,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0026,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0049,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0000,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0013,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD2,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDSNDNR2,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKOLLI2,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0027,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0050,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0001,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0014,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD3,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDSNDNR3,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKOLLI3,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0028,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0051,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0002,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0015,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD4,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDSNDNR4,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKOLLI4,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0029,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0052,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0003,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0016,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD5,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDSNDNR5,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKOLLI5,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0030,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0053,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0004,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0017,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD6,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDSNDNR6,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKOLLI6,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0031,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0054,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0005,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0018,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD7,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDSNDNR7,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKOLLI7,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0032,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0055,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0006,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0019,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD8,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDSNDNR8,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKOLLI8,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0033,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0056,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0007,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0020,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD9,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDSNDNR9,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKOLLI9,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0034,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0057,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0008,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0021,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD10,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0045,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0039,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0035,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0058,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0009,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0022,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD11,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0046,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0040,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0036,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0059,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0010,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0023,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD12,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0047,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0041,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0037,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0060,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0011,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0024,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDCMD13,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0048,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0042,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0038,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0061,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0012,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0025,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I734N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N734),                                           +        
               OPT=2,                                                  +        
               NXT=W4O734N1                                                     
MID      LPAGE SOR=(W4N734)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '47342',                                                +        
               LTH=5                                                            
         MFLD  (IDANSVI,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  IDANSVU,                                                +        
               LTH=6                                                            
         MFLD  (DGIA0043,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0044,                                               +        
               LTH=6                                                            
         MFLD  (IDKOLLII,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDKOLLIU,                                               +        
               LTH=5                                                            
         MFLD  (IDDISTRI,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  IDDISTRU,                                               +        
               LTH=4                                                            
         MFLD  (FLVISAI,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  FLVISAU,                                                +        
               LTH=1                                                            
         MFLD  (IDANSTNR,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDCMD1,                                                +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (KDCMD2,                                                +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (KDCMD3,                                                +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (KDCMD4,                                                +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (KDCMD5,                                                +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (KDCMD6,                                                +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (KDCMD7,                                                +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (KDCMD8,                                                +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (KDCMD9,                                                +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (KDCMD10,                                               +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (KDCMD11,                                               +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (KDCMD12,                                               +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (KDCMD13,                                               +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  IDSNDNR1,                                               +        
               LTH=6                                                            
         MFLD  IDKOLLI1,                                               +        
               LTH=5                                                            
         MFLD  IDSNDNR2,                                               +        
               LTH=6                                                            
         MFLD  IDKOLLI2,                                               +        
               LTH=5                                                            
         MFLD  IDSNDNR3,                                               +        
               LTH=6                                                            
         MFLD  IDKOLLI3,                                               +        
               LTH=5                                                            
         MFLD  IDSNDNR4,                                               +        
               LTH=6                                                            
         MFLD  IDKOLLI4,                                               +        
               LTH=5                                                            
         MFLD  IDSNDNR5,                                               +        
               LTH=6                                                            
         MFLD  IDKOLLI5,                                               +        
               LTH=5                                                            
         MFLD  IDSNDNR6,                                               +        
               LTH=6                                                            
         MFLD  IDKOLLI6,                                               +        
               LTH=5                                                            
         MFLD  IDSNDNR7,                                               +        
               LTH=6                                                            
         MFLD  IDKOLLI7,                                               +        
               LTH=5                                                            
         MFLD  IDSNDNR8,                                               +        
               LTH=6                                                            
         MFLD  IDKOLLI8,                                               +        
               LTH=5                                                            
         MFLD  IDSNDNR9,                                               +        
               LTH=6                                                            
         MFLD  IDKOLLI9,                                               +        
               LTH=5                                                            
         MFLD  DGIA0045,                                               +        
               LTH=6                                                            
         MFLD  DGIA0039,                                               +        
               LTH=5                                                            
         MFLD  DGIA0046,                                               +        
               LTH=6                                                            
         MFLD  DGIA0040,                                               +        
               LTH=5                                                            
         MFLD  DGIA0047,                                               +        
               LTH=6                                                            
         MFLD  DGIA0041,                                               +        
               LTH=5                                                            
         MFLD  DGIA0048,                                               +        
               LTH=6                                                            
         MFLD  DGIA0042,                                               +        
               LTH=5                                                            
         MSGEND                                                                 
         END                                                                    
