***********************************************************************         
* CREATED BY PC70375   ON 98/09/21  AT 15:36                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'LEVERANSANMÄRKNING 1            '                               
W4N712   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W4T712 4',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T712 7',                                           +        
               8='W4T712 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T712U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T711  ',                                          +        
               14='W4T712  ',                                          +        
               15='W4T713  ',                                          +        
               16='W4T714  ',                                          +        
               17='W4T715  ',                                          +        
               18='W4T716  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W4T712V ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,11)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DISCREPANCY NOTE 1',                                   +        
               POS=(1,11),LTH=18,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'District',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(NUM,PROT)                                                  
FLD0211  DFLD  POS=(2,11),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Cust',                                                 +        
               POS=(2,20),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD0225  DFLD  POS=(2,25),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DR No.',                                               +        
               POS=(2,34),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0242  DFLD  POS=(2,41),LTH=7,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Part No.',                                             +        
               POS=(2,49),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
ARTNRI   DFLD  POS=(2,58),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Line',                                                 +        
               POS=(2,67),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
RADI     DFLD  POS=(2,72),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD0311  DFLD  POS=(3,11),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0325  DFLD  POS=(3,25),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0342  DFLD  POS=(3,41),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
ARTNRU   DFLD  POS=(3,58),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
RADU     DFLD  POS=(3,72),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
ARTNRE   DFLD  POS=(4,2),LTH=8,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0408  DFLD  POS=(4,11),LTH=5,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
ARTNRN   DFLD  POS=(4,21),LTH=8,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0424  DFLD  POS=(4,30),LTH=5,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         DFLD  'Descr.date:',                                          +        
               POS=(5,2),LTH=11,                                       +        
               ATTR=(PROT)                                                      
DGIA0000 DFLD  POS=(5,14),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Status:',                                              +        
               POS=(5,21),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
STATUS   DFLD  POS=(5,29),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Currency',                                             +        
               POS=(5,31),LTH=8,                                       +        
               ATTR=(PROT)                                                      
KDVALISO DFLD  POS=(5,40),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'I N V O I C E    D  Treat',                            +        
               POS=(5,55),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Part No. Line Cde Order  Case DC   Qty  PC',           +        
               POS=(6,2),LTH=42,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Price Type   No   date D T Code',                      +        
               POS=(6,49),LTH=31,                                      +        
               ATTR=(PROT)                                                      
COL0207  DFLD  POS=(7,2),LTH=8,                                        +        
               ATTR=(PROT,MOD)                                                  
COL0907  DFLD  POS=(7,11),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KOD1     DFLD  POS=(7,17),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1407  DFLD  POS=(7,20),LTH=55,                                      +        
               ATTR=(NUM,PROT)                                                  
COL7707  DFLD  POS=(7,77),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
COL0208  DFLD  POS=(8,2),LTH=8,                                        +        
               ATTR=(PROT,MOD)                                                  
COL0908  DFLD  POS=(8,11),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KOD2     DFLD  POS=(8,17),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1408  DFLD  POS=(8,20),LTH=55,                                      +        
               ATTR=(NUM,PROT)                                                  
COL7708  DFLD  POS=(8,77),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
COL0209  DFLD  POS=(9,2),LTH=8,                                        +        
               ATTR=(PROT,MOD)                                                  
COL0909  DFLD  POS=(9,11),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KOD3     DFLD  POS=(9,17),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1409  DFLD  POS=(9,20),LTH=55,                                      +        
               ATTR=(NUM,PROT)                                                  
COL7709  DFLD  POS=(9,77),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
COL0210  DFLD  POS=(10,2),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
COL0910  DFLD  POS=(10,11),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KOD4     DFLD  POS=(10,17),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1410  DFLD  POS=(10,20),LTH=55,                                     +        
               ATTR=(NUM,PROT)                                                  
COL7710  DFLD  POS=(10,77),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
COL0211  DFLD  POS=(11,2),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
COL0911  DFLD  POS=(11,11),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KOD5     DFLD  POS=(11,17),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1411  DFLD  POS=(11,20),LTH=55,                                     +        
               ATTR=(NUM,PROT)                                                  
COL7711  DFLD  POS=(11,77),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
COL0212  DFLD  POS=(12,2),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
COL0912  DFLD  POS=(12,11),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KOD6     DFLD  POS=(12,17),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1412  DFLD  POS=(12,20),LTH=55,                                     +        
               ATTR=(NUM,PROT)                                                  
COL7712  DFLD  POS=(12,77),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
COL0213  DFLD  POS=(13,2),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
COL0913  DFLD  POS=(13,11),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KOD7     DFLD  POS=(13,17),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1413  DFLD  POS=(13,20),LTH=55,                                     +        
               ATTR=(NUM,PROT)                                                  
COL7713  DFLD  POS=(13,77),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
COL0214  DFLD  POS=(14,2),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
COL0914  DFLD  POS=(14,11),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KOD8     DFLD  POS=(14,17),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1414  DFLD  POS=(14,20),LTH=55,                                     +        
               ATTR=(NUM,PROT)                                                  
COL7714  DFLD  POS=(14,77),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
COL0215  DFLD  POS=(15,2),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
COL0915  DFLD  POS=(15,11),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KOD9     DFLD  POS=(15,17),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1415  DFLD  POS=(15,20),LTH=55,                                     +        
               ATTR=(NUM,PROT)                                                  
COL7715  DFLD  POS=(15,77),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
COL0216  DFLD  POS=(16,2),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
COL0916  DFLD  POS=(16,11),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KOD10    DFLD  POS=(16,17),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1416  DFLD  POS=(16,20),LTH=55,                                     +        
               ATTR=(NUM,PROT)                                                  
COL7716  DFLD  POS=(16,77),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
COL0217  DFLD  POS=(17,2),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
COL0917  DFLD  POS=(17,11),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KOD11    DFLD  POS=(17,17),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1417  DFLD  POS=(17,20),LTH=55,                                     +        
               ATTR=(NUM,PROT)                                                  
COL7717  DFLD  POS=(17,77),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
COL0218  DFLD  POS=(18,2),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
COL0918  DFLD  POS=(18,11),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KOD12    DFLD  POS=(18,17),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
COL1418  DFLD  POS=(18,20),LTH=55,                                     +        
               ATTR=(NUM,PROT)                                                  
COL7718  DFLD  POS=(18,77),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Part No.',                                             +        
               POS=(19,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
ARTNR19  DFLD  POS=(19,11),LTH=8,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Line',                                                 +        
               POS=(19,20),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1916  DFLD  POS=(19,25),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Code',                                                 +        
               POS=(19,30),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
KODUPP   DFLD  POS=(19,35),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Qty',                                                  +        
               POS=(19,38),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
ANTUPP   DFLD  POS=(19,42),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Price',                                                +        
               POS=(19,49),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1946  DFLD  POS=(19,55),LTH=10,                                     +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DL',                                                   +        
               POS=(19,66),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1960  DFLD  POS=(19,69),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  '13 District/Sta 14 Discr.note 1 15 Discr.note 2 16 Add.+        
                Cost    17 Returnperm.',                               +        
               POS=(21,2),LTH=78,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 Cred/Deb',                                          +        
               POS=(22,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O712N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N712,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I712N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0211,                                                +        
               LTH=4                                                            
         MFLD  FLD0311,                                                +        
               LTH=4                                                            
         MFLD  FLD0225,                                                +        
               LTH=6                                                            
         MFLD  FLD0325,                                                +        
               LTH=6                                                            
         MFLD  FLD0242,                                                +        
               LTH=7                                                            
         MFLD  FLD0342,                                                +        
               LTH=7                                                            
         MFLD  ARTNRI,                                                 +        
               LTH=8                                                            
         MFLD  ARTNRU,                                                 +        
               LTH=8                                                            
         MFLD  RADI,                                                   +        
               LTH=4                                                            
         MFLD  RADU,                                                   +        
               LTH=4                                                            
         MFLD  ARTNRE,                                                 +        
               LTH=8                                                            
         MFLD  FLD0408,                                                +        
               LTH=5                                                            
         MFLD  ARTNRN,                                                 +        
               LTH=8                                                            
         MFLD  FLD0424,                                                +        
               LTH=5                                                            
         MFLD  DGIA0000,                                               +        
               LTH=6                                                            
         MFLD  STATUS,                                                 +        
               LTH=1                                                            
         MFLD  KDVALISO,                                               +        
               LTH=3                                                            
         MFLD  COL0207,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0907,                                                +        
               LTH=4                                                            
         MFLD  KOD1,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1407,                                                +        
               LTH=57,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL7707,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0208,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0908,                                                +        
               LTH=4                                                            
         MFLD  KOD2,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1408,                                                +        
               LTH=57,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL7708,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0209,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0909,                                                +        
               LTH=4                                                            
         MFLD  KOD3,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1409,                                                +        
               LTH=57,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL7709,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0210,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0910,                                                +        
               LTH=4                                                            
         MFLD  KOD4,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1410,                                                +        
               LTH=57,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL7710,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0211,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0911,                                                +        
               LTH=4                                                            
         MFLD  KOD5,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1411,                                                +        
               LTH=57,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL7711,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0212,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0912,                                                +        
               LTH=4                                                            
         MFLD  KOD6,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1412,                                                +        
               LTH=57,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL7712,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0213,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0913,                                                +        
               LTH=4                                                            
         MFLD  KOD7,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1413,                                                +        
               LTH=57,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL7713,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0214,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0914,                                                +        
               LTH=4                                                            
         MFLD  KOD8,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1414,                                                +        
               LTH=57,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL7714,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0215,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0915,                                                +        
               LTH=4                                                            
         MFLD  KOD9,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1415,                                                +        
               LTH=57,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL7715,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0216,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0916,                                                +        
               LTH=4                                                            
         MFLD  KOD10,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1416,                                                +        
               LTH=57,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL7716,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0217,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0917,                                                +        
               LTH=4                                                            
         MFLD  KOD11,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1417,                                                +        
               LTH=57,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL7717,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0218,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0918,                                                +        
               LTH=4                                                            
         MFLD  KOD12,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1418,                                                +        
               LTH=57,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL7718,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTNR19,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1916,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KODUPP,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTUPP,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1946,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1960,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I712N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N712),                                           +        
               OPT=2,                                                  +        
               NXT=W4O712N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '47122',                                                +        
               LTH=5                                                            
         MFLD  (FLD0211,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0311,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0225,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0325,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0242,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0342,                                                +        
               LTH=7,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (ARTNRI,                                                +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  ARTNRU,                                                 +        
               LTH=8,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (RADI,                                                  +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  RADU,                                                   +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  ARTNRE,                                                 +        
               LTH=8,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0408,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  ARTNRN,                                                 +        
               LTH=8,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0424,                                                +        
               LTH=5,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (COL0207,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0907,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOD1,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL7707,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL0208,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0908,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOD2,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL7708,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL0209,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0909,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOD3,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL7709,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL0210,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0910,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOD4,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL7710,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL0211,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0911,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOD5,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL7711,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL0212,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0912,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOD6,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL7712,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL0213,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0913,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOD7,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL7713,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL0214,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0914,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOD8,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL7714,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL0215,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0915,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOD9,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL7715,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL0216,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0916,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOD10,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL7716,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL0217,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0917,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOD11,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL7717,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (COL0218,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0918,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOD12,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL7718,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (ARTNR19,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1916,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KODUPP,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTUPP,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1946,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1960,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
