***********************************************************************         
* CREATED BY V0C9059   ON 09/10/28  AT 08:51                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'Parts Matrix'                                                   
W4N751   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T751 7',                                           +        
               8='W4T751 8',                                           +        
               10='WHELP   ',                                          +        
               11='W4T751U ',                                          +        
               12='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((6,02)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Parts Matrix             ',                            +        
               POS=(1,12),LTH=25,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Identification',                                       +        
               POS=(4,29),LTH=14,                                      +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  'CMD',                                                  +        
               POS=(5,2),LTH=3,                                        +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  'Assortment',                                           +        
               POS=(5,7),LTH=10,                                       +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  'Part No.',                                             +        
               POS=(5,29),LTH=8,                                       +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  'HazM',                                                 +        
               POS=(5,39),LTH=4,                                       +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  'Sort',                                                 +        
               POS=(5,45),LTH=4,                                       +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  'Suppl',                                                +        
               POS=(5,51),LTH=5,                                       +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  'FG',                                                   +        
               POS=(5,60),LTH=2,                                       +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  'PG',                                                   +        
               POS=(5,64),LTH=2,                                       +        
               ATTR=(ALPHA,PROT)                                                
KDCMDV01 DFLD  POS=(6,2),LTH=1,                                        +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
BESORT01 DFLD  POS=(6,7),LTH=20,                                       +        
               ATTR=(ALPHA,PROT,MOD)                                            
IDARTN01 DFLD  POS=(6,29),LTH=09,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDFARL01 DFLD  POS=(6,42),LTH=01,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDSORT01 DFLD  POS=(6,45),LTH=02,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
IDLEVN01 DFLD  POS=(6,51),LTH=05,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
IDFKNG01 DFLD  POS=(6,58),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KDPROD01 DFLD  POS=(6,64),LTH=02,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDCMDV02 DFLD  POS=(7,2),LTH=1,                                        +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
BESORT02 DFLD  POS=(7,7),LTH=20,                                       +        
               ATTR=(ALPHA,PROT,MOD)                                            
IDARTN02 DFLD  POS=(7,29),LTH=09,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDFARL02 DFLD  POS=(7,42),LTH=01,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDSORT02 DFLD  POS=(7,45),LTH=02,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
IDLEVN02 DFLD  POS=(7,51),LTH=05,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
IDFKNG02 DFLD  POS=(7,58),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KDPROD02 DFLD  POS=(7,64),LTH=02,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDCMDV03 DFLD  POS=(8,2),LTH=1,                                        +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
BESORT03 DFLD  POS=(8,7),LTH=20,                                       +        
               ATTR=(ALPHA,PROT,MOD)                                            
IDARTN03 DFLD  POS=(8,29),LTH=09,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDFARL03 DFLD  POS=(8,42),LTH=01,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDSORT03 DFLD  POS=(8,45),LTH=02,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
IDLEVN03 DFLD  POS=(8,51),LTH=05,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
IDFKNG03 DFLD  POS=(8,58),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KDPROD03 DFLD  POS=(8,64),LTH=02,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDCMDV04 DFLD  POS=(9,2),LTH=1,                                        +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
BESORT04 DFLD  POS=(9,7),LTH=20,                                       +        
               ATTR=(ALPHA,PROT,MOD)                                            
IDARTN04 DFLD  POS=(9,29),LTH=09,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDFARL04 DFLD  POS=(9,42),LTH=01,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDSORT04 DFLD  POS=(9,45),LTH=02,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
IDLEVN04 DFLD  POS=(9,51),LTH=05,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
IDFKNG04 DFLD  POS=(9,58),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KDPROD04 DFLD  POS=(9,64),LTH=02,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDCMDV05 DFLD  POS=(10,2),LTH=1,                                       +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
BESORT05 DFLD  POS=(10,7),LTH=20,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
IDARTN05 DFLD  POS=(10,29),LTH=09,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
KDFARL05 DFLD  POS=(10,42),LTH=01,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
KDSORT05 DFLD  POS=(10,45),LTH=02,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
IDLEVN05 DFLD  POS=(10,51),LTH=05,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
IDFKNG05 DFLD  POS=(10,58),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDPROD05 DFLD  POS=(10,64),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
KDCMDV06 DFLD  POS=(11,2),LTH=1,                                       +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
BESORT06 DFLD  POS=(11,7),LTH=20,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
IDARTN06 DFLD  POS=(11,29),LTH=09,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
KDFARL06 DFLD  POS=(11,42),LTH=01,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
KDSORT06 DFLD  POS=(11,45),LTH=02,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
IDLEVN06 DFLD  POS=(11,51),LTH=05,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
IDFKNG06 DFLD  POS=(11,58),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDPROD06 DFLD  POS=(11,64),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
KDCMDV07 DFLD  POS=(12,2),LTH=1,                                       +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
BESORT07 DFLD  POS=(12,7),LTH=20,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
IDARTN07 DFLD  POS=(12,29),LTH=09,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
KDFARL07 DFLD  POS=(12,42),LTH=01,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
KDSORT07 DFLD  POS=(12,45),LTH=02,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
IDLEVN07 DFLD  POS=(12,51),LTH=05,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
IDFKNG07 DFLD  POS=(12,58),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDPROD07 DFLD  POS=(12,64),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
KDCMDV08 DFLD  POS=(13,2),LTH=1,                                       +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
BESORT08 DFLD  POS=(13,7),LTH=20,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
IDARTN08 DFLD  POS=(13,29),LTH=09,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
KDFARL08 DFLD  POS=(13,42),LTH=01,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
KDSORT08 DFLD  POS=(13,45),LTH=02,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
IDLEVN08 DFLD  POS=(13,51),LTH=05,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
IDFKNG08 DFLD  POS=(13,58),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDPROD08 DFLD  POS=(13,64),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
KDCMDV09 DFLD  POS=(14,2),LTH=1,                                       +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
BESORT09 DFLD  POS=(14,7),LTH=20,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
IDARTN09 DFLD  POS=(14,29),LTH=09,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
KDFARL09 DFLD  POS=(14,42),LTH=01,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
KDSORT09 DFLD  POS=(14,45),LTH=02,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
IDLEVN09 DFLD  POS=(14,51),LTH=05,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
IDFKNG09 DFLD  POS=(14,58),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDPROD09 DFLD  POS=(14,64),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
KDCMDV10 DFLD  POS=(15,2),LTH=1,                                       +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
BESORT10 DFLD  POS=(15,7),LTH=20,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
IDARTN10 DFLD  POS=(15,29),LTH=09,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
KDFARL10 DFLD  POS=(15,42),LTH=01,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
KDSORT10 DFLD  POS=(15,45),LTH=02,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
IDLEVN10 DFLD  POS=(15,51),LTH=05,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
IDFKNG10 DFLD  POS=(15,58),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDPROD10 DFLD  POS=(15,64),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
KDCMDV11 DFLD  POS=(16,2),LTH=1,                                       +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
BESORT11 DFLD  POS=(16,7),LTH=20,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
IDARTN11 DFLD  POS=(16,29),LTH=09,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
KDFARL11 DFLD  POS=(16,42),LTH=01,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
KDSORT11 DFLD  POS=(16,45),LTH=02,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
IDLEVN11 DFLD  POS=(16,51),LTH=05,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
IDFKNG11 DFLD  POS=(16,58),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDPROD11 DFLD  POS=(16,64),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
KDCMDV12 DFLD  POS=(17,2),LTH=1,                                       +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
BESORT12 DFLD  POS=(17,7),LTH=20,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
IDARTN12 DFLD  POS=(17,29),LTH=09,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
KDFARL12 DFLD  POS=(17,42),LTH=01,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
KDSORT12 DFLD  POS=(17,45),LTH=02,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
IDLEVN12 DFLD  POS=(17,51),LTH=05,                                     +        
               ATTR=(ALPHA,PROT,MOD)                                            
IDFKNG12 DFLD  POS=(17,58),LTH=4,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KDPROD12 DFLD  POS=(17,64),LTH=02,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  'CMD',                                                  +        
               POS=(18,2),LTH=3,                                       +        
               ATTR=(ALPHA,PROT)                                                
KDCMDV19 DFLD  POS=(19,2),LTH=1,                                       +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
BESORT19 DFLD  POS=(19,7),LTH=20,                                      +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
IDARTN19 DFLD  POS=(19,29),LTH=09,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
KDFARL19 DFLD  POS=(19,42),LTH=01,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
KDSORT19 DFLD  POS=(19,45),LTH=02,                                     +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
IDLEVN19 DFLD  POS=(19,51),LTH=05,                                     +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
IDFKNG19 DFLD  POS=(19,58),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
KDPROD19 DFLD  POS=(19,64),LTH=02,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'F7= First F8=Forward F10=Whelp F11=Update F12=Logoff', +        
               POS=(22,2),LTH=70,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4I751N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N751),                                           +        
               OPT=2,                                                  +        
               NXT=W4O751N1                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS1,                                              +        
               '4'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS2,                                              +        
               '7'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  (IDTRANS3,                                              +        
               '5'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  (IDTRANS4,                                              +        
               '1'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '47512',                                                +        
               LTH=5                                                            
         MFLD  (KDCMDV01,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  BESORT01,                                               +        
               LTH=20                                                           
         MFLD  IDARTN01,                                               +        
               LTH=9                                                            
         MFLD  KDFARL01,                                               +        
               LTH=01                                                           
         MFLD  KDSORT01,                                               +        
               LTH=02                                                           
         MFLD  IDLEVN01,                                               +        
               LTH=05                                                           
         MFLD  IDFKNG01,                                               +        
               LTH=4                                                            
         MFLD  KDPROD01,                                               +        
               LTH=02                                                           
         MFLD  (KDCMDV02,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  BESORT02,                                               +        
               LTH=20                                                           
         MFLD  IDARTN02,                                               +        
               LTH=9                                                            
         MFLD  KDFARL02,                                               +        
               LTH=01                                                           
         MFLD  KDSORT02,                                               +        
               LTH=02                                                           
         MFLD  IDLEVN02,                                               +        
               LTH=05                                                           
         MFLD  IDFKNG02,                                               +        
               LTH=4                                                            
         MFLD  KDPROD02,                                               +        
               LTH=02                                                           
         MFLD  (KDCMDV03,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  BESORT03,                                               +        
               LTH=20                                                           
         MFLD  IDARTN03,                                               +        
               LTH=9                                                            
         MFLD  KDFARL03,                                               +        
               LTH=01                                                           
         MFLD  KDSORT03,                                               +        
               LTH=02                                                           
         MFLD  IDLEVN03,                                               +        
               LTH=05                                                           
         MFLD  IDFKNG03,                                               +        
               LTH=4                                                            
         MFLD  KDPROD03,                                               +        
               LTH=02                                                           
         MFLD  (KDCMDV04,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  BESORT04,                                               +        
               LTH=20                                                           
         MFLD  IDARTN04,                                               +        
               LTH=9                                                            
         MFLD  KDFARL04,                                               +        
               LTH=01                                                           
         MFLD  KDSORT04,                                               +        
               LTH=02                                                           
         MFLD  IDLEVN04,                                               +        
               LTH=05                                                           
         MFLD  IDFKNG04,                                               +        
               LTH=4                                                            
         MFLD  KDPROD04,                                               +        
               LTH=02                                                           
         MFLD  (KDCMDV05,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  BESORT05,                                               +        
               LTH=20                                                           
         MFLD  IDARTN05,                                               +        
               LTH=9                                                            
         MFLD  KDFARL05,                                               +        
               LTH=01                                                           
         MFLD  KDSORT05,                                               +        
               LTH=02                                                           
         MFLD  IDLEVN05,                                               +        
               LTH=05                                                           
         MFLD  IDFKNG05,                                               +        
               LTH=4                                                            
         MFLD  KDPROD05,                                               +        
               LTH=02                                                           
         MFLD  (KDCMDV06,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  BESORT06,                                               +        
               LTH=20                                                           
         MFLD  IDARTN06,                                               +        
               LTH=9                                                            
         MFLD  KDFARL06,                                               +        
               LTH=01                                                           
         MFLD  KDSORT06,                                               +        
               LTH=02                                                           
         MFLD  IDLEVN06,                                               +        
               LTH=05                                                           
         MFLD  IDFKNG06,                                               +        
               LTH=4                                                            
         MFLD  KDPROD06,                                               +        
               LTH=02                                                           
         MFLD  (KDCMDV07,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  BESORT07,                                               +        
               LTH=20                                                           
         MFLD  IDARTN07,                                               +        
               LTH=9                                                            
         MFLD  KDFARL07,                                               +        
               LTH=01                                                           
         MFLD  KDSORT07,                                               +        
               LTH=02                                                           
         MFLD  IDLEVN07,                                               +        
               LTH=05                                                           
         MFLD  IDFKNG07,                                               +        
               LTH=4                                                            
         MFLD  KDPROD07,                                               +        
               LTH=02                                                           
         MFLD  (KDCMDV08,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  BESORT08,                                               +        
               LTH=20                                                           
         MFLD  IDARTN08,                                               +        
               LTH=9                                                            
         MFLD  KDFARL08,                                               +        
               LTH=01                                                           
         MFLD  KDSORT08,                                               +        
               LTH=02                                                           
         MFLD  IDLEVN08,                                               +        
               LTH=05                                                           
         MFLD  IDFKNG08,                                               +        
               LTH=4                                                            
         MFLD  KDPROD08,                                               +        
               LTH=02                                                           
         MFLD  (KDCMDV09,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  BESORT09,                                               +        
               LTH=20                                                           
         MFLD  IDARTN09,                                               +        
               LTH=9                                                            
         MFLD  KDFARL09,                                               +        
               LTH=01                                                           
         MFLD  KDSORT09,                                               +        
               LTH=02                                                           
         MFLD  IDLEVN09,                                               +        
               LTH=05                                                           
         MFLD  IDFKNG09,                                               +        
               LTH=4                                                            
         MFLD  KDPROD09,                                               +        
               LTH=02                                                           
         MFLD  (KDCMDV10,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  BESORT10,                                               +        
               LTH=20                                                           
         MFLD  IDARTN10,                                               +        
               LTH=9                                                            
         MFLD  KDFARL10,                                               +        
               LTH=01                                                           
         MFLD  KDSORT10,                                               +        
               LTH=02                                                           
         MFLD  IDLEVN10,                                               +        
               LTH=05                                                           
         MFLD  IDFKNG10,                                               +        
               LTH=4                                                            
         MFLD  KDPROD10,                                               +        
               LTH=02                                                           
         MFLD  (KDCMDV11,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  BESORT11,                                               +        
               LTH=20                                                           
         MFLD  IDARTN11,                                               +        
               LTH=9                                                            
         MFLD  KDFARL11,                                               +        
               LTH=01                                                           
         MFLD  KDSORT11,                                               +        
               LTH=02                                                           
         MFLD  IDLEVN11,                                               +        
               LTH=05                                                           
         MFLD  IDFKNG11,                                               +        
               LTH=4                                                            
         MFLD  KDPROD11,                                               +        
               LTH=02                                                           
         MFLD  (KDCMDV12,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  BESORT12,                                               +        
               LTH=20                                                           
         MFLD  IDARTN12,                                               +        
               LTH=9                                                            
         MFLD  KDFARL12,                                               +        
               LTH=01                                                           
         MFLD  KDSORT12,                                               +        
               LTH=02                                                           
         MFLD  IDLEVN12,                                               +        
               LTH=05                                                           
         MFLD  IDFKNG12,                                               +        
               LTH=4                                                            
         MFLD  KDPROD12,                                               +        
               LTH=02                                                           
         MFLD  (KDCMDV19,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (BESORT19,                                              +        
               '++++++++++++++++++++'),                                +        
               LTH=20                                                           
         MFLD  (IDARTN19,                                              +        
               '+++++++++'),                                           +        
               LTH=9                                                            
         MFLD  (KDFARL19,                                              +        
               '+'),                                                   +        
               LTH=01                                                           
         MFLD  (KDSORT19,                                              +        
               '++'),                                                  +        
               LTH=02                                                           
         MFLD  (IDLEVN19,                                              +        
               '+++++'),                                               +        
               LTH=05                                                           
         MFLD  (IDFKNG19,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (KDPROD19,                                              +        
               '++'),                                                  +        
               LTH=02                                                           
         MSGEND                                                                 
W4O751N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N751,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I751N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  KDCMDV01,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BESORT01,                                               +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDARTN01,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDFARL01,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDSORT01,                                               +        
               LTH=04,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVN01,                                               +        
               LTH=07,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDFKNG01,                                               +        
               LTH=06,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDPROD01,                                               +        
               LTH=04,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDCMDV02,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  BESORT02,                                               +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDARTN02,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDFARL02,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDSORT02,                                               +        
               LTH=04,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVN02,                                               +        
               LTH=07,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDFKNG02,                                               +        
               LTH=06,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDPROD02,                                               +        
               LTH=04,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDCMDV03,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  BESORT03,                                               +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDARTN03,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDFARL03,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDSORT03,                                               +        
               LTH=04,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVN03,                                               +        
               LTH=07,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDFKNG03,                                               +        
               LTH=06,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDPROD03,                                               +        
               LTH=04,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDCMDV04,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  BESORT04,                                               +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDARTN04,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDFARL04,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDSORT04,                                               +        
               LTH=04,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVN04,                                               +        
               LTH=07,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDFKNG04,                                               +        
               LTH=06,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDPROD04,                                               +        
               LTH=04,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDCMDV05,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  BESORT05,                                               +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDARTN05,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDFARL05,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDSORT05,                                               +        
               LTH=04,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVN05,                                               +        
               LTH=07,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDFKNG05,                                               +        
               LTH=06,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDPROD05,                                               +        
               LTH=04,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDCMDV06,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  BESORT06,                                               +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDARTN06,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDFARL06,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDSORT06,                                               +        
               LTH=04,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVN06,                                               +        
               LTH=07,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDFKNG06,                                               +        
               LTH=06,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDPROD06,                                               +        
               LTH=04,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDCMDV07,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  BESORT07,                                               +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDARTN07,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDFARL07,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDSORT07,                                               +        
               LTH=04,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVN07,                                               +        
               LTH=07,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDFKNG07,                                               +        
               LTH=06,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDPROD07,                                               +        
               LTH=04,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDCMDV08,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  BESORT08,                                               +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDARTN08,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDFARL08,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDSORT08,                                               +        
               LTH=04,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVN08,                                               +        
               LTH=07,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDFKNG08,                                               +        
               LTH=06,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDPROD08,                                               +        
               LTH=04,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDCMDV09,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  BESORT09,                                               +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDARTN09,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDFARL09,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDSORT09,                                               +        
               LTH=04,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVN09,                                               +        
               LTH=07,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDFKNG09,                                               +        
               LTH=06,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDPROD09,                                               +        
               LTH=04,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDCMDV10,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  BESORT10,                                               +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDARTN10,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDFARL10,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDSORT10,                                               +        
               LTH=04,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVN10,                                               +        
               LTH=07,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDFKNG10,                                               +        
               LTH=06,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDPROD10,                                               +        
               LTH=04,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDCMDV11,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  BESORT11,                                               +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDARTN11,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDFARL11,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDSORT11,                                               +        
               LTH=04,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVN11,                                               +        
               LTH=07,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDFKNG11,                                               +        
               LTH=06,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDPROD11,                                               +        
               LTH=04,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDCMDV12,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  BESORT12,                                               +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDARTN12,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDFARL12,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDSORT12,                                               +        
               LTH=04,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVN12,                                               +        
               LTH=07,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDFKNG12,                                               +        
               LTH=06,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDPROD12,                                               +        
               LTH=04,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDCMDV19,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  BESORT19,                                               +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDARTN19,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDFARL19,                                               +        
               LTH=03,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDSORT19,                                               +        
               LTH=04,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVN19,                                               +        
               LTH=07,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDFKNG19,                                               +        
               LTH=06,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDPROD19,                                               +        
               LTH=04,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
