*          DATA SET W4N903FII0 AT LEVEL 001 AS OF 89/02/09                      
*          DATA SET W4N903FII0 AT LEVEL 007 AS OF 88/09/12                      
         PRINT NOGEN                                                            
W4N903   FMT                                                                    
         DEV   TYPE=(3270,2),                                          *        
               FEAT=IGNORE,                                            *        
               PFK=(FLDPFK,'W0T501  ','W0T501  ','W0T501  ','W0T501  ',*        
               'W0T501  ','W0T501  ','W4T903 7','W4T903 8','W0T501  ', *        
               'WHELP   ','W0T501  ','/RCL.   ','W4T901  ','W4T902  ', *        
               'W4T903  ','W4T904  ','W0T501  ','W0T501  ','W0T501  ', *        
               'W0T501  ','W0T501  ','WHELP   ','W0T501  ','/RCL.   '),*        
               DSCA=X'0080',SYSMSG=FSYSMSG                                      
         DIV   TYPE=INOUT                                                       
         DPAGE CURSOR=((02,08)),                                       *        
               FILL=NONE                                                        
         ALPHA 'abcdefghijklmnopqrstuvwxyzåäö'                                  
FLD0102  DFLD  POS=(01,02),LTH=0001,ATTR=(ALPHA,NOPROT,MOD)                     
FLD0104  DFLD  POS=(01,04),LTH=0001,ATTR=(NUM)                                  
FLD0106  DFLD  POS=(01,06),LTH=0001,ATTR=(NUM)                                  
FLD0108  DFLD  POS=(01,08),LTH=0001,ATTR=(NUM)                                  
         DFLD  'B O - R E L E A S E  QUERY',                           *        
               POS=(01,11),LTH=0026,ATTR=(NUM,PROT)                             
FLD0141  DFLD  POS=(01,41),LTH=0040,ATTR=(NUM,PROT,HI)                          
         DFLD  'Distr',                                                *        
               POS=(02,02),LTH=0005,ATTR=(NUM,PROT)                             
FLD0208  DFLD  POS=(02,08),LTH=0004,ATTR=(NUM)                                  
FLD0308  DFLD  POS=(03,08),LTH=0004,ATTR=(NUM,PROT,MOD)                         
         DFLD  'Cust',                                                 *        
               POS=(02,13),LTH=0004,ATTR=(NUM,PROT)                             
FLD0218  DFLD  POS=(02,18),LTH=0006,ATTR=(NUM)                                  
FLD0318  DFLD  POS=(03,18),LTH=0006,ATTR=(NUM,PROT,MOD)                         
         DFLD  'Fc',                                                   *        
               POS=(02,25),LTH=0002,ATTR=(NUM,PROT)                             
FLD0228  DFLD  POS=(02,28),LTH=0002,ATTR=(NUM)                                  
FLD0328  DFLD  POS=(03,28),LTH=0002,ATTR=(NUM,PROT,MOD)                         
         DFLD  'Class',                                                *        
               POS=(02,31),LTH=0005,ATTR=(NUM,PROT)                             
FLD0237  DFLD  POS=(02,37),LTH=0001,ATTR=(NUM)                                  
FLD0337  DFLD  POS=(03,37),LTH=0001,ATTR=(NUM,PROT,MOD)                         
FLD0402  DFLD  POS=(04,02),LTH=0002,ATTR=(NUM,PROT,MOD,NODISP)                  
FLD0405  DFLD  POS=(04,05),LTH=0001,ATTR=(NUM,PROT,MOD,NODISP)                  
FLD0410  DFLD  POS=(04,10),LTH=0002,ATTR=(NUM,PROT,MOD,NODISP)                  
FLD0413  DFLD  POS=(04,13),LTH=0001,ATTR=(NUM,PROT,MOD,NODISP)                  
         DFLD  'Cust.     Fc    Class  Release   Startday   Even       *        
                 Odd ',                                                *        
               POS=(05,04),LTH=0061,ATTR=(NUM,PROT)                             
         DO    14,SUF=06                                                        
COL04    DFLD  POS=(06,04),LTH=0067,ATTR=(NUM,PROT)                             
         ENDDO                                                                  
         DFLD  '13 Active order 14 Phys. dev.   15 Bo-rel.query 16 Bo-r*        
               el.chng  17              18              19             *        
                20              21              10 WHELP',             *        
               POS=(21,02),LTH=0152,ATTR=(NUM,PROT)                             
FLD2302  DFLD  POS=(23,02),LTH=0055,ATTR=(NUM,PROT,HI)                          
         DFLD  ' VCAS',POS=(23,58)                                              
FLD2364  DFLD  POS=(23,64),LTH=0008,ATTR=(NUM,PROT)                             
FLD2373  DFLD  POS=(23,73),LTH=0008,ATTR=(NUM,PROT)                             
FSYSMSG  DFLD  POS=(24,02),LTH=0079,ATTR=(NUM,PROT,HI)                          
         FMTEND                                                                 
         EJECT                                                                  
W4O903N1 MSG   TYPE=OUTPUT,                                            *        
               SOR=(W4N903,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W4I903N1,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  FLD0102,LTH=0001                                                 
         MFLD  FLD0104,LTH=0001                                                 
         MFLD  FLD0106,LTH=0001                                                 
         MFLD  FLD0108,LTH=0001                                                 
         MFLD  FLD0141,LTH=0040                                                 
         MFLD  FLD0208,LTH=0004                                                 
         MFLD  FLD0308,LTH=0004                                                 
         MFLD  FLD0218,LTH=0006                                                 
         MFLD  FLD0318,LTH=0006                                                 
         MFLD  FLD0228,LTH=0002                                                 
         MFLD  FLD0328,LTH=0002                                                 
         MFLD  FLD0237,LTH=0001                                                 
         MFLD  FLD0337,LTH=0001                                                 
         MFLD  FLD0402,LTH=0002                                                 
         MFLD  FLD0405,LTH=0001                                                 
         MFLD  FLD0410,LTH=0002                                                 
         MFLD  FLD0413,LTH=0001                                                 
         DO    14,SUF=06                                                        
         MFLD  COL04,LTH=0067                                                   
         ENDDO                                                                  
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W4I903N1 MSG   TYPE=INPUT,                                             *        
               SOR=W4N903,                                             *        
               OPT=2,                                                  *        
               NXT=W4O903N1                                                     
         SEG                                                                    
         MFLD  FLDPFK,LTH=0008,FILL=NULL                                        
         MFLD  'W',LTH=0001                                                     
         MFLD  FLD0102,LTH=0001,FILL=C'4'                                       
         MFLD  'T',LTH=0001                                                     
         MFLD  FLD0104,LTH=0001,FILL=C'9'                                       
         MFLD  FLD0106,LTH=0001,FILL=C'0'                                       
         MFLD  FLD0108,LTH=0001,FILL=C'3'                                       
         MFLD  '  ',LTH=0002                                                    
         MFLD  '49032',LTH=0005                                                 
         MFLD  (FLD0208,'++++'),LTH=0004,FILL=C'0',JUST=R                       
         MFLD  FLD0308,LTH=0004,FILL=C'0'                                       
         MFLD  (FLD0218,'++++++'),LTH=0006,FILL=C'0',JUST=R                     
         MFLD  FLD0318,LTH=0006,FILL=C'0'                                       
         MFLD  (FLD0228,'++'),LTH=0002,FILL=C'0'                                
         MFLD  FLD0328,LTH=0002,FILL=C'0'                                       
         MFLD  (FLD0237,'+'),LTH=0001                                           
         MFLD  FLD0337,LTH=0001,FILL=C'0'                                       
         MFLD  FLD0402,LTH=0002,FILL=C'0',JUST=R                                
         MFLD  FLD0405,LTH=0001,FILL=C'0'                                       
         MFLD  FLD0410,LTH=0002,FILL=C'0',JUST=R                                
         MFLD  FLD0413,LTH=0001,FILL=C'0'                                       
         MSGEND                                                                 
         EJECT                                                                  
         END                                                                    
