***********************************************************************         
* CREATED BY PC36147   ON 98/11/05  AT 18:21                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W4N904   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W4T904 7',                                           +        
               8='W4T904 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W4T904U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W4T901  ',                                          +        
               14='W4T902  ',                                          +        
               15='W4T903  ',                                          +        
               16='W4T904  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,8)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'B O - R E L E A S E  CHANGE',                          +        
               POS=(1,11),LTH=27,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Distr',                                                +        
               POS=(2,2),LTH=5,                                        +        
               ATTR=(NUM,PROT)                                                  
FLD0208  DFLD  POS=(2,8),LTH=4,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Cust',                                                 +        
               POS=(2,13),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0218  DFLD  POS=(2,18),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Fc',                                                   +        
               POS=(2,25),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0228  DFLD  POS=(2,28),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Class',                                                +        
               POS=(2,31),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0237  DFLD  POS=(2,37),LTH=1,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Delete  (Y)',                                          +        
               POS=(2,39),LTH=11,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD0251  DFLD  POS=(2,51),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
FLD0308  DFLD  POS=(3,8),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
FLD0318  DFLD  POS=(3,18),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0328  DFLD  POS=(3,28),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0337  DFLD  POS=(3,37),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0351  DFLD  POS=(3,51),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Cust Ref',                                             +        
               POS=(5,2),LTH=8,                                        +        
               ATTR=(PROT)                                                      
FLD0512  DFLD  POS=(5,12),LTH=10,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Lang. (S,GB,D,F,E)',                                   +        
               POS=(5,31),LTH=18,                                      +        
               ATTR=(PROT)                                                      
FLD0550  DFLD  POS=(5,50),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  '(',                                                    +        
               POS=(5,55),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0557  DFLD  POS=(5,57),LTH=20,                                      +        
               ATTR=(PROT)                                                      
         DFLD  ')',                                                    +        
               POS=(5,78),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Volvo Ref',                                            +        
               POS=(6,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
FLD0612  DFLD  POS=(6,12),LTH=10,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Release Code',                                         +        
               POS=(6,31),LTH=12,                                      +        
               ATTR=(PROT)                                                      
FLD0650  DFLD  POS=(6,50),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  '(',                                                    +        
               POS=(6,55),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0657  DFLD  POS=(6,57),LTH=20,                                      +        
               ATTR=(PROT)                                                      
         DFLD  ')',                                                    +        
               POS=(6,78),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Invoice Type',                                         +        
               POS=(7,31),LTH=12,                                      +        
               ATTR=(PROT)                                                      
FLD0750  DFLD  POS=(7,50),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  '(',                                                    +        
               POS=(7,55),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0757  DFLD  POS=(7,57),LTH=20,                                      +        
               ATTR=(PROT)                                                      
         DFLD  ')',                                                    +        
               POS=(7,78),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'CC ',                                                  +        
               POS=(9,2),LTH=3,                                        +        
               ATTR=(PROT)                                                      
FTGUT    DFLD  POS=(9,6),LTH=2,                                        +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Acc No',                                               +        
               POS=(9,10),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0917  DFLD  POS=(9,17),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'C. C.',                                                +        
               POS=(9,31),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLD0948  DFLD  POS=(9,43),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'AnNo',                                                 +        
               POS=(9,60),LTH=4,                                       +        
               ATTR=(PROT)                                                      
ANALYSUT DFLD  POS=(9,65),LTH=12,                                      +        
               ATTR=(PROT,MOD)                                                  
FTGIN    DFLD  POS=(10,6),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD1017  DFLD  POS=(10,17),LTH=10,                                     +        
               ATTR=(NUM,NOPROT)                                                
FLD1048  DFLD  POS=(10,43),LTH=10,                                     +        
               ATTR=(NUM,NOPROT)                                                
ANALYSIN DFLD  POS=(10,65),LTH=12,                                     +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Note',                                                 +        
               POS=(12,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD1212  DFLD  POS=(12,12),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Week Even:',                                           +        
               POS=(15,2),LTH=10,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Monday',                                               +        
               POS=(16,10),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1620  DFLD  POS=(16,20),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Tuesday',                                              +        
               POS=(16,23),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1633  DFLD  POS=(16,33),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Wednesday',                                            +        
               POS=(16,36),LTH=9,                                      +        
               ATTR=(PROT)                                                      
FLD1646  DFLD  POS=(16,46),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Thursday',                                             +        
               POS=(16,49),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1659  DFLD  POS=(16,59),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Friday',                                               +        
               POS=(16,62),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1672  DFLD  POS=(16,72),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Week Odd :',                                           +        
               POS=(17,2),LTH=10,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Monday',                                               +        
               POS=(18,10),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1820  DFLD  POS=(18,20),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Tuesday',                                              +        
               POS=(18,23),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1833  DFLD  POS=(18,33),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Wednesday',                                            +        
               POS=(18,36),LTH=9,                                      +        
               ATTR=(PROT)                                                      
FLD1846  DFLD  POS=(18,46),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Thursday',                                             +        
               POS=(18,49),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1859  DFLD  POS=(18,59),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Friday',                                               +        
               POS=(18,62),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1872  DFLD  POS=(18,72),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Start Day:',                                           +        
               POS=(19,2),LTH=10,                                      +        
               ATTR=(PROT)                                                      
FLD1913  DFLD  POS=(19,13),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '13 Active order 14 Phys. dev.   15 Bo-rel.query 16 Bo-r+        
               el.chng  17',                                           +        
               POS=(21,2),LTH=66,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W4O904N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W4N904,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W4I904N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0208,                                                +        
               LTH=4                                                            
         MFLD  FLD0308,                                                +        
               LTH=4                                                            
         MFLD  FLD0218,                                                +        
               LTH=6                                                            
         MFLD  FLD0318,                                                +        
               LTH=6                                                            
         MFLD  FLD0228,                                                +        
               LTH=2                                                            
         MFLD  FLD0328,                                                +        
               LTH=2                                                            
         MFLD  FLD0237,                                                +        
               LTH=1                                                            
         MFLD  FLD0337,                                                +        
               LTH=1                                                            
         MFLD  FLD0251,                                                +        
               LTH=1                                                            
         MFLD  FLD0351,                                                +        
               LTH=1                                                            
         MFLD  FLD0512,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD0550,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0557,                                                +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD0612,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD0650,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0657,                                                +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD0750,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0757,                                                +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FTGIN,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FTGUT,                                                  +        
               LTH=2                                                            
         MFLD  FLD1017,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD0917,                                                +        
               LTH=10                                                           
         MFLD  FLD1048,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD0948,                                                +        
               LTH=10                                                           
         MFLD  ANALYSIN,                                               +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ANALYSUT,                                               +        
               LTH=12                                                           
         MFLD  FLD1212,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1620,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1633,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1646,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1659,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1672,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1820,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1833,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1846,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1859,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1872,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1913,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W4I904N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W4N904),                                           +        
               OPT=2,                                                  +        
               NXT=W4O904N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F9'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '49042',                                                +        
               LTH=5                                                            
         MFLD  (FLD0208,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0308,                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0218,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0318,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0228,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0328,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0237,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  FLD0337,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0251,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  FLD0351,                                                +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0512,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLD0550,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0612,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLD0650,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (FLD0750,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (FTGIN,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FTGUT,                                                  +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD1017,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0917,                                                +        
               LTH=10,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1048,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  FLD0948,                                                +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MFLD  (ANALYSIN,                                              +        
               '++++++++++++'),                                        +        
               LTH=12,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  ANALYSUT,                                               +        
               LTH=12,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1212,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLD1620,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (FLD1633,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (FLD1646,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (FLD1659,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (FLD1672,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (FLD1820,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (FLD1833,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (FLD1846,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (FLD1859,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (FLD1872,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (FLD1913,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
