***********************************************************************         
* CREATED BY V065708   ON 02/10/01  AT 15:33                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W5F114   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W5T114U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W5T111  ',                                          +        
               14='W5T112  ',                                          +        
               15='W5T113  ',                                          +        
               16='W5T114  ',                                          +        
               17='W5T115  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W5F114   DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'SPIS FRÅGA ÄNDRA ART FÖRSLAG',                         +        
               POS=(1,12),LTH=28,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Artikelnr',                                            +        
               POS=(2,2),LTH=9,                                        +        
               ATTR=(NUM,PROT)                                                  
DGIA0010 DFLD  POS=(2,12),LTH=9,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Levnr',                                                +        
               POS=(2,23),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DGIA0014 DFLD  POS=(2,29),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0019 DFLD  POS=(2,43),LTH=1,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0033 DFLD  POS=(2,54),LTH=6,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0043 DFLD  POS=(2,63),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLSVAR   DFLD  POS=(2,68),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  ' ',                                                    +        
               POS=(2,70),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
DGIA0011 DFLD  POS=(3,12),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0015 DFLD  POS=(3,29),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0021 DFLD  POS=(3,43),LTH=1,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0034 DFLD  POS=(3,54),LTH=6,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0009 DFLD  POS=(4,1),LTH=9,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0012 DFLD  POS=(4,11),LTH=5,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
FLAGGA   DFLD  POS=(4,17),LTH=1,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Prisansvar',                                           +        
               POS=(5,2),LTH=10,                                       +        
               ATTR=(PROT)                                                      
IDPRANSV DFLD  POS=(5,13),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Märkning',                                             +        
               POS=(5,18),LTH=8,                                       +        
               ATTR=(ALPHA,PROT)                                                
MARKNING DFLD  POS=(5,27),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Benämning',                                            +        
               POS=(5,38),LTH=9,                                       +        
               ATTR=(PROT)                                                      
BEART    DFLD  POS=(5,48),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Gällande   SPIS förslag Procent',                      +        
               POS=(6,50),LTH=31,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'SPIS-årsprog',                                         +        
               POS=(7,2),LTH=12,                                       +        
               ATTR=(PROT)                                                      
DGIA0024 DFLD  POS=(7,20),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Inkpris',                                              +        
               POS=(7,41),LTH=7,                                       +        
               ATTR=(PROT)                                                      
DGIA0017 DFLD  POS=(7,50),LTH=10,                                      +        
               ATTR=(PROT)                                                      
DGIA0018 DFLD  POS=(7,62),LTH=10,                                      +        
               ATTR=(PROT)                                                      
DGIA0016 DFLD  POS=(7,74),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Totalsaldo',                                           +        
               POS=(8,2),LTH=10,                                       +        
               ATTR=(ALPHA,PROT)                                                
DGIA0025 DFLD  POS=(8,21),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Stdpris',                                              +        
               POS=(8,41),LTH=7,                                       +        
               ATTR=(PROT)                                                      
DGIA0041 DFLD  POS=(8,50),LTH=10,                                      +        
               ATTR=(PROT)                                                      
DGIA0042 DFLD  POS=(8,62),LTH=10,                                      +        
               ATTR=(PROT)                                                      
DGIA0040 DFLD  POS=(8,74),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'SPIS-hemtagfakt',                                      +        
               POS=(9,2),LTH=15,                                       +        
               ATTR=(ALPHA,PROT)                                                
RETULF   DFLD  POS=(9,19),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DGIA0036 DFLD  POS=(9,28),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Bestpris',                                             +        
               POS=(9,41),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DGIA0028 DFLD  POS=(9,50),LTH=10,                                      +        
               ATTR=(PROT)                                                      
DGIA0029 DFLD  POS=(9,62),LTH=10,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'SPIS-valkurs',                                         +        
               POS=(10,2),LTH=12,                                      +        
               ATTR=(PROT)                                                      
DGIA0032 DFLD  POS=(10,15),LTH=12,                                     +        
               ATTR=(PROT)                                                      
DGIA0031 DFLD  POS=(10,28),LTH=12,                                     +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Sjkpris',                                              +        
               POS=(10,41),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0030 DFLD  POS=(10,50),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DGIA0037 DFLD  POS=(10,62),LTH=10,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Ingår i sats',                                         +        
               POS=(11,2),LTH=12,                                      +        
               ATTR=(PROT)                                                      
FLIART   DFLD  POS=(11,26),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Dirlön',                                               +        
               POS=(11,41),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0004 DFLD  POS=(11,52),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DGIA0005 DFLD  POS=(11,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Huvlevnr',                                             +        
               POS=(12,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DGIA0013 DFLD  POS=(12,22),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Dirmat',                                               +        
               POS=(12,41),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0006 DFLD  POS=(12,50),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DGIA0007 DFLD  POS=(12,62),LTH=10,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Prodslag',                                             +        
               POS=(13,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
KDPRODSL DFLD  POS=(13,25),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Övromk',                                               +        
               POS=(13,41),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0026 DFLD  POS=(13,52),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DGIA0027 DFLD  POS=(13,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Baspris-   SPIS-',                                     +        
               POS=(15,2),LTH=16,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Baspris',                                              +        
               POS=(15,23),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Val  Status   Beh-  DL   APC    Fil',                  +        
               POS=(15,36),LTH=35,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'datum',                                                +        
               POS=(16,2),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'levnr',                                                +        
               POS=(16,13),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'fr.lev',                                               +        
               POS=(16,23),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'ISO  baspris  kod',                                    +        
               POS=(16,36),LTH=17,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'pris',                                                 +        
               POS=(16,68),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0000 DFLD  POS=(17,3),LTH=6,                                       +        
               ATTR=(PROT)                                                      
DGIA0039 DFLD  POS=(17,13),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0002 DFLD  POS=(17,19),LTH=14,                                     +        
               ATTR=(NUM,PROT)                                                  
DGIA0046 DFLD  POS=(17,36),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0023 DFLD  POS=(17,42),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0022 DFLD  POS=(17,51),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0035 DFLD  POS=(17,55),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0008 DFLD  POS=(17,62),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLPRFIL  DFLD  POS=(17,69),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0003 DFLD  POS=(18,3),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0038 DFLD  POS=(18,13),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0001 DFLD  POS=(18,19),LTH=14,                                     +        
               ATTR=(NUM,NOPROT)                                                
DGIA0045 DFLD  POS=(18,36),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0020 DFLD  POS=(18,51),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Notering',                                             +        
               POS=(19,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DGIA0044 DFLD  POS=(19,11),LTH=40,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  '13 Pris uppdat  14 Pris borttag 15 Best-pr f-år 16 Art-+        
               förslag 17 Godk prisfsl',                               +        
               POS=(21,2),LTH=78,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '09',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 Whelp',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W5O11401 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W5F114,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W5I11401,                                           +        
               FILL=PT                                                          
W5O11401 LPAGE SOR=W5F114,                                             +        
               NXT=W5I11401                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DGIA0010,                                               +        
               LTH=9                                                            
         MFLD  DGIA0011,                                               +        
               LTH=9                                                            
         MFLD  DGIA0014,                                               +        
               LTH=5                                                            
         MFLD  DGIA0015,                                               +        
               LTH=5                                                            
         MFLD  DGIA0019,                                               +        
               LTH=1                                                            
         MFLD  DGIA0021,                                               +        
               LTH=1                                                            
         MFLD  DGIA0033,                                               +        
               LTH=6                                                            
         MFLD  DGIA0034,                                               +        
               LTH=6                                                            
         MFLD  DGIA0009,                                               +        
               LTH=9                                                            
         MFLD  DGIA0012,                                               +        
               LTH=5                                                            
         MFLD  FLAGGA,                                                 +        
               LTH=1                                                            
         MFLD  IDPRANSV,                                               +        
               LTH=4                                                            
         MFLD  MARKNING,                                               +        
               LTH=6                                                            
         MFLD  BEART,                                                  +        
               LTH=25                                                           
         MFLD  DGIA0024,                                               +        
               LTH=7                                                            
         MFLD  DGIA0017,                                               +        
               LTH=10                                                           
         MFLD  DGIA0018,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0016,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0025,                                               +        
               LTH=6                                                            
         MFLD  DGIA0041,                                               +        
               LTH=10                                                           
         MFLD  DGIA0042,                                               +        
               LTH=10                                                           
         MFLD  DGIA0040,                                               +        
               LTH=7                                                            
         MFLD  RETULF,                                                 +        
               LTH=8                                                            
         MFLD  DGIA0036,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0028,                                               +        
               LTH=10                                                           
         MFLD  DGIA0029,                                               +        
               LTH=10                                                           
         MFLD  DGIA0032,                                               +        
               LTH=12                                                           
         MFLD  DGIA0031,                                               +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0030,                                               +        
               LTH=10                                                           
         MFLD  DGIA0037,                                               +        
               LTH=10                                                           
         MFLD  FLIART,                                                 +        
               LTH=1                                                            
         MFLD  DGIA0004,                                               +        
               LTH=8                                                            
         MFLD  DGIA0005,                                               +        
               LTH=8                                                            
         MFLD  DGIA0013,                                               +        
               LTH=5                                                            
         MFLD  DGIA0006,                                               +        
               LTH=10                                                           
         MFLD  DGIA0007,                                               +        
               LTH=10                                                           
         MFLD  KDPRODSL,                                               +        
               LTH=2                                                            
         MFLD  DGIA0026,                                               +        
               LTH=8                                                            
         MFLD  DGIA0027,                                               +        
               LTH=8                                                            
         MFLD  DGIA0000,                                               +        
               LTH=6                                                            
         MFLD  DGIA0039,                                               +        
               LTH=5                                                            
         MFLD  DGIA0002,                                               +        
               LTH=14                                                           
         MFLD  DGIA0046,                                               +        
               LTH=3                                                            
         MFLD  DGIA0023,                                               +        
               LTH=5                                                            
         MFLD  DGIA0022,                                               +        
               LTH=1                                                            
         MFLD  DGIA0035,                                               +        
               LTH=4                                                            
         MFLD  DGIA0008,                                               +        
               LTH=1                                                            
         MFLD  FLPRFIL,                                                +        
               LTH=1                                                            
         MFLD  DGIA0003,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0038,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0001,                                               +        
               LTH=16,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0045,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0020,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0044,                                               +        
               LTH=42,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0043,                                               +        
               LTH=4                                                            
         MFLD  FLSVAR,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W5I11401 MSG   TYPE=INPUT,                                             +        
               SOR=(W5F114),                                           +        
               OPT=2,                                                  +        
               NXT=W5O11401                                                     
W5I11401 LPAGE SOR=(W5F114),                                           +        
               NXT=W5O11401                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '51141',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0010,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0011,                                               +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0014,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  DGIA0015,                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0019,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0021,                                               +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0033,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0034,                                               +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0009,                                               +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0012,                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLAGGA,                                                 +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0018,                                               +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0016,                                               +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0036,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0031,                                              +        
               '++++++++++++'),                                        +        
               LTH=12,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0003,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0038,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0001,                                              +        
               '++++++++++++++'),                                      +        
               LTH=14,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0045,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0020,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0044,                                              +        
               '++++++++++++++++++++++++++++++++++++++++'),            +        
               LTH=40,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLSVAR,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
