***********************************************************************         
* CREATED BY PCC6483   ON 00/08/08  AT 09:39                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'FIKTIV CLEARING                 '                               
W5F109   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='w0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W01501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W5T109U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W5T101  ',                                          +        
               14='W5T102  ',                                          +        
               15='W5T103  ',                                          +        
               16='W5T104  ',                                          +        
               17='W5T105  ',                                          +        
               18='W5T106  ',                                          +        
               19='W5T107  ',                                          +        
               20='W5T108  ',                                          +        
               21='W5T109  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W5F109   DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Fiktiv Clearing',                                      +        
               POS=(1,12),LTH=15,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Artikelnr',                                            +        
               POS=(2,2),LTH=9,                                        +        
               ATTR=(NUM,PROT)                                                  
DGIA0000 DFLD  POS=(2,12),LTH=9,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0001 DFLD  POS=(3,12),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Kvantitet',                                            +        
               POS=(5,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
KVANTAL  DFLD  POS=(5,19),LTH=7,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Sändande lager',                                       +        
               POS=(6,2),LTH=14,                                       +        
               ATTR=(PROT)                                                      
IDDCSEND DFLD  POS=(6,24),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Mottagande lager',                                     +        
               POS=(7,2),LTH=16,                                       +        
               ATTR=(PROT)                                                      
IDDCMOT  DFLD  POS=(7,24),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Referensnr',                                           +        
               POS=(8,2),LTH=10,                                       +        
               ATTR=(PROT)                                                      
REFNR    DFLD  POS=(8,19),LTH=7,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  '1 Invent.info 2 Lagerbok.info 3 Fråge-central 4 Pris-be+        
               st.info  5 Just.historik',                              +        
               POS=(21,2),LTH=79,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '6 Just. o-1   7 Inlev.info    8 Uppd.utrsaldo 9 Fiktiv +        
               clear.  10 WHELP',                                      +        
               POS=(22,2),LTH=71,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  '    ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W5O10901 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W5F109,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W5I10901,                                           +        
               FILL=PT                                                          
W5O10901 LPAGE SOR=W5F109,                                             +        
               NXT=W5I10901                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DGIA0000,                                               +        
               LTH=9                                                            
         MFLD  DGIA0001,                                               +        
               LTH=9                                                            
         MFLD  KVANTAL,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDDCSEND,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDDCMOT,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  REFNR,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W5I10901 MSG   TYPE=INPUT,                                             +        
               SOR=(W5F109),                                           +        
               OPT=2,                                                  +        
               NXT=W5O10901                                                     
W5I10901 LPAGE SOR=(W5F109),                                           +        
               NXT=W5O10901                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F9'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '51091',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0000,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0001,                                               +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVANTAL,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDDCSEND,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDDCMOT,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (REFNR,                                                 +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
