         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
W5F103   FMT                                                                    
         DEV   TYPE=(3270,2),                                          *        
               FEAT=IGNORE,                                            *        
               PFK=(FLDPFK,'W5T101  ','W5T102  ','W5T103  ','W5T104  ',*        
               'W5T105  ','W5T106  ','W5T107  ','W5T108  ','W5T109  ', *        
               'WHELP   ','W0T501  ','/RCL.   ','W5T101  ','W5T102  ', *        
               'W5T103  ','W5T104  ','W5T105  ','W5T106  ','W5T107  ', *        
               'W5T108  ','W5T109  ','WHELP   ','W0T501  ','/RCL.   '),*        
               DSCA=X'0080',SYSMSG=FSYSMSG                                      
         DIV   TYPE=INOUT                                                       
         DPAGE CURSOR=((02,12)),                                       *        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(01,02),LTH=0001,ATTR=(ALPHA,NOPROT,MOD)                     
FLD0104  DFLD  POS=(01,04),LTH=0001,ATTR=(NUM,MOD)                              
FLD0106  DFLD  POS=(01,06),LTH=0001,ATTR=(NUM,MOD)                              
FLD0108  DFLD  POS=(01,08),LTH=0001,ATTR=(NUM,MOD)                              
         DFLD  'FRÅGECENTRAL',                                         *        
               POS=(01,12),LTH=0012,ATTR=(NUM,PROT)                             
FLD0141  DFLD  POS=(01,41),LTH=0040,ATTR=(NUM,PROT,HI)                          
         DFLD  'ARTIKELNR',                                            *        
               POS=(02,02),LTH=0009,ATTR=(NUM,PROT)                             
FLD0212  DFLD  POS=(02,12),LTH=0009,ATTR=(NUM,MOD)                              
FLD0312  DFLD  POS=(03,12),LTH=0011,ATTR=(NUM,PROT,MOD)                         
         DFLD  'Spärrkod',                                             *        
               POS=(05,02),LTH=0008,ATTR=(NUM,PROT)                             
FLD0523  DFLD  POS=(05,23),LTH=0001,ATTR=(NUM,PROT)                             
FLD0537  DFLD  POS=(05,37),LTH=0001,ATTR=(NUM,PROT)                             
         DFLD  'Ink.pris',                                             *        
               POS=(05,42),LTH=0008,ATTR=(NUM,PROT)                             
FLD0562  DFLD  POS=(05,62),LTH=0010,ATTR=(NUM,PROT)                             
         DFLD  'Lev.som res-del',                                      *        
               POS=(06,02),LTH=0015,ATTR=(NUM,PROT)                             
FLD0623  DFLD  POS=(06,23),LTH=0001,ATTR=(ALPHA,PROT)                           
         DFLD  'Std.pris',                                             *        
               POS=(06,42),LTH=0008,ATTR=(NUM,PROT)                             
FLD0662  DFLD  POS=(06,62),LTH=0010,ATTR=(NUM,PROT)                             
         DFLD  'Ers.kod',                                              *        
               POS=(07,02),LTH=0007,ATTR=(NUM,PROT)                             
FLD0721  DFLD  POS=(07,21),LTH=0003,ATTR=(NUM,PROT)                             
FLD0735  DFLD  POS=(07,35),LTH=0003,ATTR=(NUM,PROT)                             
         DFLD  'Best.pris',                                            *        
               POS=(07,42),LTH=0009,ATTR=(NUM,PROT)                             
FLD0762  DFLD  POS=(07,62),LTH=0010,ATTR=(NUM,PROT)                             
         DFLD  'Kvant-förp',                                           *        
               POS=(08,02),LTH=0010,ATTR=(NUM,PROT)                             
FLD0819  DFLD  POS=(08,19),LTH=0005,ATTR=(NUM,PROT)                             
         DFLD  'Självkost',                                            *        
               POS=(08,42),LTH=0009,ATTR=(NUM,PROT)                             
FLD0862  DFLD  POS=(08,62),LTH=0010,ATTR=(NUM,PROT)                             
         DFLD  'Ansk-nr',                                              *        
               POS=(09,02),LTH=0007,ATTR=(NUM,PROT)                             
FLD0921  DFLD  POS=(09,21),LTH=0003,ATTR=(NUM,PROT)                             
         DFLD  'Priskod',                                              *        
               POS=(09,42),LTH=0007,ATTR=(NUM,PROT)                             
FLD0968  DFLD  POS=(09,68),LTH=0001,ATTR=(NUM,PROT)                             
         DFLD  'Lev-nr',                                               *        
               POS=(10,02),LTH=0006,ATTR=(NUM,PROT)                             
FLD1019  DFLD  POS=(10,19),LTH=0005,ATTR=(NUM,PROT)                             
         DFLD  'Tillk.art.',                                           *        
               POS=(10,42),LTH=0010,ATTR=(NUM,PROT)                             
FLD1060  DFLD  POS=(10,60),LTH=0009,ATTR=(NUM,PROT)                             
         DFLD  'Ink-nr',                                               *        
               POS=(11,02),LTH=0006,ATTR=(NUM,PROT)                             
FLD1121  DFLD  POS=(11,20),LTH=0004,ATTR=(NUM,PROT)                             
         DFLD  'Ant.av tillk.art. ',                                   *        
               POS=(11,42),LTH=0018,ATTR=(NUM,PROT)                             
FLD1161  DFLD  POS=(11,61),LTH=0008,ATTR=(NUM,PROT)                             
         DFLD  'Art-adr',                                              *        
               POS=(12,02),LTH=0007,ATTR=(NUM,PROT)                             
FLD1213  DFLD  POS=(12,13),LTH=0011,ATTR=(NUM,PROT)                             
FLD1227  DFLD  POS=(12,27),LTH=0011,ATTR=(NUM,PROT)                             
         DFLD  'Artikelvikt',                                          *        
               POS=(12,42),LTH=0011,ATTR=(NUM,PROT)                             
FLD1261  DFLD  POS=(12,61),LTH=0008,ATTR=(NUM,PROT)                             
         DFLD  'Disp.lager',                                           *        
               POS=(13,02),LTH=0010,ATTR=(NUM,PROT)                             
FLD1317  DFLD  POS=(13,17),LTH=0008,ATTR=(NUM,PROT)                             
FLD1331  DFLD  POS=(13,31),LTH=0008,ATTR=(NUM,PROT)                             
         DFLD  'Avsändningsdatum',                                     *        
               POS=(13,42),LTH=0016,ATTR=(NUM,PROT)                             
FLD1361  DFLD  POS=(13,61),LTH=0019,ATTR=(NUM,PROT)                             
         DFLD  'Ankomstsaldo',                                         *        
               POS=(14,02),LTH=0012,ATTR=(NUM,PROT)                             
FLD1417  DFLD  POS=(14,17),LTH=0008,ATTR=(NUM,PROT)                             
FLD1431  DFLD  POS=(14,31),LTH=0008,ATTR=(NUM,PROT)                             
         DFLD  'Huvudförrådsmärkn.',                                   *        
               POS=(14,42),LTH=0018,ATTR=(NUM,PROT)                             
FLD1468  DFLD  POS=(14,68),LTH=0001,ATTR=(NUM,PROT)                             
         DFLD  'Kat.ord.buff',                                         *        
               POS=(15,02),LTH=0012,ATTR=(NUM,PROT)                             
FLD1517  DFLD  POS=(15,17),LTH=0008,ATTR=(NUM,PROT)                             
FLD1531  DFLD  POS=(15,31),LTH=0008,ATTR=(NUM,PROT)                             
         DFLD  'Restordersaldo',                                       *        
               POS=(15,42),LTH=0014,ATTR=(NUM,PROT)                             
FLD1562  DFLD  POS=(15,62),LTH=0019,ATTR=(NUM,PROT)                             
         DFLD  'Pb tot',                                               *        
               POS=(16,02),LTH=0006,ATTR=(NUM,PROT)                             
FLD1618  DFLD  POS=(16,18),LTH=0008,ATTR=(NUM,PROT)                             
         DFLD  'Efr-saldo',                                            *        
               POS=(16,42),LTH=0009,ATTR=(NUM,PROT)                             
FLD1662  DFLD  POS=(16,62),LTH=0019,ATTR=(NUM,PROT)                             
         DFLD  'Res.kvant',                                            *        
               POS=(17,02),LTH=0009,ATTR=(NUM,PROT)                             
FLD1717  DFLD  POS=(17,17),LTH=0007,ATTR=(NUM,PROT)                             
FLD1731  DFLD  POS=(17,31),LTH=0007,ATTR=(NUM,PROT)                             
         DFLD  'Kuransgrupp',                                          *        
               POS=(17,42),LTH=0011,ATTR=(NUM,PROT)                             
FLD1768  DFLD  POS=(17,68),LTH=0001,ATTR=(NUM,PROT)                             
         DFLD  'Best.rest',                                            *        
               POS=(18,02),LTH=0009,ATTR=(NUM,PROT)                             
FLD1817  DFLD  POS=(18,17),LTH=0008,ATTR=(NUM,PROT)                             
         DFLD  'Hemtagpris',                                           *        
               POS=(18,42),LTH=0010,ATTR=(NUM,PROT)                             
FLD1858  DFLD  POS=(18,58),LTH=0011,ATTR=(NUM,PROT)                             
         DFLD  'Sortkod',                                              *        
               POS=(19,02),LTH=0007,ATTR=(NUM,PROT)                             
FLD1922  DFLD  POS=(19,22),LTH=0002,ATTR=(ALPHA,PROT)                           
         DFLD  'Artikelben.',                                          *        
               POS=(19,42),LTH=0011,ATTR=(NUM,PROT)                             
FLD1954  DFLD  POS=(19,54),LTH=0025,ATTR=(ALPHA,PROT)                           
         DFLD  '1 Invent. info  2 Lagerbok.info 3 Fråge-central 4 Pris-*        
                best,inf 5 Just.historik 6 Justering o-l 7 Inlev.info  *        
                8 Uppd.utrsaldo  9 Fikt. clear. 10 Whelp',             *        
               POS=(21,02),LTH=0152,ATTR=(NUM,PROT)                             
         DFLD  ' VCAS',POS=(23,58)                                              
FLD2364  DFLD  POS=(23,64),LTH=0008,ATTR=(NUM,PROT)                             
FLD2373  DFLD  POS=(23,73),LTH=0008,ATTR=(NUM,PROT)                             
FSYSMSG  DFLD  POS=(24,02),LTH=0079,ATTR=(NUM,PROT,HI)                          
         FMTEND                                                                 
         EJECT                                                                  
W5O10301 MSG   TYPE=OUTPUT,                                            *        
               SOR=(W5F103,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W5I10301,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  FLD0102,LTH=0001                                                 
         MFLD  FLD0104,LTH=0001                                                 
         MFLD  FLD0106,LTH=0001                                                 
         MFLD  FLD0108,LTH=0001                                                 
         MFLD  FLD0141,LTH=0040                                                 
         MFLD  FLD0212,LTH=0002                                                 
         MFLD  FLD0312,LTH=0011                                                 
         MFLD  FLD0523,LTH=0001                                                 
         MFLD  FLD0537,LTH=0001                                                 
         MFLD  FLD0623,LTH=0001                                                 
         MFLD  FLD0721,LTH=0003                                                 
         MFLD  FLD0735,LTH=0003                                                 
         MFLD  FLD0819,LTH=0005                                                 
         MFLD  FLD0921,LTH=0003                                                 
         MFLD  FLD1019,LTH=0005                                                 
         MFLD  FLD1121,LTH=0004                                                 
         MFLD  FLD1213,LTH=0011                                                 
         MFLD  FLD1227,LTH=0011                                                 
         MFLD  FLD1317,LTH=0008                                                 
         MFLD  FLD1331,LTH=0008                                                 
         MFLD  FLD1417,LTH=0008                                                 
         MFLD  FLD1431,LTH=0008                                                 
         MFLD  FLD1517,LTH=0008                                                 
         MFLD  FLD1531,LTH=0008                                                 
         MFLD  FLD1618,LTH=0008                                                 
         MFLD  FLD1717,LTH=0007                                                 
         MFLD  FLD1731,LTH=0007                                                 
         MFLD  FLD1817,LTH=0008                                                 
         MFLD  FLD1922,LTH=0002                                                 
         MFLD  FLD0562,LTH=0010                                                 
         MFLD  FLD0662,LTH=0010                                                 
         MFLD  FLD0762,LTH=0010                                                 
         MFLD  FLD0862,LTH=0010                                                 
         MFLD  FLD0968,LTH=0001                                                 
         MFLD  FLD1060,LTH=0009                                                 
         MFLD  FLD1161,LTH=0008                                                 
         MFLD  FLD1261,LTH=0008                                                 
         MFLD  FLD1361,LTH=0022                                                 
         MFLD  FLD1468,LTH=0001                                                 
         MFLD  FLD1562,LTH=0022                                                 
         MFLD  FLD1662,LTH=0022                                                 
         MFLD  FLD1768,LTH=0001                                                 
         MFLD  FLD1858,LTH=0011                                                 
         MFLD  FLD1954,LTH=0025                                                 
         MFLD  (FLD2364,DATE4)                                                  
         MFLD  (FLD2373,TIME)                                                   
         MFLD  (FSYSMSG,' '),LTH=0001                                           
         MSGEND                                                                 
         EJECT                                                                  
W5I10301 MSG   TYPE=INPUT,                                             *        
               SOR=W5F103,                                             *        
               OPT=2,                                                  *        
               NXT=W5O10301                                                     
         SEG                                                                    
         MFLD  FLDPFK,LTH=008,FILL=NULL                                         
         MFLD  'W',LTH=001                                                      
         MFLD  FLD0102,LTH=0001,FILL=C'5'                                       
         MFLD  'T',LTH=001                                                      
         MFLD  FLD0104,LTH=0001,FILL=C'1'                                       
         MFLD  FLD0106,LTH=0001,FILL=C'0'                                       
         MFLD  FLD0108,LTH=0001,FILL=C'3'                                       
         MFLD  '  ',LTH=002                                                     
         MFLD  '51031',LTH=0005                                                 
         MFLD  (FLD0212,'+++++++++'),LTH=0009,FILL=C'0',JUST=R                  
         MFLD  FLD0312,LTH=0009,FILL=C'0'                                       
         MSGEND                                                                 
         EJECT                                                                  
         END                                                                    
