***********************************************************************         
* CREATED BY R063238   ON 92/11/30  AT 16:02                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W5F113   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W5T111  ',                                           +        
               2='W5T112  ',                                           +        
               3='W5T113  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W5T111  ',                                          +        
               14='W5T112  ',                                          +        
               15='W5T113  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'FJOLÅRETS PRIS/BEST-INFO',                             +        
               POS=(1,12),LTH=24,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Artikelnr',                                            +        
               POS=(2,2),LTH=9,                                        +        
               ATTR=(NUM,PROT)                                                  
DGIA0000 DFLD  POS=(2,12),LTH=9,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0001 DFLD  POS=(3,12),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  '-',                                                    +        
               POS=(3,22),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
REKSIFFR DFLD  POS=(3,24),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Datum  Levnr    Sv.bestpris  Utl.bestpris  Status',    +        
               POS=(5,4),LTH=49,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Inkpris',                                              +        
               POS=(5,60),LTH=7,                                       +        
               ATTR=(PROT)                                                      
PRINK    DFLD  POS=(5,69),LTH=10,                                      +        
               ATTR=(PROT)                                                      
BESTRAD1 DFLD  POS=(6,3),LTH=50,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Stdpris',                                              +        
               POS=(6,60),LTH=7,                                       +        
               ATTR=(PROT)                                                      
PRARTSTD DFLD  POS=(6,69),LTH=10,                                      +        
               ATTR=(PROT)                                                      
BESTRAD2 DFLD  POS=(7,3),LTH=50,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Bestpris',                                             +        
               POS=(7,60),LTH=8,                                       +        
               ATTR=(PROT)                                                      
PRARTBES DFLD  POS=(7,69),LTH=10,                                      +        
               ATTR=(PROT)                                                      
BESTRAD3 DFLD  POS=(8,3),LTH=50,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Sjkpris',                                              +        
               POS=(8,60),LTH=7,                                       +        
               ATTR=(PROT)                                                      
PRARTSJK DFLD  POS=(8,69),LTH=10,                                      +        
               ATTR=(PROT)                                                      
BESTRAD4 DFLD  POS=(9,3),LTH=50,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Dirlon',                                               +        
               POS=(9,60),LTH=6,                                       +        
               ATTR=(PROT)                                                      
PRDIRLON DFLD  POS=(9,71),LTH=8,                                       +        
               ATTR=(PROT)                                                      
BESTRAD5 DFLD  POS=(10,3),LTH=50,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Dirmat',                                               +        
               POS=(10,60),LTH=6,                                      +        
               ATTR=(PROT)                                                      
PRDMTRL  DFLD  POS=(10,69),LTH=10,                                     +        
               ATTR=(PROT)                                                      
BESTRAD6 DFLD  POS=(11,3),LTH=50,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Övr omk',                                              +        
               POS=(11,60),LTH=7,                                      +        
               ATTR=(PROT)                                                      
PROVRPAL DFLD  POS=(11,71),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Tippat',                                               +        
               POS=(12,60),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KDTIPPR  DFLD  POS=(12,78),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Hemt',                                                 +        
               POS=(13,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
IDLKTO   DFLD  POS=(13,7),LTH=10,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Prodsl',                                               +        
               POS=(13,19),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
KDPRODSL DFLD  POS=(13,26),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Ansknr',                                               +        
               POS=(13,60),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDANSK   DFLD  POS=(13,76),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Avtal / Beställningar / Annullationer',                +        
               POS=(14,5),LTH=37,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Inknr',                                                +        
               POS=(14,60),LTH=5,                                      +        
               ATTR=(PROT)                                                      
IDINK    DFLD  POS=(14,75),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Order Nummer       Levnr   Datum   Kvant    Bekr  Märkn+        
               ing',                                                   +        
               POS=(15,2),LTH=58,                                      +        
               ATTR=(PROT)                                                      
FLD1602  DFLD  POS=(16,2),LTH=57,                                      +        
               ATTR=(PROT)                                                      
FLD1702  DFLD  POS=(17,2),LTH=57,                                      +        
               ATTR=(PROT)                                                      
FLD1802  DFLD  POS=(18,2),LTH=57,                                      +        
               ATTR=(PROT)                                                      
FLD1902  DFLD  POS=(19,2),LTH=57,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '13 Pris uppdat  14 Pris borttag 15 Best-pr f-år 16',   +        
               POS=(21,2),LTH=50,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 Whelp',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  ' VCAS',POS=(23,58)                                              
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(NOPROT)                                                    
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NOPROT)                                                    
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W5O11301 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W5F113,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W5I11301,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DGIA0000,                                               +        
               LTH=2                                                            
         MFLD  DGIA0001,                                               +        
               LTH=9                                                            
         MFLD  REKSIFFR,                                               +        
               LTH=1                                                            
         MFLD  IDANSK,                                                 +        
               LTH=3                                                            
         MFLD  IDINK,                                                  +        
               LTH=4                                                            
         MFLD  IDLKTO,                                                 +        
               LTH=10                                                           
         MFLD  KDPRODSL,                                               +        
               LTH=2                                                            
         MFLD  KDTIPPR,                                                +        
               LTH=1                                                            
         MFLD  PRARTBES,                                               +        
               LTH=10                                                           
         MFLD  PRARTSJK,                                               +        
               LTH=10                                                           
         MFLD  PRARTSTD,                                               +        
               LTH=10                                                           
         MFLD  PRINK,                                                  +        
               LTH=10                                                           
         MFLD  PRDIRLON,                                               +        
               LTH=8                                                            
         MFLD  PRDMTRL,                                                +        
               LTH=10                                                           
         MFLD  PROVRPAL,                                               +        
               LTH=8                                                            
         MFLD  BESTRAD1,                                               +        
               LTH=50                                                           
         MFLD  BESTRAD2,                                               +        
               LTH=50                                                           
         MFLD  BESTRAD3,                                               +        
               LTH=50                                                           
         MFLD  BESTRAD4,                                               +        
               LTH=50                                                           
         MFLD  BESTRAD5,                                               +        
               LTH=50                                                           
         MFLD  BESTRAD6,                                               +        
               LTH=50                                                           
         MFLD  FLD1602,                                                +        
               LTH=57                                                           
         MFLD  FLD1702,                                                +        
               LTH=57                                                           
         MFLD  FLD1802,                                                +        
               LTH=57                                                           
         MFLD  FLD1902,                                                +        
               LTH=57                                                           
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W5I11301 MSG   TYPE=INPUT,                                             +        
               SOR=(W5F113),                                           +        
               OPT=2,                                                  +        
               NXT=W5O11301                                                     
MID      LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '51131',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0000,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0001,                                               +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
