***********************************************************************         
* CREATED BY PC56049   ON 95/05/19  AT 13:48                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W5F143   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W5T143 7',                                           +        
               8='W5T143 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W5T143U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W5T141  ',                                          +        
               14='W5T142  ',                                          +        
               15='W5T143  ',                                          +        
               16='W5T144  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,13)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'EMBALLAGEKOST/DETALJKOD',                              +        
               POS=(1,11),LTH=23,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Detaljkod:',                                           +        
               POS=(2,2),LTH=10,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0213  DFLD  POS=(2,13),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD0313  DFLD  POS=(3,13),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0402  DFLD  POS=(4,2),LTH=9,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0412  DFLD  POS=(4,12),LTH=9,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         DFLD  'Detaljkod    Mtrl.kost/st',                            +        
               POS=(5,2),LTH=25,                                       +        
               ATTR=(PROT)                                                      
COL0206  DFLD  POS=(6,2),LTH=9,                                        +        
               ATTR=(PROT,MOD)                                                  
COL1406  DFLD  POS=(6,14),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
COL0207  DFLD  POS=(7,2),LTH=9,                                        +        
               ATTR=(PROT,MOD)                                                  
COL1407  DFLD  POS=(7,14),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
COL0208  DFLD  POS=(8,2),LTH=9,                                        +        
               ATTR=(PROT,MOD)                                                  
COL1408  DFLD  POS=(8,14),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
COL0209  DFLD  POS=(9,2),LTH=9,                                        +        
               ATTR=(PROT,MOD)                                                  
COL1409  DFLD  POS=(9,14),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
COL0210  DFLD  POS=(10,2),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1410  DFLD  POS=(10,14),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
COL0211  DFLD  POS=(11,2),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1411  DFLD  POS=(11,14),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
COL0212  DFLD  POS=(12,2),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1412  DFLD  POS=(12,14),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
COL0213  DFLD  POS=(13,2),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1413  DFLD  POS=(13,14),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
COL0214  DFLD  POS=(14,2),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1414  DFLD  POS=(14,14),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
COL0215  DFLD  POS=(15,2),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1415  DFLD  POS=(15,14),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
COL0216  DFLD  POS=(16,2),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1416  DFLD  POS=(16,14),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
COL0217  DFLD  POS=(17,2),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1417  DFLD  POS=(17,14),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Nyupplägg/Ändring',                                    +        
               POS=(18,2),LTH=17,                                      +        
               ATTR=(PROT)                                                      
FLD1902  DFLD  POS=(19,2),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD1914  DFLD  POS=(19,14),LTH=10,                                     +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Borttag',                                              +        
               POS=(19,55),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1964  DFLD  POS=(19,64),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  '13 KOST/FP-TYP  14 EX.KOST/ART  15 KOST/DET.KOD 16 KOST+        
               /FP-GRP  17',                                           +        
               POS=(21,2),LTH=66,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W5O14301 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W5F143,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W5I14301,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0213,                                                +        
               LTH=9                                                            
         MFLD  FLD0313,                                                +        
               LTH=9                                                            
         MFLD  FLD0402,                                                +        
               LTH=9                                                            
         MFLD  FLD0412,                                                +        
               LTH=9                                                            
         MFLD  COL0206,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL1406,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0207,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL1407,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0208,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL1408,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0209,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL1409,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0210,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL1410,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0211,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL1411,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0212,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL1412,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0213,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL1413,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0214,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL1414,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0215,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL1415,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0216,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL1416,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0217,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL1417,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1902,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1914,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1964,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W5I14301 MSG   TYPE=INPUT,                                             +        
               SOR=(W5F143),                                           +        
               OPT=2,                                                  +        
               NXT=W5O14301                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '51431',                                                +        
               LTH=5                                                            
         MFLD  (FLD0213,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0313,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0402,                                                +        
               LTH=9                                                            
         MFLD  FLD0412,                                                +        
               LTH=9                                                            
         MFLD  (FLD1902,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1914,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1964,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
