***********************************************************************         
* CREATED BY PC56049   ON 95/05/17  AT 13:12                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W5F144   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W5T144 7',                                           +        
               8='W5T144 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W5T144U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W5T141  ',                                          +        
               14='W5T142  ',                                          +        
               15='W5T143  ',                                          +        
               16='W5T144  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W5F14401 DPAGE CURSOR=((2,10)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'FÖRPACKNINGSKOSTNAD/FP-GRUPP',                         +        
               POS=(1,11),LTH=28,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Fp-grp:',                                              +        
               POS=(2,2),LTH=7,                                        +        
               ATTR=(NUM,PROT)                                                  
DGIA0001 DFLD  POS=(2,10),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0016 DFLD  POS=(3,10),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0000 DFLD  POS=(4,2),LTH=2,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0002 DFLD  POS=(4,11),LTH=2,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Fp-grp   Dir.lön/fg  Mtrl.kost/fg  Övr.omk/fg',        +        
               POS=(5,2),LTH=45,                                       +        
               ATTR=(PROT)                                                      
DGIA0003 DFLD  POS=(6,5),LTH=2,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0017 DFLD  POS=(6,13),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0030 DFLD  POS=(6,25),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0043 DFLD  POS=(6,39),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0007 DFLD  POS=(7,5),LTH=2,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0021 DFLD  POS=(7,13),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0034 DFLD  POS=(7,25),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0047 DFLD  POS=(7,39),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0008 DFLD  POS=(8,5),LTH=2,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0022 DFLD  POS=(8,13),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0035 DFLD  POS=(8,25),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0048 DFLD  POS=(8,39),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0009 DFLD  POS=(9,5),LTH=2,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0023 DFLD  POS=(9,13),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0036 DFLD  POS=(9,25),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0049 DFLD  POS=(9,39),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0010 DFLD  POS=(10,5),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0024 DFLD  POS=(10,13),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0037 DFLD  POS=(10,25),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
DGIA0050 DFLD  POS=(10,39),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0011 DFLD  POS=(11,5),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0025 DFLD  POS=(11,13),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0038 DFLD  POS=(11,25),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
DGIA0051 DFLD  POS=(11,39),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0012 DFLD  POS=(12,5),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0026 DFLD  POS=(12,13),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0039 DFLD  POS=(12,25),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
DGIA0052 DFLD  POS=(12,39),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0013 DFLD  POS=(13,5),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0027 DFLD  POS=(13,13),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0040 DFLD  POS=(13,25),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
DGIA0053 DFLD  POS=(13,39),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0014 DFLD  POS=(14,5),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0028 DFLD  POS=(14,13),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0041 DFLD  POS=(14,25),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
DGIA0054 DFLD  POS=(14,39),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0004 DFLD  POS=(15,5),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0018 DFLD  POS=(15,13),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0031 DFLD  POS=(15,25),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
DGIA0044 DFLD  POS=(15,39),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0005 DFLD  POS=(16,5),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0019 DFLD  POS=(16,13),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0032 DFLD  POS=(16,25),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
DGIA0045 DFLD  POS=(16,39),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0006 DFLD  POS=(17,5),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0020 DFLD  POS=(17,13),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0033 DFLD  POS=(17,25),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
DGIA0046 DFLD  POS=(17,39),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Nyupplägg/ändring:',                                   +        
               POS=(18,2),LTH=18,                                      +        
               ATTR=(PROT)                                                      
DGIA0015 DFLD  POS=(19,6),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0029 DFLD  POS=(19,13),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0042 DFLD  POS=(19,25),LTH=10,                                     +        
               ATTR=(NUM,NOPROT)                                                
DGIA0055 DFLD  POS=(19,39),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Borttag:',                                             +        
               POS=(19,55),LTH=8,                                      +        
               ATTR=(PROT)                                                      
KDCMD    DFLD  POS=(19,64),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  '13 KOST/FP-TYP  14 EX.KOST/ART  15 KOST/DET.KOD 16 KOST+        
               /FP-GRP  17',                                           +        
               POS=(21,2),LTH=66,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMSINF  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W5O14401 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W5F144,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W5I14401,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W5F14401                                                     
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DGIA0001,                                               +        
               LTH=2                                                            
         MFLD  DGIA0016,                                               +        
               LTH=2                                                            
         MFLD  DGIA0000,                                               +        
               LTH=2                                                            
         MFLD  DGIA0002,                                               +        
               LTH=2                                                            
         MFLD  DGIA0003,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0017,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0030,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0043,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0007,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0021,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0034,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0047,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0008,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0022,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0035,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0048,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0009,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0023,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0036,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0049,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0010,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0024,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0037,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0050,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0011,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0025,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0038,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0051,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0012,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0026,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0039,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0052,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0013,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0027,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0040,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0053,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0014,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0028,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0041,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0054,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0004,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0018,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0031,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0044,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0005,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0019,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0032,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0045,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0006,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0020,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0033,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0046,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0015,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0029,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0042,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0055,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDCMD,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMSINF,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W5I14401 MSG   TYPE=INPUT,                                             +        
               SOR=(W5F144),                                           +        
               OPT=2,                                                  +        
               NXT=W5O14401                                                     
MID      LPAGE SOR=(W5F14401)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '51441',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0001,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0016,                                               +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  DGIA0000,                                               +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  DGIA0002,                                               +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0015,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0029,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0042,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0055,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KDCMD,                                                  +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
