***********************************************************************         
* CREATED BY V065708   ON 02/10/04  AT 08:53                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'STDPRISÄNDRING INNEVARANDE ÅR   '                               
W5F116   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W5T116U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W5T111  ',                                          +        
               14='W5T112  ',                                          +        
               15='W5T113  ',                                          +        
               16='W5T114  ',                                          +        
               17='W5T115  ',                                          +        
               18='W5T116  ',                                          +        
               19='W5T117  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W5F116   DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'ÄNDRING AV BEHANDLINGSKOD',                            +        
               POS=(1,12),LTH=25,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Artikelnr',                                            +        
               POS=(2,2),LTH=9,                                        +        
               ATTR=(NUM,PROT)                                                  
IDARTNRI DFLD  POS=(2,12),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDARTNRU DFLD  POS=(3,12),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Benämning',                                            +        
               POS=(5,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
BEART    DFLD  POS=(5,12),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Gäll. pris    Nytt pris   Procent',                    +        
               POS=(6,45),LTH=33,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Inköpare',                                             +        
               POS=(7,2),LTH=8,                                        +        
               ATTR=(PROT)                                                      
IDINK    DFLD  POS=(7,23),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Inkpris',                                              +        
               POS=(7,36),LTH=7,                                       +        
               ATTR=(PROT)                                                      
PRAKTINK DFLD  POS=(7,45),LTH=10,                                      +        
               ATTR=(PROT)                                                      
PRKOMINK DFLD  POS=(7,58),LTH=10,                                      +        
               ATTR=(PROT)                                                      
REAENINK DFLD  POS=(7,71),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Totalsaldo',                                           +        
               POS=(8,2),LTH=10,                                       +        
               ATTR=(PROT)                                                      
KVDISPSP DFLD  POS=(8,21),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Stdpris',                                              +        
               POS=(8,36),LTH=7,                                       +        
               ATTR=(PROT)                                                      
PRAKTSTD DFLD  POS=(8,45),LTH=10,                                      +        
               ATTR=(PROT)                                                      
PRKOMSTD DFLD  POS=(8,58),LTH=10,                                      +        
               ATTR=(PROT)                                                      
REAENSTD DFLD  POS=(8,71),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Hemtagfakt',                                           +        
               POS=(9,2),LTH=10,                                       +        
               ATTR=(PROT)                                                      
RETULF   DFLD  POS=(9,19),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Bestpris',                                             +        
               POS=(9,36),LTH=8,                                       +        
               ATTR=(PROT)                                                      
PRARTBES DFLD  POS=(9,45),LTH=10,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Valutakurs',                                           +        
               POS=(10,2),LTH=10,                                      +        
               ATTR=(PROT)                                                      
PRKURSUT DFLD  POS=(10,15),LTH=12,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Sjkpris',                                              +        
               POS=(10,36),LTH=7,                                      +        
               ATTR=(PROT)                                                      
PRARTSJK DFLD  POS=(10,45),LTH=10,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Ingår i sats',                                         +        
               POS=(11,2),LTH=12,                                      +        
               ATTR=(PROT)                                                      
FLIART   DFLD  POS=(11,26),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Dirlön',                                               +        
               POS=(11,36),LTH=6,                                      +        
               ATTR=(PROT)                                                      
PRDIRLAK DFLD  POS=(11,47),LTH=8,                                      +        
               ATTR=(PROT)                                                      
PRDIRLKO DFLD  POS=(11,60),LTH=8,                                      +        
               ATTR=(PROT)                                                      
REAENDL  DFLD  POS=(11,71),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Huvlevnr',                                             +        
               POS=(12,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
IDLEVNRH DFLD  POS=(12,22),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Dirmat',                                               +        
               POS=(12,36),LTH=6,                                      +        
               ATTR=(PROT)                                                      
PRDMTRLA DFLD  POS=(12,45),LTH=10,                                     +        
               ATTR=(PROT)                                                      
PRDMTRLK DFLD  POS=(12,58),LTH=10,                                     +        
               ATTR=(PROT)                                                      
REAENMT  DFLD  POS=(12,71),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Prodslag',                                             +        
               POS=(13,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
KDPRODSL DFLD  POS=(13,25),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Övromk',                                               +        
               POS=(13,36),LTH=6,                                      +        
               ATTR=(PROT)                                                      
PROVRPAA DFLD  POS=(13,47),LTH=8,                                      +        
               ATTR=(PROT)                                                      
PROVRPAK DFLD  POS=(13,60),LTH=8,                                      +        
               ATTR=(PROT)                                                      
REAENOV  DFLD  POS=(13,71),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Best.pris- Rad-',                                      +        
               POS=(15,2),LTH=15,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Baspris',                                              +        
               POS=(15,23),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Val  Status   Beh-  DL   Fil-',                        +        
               POS=(15,35),LTH=29,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'datum',                                                +        
               POS=(16,2),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'levnr',                                                +        
               POS=(16,13),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'fr.lev',                                               +        
               POS=(16,23),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'ISO  baspris  kod',                                    +        
               POS=(16,35),LTH=17,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'flagga',                                               +        
               POS=(16,60),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TIPRLIRA DFLD  POS=(17,3),LTH=6,                                       +        
               ATTR=(PROT)                                                      
IDLEVNRR DFLD  POS=(17,13),LTH=5,                                      +        
               ATTR=(PROT)                                                      
PRARTBPR DFLD  POS=(17,19),LTH=14,                                     +        
               ATTR=(NUM,PROT)                                                  
KDVALISR DFLD  POS=(17,35),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KDSTASPI DFLD  POS=(17,41),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KDPRBHRA DFLD  POS=(17,50),LTH=1,                                      +        
               ATTR=(PROT)                                                      
REDIRLEV DFLD  POS=(17,54),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLPRFIL  DFLD  POS=(17,62),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DAREGDAT DFLD  POS=(18,2),LTH=8,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
TIREGTID DFLD  POS=(18,12),LTH=6,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
KDPRBHIN DFLD  POS=(18,50),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  '13 Pris uppdat  14 Pris borttag 15 Best-pr f-år 16 Art-+        
               förslag 17 Godk prisfsl',                               +        
               POS=(21,2),LTH=78,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 Std uppd.kö  19',                                   +        
               POS=(22,2),LTH=18,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '09',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,65),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W5O11601 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W5F116,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W5I11601,                                           +        
               FILL=PT                                                          
W5O11601 LPAGE SOR=W5F116,                                             +        
               NXT=W5I11601                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDARTNRI,                                               +        
               LTH=9                                                            
         MFLD  IDARTNRU,                                               +        
               LTH=9                                                            
         MFLD  BEART,                                                  +        
               LTH=25                                                           
         MFLD  PRAKTINK,                                               +        
               LTH=10                                                           
         MFLD  PRKOMINK,                                               +        
               LTH=10                                                           
         MFLD  REAENINK,                                               +        
               LTH=7                                                            
         MFLD  IDINK,                                                  +        
               LTH=4                                                            
         MFLD  KVDISPSP,                                               +        
               LTH=6                                                            
         MFLD  PRAKTSTD,                                               +        
               LTH=10                                                           
         MFLD  PRKOMSTD,                                               +        
               LTH=10                                                           
         MFLD  REAENSTD,                                               +        
               LTH=7                                                            
         MFLD  RETULF,                                                 +        
               LTH=8                                                            
         MFLD  PRARTBES,                                               +        
               LTH=10                                                           
         MFLD  PRKURSUT,                                               +        
               LTH=12                                                           
         MFLD  PRARTSJK,                                               +        
               LTH=10                                                           
         MFLD  FLIART,                                                 +        
               LTH=1                                                            
         MFLD  PRDIRLAK,                                               +        
               LTH=8                                                            
         MFLD  PRDIRLKO,                                               +        
               LTH=8                                                            
         MFLD  REAENDL,                                                +        
               LTH=7                                                            
         MFLD  IDLEVNRH,                                               +        
               LTH=5                                                            
         MFLD  PRDMTRLA,                                               +        
               LTH=10                                                           
         MFLD  PRDMTRLK,                                               +        
               LTH=10                                                           
         MFLD  REAENMT,                                                +        
               LTH=7                                                            
         MFLD  KDPRODSL,                                               +        
               LTH=2                                                            
         MFLD  PROVRPAA,                                               +        
               LTH=8                                                            
         MFLD  PROVRPAK,                                               +        
               LTH=8                                                            
         MFLD  REAENOV,                                                +        
               LTH=7                                                            
         MFLD  TIPRLIRA,                                               +        
               LTH=6                                                            
         MFLD  IDLEVNRR,                                               +        
               LTH=5                                                            
         MFLD  PRARTBPR,                                               +        
               LTH=14                                                           
         MFLD  KDVALISR,                                               +        
               LTH=3                                                            
         MFLD  KDSTASPI,                                               +        
               LTH=5                                                            
         MFLD  KDPRBHRA,                                               +        
               LTH=1                                                            
         MFLD  REDIRLEV,                                               +        
               LTH=4                                                            
         MFLD  FLPRFIL,                                                +        
               LTH=1                                                            
         MFLD  KDPRBHIN,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DAREGDAT,                                               +        
               LTH=8                                                            
         MFLD  TIREGTID,                                               +        
               LTH=6                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W5I11601 MSG   TYPE=INPUT,                                             +        
               SOR=(W5F116),                                           +        
               OPT=2,                                                  +        
               NXT=W5O11601                                                     
W5I11601 LPAGE SOR=(W5F116),                                           +        
               NXT=W5O11601                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '51161',                                                +        
               LTH=5                                                            
         MFLD  (IDARTNRI,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDARTNRU,                                               +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (KDPRBHIN,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DAREGDAT,                                              +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (TIREGTID,                                              +        
               '++++++'),                                              +        
               LTH=6                                                            
         MSGEND                                                                 
         END                                                                    
