***********************************************************************         
* CREATED BY PC56049   ON 95/05/19  AT 13:51                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W5F141   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W5T141 7',                                           +        
               8='W5T141 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W5T141U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W5T141  ',                                          +        
               14='W5T142  ',                                          +        
               15='W5T143  ',                                          +        
               16='W5T144  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,10)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'FÖRPACKNINGSKOSTNAD/FP-TYP',                           +        
               POS=(1,11),LTH=29,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Fp-typ:',                                              +        
               POS=(2,2),LTH=7,                                        +        
               ATTR=(NUM,PROT)                                                  
FLD0210  DFLD  POS=(2,10),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD0310  DFLD  POS=(3,10),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0402  DFLD  POS=(4,2),LTH=2,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0411  DFLD  POS=(4,11),LTH=2,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Fp-typ   Dl.kost/fp  Mtrl.kost/fp  Övr.omk/fp',        +        
               POS=(5,2),LTH=45,                                       +        
               ATTR=(PROT)                                                      
COL0506  DFLD  POS=(6,5),LTH=3,                                        +        
               ATTR=(PROT,MOD)                                                  
COL1306  DFLD  POS=(6,13),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
COL2506  DFLD  POS=(6,25),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
COL3906  DFLD  POS=(6,39),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
COL0507  DFLD  POS=(7,5),LTH=3,                                        +        
               ATTR=(PROT,MOD)                                                  
COL1307  DFLD  POS=(7,13),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
COL2507  DFLD  POS=(7,25),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
COL3907  DFLD  POS=(7,39),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
COL0508  DFLD  POS=(8,5),LTH=3,                                        +        
               ATTR=(PROT,MOD)                                                  
COL1308  DFLD  POS=(8,13),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
COL2508  DFLD  POS=(8,25),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
COL3908  DFLD  POS=(8,39),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
COL0509  DFLD  POS=(9,5),LTH=3,                                        +        
               ATTR=(PROT,MOD)                                                  
COL1309  DFLD  POS=(9,13),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
COL2509  DFLD  POS=(9,25),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
COL3909  DFLD  POS=(9,39),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
COL0510  DFLD  POS=(10,5),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1310  DFLD  POS=(10,13),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
COL2510  DFLD  POS=(10,25),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
COL3910  DFLD  POS=(10,39),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
COL0511  DFLD  POS=(11,5),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1311  DFLD  POS=(11,13),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
COL2511  DFLD  POS=(11,25),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
COL3911  DFLD  POS=(11,39),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
COL0512  DFLD  POS=(12,5),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1312  DFLD  POS=(12,13),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
COL2512  DFLD  POS=(12,25),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
COL3912  DFLD  POS=(12,39),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
COL0513  DFLD  POS=(13,5),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1313  DFLD  POS=(13,13),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
COL2513  DFLD  POS=(13,25),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
COL3913  DFLD  POS=(13,39),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
COL0514  DFLD  POS=(14,5),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1314  DFLD  POS=(14,13),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
COL2514  DFLD  POS=(14,25),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
COL3914  DFLD  POS=(14,39),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
COL0515  DFLD  POS=(15,5),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1315  DFLD  POS=(15,13),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
COL2515  DFLD  POS=(15,25),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
COL3915  DFLD  POS=(15,39),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
COL0516  DFLD  POS=(16,5),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1316  DFLD  POS=(16,13),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
COL2516  DFLD  POS=(16,25),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
COL3916  DFLD  POS=(16,39),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
COL0517  DFLD  POS=(17,5),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
COL1317  DFLD  POS=(17,13),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
COL2517  DFLD  POS=(17,25),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
COL3917  DFLD  POS=(17,39),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Nyupplägg/ändring:',                                   +        
               POS=(18,2),LTH=18,                                      +        
               ATTR=(PROT)                                                      
FLD1906  DFLD  POS=(19,6),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD1913  DFLD  POS=(19,13),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
FLD1925  DFLD  POS=(19,25),LTH=10,                                     +        
               ATTR=(NUM,NOPROT)                                                
FLD1939  DFLD  POS=(19,39),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Borttag:',                                             +        
               POS=(19,55),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1964  DFLD  POS=(19,64),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  '13 KOST/FP-TYP  14 EX.KOST/ART  15 KOST/DET.KOD 16 KOST+        
               /FP-GRP  17',                                           +        
               POS=(21,2),LTH=66,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W5O14101 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W5F141,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W5I14101,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0210,                                                +        
               LTH=2                                                            
         MFLD  FLD0310,                                                +        
               LTH=2                                                            
         MFLD  FLD0402,                                                +        
               LTH=2                                                            
         MFLD  FLD0411,                                                +        
               LTH=2                                                            
         MFLD  COL0506,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1306,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL2506,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL3906,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0507,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1307,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL2507,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL3907,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0508,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1308,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL2508,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL3908,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0509,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1309,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL2509,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL3909,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0510,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1310,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL2510,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL3910,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0511,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1311,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL2511,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL3911,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0512,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1312,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL2512,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL3912,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0513,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1313,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL2513,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL3913,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0514,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1314,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL2514,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL3914,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0515,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1315,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL2515,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL3915,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0516,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1316,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL2516,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL3916,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL0517,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL1317,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL2517,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  COL3917,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1906,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1913,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1925,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1939,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1964,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W5I14101 MSG   TYPE=INPUT,                                             +        
               SOR=(W5F141),                                           +        
               OPT=2,                                                  +        
               NXT=W5O14101                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '51411',                                                +        
               LTH=5                                                            
         MFLD  (FLD0210,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0310,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0402,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0411,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD1906,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1913,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1925,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1939,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD1964,                                                +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
