***********************************************************************         
* CREATED BY R063238   ON 93/08/18  AT 14:57                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W5F104   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W5T101  ',                                           +        
               2='W5T102  ',                                           +        
               3='W5T103  ',                                           +        
               4='W5T104  ',                                           +        
               5='W5T105  ',                                           +        
               6='W5T106  ',                                           +        
               7='W5T107  ',                                           +        
               8='W5T108  ',                                           +        
               9='W5T109  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W5T101  ',                                          +        
               14='W5T102  ',                                          +        
               15='W5T103  ',                                          +        
               16='W5T104  ',                                          +        
               17='W5T105  ',                                          +        
               18='W5T106  ',                                          +        
               19='W5T107  ',                                          +        
               20='W5T108  ',                                          +        
               21='W5T109  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'PRIS OCH BESTÄLLNINGS-INFO',                           +        
               POS=(1,12),LTH=26,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Artikelnr',                                            +        
               POS=(2,2),LTH=9,                                        +        
               ATTR=(NUM,PROT)                                                  
FLD0212  DFLD  POS=(2,12),LTH=9,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0312  DFLD  POS=(3,12),LTH=11,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Datum  Levnr    Sv.bestpris    Utl.bestpris  Status',  +        
               POS=(5,4),LTH=51,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Inkpris',                                              +        
               POS=(5,60),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD0569  DFLD  POS=(5,69),LTH=12,                                      +        
               ATTR=(PROT)                                                      
FLD0603  DFLD  POS=(6,3),LTH=52,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Stdpris',                                              +        
               POS=(6,60),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD0669  DFLD  POS=(6,69),LTH=12,                                      +        
               ATTR=(PROT)                                                      
FLD0703  DFLD  POS=(7,3),LTH=52,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Bestpris',                                             +        
               POS=(7,60),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD0769  DFLD  POS=(7,69),LTH=12,                                      +        
               ATTR=(PROT)                                                      
FLD0803  DFLD  POS=(8,3),LTH=52,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Sjkpris',                                              +        
               POS=(8,60),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD0869  DFLD  POS=(8,69),LTH=12,                                      +        
               ATTR=(PROT)                                                      
FLD0903  DFLD  POS=(9,3),LTH=52,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Dirlon',                                               +        
               POS=(9,60),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0971  DFLD  POS=(9,71),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD1003  DFLD  POS=(10,3),LTH=52,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Dirmat',                                               +        
               POS=(10,60),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1069  DFLD  POS=(10,69),LTH=12,                                     +        
               ATTR=(PROT)                                                      
FLD1103  DFLD  POS=(11,3),LTH=52,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Övr omk',                                              +        
               POS=(11,60),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1171  DFLD  POS=(11,71),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Fixed Pris',                                           +        
               POS=(12,60),LTH=10,                                     +        
               ATTR=(PROT)                                                      
FLD1278  DFLD  POS=(12,78),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Ansknr',                                               +        
               POS=(13,60),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1376  DFLD  POS=(13,76),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Avtal / Beställningar / Annullationer',                +        
               POS=(14,5),LTH=37,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Inknr',                                                +        
               POS=(14,60),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLD1476  DFLD  POS=(14,75),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Order Nummer       Levnr   Datum   Kvant    Bekr  Märkn+        
               ing',                                                   +        
               POS=(15,2),LTH=58,                                      +        
               ATTR=(PROT)                                                      
FLD1602  DFLD  POS=(16,2),LTH=57,                                      +        
               ATTR=(PROT)                                                      
FLD1702  DFLD  POS=(17,2),LTH=57,                                      +        
               ATTR=(PROT)                                                      
FLD1802  DFLD  POS=(18,2),LTH=57,                                      +        
               ATTR=(PROT)                                                      
FLD1902  DFLD  POS=(19,2),LTH=57,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '1 Invent. Info  2 Lagerbok.info 3 Fråge-central 4 Pris-+        
               best inf 5 Just.historik',                              +        
               POS=(21,2),LTH=79,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '6 Justering o-l 7 Inlev.info    8 Uppd.utrsaldo  9 Fikt+        
               . clear. 10 Whelp',                                     +        
               POS=(22,2),LTH=72,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(NOPROT)                                                    
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NOPROT)                                                    
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W5O10401 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W5F104,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W5I10401,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  FLD0212,                                                +        
               LTH=9                                                            
         MFLD  FLD0312,                                                +        
               LTH=11                                                           
         MFLD  FLD0569,                                                +        
               LTH=10                                                           
         MFLD  FLD0669,                                                +        
               LTH=10                                                           
         MFLD  FLD0769,                                                +        
               LTH=10                                                           
         MFLD  FLD0869,                                                +        
               LTH=10                                                           
         MFLD  FLD0971,                                                +        
               LTH=8                                                            
         MFLD  FLD1069,                                                +        
               LTH=10                                                           
         MFLD  FLD1171,                                                +        
               LTH=8                                                            
         MFLD  FLD1278,                                                +        
               LTH=1                                                            
         MFLD  FLD1376,                                                +        
               LTH=3                                                            
         MFLD  FLD1476,                                                +        
               LTH=4                                                            
         MFLD  FLD0603,                                                +        
               LTH=52                                                           
         MFLD  FLD0703,                                                +        
               LTH=52                                                           
         MFLD  FLD0803,                                                +        
               LTH=52                                                           
         MFLD  FLD0903,                                                +        
               LTH=52                                                           
         MFLD  FLD1003,                                                +        
               LTH=52                                                           
         MFLD  FLD1103,                                                +        
               LTH=52                                                           
         MFLD  FLD1602,                                                +        
               LTH=57                                                           
         MFLD  FLD1702,                                                +        
               LTH=57                                                           
         MFLD  FLD1802,                                                +        
               LTH=57                                                           
         MFLD  FLD1902,                                                +        
               LTH=57                                                           
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W5I10401 MSG   TYPE=INPUT,                                             +        
               SOR=(W5F104),                                           +        
               OPT=2,                                                  +        
               NXT=W5O10401                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '51041',                                                +        
               LTH=5                                                            
         MFLD  (FLD0212,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0312,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
