***********************************************************************         
* CREATED BY PCC6483   ON 00/09/12  AT 12:56                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'SDC GOODS RECEIVING HISTORY     '                               
W5F307   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='w0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W01501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W5T307 7',                                           +        
               8='W5T307 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W5T301  ',                                          +        
               14='W5T302  ',                                          +        
               15='W5T303  ',                                          +        
               16='W5T304  ',                                          +        
               17='W5T305  ',                                          +        
               18='W5T306  ',                                          +        
               19='W5T307  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W5F307   DPAGE CURSOR=((2,11)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'SDC GOODS RECEIVING HISTORY',                          +        
               POS=(1,12),LTH=27,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'PART NO.',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(NUM,PROT)                                                  
DGIA0005 DFLD  POS=(2,11),LTH=9,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'DC',                                                   +        
               POS=(2,22),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0008 DFLD  POS=(2,25),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0006 DFLD  POS=(3,11),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0010 DFLD  POS=(3,25),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0007 DFLD  POS=(4,2),LTH=2,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0009 DFLD  POS=(4,5),LTH=2,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0011 DFLD  POS=(4,8),LTH=15,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0012 DFLD  POS=(4,24),LTH=15,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Description',                                          +        
               POS=(5,2),LTH=11,                                       +        
               ATTR=(PROT)                                                      
DGIA0004 DFLD  POS=(5,14),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'DC:',                                                  +        
               POS=(5,41),LTH=3,                                       +        
               ATTR=(PROT)                                                      
LAGER    DFLD  POS=(5,45),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'RT DC Dep date Rec date Bin date Order',               +        
               POS=(6,2),LTH=38,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Invoice  Adv.  Binned    Area',                        +        
               POS=(6,46),LTH=29,                                      +        
               ATTR=(PROT)                                                      
IDPTYP1  DFLD  POS=(7,1),LTH=3,                                        +        
               ATTR=(PROT)                                                      
DC1      DFLD  POS=(7,5),LTH=2,                                        +        
               ATTR=(PROT)                                                      
AVSDAT1  DFLD  POS=(7,9),LTH=6,                                        +        
               ATTR=(PROT)                                                      
ANKDAT1  DFLD  POS=(7,18),LTH=6,                                       +        
               ATTR=(PROT)                                                      
INLDAT1  DFLD  POS=(7,27),LTH=6,                                       +        
               ATTR=(PROT)                                                      
ORDER1   DFLD  POS=(7,35),LTH=10,                                      +        
               ATTR=(PROT)                                                      
FAKT1    DFLD  POS=(7,46),LTH=7,                                       +        
               ATTR=(PROT)                                                      
AVIS1    DFLD  POS=(7,54),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
INLAG1   DFLD  POS=(7,61),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
ADLAG1   DFLD  POS=(7,69),LTH=2,                                       +        
               ATTR=(PROT)                                                      
ADGANG1  DFLD  POS=(7,72),LTH=2,                                       +        
               ATTR=(PROT)                                                      
ADPLATS1 DFLD  POS=(7,75),LTH=5,                                       +        
               ATTR=(PROT)                                                      
IDPTYP2  DFLD  POS=(8,1),LTH=3,                                        +        
               ATTR=(PROT)                                                      
DC2      DFLD  POS=(8,5),LTH=2,                                        +        
               ATTR=(PROT)                                                      
AVSDAT2  DFLD  POS=(8,9),LTH=6,                                        +        
               ATTR=(PROT)                                                      
ANKDAT2  DFLD  POS=(8,18),LTH=6,                                       +        
               ATTR=(PROT)                                                      
INLDAT2  DFLD  POS=(8,27),LTH=6,                                       +        
               ATTR=(PROT)                                                      
ORDER2   DFLD  POS=(8,35),LTH=10,                                      +        
               ATTR=(PROT)                                                      
FAKT2    DFLD  POS=(8,46),LTH=7,                                       +        
               ATTR=(PROT)                                                      
AVIS2    DFLD  POS=(8,54),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
INLAG2   DFLD  POS=(8,61),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
ADLAG2   DFLD  POS=(8,69),LTH=2,                                       +        
               ATTR=(PROT)                                                      
ADGANG2  DFLD  POS=(8,72),LTH=2,                                       +        
               ATTR=(PROT)                                                      
ADPLATS2 DFLD  POS=(8,75),LTH=5,                                       +        
               ATTR=(PROT)                                                      
IDPTYP3  DFLD  POS=(9,1),LTH=3,                                        +        
               ATTR=(PROT)                                                      
DC3      DFLD  POS=(9,5),LTH=2,                                        +        
               ATTR=(PROT)                                                      
AVSDAT3  DFLD  POS=(9,9),LTH=6,                                        +        
               ATTR=(PROT)                                                      
ANKDAT3  DFLD  POS=(9,18),LTH=6,                                       +        
               ATTR=(PROT)                                                      
INLDAT3  DFLD  POS=(9,27),LTH=6,                                       +        
               ATTR=(PROT)                                                      
ORDER3   DFLD  POS=(9,35),LTH=10,                                      +        
               ATTR=(PROT)                                                      
FAKT3    DFLD  POS=(9,46),LTH=7,                                       +        
               ATTR=(PROT)                                                      
AVIS3    DFLD  POS=(9,54),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
INLAG3   DFLD  POS=(9,61),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
ADLAG3   DFLD  POS=(9,69),LTH=2,                                       +        
               ATTR=(PROT)                                                      
ADGANG3  DFLD  POS=(9,72),LTH=2,                                       +        
               ATTR=(PROT)                                                      
ADPLATS3 DFLD  POS=(9,75),LTH=5,                                       +        
               ATTR=(PROT)                                                      
IDPTYP4  DFLD  POS=(10,1),LTH=3,                                       +        
               ATTR=(PROT)                                                      
DC4      DFLD  POS=(10,5),LTH=2,                                       +        
               ATTR=(PROT)                                                      
AVSDAT4  DFLD  POS=(10,9),LTH=6,                                       +        
               ATTR=(PROT)                                                      
ANKDAT4  DFLD  POS=(10,18),LTH=6,                                      +        
               ATTR=(PROT)                                                      
INLDAT4  DFLD  POS=(10,27),LTH=6,                                      +        
               ATTR=(PROT)                                                      
ORDER4   DFLD  POS=(10,35),LTH=10,                                     +        
               ATTR=(PROT)                                                      
FAKT4    DFLD  POS=(10,46),LTH=7,                                      +        
               ATTR=(PROT)                                                      
AVIS4    DFLD  POS=(10,54),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
INLAG4   DFLD  POS=(10,61),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
ADLAG4   DFLD  POS=(10,69),LTH=2,                                      +        
               ATTR=(PROT)                                                      
ADGANG4  DFLD  POS=(10,72),LTH=2,                                      +        
               ATTR=(PROT)                                                      
ADPLATS4 DFLD  POS=(10,75),LTH=5,                                      +        
               ATTR=(PROT)                                                      
IDPTYP5  DFLD  POS=(11,1),LTH=3,                                       +        
               ATTR=(PROT)                                                      
DC5      DFLD  POS=(11,5),LTH=2,                                       +        
               ATTR=(PROT)                                                      
AVSDAT5  DFLD  POS=(11,9),LTH=6,                                       +        
               ATTR=(PROT)                                                      
ANKDAT5  DFLD  POS=(11,18),LTH=6,                                      +        
               ATTR=(PROT)                                                      
INLDAT5  DFLD  POS=(11,27),LTH=6,                                      +        
               ATTR=(PROT)                                                      
ORDER5   DFLD  POS=(11,35),LTH=10,                                     +        
               ATTR=(PROT)                                                      
FAKT5    DFLD  POS=(11,46),LTH=7,                                      +        
               ATTR=(PROT)                                                      
AVIS5    DFLD  POS=(11,54),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
INLAG5   DFLD  POS=(11,61),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
ADLAG5   DFLD  POS=(11,69),LTH=2,                                      +        
               ATTR=(PROT)                                                      
ADGANG5  DFLD  POS=(11,72),LTH=2,                                      +        
               ATTR=(PROT)                                                      
ADPLATS5 DFLD  POS=(11,75),LTH=5,                                      +        
               ATTR=(PROT)                                                      
IDPTYP6  DFLD  POS=(12,1),LTH=3,                                       +        
               ATTR=(PROT)                                                      
DC6      DFLD  POS=(12,5),LTH=2,                                       +        
               ATTR=(PROT)                                                      
AVSDAT6  DFLD  POS=(12,9),LTH=6,                                       +        
               ATTR=(PROT)                                                      
ANKDAT6  DFLD  POS=(12,18),LTH=6,                                      +        
               ATTR=(PROT)                                                      
INLDAT6  DFLD  POS=(12,27),LTH=6,                                      +        
               ATTR=(PROT)                                                      
ORDER6   DFLD  POS=(12,35),LTH=10,                                     +        
               ATTR=(PROT)                                                      
FAKT6    DFLD  POS=(12,46),LTH=7,                                      +        
               ATTR=(PROT)                                                      
AVIS6    DFLD  POS=(12,54),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
INLAG6   DFLD  POS=(12,61),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
ADLAG6   DFLD  POS=(12,69),LTH=2,                                      +        
               ATTR=(PROT)                                                      
ADGANG6  DFLD  POS=(12,72),LTH=2,                                      +        
               ATTR=(PROT)                                                      
ADPLATS6 DFLD  POS=(12,75),LTH=5,                                      +        
               ATTR=(PROT)                                                      
IDPTYP7  DFLD  POS=(13,1),LTH=3,                                       +        
               ATTR=(PROT)                                                      
DC7      DFLD  POS=(13,5),LTH=2,                                       +        
               ATTR=(PROT)                                                      
AVSDAT7  DFLD  POS=(13,9),LTH=6,                                       +        
               ATTR=(PROT)                                                      
ANKDAT7  DFLD  POS=(13,18),LTH=6,                                      +        
               ATTR=(PROT)                                                      
INLDAT7  DFLD  POS=(13,27),LTH=6,                                      +        
               ATTR=(PROT)                                                      
ORDER7   DFLD  POS=(13,35),LTH=10,                                     +        
               ATTR=(PROT)                                                      
FAKT7    DFLD  POS=(13,46),LTH=7,                                      +        
               ATTR=(PROT)                                                      
AVIS7    DFLD  POS=(13,54),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
INLAG7   DFLD  POS=(13,61),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
ADLAG7   DFLD  POS=(13,69),LTH=2,                                      +        
               ATTR=(PROT)                                                      
ADGANG7  DFLD  POS=(13,72),LTH=2,                                      +        
               ATTR=(PROT)                                                      
ADPLATS7 DFLD  POS=(13,75),LTH=5,                                      +        
               ATTR=(PROT)                                                      
IDPTYP8  DFLD  POS=(14,1),LTH=3,                                       +        
               ATTR=(PROT)                                                      
DC8      DFLD  POS=(14,5),LTH=2,                                       +        
               ATTR=(PROT)                                                      
AVSDAT8  DFLD  POS=(14,9),LTH=6,                                       +        
               ATTR=(PROT)                                                      
ANKDAT8  DFLD  POS=(14,18),LTH=6,                                      +        
               ATTR=(PROT)                                                      
INLDAT8  DFLD  POS=(14,27),LTH=6,                                      +        
               ATTR=(PROT)                                                      
ORDER8   DFLD  POS=(14,35),LTH=10,                                     +        
               ATTR=(PROT)                                                      
FAKT8    DFLD  POS=(14,46),LTH=7,                                      +        
               ATTR=(PROT)                                                      
AVIS8    DFLD  POS=(14,54),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
INLAG8   DFLD  POS=(14,61),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
ADLAG8   DFLD  POS=(14,69),LTH=2,                                      +        
               ATTR=(PROT)                                                      
ADGANG8  DFLD  POS=(14,72),LTH=2,                                      +        
               ATTR=(PROT)                                                      
ADPLATS8 DFLD  POS=(14,75),LTH=5,                                      +        
               ATTR=(PROT)                                                      
IDPTYP9  DFLD  POS=(15,1),LTH=3,                                       +        
               ATTR=(PROT)                                                      
DC9      DFLD  POS=(15,5),LTH=2,                                       +        
               ATTR=(PROT)                                                      
AVSDAT9  DFLD  POS=(15,9),LTH=6,                                       +        
               ATTR=(PROT)                                                      
ANKDAT9  DFLD  POS=(15,18),LTH=6,                                      +        
               ATTR=(PROT)                                                      
INLDAT9  DFLD  POS=(15,27),LTH=6,                                      +        
               ATTR=(PROT)                                                      
ORDER9   DFLD  POS=(15,35),LTH=10,                                     +        
               ATTR=(PROT)                                                      
FAKT9    DFLD  POS=(15,46),LTH=7,                                      +        
               ATTR=(PROT)                                                      
AVIS9    DFLD  POS=(15,54),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
INLAG9   DFLD  POS=(15,61),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
ADLAG9   DFLD  POS=(15,69),LTH=2,                                      +        
               ATTR=(PROT)                                                      
ADGANG9  DFLD  POS=(15,72),LTH=2,                                      +        
               ATTR=(PROT)                                                      
ADPLATS9 DFLD  POS=(15,75),LTH=5,                                      +        
               ATTR=(PROT)                                                      
IDPTYP10 DFLD  POS=(16,1),LTH=3,                                       +        
               ATTR=(PROT)                                                      
DC10     DFLD  POS=(16,5),LTH=2,                                       +        
               ATTR=(PROT)                                                      
AVSDAT10 DFLD  POS=(16,9),LTH=6,                                       +        
               ATTR=(PROT)                                                      
ANKDAT10 DFLD  POS=(16,18),LTH=6,                                      +        
               ATTR=(PROT)                                                      
INLDAT10 DFLD  POS=(16,27),LTH=6,                                      +        
               ATTR=(PROT)                                                      
ORDER10  DFLD  POS=(16,35),LTH=10,                                     +        
               ATTR=(PROT)                                                      
FAKT10   DFLD  POS=(16,46),LTH=7,                                      +        
               ATTR=(PROT)                                                      
AVIS10   DFLD  POS=(16,54),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
INLAG10  DFLD  POS=(16,61),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
ADLAG10  DFLD  POS=(16,69),LTH=2,                                      +        
               ATTR=(PROT)                                                      
ADGANG10 DFLD  POS=(16,72),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0000 DFLD  POS=(16,75),LTH=5,                                      +        
               ATTR=(PROT)                                                      
IDPTYP11 DFLD  POS=(17,1),LTH=3,                                       +        
               ATTR=(PROT)                                                      
DC11     DFLD  POS=(17,5),LTH=2,                                       +        
               ATTR=(PROT)                                                      
AVSDAT11 DFLD  POS=(17,9),LTH=6,                                       +        
               ATTR=(PROT)                                                      
ANKDAT11 DFLD  POS=(17,18),LTH=6,                                      +        
               ATTR=(PROT)                                                      
INLDAT11 DFLD  POS=(17,27),LTH=6,                                      +        
               ATTR=(PROT)                                                      
ORDER11  DFLD  POS=(17,35),LTH=10,                                     +        
               ATTR=(PROT)                                                      
FAKT11   DFLD  POS=(17,46),LTH=7,                                      +        
               ATTR=(PROT)                                                      
AVIS11   DFLD  POS=(17,54),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
INLAG11  DFLD  POS=(17,61),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
ADLAG11  DFLD  POS=(17,69),LTH=2,                                      +        
               ATTR=(PROT)                                                      
ADGANG11 DFLD  POS=(17,72),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0001 DFLD  POS=(17,75),LTH=5,                                      +        
               ATTR=(PROT)                                                      
IDPTYP12 DFLD  POS=(18,1),LTH=3,                                       +        
               ATTR=(PROT)                                                      
DC12     DFLD  POS=(18,5),LTH=2,                                       +        
               ATTR=(PROT)                                                      
AVSDAT12 DFLD  POS=(18,9),LTH=6,                                       +        
               ATTR=(PROT)                                                      
ANKDAT12 DFLD  POS=(18,18),LTH=6,                                      +        
               ATTR=(PROT)                                                      
INLDAT12 DFLD  POS=(18,27),LTH=6,                                      +        
               ATTR=(PROT)                                                      
ORDER12  DFLD  POS=(18,35),LTH=10,                                     +        
               ATTR=(PROT)                                                      
FAKT12   DFLD  POS=(18,46),LTH=7,                                      +        
               ATTR=(PROT)                                                      
AVIS12   DFLD  POS=(18,54),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
INLAG12  DFLD  POS=(18,61),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
ADLAG12  DFLD  POS=(18,69),LTH=2,                                      +        
               ATTR=(PROT)                                                      
ADGANG12 DFLD  POS=(18,72),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0002 DFLD  POS=(18,75),LTH=5,                                      +        
               ATTR=(PROT)                                                      
IDPTYP13 DFLD  POS=(19,1),LTH=3,                                       +        
               ATTR=(PROT)                                                      
DC13     DFLD  POS=(19,5),LTH=2,                                       +        
               ATTR=(PROT)                                                      
AVSDAT13 DFLD  POS=(19,9),LTH=6,                                       +        
               ATTR=(PROT)                                                      
ANKDAT13 DFLD  POS=(19,18),LTH=6,                                      +        
               ATTR=(PROT)                                                      
INLDAT13 DFLD  POS=(19,27),LTH=6,                                      +        
               ATTR=(PROT)                                                      
ORDER13  DFLD  POS=(19,35),LTH=10,                                     +        
               ATTR=(PROT)                                                      
FAKT13   DFLD  POS=(19,46),LTH=7,                                      +        
               ATTR=(PROT)                                                      
AVIS13   DFLD  POS=(19,54),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
INLAG13  DFLD  POS=(19,61),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
ADLAG13  DFLD  POS=(19,69),LTH=2,                                      +        
               ATTR=(PROT)                                                      
ADGANG13 DFLD  POS=(19,72),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0003 DFLD  POS=(19,75),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '13 Utskr Invund 14 Inv.kön',                           +        
               POS=(21,2),LTH=26,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15 Inv.Översikt 16 Beg. om Inv 17 Mängdkort',          +        
               POS=(21,34),LTH=43,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '09',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W5O30701 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W5F307,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W5I30701,                                           +        
               FILL=PT                                                          
W5O30701 LPAGE SOR=W5F307,                                             +        
               NXT=W5I30701                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DGIA0005,                                               +        
               LTH=9                                                            
         MFLD  DGIA0006,                                               +        
               LTH=9                                                            
         MFLD  DGIA0008,                                               +        
               LTH=2                                                            
         MFLD  DGIA0010,                                               +        
               LTH=2                                                            
         MFLD  DGIA0007,                                               +        
               LTH=2                                                            
         MFLD  DGIA0009,                                               +        
               LTH=2                                                            
         MFLD  DGIA0011,                                               +        
               LTH=15                                                           
         MFLD  DGIA0012,                                               +        
               LTH=15                                                           
         MFLD  DGIA0004,                                               +        
               LTH=25                                                           
         MFLD  LAGER,                                                  +        
               LTH=8                                                            
         MFLD  IDPTYP1,                                                +        
               LTH=3                                                            
         MFLD  DC1,                                                    +        
               LTH=2                                                            
         MFLD  AVSDAT1,                                                +        
               LTH=6                                                            
         MFLD  ANKDAT1,                                                +        
               LTH=6                                                            
         MFLD  INLDAT1,                                                +        
               LTH=6                                                            
         MFLD  ORDER1,                                                 +        
               LTH=10                                                           
         MFLD  FAKT1,                                                  +        
               LTH=7                                                            
         MFLD  AVIS1,                                                  +        
               LTH=6                                                            
         MFLD  INLAG1,                                                 +        
               LTH=7                                                            
         MFLD  ADLAG1,                                                 +        
               LTH=2                                                            
         MFLD  ADGANG1,                                                +        
               LTH=2                                                            
         MFLD  ADPLATS1,                                               +        
               LTH=5                                                            
         MFLD  IDPTYP2,                                                +        
               LTH=3                                                            
         MFLD  DC2,                                                    +        
               LTH=2                                                            
         MFLD  AVSDAT2,                                                +        
               LTH=6                                                            
         MFLD  ANKDAT2,                                                +        
               LTH=6                                                            
         MFLD  INLDAT2,                                                +        
               LTH=6                                                            
         MFLD  ORDER2,                                                 +        
               LTH=10                                                           
         MFLD  FAKT2,                                                  +        
               LTH=7                                                            
         MFLD  AVIS2,                                                  +        
               LTH=6                                                            
         MFLD  INLAG2,                                                 +        
               LTH=7                                                            
         MFLD  ADLAG2,                                                 +        
               LTH=2                                                            
         MFLD  ADGANG2,                                                +        
               LTH=2                                                            
         MFLD  ADPLATS2,                                               +        
               LTH=5                                                            
         MFLD  IDPTYP3,                                                +        
               LTH=3                                                            
         MFLD  DC3,                                                    +        
               LTH=2                                                            
         MFLD  AVSDAT3,                                                +        
               LTH=6                                                            
         MFLD  ANKDAT3,                                                +        
               LTH=6                                                            
         MFLD  INLDAT3,                                                +        
               LTH=6                                                            
         MFLD  ORDER3,                                                 +        
               LTH=10                                                           
         MFLD  FAKT3,                                                  +        
               LTH=7                                                            
         MFLD  AVIS3,                                                  +        
               LTH=6                                                            
         MFLD  INLAG3,                                                 +        
               LTH=7                                                            
         MFLD  ADLAG3,                                                 +        
               LTH=2                                                            
         MFLD  ADGANG3,                                                +        
               LTH=2                                                            
         MFLD  ADPLATS3,                                               +        
               LTH=5                                                            
         MFLD  IDPTYP4,                                                +        
               LTH=3                                                            
         MFLD  DC4,                                                    +        
               LTH=2                                                            
         MFLD  AVSDAT4,                                                +        
               LTH=6                                                            
         MFLD  ANKDAT4,                                                +        
               LTH=6                                                            
         MFLD  INLDAT4,                                                +        
               LTH=6                                                            
         MFLD  ORDER4,                                                 +        
               LTH=10                                                           
         MFLD  FAKT4,                                                  +        
               LTH=7                                                            
         MFLD  AVIS4,                                                  +        
               LTH=6                                                            
         MFLD  INLAG4,                                                 +        
               LTH=7                                                            
         MFLD  ADLAG4,                                                 +        
               LTH=2                                                            
         MFLD  ADGANG4,                                                +        
               LTH=2                                                            
         MFLD  ADPLATS4,                                               +        
               LTH=5                                                            
         MFLD  IDPTYP5,                                                +        
               LTH=3                                                            
         MFLD  DC5,                                                    +        
               LTH=2                                                            
         MFLD  AVSDAT5,                                                +        
               LTH=6                                                            
         MFLD  ANKDAT5,                                                +        
               LTH=6                                                            
         MFLD  INLDAT5,                                                +        
               LTH=6                                                            
         MFLD  ORDER5,                                                 +        
               LTH=10                                                           
         MFLD  FAKT5,                                                  +        
               LTH=7                                                            
         MFLD  AVIS5,                                                  +        
               LTH=6                                                            
         MFLD  INLAG5,                                                 +        
               LTH=7                                                            
         MFLD  ADLAG5,                                                 +        
               LTH=2                                                            
         MFLD  ADGANG5,                                                +        
               LTH=2                                                            
         MFLD  ADPLATS5,                                               +        
               LTH=5                                                            
         MFLD  IDPTYP6,                                                +        
               LTH=3                                                            
         MFLD  DC6,                                                    +        
               LTH=2                                                            
         MFLD  AVSDAT6,                                                +        
               LTH=6                                                            
         MFLD  ANKDAT6,                                                +        
               LTH=6                                                            
         MFLD  INLDAT6,                                                +        
               LTH=6                                                            
         MFLD  ORDER6,                                                 +        
               LTH=10                                                           
         MFLD  FAKT6,                                                  +        
               LTH=7                                                            
         MFLD  AVIS6,                                                  +        
               LTH=6                                                            
         MFLD  INLAG6,                                                 +        
               LTH=7                                                            
         MFLD  ADLAG6,                                                 +        
               LTH=2                                                            
         MFLD  ADGANG6,                                                +        
               LTH=2                                                            
         MFLD  ADPLATS6,                                               +        
               LTH=5                                                            
         MFLD  IDPTYP7,                                                +        
               LTH=3                                                            
         MFLD  DC7,                                                    +        
               LTH=2                                                            
         MFLD  AVSDAT7,                                                +        
               LTH=6                                                            
         MFLD  ANKDAT7,                                                +        
               LTH=6                                                            
         MFLD  INLDAT7,                                                +        
               LTH=6                                                            
         MFLD  ORDER7,                                                 +        
               LTH=10                                                           
         MFLD  FAKT7,                                                  +        
               LTH=7                                                            
         MFLD  AVIS7,                                                  +        
               LTH=6                                                            
         MFLD  INLAG7,                                                 +        
               LTH=7                                                            
         MFLD  ADLAG7,                                                 +        
               LTH=2                                                            
         MFLD  ADGANG7,                                                +        
               LTH=2                                                            
         MFLD  ADPLATS7,                                               +        
               LTH=5                                                            
         MFLD  IDPTYP8,                                                +        
               LTH=3                                                            
         MFLD  DC8,                                                    +        
               LTH=2                                                            
         MFLD  AVSDAT8,                                                +        
               LTH=6                                                            
         MFLD  ANKDAT8,                                                +        
               LTH=6                                                            
         MFLD  INLDAT8,                                                +        
               LTH=6                                                            
         MFLD  ORDER8,                                                 +        
               LTH=10                                                           
         MFLD  FAKT8,                                                  +        
               LTH=7                                                            
         MFLD  AVIS8,                                                  +        
               LTH=6                                                            
         MFLD  INLAG8,                                                 +        
               LTH=7                                                            
         MFLD  ADLAG8,                                                 +        
               LTH=2                                                            
         MFLD  ADGANG8,                                                +        
               LTH=2                                                            
         MFLD  ADPLATS8,                                               +        
               LTH=5                                                            
         MFLD  IDPTYP9,                                                +        
               LTH=3                                                            
         MFLD  DC9,                                                    +        
               LTH=2                                                            
         MFLD  AVSDAT9,                                                +        
               LTH=6                                                            
         MFLD  ANKDAT9,                                                +        
               LTH=6                                                            
         MFLD  INLDAT9,                                                +        
               LTH=6                                                            
         MFLD  ORDER9,                                                 +        
               LTH=10                                                           
         MFLD  FAKT9,                                                  +        
               LTH=7                                                            
         MFLD  AVIS9,                                                  +        
               LTH=6                                                            
         MFLD  INLAG9,                                                 +        
               LTH=7                                                            
         MFLD  ADLAG9,                                                 +        
               LTH=2                                                            
         MFLD  ADGANG9,                                                +        
               LTH=2                                                            
         MFLD  ADPLATS9,                                               +        
               LTH=5                                                            
         MFLD  IDPTYP10,                                               +        
               LTH=3                                                            
         MFLD  DC10,                                                   +        
               LTH=2                                                            
         MFLD  AVSDAT10,                                               +        
               LTH=6                                                            
         MFLD  ANKDAT10,                                               +        
               LTH=6                                                            
         MFLD  INLDAT10,                                               +        
               LTH=6                                                            
         MFLD  ORDER10,                                                +        
               LTH=10                                                           
         MFLD  FAKT10,                                                 +        
               LTH=7                                                            
         MFLD  AVIS10,                                                 +        
               LTH=6                                                            
         MFLD  INLAG10,                                                +        
               LTH=7                                                            
         MFLD  ADLAG10,                                                +        
               LTH=2                                                            
         MFLD  ADGANG10,                                               +        
               LTH=2                                                            
         MFLD  DGIA0000,                                               +        
               LTH=5                                                            
         MFLD  IDPTYP11,                                               +        
               LTH=3                                                            
         MFLD  DC11,                                                   +        
               LTH=2                                                            
         MFLD  AVSDAT11,                                               +        
               LTH=6                                                            
         MFLD  ANKDAT11,                                               +        
               LTH=6                                                            
         MFLD  INLDAT11,                                               +        
               LTH=6                                                            
         MFLD  ORDER11,                                                +        
               LTH=10                                                           
         MFLD  FAKT11,                                                 +        
               LTH=7                                                            
         MFLD  AVIS11,                                                 +        
               LTH=6                                                            
         MFLD  INLAG11,                                                +        
               LTH=7                                                            
         MFLD  ADLAG11,                                                +        
               LTH=2                                                            
         MFLD  ADGANG11,                                               +        
               LTH=2                                                            
         MFLD  DGIA0001,                                               +        
               LTH=5                                                            
         MFLD  IDPTYP12,                                               +        
               LTH=3                                                            
         MFLD  DC12,                                                   +        
               LTH=2                                                            
         MFLD  AVSDAT12,                                               +        
               LTH=6                                                            
         MFLD  ANKDAT12,                                               +        
               LTH=6                                                            
         MFLD  INLDAT12,                                               +        
               LTH=6                                                            
         MFLD  ORDER12,                                                +        
               LTH=10                                                           
         MFLD  FAKT12,                                                 +        
               LTH=7                                                            
         MFLD  AVIS12,                                                 +        
               LTH=6                                                            
         MFLD  INLAG12,                                                +        
               LTH=7                                                            
         MFLD  ADLAG12,                                                +        
               LTH=2                                                            
         MFLD  ADGANG12,                                               +        
               LTH=2                                                            
         MFLD  DGIA0002,                                               +        
               LTH=5                                                            
         MFLD  IDPTYP13,                                               +        
               LTH=3                                                            
         MFLD  DC13,                                                   +        
               LTH=2                                                            
         MFLD  AVSDAT13,                                               +        
               LTH=6                                                            
         MFLD  ANKDAT13,                                               +        
               LTH=6                                                            
         MFLD  INLDAT13,                                               +        
               LTH=6                                                            
         MFLD  ORDER13,                                                +        
               LTH=10                                                           
         MFLD  FAKT13,                                                 +        
               LTH=7                                                            
         MFLD  AVIS13,                                                 +        
               LTH=6                                                            
         MFLD  INLAG13,                                                +        
               LTH=7                                                            
         MFLD  ADLAG13,                                                +        
               LTH=2                                                            
         MFLD  ADGANG13,                                               +        
               LTH=2                                                            
         MFLD  DGIA0003,                                               +        
               LTH=5                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W5I30701 MSG   TYPE=INPUT,                                             +        
               SOR=(W5F307),                                           +        
               OPT=2,                                                  +        
               NXT=W5O30701                                                     
W5I30701 LPAGE SOR=(W5F307),                                           +        
               NXT=W5O30701                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '53071',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0005,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0006,                                               +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0008,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0010,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0007,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0009,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0011,                                               +        
               LTH=15,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0012,                                               +        
               LTH=15,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
