***********************************************************************         
* CREATED BY V065708   ON 02/10/09  AT 12:40                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W5N115   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='w0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W01501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W5T115 7',                                           +        
               8='W5T115 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W5T115U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W5T111  ',                                          +        
               14='W5T112  ',                                          +        
               15='W5T113  ',                                          +        
               16='W5T114  ',                                          +        
               17='W5T115  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,8)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'SPIS QUERY/APPROVE PRICE SUG',                         +        
               POS=(1,12),LTH=28,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Supno',                                                +        
               POS=(2,2),LTH=5,                                        +        
               ATTR=(NUM,PROT)                                                  
DGIA0023 DFLD  POS=(2,8),LTH=5,                                        +        
               ATTR=(NOPROT)                                                    
         DFLD  'Partno',                                               +        
               POS=(2,14),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0016 DFLD  POS=(2,24),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Treatcd',                                              +        
               POS=(2,35),LTH=7,                                       +        
               ATTR=(PROT)                                                      
DGIA0027 DFLD  POS=(2,43),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Percent',                                              +        
               POS=(2,46),LTH=7,                                       +        
               ATTR=(PROT)                                                      
DGIA0043 DFLD  POS=(2,54),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0025 DFLD  POS=(3,8),LTH=5,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0018 DFLD  POS=(3,24),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0029 DFLD  POS=(3,43),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0045 DFLD  POS=(3,54),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0022 DFLD  POS=(4,1),LTH=5,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0024 DFLD  POS=(4,7),LTH=5,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0015 DFLD  POS=(4,13),LTH=9,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0017 DFLD  POS=(4,23),LTH=9,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0026 DFLD  POS=(4,33),LTH=1,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0028 DFLD  POS=(4,35),LTH=1,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0042 DFLD  POS=(4,37),LTH=6,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0044 DFLD  POS=(4,44),LTH=6,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Loadingdate',                                          +        
               POS=(5,57),LTH=11,                                      +        
               ATTR=(PROT)                                                      
DATUM    DFLD  POS=(5,72),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'S  Partno Suggestprice From  Sel Concerning   SPIS-',  +        
               POS=(6,2),LTH=51,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'SPIS-',                                                +        
               POS=(6,60),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Alter   Tre',                                          +        
               POS=(6,70),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Supplier',                                             +        
               POS=(7,17),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'ISO  Pur.price  Pur.price    std.price procent cod',   +        
               POS=(7,31),LTH=50,                                      +        
               ATTR=(PROT)                                                      
VAL1     DFLD  POS=(8,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDARTNR1 DFLD  POS=(8,5),LTH=9,                                        +        
               ATTR=(PROT,MOD)                                                  
BASPRIS1 DFLD  POS=(8,15),LTH=14,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0030 DFLD  POS=(8,31),LTH=3,                                       +        
               ATTR=(PROT)                                                      
PRINK1   DFLD  POS=(8,35),LTH=10,                                      +        
               ATTR=(NUM,PROT)                                                  
SPRINK1  DFLD  POS=(8,47),LTH=10,                                      +        
               ATTR=(PROT)                                                      
DGIA0046 DFLD  POS=(8,59),LTH=10,                                      +        
               ATTR=(PROT)                                                      
DGIA0000 DFLD  POS=(8,70),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
BEHKOD1  DFLD  POS=(8,79),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
VAL2     DFLD  POS=(9,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDARTNR2 DFLD  POS=(9,5),LTH=9,                                        +        
               ATTR=(PROT,MOD)                                                  
BASPRIS2 DFLD  POS=(9,15),LTH=14,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0034 DFLD  POS=(9,31),LTH=3,                                       +        
               ATTR=(PROT)                                                      
PRINK2   DFLD  POS=(9,35),LTH=10,                                      +        
               ATTR=(NUM,PROT)                                                  
SPRINK2  DFLD  POS=(9,47),LTH=10,                                      +        
               ATTR=(PROT)                                                      
DGIA0050 DFLD  POS=(9,59),LTH=10,                                      +        
               ATTR=(PROT)                                                      
DGIA0004 DFLD  POS=(9,70),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
BEHKOD2  DFLD  POS=(9,79),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
VAL3     DFLD  POS=(10,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDARTNR3 DFLD  POS=(10,5),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
BASPRIS3 DFLD  POS=(10,15),LTH=14,                                     +        
               ATTR=(NUM,PROT)                                                  
DGIA0035 DFLD  POS=(10,31),LTH=3,                                      +        
               ATTR=(PROT)                                                      
PRINK3   DFLD  POS=(10,35),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
SPRINK3  DFLD  POS=(10,47),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DGIA0051 DFLD  POS=(10,59),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DGIA0005 DFLD  POS=(10,70),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
BEHKOD3  DFLD  POS=(10,79),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
VAL4     DFLD  POS=(11,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDARTNR4 DFLD  POS=(11,5),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
BASPRIS4 DFLD  POS=(11,15),LTH=14,                                     +        
               ATTR=(NUM,PROT)                                                  
DGIA0036 DFLD  POS=(11,31),LTH=3,                                      +        
               ATTR=(PROT)                                                      
PRINK4   DFLD  POS=(11,35),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
SPRINK4  DFLD  POS=(11,47),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DGIA0052 DFLD  POS=(11,59),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DGIA0006 DFLD  POS=(11,70),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
BEHKOD4  DFLD  POS=(11,79),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
VAL5     DFLD  POS=(12,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDARTNR5 DFLD  POS=(12,5),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
BASPRIS5 DFLD  POS=(12,15),LTH=14,                                     +        
               ATTR=(NUM,PROT)                                                  
DGIA0037 DFLD  POS=(12,31),LTH=3,                                      +        
               ATTR=(PROT)                                                      
PRINK5   DFLD  POS=(12,35),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
SPRINK5  DFLD  POS=(12,47),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DGIA0053 DFLD  POS=(12,59),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DGIA0007 DFLD  POS=(12,70),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
BEHKOD5  DFLD  POS=(12,79),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
VAL6     DFLD  POS=(13,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDARTNR6 DFLD  POS=(13,5),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
BASPRIS6 DFLD  POS=(13,15),LTH=14,                                     +        
               ATTR=(NUM,PROT)                                                  
DGIA0038 DFLD  POS=(13,31),LTH=3,                                      +        
               ATTR=(PROT)                                                      
PRINK6   DFLD  POS=(13,35),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
SPRINK6  DFLD  POS=(13,47),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DGIA0054 DFLD  POS=(13,59),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DGIA0008 DFLD  POS=(13,70),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
BEHKOD6  DFLD  POS=(13,79),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
VAL7     DFLD  POS=(14,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDARTNR7 DFLD  POS=(14,5),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
BASPRIS7 DFLD  POS=(14,15),LTH=14,                                     +        
               ATTR=(NUM,PROT)                                                  
DGIA0039 DFLD  POS=(14,31),LTH=3,                                      +        
               ATTR=(PROT)                                                      
PRINK7   DFLD  POS=(14,35),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
SPRINK7  DFLD  POS=(14,47),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DGIA0055 DFLD  POS=(14,59),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DGIA0009 DFLD  POS=(14,70),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
BEHKOD7  DFLD  POS=(14,79),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
VAL8     DFLD  POS=(15,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDARTNR8 DFLD  POS=(15,5),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
BASPRIS8 DFLD  POS=(15,15),LTH=14,                                     +        
               ATTR=(NUM,PROT)                                                  
DGIA0040 DFLD  POS=(15,31),LTH=3,                                      +        
               ATTR=(PROT)                                                      
PRINK8   DFLD  POS=(15,35),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
SPRINK8  DFLD  POS=(15,47),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DGIA0056 DFLD  POS=(15,59),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DGIA0010 DFLD  POS=(15,70),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
BEHKOD8  DFLD  POS=(15,79),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
VAL9     DFLD  POS=(16,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDARTNR9 DFLD  POS=(16,5),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
BASPRIS9 DFLD  POS=(16,15),LTH=14,                                     +        
               ATTR=(NUM,PROT)                                                  
DGIA0041 DFLD  POS=(16,31),LTH=3,                                      +        
               ATTR=(PROT)                                                      
PRINK9   DFLD  POS=(16,35),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
SPRINK9  DFLD  POS=(16,47),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DGIA0057 DFLD  POS=(16,59),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DGIA0011 DFLD  POS=(16,70),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
BEHKOD9  DFLD  POS=(16,79),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
VAL10    DFLD  POS=(17,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0019 DFLD  POS=(17,5),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0012 DFLD  POS=(17,15),LTH=14,                                     +        
               ATTR=(NUM,PROT)                                                  
DGIA0031 DFLD  POS=(17,31),LTH=3,                                      +        
               ATTR=(PROT)                                                      
PRINK10  DFLD  POS=(17,35),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
SPRIN10  DFLD  POS=(17,47),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DGIA0047 DFLD  POS=(17,59),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DGIA0001 DFLD  POS=(17,70),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
BEHKOD10 DFLD  POS=(17,79),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
VAL11    DFLD  POS=(18,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0020 DFLD  POS=(18,5),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0013 DFLD  POS=(18,15),LTH=14,                                     +        
               ATTR=(NUM,PROT)                                                  
DGIA0032 DFLD  POS=(18,31),LTH=3,                                      +        
               ATTR=(PROT)                                                      
PRINK11  DFLD  POS=(18,35),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
SPRINK11 DFLD  POS=(18,47),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DGIA0048 DFLD  POS=(18,59),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DGIA0002 DFLD  POS=(18,70),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
BEHKOD11 DFLD  POS=(18,79),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
VAL12    DFLD  POS=(19,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0021 DFLD  POS=(19,5),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0014 DFLD  POS=(19,15),LTH=14,                                     +        
               ATTR=(NUM,PROT)                                                  
DGIA0033 DFLD  POS=(19,31),LTH=3,                                      +        
               ATTR=(PROT)                                                      
PRINK12  DFLD  POS=(19,35),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
SPRINK12 DFLD  POS=(19,47),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DGIA0049 DFLD  POS=(19,59),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DGIA0003 DFLD  POS=(19,70),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
BEHKOD12 DFLD  POS=(19,79),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  '13 Update price 14 Remove price 15 Ord pr inf y 16 Part+        
                suggest 17 Appr price s',                              +        
               POS=(21,2),LTH=79,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '09',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 Whelp',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W5O115N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W5N115,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W5I115N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT,                                             +        
               NXT=W5I115N1                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DGIA0016,                                               +        
               LTH=9                                                            
         MFLD  DGIA0018,                                               +        
               LTH=9                                                            
         MFLD  DGIA0023,                                               +        
               LTH=5                                                            
         MFLD  DGIA0025,                                               +        
               LTH=5                                                            
         MFLD  DGIA0027,                                               +        
               LTH=1                                                            
         MFLD  DGIA0029,                                               +        
               LTH=1                                                            
         MFLD  DGIA0043,                                               +        
               LTH=6                                                            
         MFLD  DGIA0045,                                               +        
               LTH=6                                                            
         MFLD  DGIA0022,                                               +        
               LTH=5                                                            
         MFLD  DGIA0024,                                               +        
               LTH=5                                                            
         MFLD  DGIA0015,                                               +        
               LTH=9                                                            
         MFLD  DGIA0017,                                               +        
               LTH=9                                                            
         MFLD  DGIA0026,                                               +        
               LTH=1                                                            
         MFLD  DGIA0028,                                               +        
               LTH=1                                                            
         MFLD  DGIA0042,                                               +        
               LTH=6                                                            
         MFLD  DGIA0044,                                               +        
               LTH=6                                                            
         MFLD  DATUM,                                                  +        
               LTH=6                                                            
         MFLD  VAL1,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTNR1,                                               +        
               LTH=9                                                            
         MFLD  BASPRIS1,                                               +        
               LTH=14                                                           
         MFLD  DGIA0030,                                               +        
               LTH=3                                                            
         MFLD  PRINK1,                                                 +        
               LTH=10                                                           
         MFLD  SPRINK1,                                                +        
               LTH=10                                                           
         MFLD  DGIA0046,                                               +        
               LTH=10                                                           
         MFLD  DGIA0000,                                               +        
               LTH=7                                                            
         MFLD  BEHKOD1,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VAL2,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTNR2,                                               +        
               LTH=9                                                            
         MFLD  BASPRIS2,                                               +        
               LTH=14                                                           
         MFLD  DGIA0034,                                               +        
               LTH=3                                                            
         MFLD  PRINK2,                                                 +        
               LTH=10                                                           
         MFLD  SPRINK2,                                                +        
               LTH=10                                                           
         MFLD  DGIA0050,                                               +        
               LTH=10                                                           
         MFLD  DGIA0004,                                               +        
               LTH=7                                                            
         MFLD  BEHKOD2,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VAL3,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTNR3,                                               +        
               LTH=9                                                            
         MFLD  BASPRIS3,                                               +        
               LTH=14                                                           
         MFLD  DGIA0035,                                               +        
               LTH=3                                                            
         MFLD  PRINK3,                                                 +        
               LTH=10                                                           
         MFLD  SPRINK3,                                                +        
               LTH=10                                                           
         MFLD  DGIA0051,                                               +        
               LTH=10                                                           
         MFLD  DGIA0005,                                               +        
               LTH=7                                                            
         MFLD  BEHKOD3,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VAL4,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTNR4,                                               +        
               LTH=9                                                            
         MFLD  BASPRIS4,                                               +        
               LTH=14                                                           
         MFLD  DGIA0036,                                               +        
               LTH=3                                                            
         MFLD  PRINK4,                                                 +        
               LTH=10                                                           
         MFLD  SPRINK4,                                                +        
               LTH=10                                                           
         MFLD  DGIA0052,                                               +        
               LTH=10                                                           
         MFLD  DGIA0006,                                               +        
               LTH=7                                                            
         MFLD  BEHKOD4,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VAL5,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTNR5,                                               +        
               LTH=9                                                            
         MFLD  BASPRIS5,                                               +        
               LTH=14                                                           
         MFLD  DGIA0037,                                               +        
               LTH=3                                                            
         MFLD  PRINK5,                                                 +        
               LTH=10                                                           
         MFLD  SPRINK5,                                                +        
               LTH=10                                                           
         MFLD  DGIA0053,                                               +        
               LTH=10                                                           
         MFLD  DGIA0007,                                               +        
               LTH=7                                                            
         MFLD  BEHKOD5,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VAL6,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTNR6,                                               +        
               LTH=9                                                            
         MFLD  BASPRIS6,                                               +        
               LTH=14                                                           
         MFLD  DGIA0038,                                               +        
               LTH=3                                                            
         MFLD  PRINK6,                                                 +        
               LTH=10                                                           
         MFLD  SPRINK6,                                                +        
               LTH=10                                                           
         MFLD  DGIA0054,                                               +        
               LTH=10                                                           
         MFLD  DGIA0008,                                               +        
               LTH=7                                                            
         MFLD  BEHKOD6,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VAL7,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTNR7,                                               +        
               LTH=9                                                            
         MFLD  BASPRIS7,                                               +        
               LTH=14                                                           
         MFLD  DGIA0039,                                               +        
               LTH=3                                                            
         MFLD  PRINK7,                                                 +        
               LTH=10                                                           
         MFLD  SPRINK7,                                                +        
               LTH=10                                                           
         MFLD  DGIA0055,                                               +        
               LTH=10                                                           
         MFLD  DGIA0009,                                               +        
               LTH=7                                                            
         MFLD  BEHKOD7,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VAL8,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTNR8,                                               +        
               LTH=9                                                            
         MFLD  BASPRIS8,                                               +        
               LTH=14                                                           
         MFLD  DGIA0040,                                               +        
               LTH=3                                                            
         MFLD  PRINK8,                                                 +        
               LTH=10                                                           
         MFLD  SPRINK8,                                                +        
               LTH=10                                                           
         MFLD  DGIA0056,                                               +        
               LTH=10                                                           
         MFLD  DGIA0010,                                               +        
               LTH=7                                                            
         MFLD  BEHKOD8,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VAL9,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTNR9,                                               +        
               LTH=9                                                            
         MFLD  BASPRIS9,                                               +        
               LTH=14                                                           
         MFLD  DGIA0041,                                               +        
               LTH=3                                                            
         MFLD  PRINK9,                                                 +        
               LTH=10                                                           
         MFLD  SPRINK9,                                                +        
               LTH=10                                                           
         MFLD  DGIA0057,                                               +        
               LTH=10                                                           
         MFLD  DGIA0011,                                               +        
               LTH=7                                                            
         MFLD  BEHKOD9,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VAL10,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0019,                                               +        
               LTH=9                                                            
         MFLD  DGIA0012,                                               +        
               LTH=14                                                           
         MFLD  DGIA0031,                                               +        
               LTH=3                                                            
         MFLD  PRINK10,                                                +        
               LTH=10                                                           
         MFLD  SPRIN10,                                                +        
               LTH=10                                                           
         MFLD  DGIA0047,                                               +        
               LTH=10                                                           
         MFLD  DGIA0001,                                               +        
               LTH=7                                                            
         MFLD  BEHKOD10,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VAL11,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0020,                                               +        
               LTH=9                                                            
         MFLD  DGIA0013,                                               +        
               LTH=14                                                           
         MFLD  DGIA0032,                                               +        
               LTH=3                                                            
         MFLD  PRINK11,                                                +        
               LTH=10                                                           
         MFLD  SPRINK11,                                               +        
               LTH=10                                                           
         MFLD  DGIA0048,                                               +        
               LTH=10                                                           
         MFLD  DGIA0002,                                               +        
               LTH=7                                                            
         MFLD  BEHKOD11,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VAL12,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0021,                                               +        
               LTH=9                                                            
         MFLD  DGIA0014,                                               +        
               LTH=14                                                           
         MFLD  DGIA0033,                                               +        
               LTH=3                                                            
         MFLD  PRINK12,                                                +        
               LTH=10                                                           
         MFLD  SPRINK12,                                               +        
               LTH=10                                                           
         MFLD  DGIA0049,                                               +        
               LTH=10                                                           
         MFLD  DGIA0003,                                               +        
               LTH=7                                                            
         MFLD  BEHKOD12,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W5I115N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W5N115),                                           +        
               OPT=2,                                                  +        
               NXT=W5O115N1                                                     
MID      LPAGE SOR=(FORMAT),                                           +        
               NXT=W5O115N1                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '51152',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0016,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0018,                                               +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0023,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  DGIA0025,                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0027,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0029,                                               +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0043,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0045,                                               +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0022,                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0024,                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0015,                                               +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0017,                                               +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0026,                                               +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0028,                                               +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0042,                                               +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0044,                                               +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (VAL1,                                                  +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDARTNR1,                                               +        
               LTH=9                                                            
         MFLD  (BEHKOD1,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (VAL2,                                                  +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDARTNR2,                                               +        
               LTH=9                                                            
         MFLD  (BEHKOD2,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (VAL3,                                                  +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDARTNR3,                                               +        
               LTH=9                                                            
         MFLD  (BEHKOD3,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (VAL4,                                                  +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDARTNR4,                                               +        
               LTH=9                                                            
         MFLD  (BEHKOD4,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (VAL5,                                                  +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDARTNR5,                                               +        
               LTH=9                                                            
         MFLD  (BEHKOD5,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (VAL6,                                                  +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDARTNR6,                                               +        
               LTH=9                                                            
         MFLD  (BEHKOD6,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (VAL7,                                                  +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDARTNR7,                                               +        
               LTH=9                                                            
         MFLD  (BEHKOD7,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (VAL8,                                                  +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDARTNR8,                                               +        
               LTH=9                                                            
         MFLD  (BEHKOD8,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (VAL9,                                                  +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDARTNR9,                                               +        
               LTH=9                                                            
         MFLD  (BEHKOD9,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (VAL10,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  DGIA0019,                                               +        
               LTH=9                                                            
         MFLD  (BEHKOD10,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (VAL11,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  DGIA0020,                                               +        
               LTH=9                                                            
         MFLD  (BEHKOD11,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (VAL12,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  DGIA0021,                                               +        
               LTH=9                                                            
         MFLD  (BEHKOD12,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
