***********************************************************************         
* CREATED BY PCCP628   ON 18/05/08  AT 12:33                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'EXISTING PRICE '                                                
W5N125   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,11)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'EXISTING PRICE',                                       +        
               POS=(1,11),LTH=14,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Part No.',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(ALPHA,PROT)                                                
ARTNRIN  DFLD  POS=(2,11),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
ARTNRUT  DFLD  POS=(3,11),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'C',                                                    +        
               POS=(5,2),LTH=1,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'DC  Date     Vendor   Order price     Cur Code Status',+        
               POS=(5,5),LTH=53,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Reg Date User',                                        +        
               POS=(5,59),LTH=13,                                      +        
               ATTR=(PROT)                                                      
         DO    14                                                               
PRURSP   DFLD  POS=(6,2),LTH=1,ATTR=(PROT)                                      
DC       DFLD  POS=(6,5),LTH=2,ATTR=(PROT)                                      
DATE     DFLD  POS=(6,9),LTH=8,ATTR=(PROT)                                      
LEVNR    DFLD  POS=(6,18),LTH=5,ATTR=(PROT)                                     
PRART    DFLD  POS=(6,27),LTH=15,ATTR=(PROT)                                    
VALISO   DFLD  POS=(6,43),LTH=3,ATTR=(PROT)                                     
STATUS   DFLD  POS=(6,52),LTH=5,ATTR=(PROT)                                     
PRDATE   DFLD  POS=(6,59),LTH=8,ATTR=(PROT)                                     
IDUSER   DFLD  POS=(6,68),LTH=8,ATTR=(PROT)                                     
         ENDDO                                                                  
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W5O125N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W5N125,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W5I125N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  ARTNRIN,                                                +        
               LTH=9                                                            
         MFLD  ARTNRUT,                                                +        
               LTH=9                                                            
         DO 14                                                                  
         MFLD  PRURSP,                                                 +        
               LTH=1                                                            
         MFLD  DC,                                                     +        
               LTH=2                                                            
         MFLD  DATE,                                                   +        
               LTH=8                                                            
         MFLD  LEVNR,                                                  +        
               LTH=5                                                            
         MFLD  PRART,                                                  +        
               LTH=14                                                           
         MFLD  VALISO,                                                 +        
               LTH=3                                                            
         MFLD  STATUS,                                                 +        
               LTH=5                                                            
         MFLD  PRDATE,                                                 +        
               LTH=8                                                            
         MFLD  IDUSER,                                                 +        
               LTH=8                                                            
         ENDDO                                                                  
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W5I125N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W5N125),                                           +        
               OPT=2,                                                  +        
               NXT=W5O125N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '51252',                                                +        
               LTH=5                                                            
         MFLD  (ARTNRIN,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R                                                           
         MSGEND                                                                 
         END                                                                    
