***********************************************************************         
* CREATED BY V048987   oN 97/02/14  AT 13:15                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W5N101   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W5T101  ',                                           +        
               2='W5T102  ',                                           +        
               3='W5T103  ',                                           +        
               4='W5T104  ',                                           +        
               5='W5T105  ',                                           +        
               6='W5T106  ',                                           +        
               7='W5T107  ',                                           +        
               8='W5T108  ',                                           +        
               9='W5T109  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W5T101  ',                                          +        
               14='W5T102  ',                                          +        
               15='W5T103  ',                                          +        
               16='W5T104  ',                                          +        
               17='W5T105  ',                                          +        
               18='W5T106  ',                                          +        
               19='W5T107  ',                                          +        
               20='W5T108  ',                                          +        
               21='W5T109  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,16)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'INVENTORYINFORMATION',                                 +        
               POS=(1,12),LTH=20,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Partno',                                               +        
               POS=(2,2),LTH=6,                                        +        
               ATTR=(NUM,PROT)                                                  
FLD0216  DFLD  POS=(2,16),LTH=9,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Dc',                                                   +        
               POS=(2,29),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0000 DFLD  POS=(2,32),LTH=2,                                       +        
               ATTR=(NOPROT,MOD)                                                
FLD0316  DFLD  POS=(3,16),LTH=11,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0001 DFLD  POS=(3,32),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Description',                                          +        
               POS=(4,2),LTH=11,                                       +        
               ATTR=(PROT)                                                      
FLD0415  DFLD  POS=(4,15),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Per n tot',                                            +        
               POS=(4,42),LTH=9,                                       +        
               ATTR=(PROT)                                                      
FLD0458  DFLD  POS=(4,58),LTH=10,                                      +        
               ATTR=(PROT)                                                      
FLD0469  DFLD  POS=(4,69),LTH=10,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Address',                                              +        
               POS=(5,2),LTH=7,                                        +        
               ATTR=(PROT)                                                      
FLD0513  DFLD  POS=(5,13),LTH=11,                                      +        
               ATTR=(PROT)                                                      
FLD0526  DFLD  POS=(5,26),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Per n kit',                                            +        
               POS=(5,42),LTH=9,                                       +        
               ATTR=(PROT)                                                      
FLD0558  DFLD  POS=(5,58),LTH=9,                                       +        
               ATTR=(PROT)                                                      
FLD0569  DFLD  POS=(5,69),LTH=9,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Last invdate',                                         +        
               POS=(6,2),LTH=12,                                       +        
               ATTR=(PROT)                                                      
FLD0619  DFLD  POS=(6,19),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLD0632  DFLD  POS=(6,32),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Quant 01',                                             +        
               POS=(6,42),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD0660  DFLD  POS=(6,60),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Adj quant',                                            +        
               POS=(7,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
FLD0716  DFLD  POS=(7,16),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD0729  DFLD  POS=(7,29),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Kit mark',                                             +        
               POS=(7,42),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD0764  DFLD  POS=(7,64),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Curr inv',                                             +        
               POS=(8,2),LTH=8,                                        +        
               ATTR=(PROT)                                                      
FLD0812  DFLD  POS=(8,12),LTH=12,                                      +        
               ATTR=(PROT,HI)                                                   
FLD0825  DFLD  POS=(8,25),LTH=12,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         DFLD  'Vth',                                                  +        
               POS=(8,42),LTH=3,                                       +        
               ATTR=(PROT)                                                      
FLD0864  DFLD  POS=(8,64),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Creat date',                                           +        
               POS=(9,2),LTH=10,                                       +        
               ATTR=(PROT)                                                      
FLD0918  DFLD  POS=(9,18),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0931  DFLD  POS=(9,31),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Vvcl',                                                 +        
               POS=(9,42),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD0964  DFLD  POS=(9,64),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Trsp cost',                                            +        
               POS=(10,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
FLD1013  DFLD  POS=(10,14),LTH=10,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Prod.code',                                            +        
               POS=(10,26),LTH=9,                                      +        
               ATTR=(PROT)                                                      
FLD1034  DFLD  POS=(10,37),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Obs. groupe',                                          +        
               POS=(10,42),LTH=11,                                     +        
               ATTR=(PROT)                                                      
FLD1064  DFLD  POS=(10,64),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Purch price',                                          +        
               POS=(11,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
FLD1117  DFLD  POS=(11,14),LTH=10,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Lpc',                                                  +        
               POS=(11,32),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KDPSLLOC DFLD  POS=(11,38),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Goods rec.code',                                       +        
               POS=(11,42),LTH=14,                                     +        
               ATTR=(PROT)                                                      
FLD1164  DFLD  POS=(11,64),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Std.price',                                            +        
               POS=(12,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
FLD1217  DFLD  POS=(12,14),LTH=10,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Wh code',                                              +        
               POS=(12,42),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1264  DFLD  POS=(12,64),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Orderprice',                                           +        
               POS=(13,2),LTH=10,                                      +        
               ATTR=(PROT)                                                      
FLD1317  DFLD  POS=(13,14),LTH=10,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Hf code',                                              +        
               POS=(13,42),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1364  DFLD  POS=(13,64),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Cost price',                                           +        
               POS=(14,2),LTH=10,                                      +        
               ATTR=(PROT)                                                      
FLD1417  DFLD  POS=(14,14),LTH=10,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Publ.week',                                            +        
               POS=(14,42),LTH=9,                                      +        
               ATTR=(PROT)                                                      
FLD1460  DFLD  POS=(14,60),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Ak cdc st',                                            +        
               POS=(15,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
FLD1516  DFLD  POS=(15,16),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1529  DFLD  POS=(15,29),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Procurer',                                             +        
               POS=(15,42),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1562  DFLD  POS=(15,62),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Ak sdc',                                               +        
               POS=(16,2),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD1629  DFLD  POS=(16,29),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Supers.code',                                          +        
               POS=(16,42),LTH=11,                                     +        
               ATTR=(PROT)                                                      
FLD1662  DFLD  POS=(16,62),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Efr balance',                                          +        
               POS=(17,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
FLD1716  DFLD  POS=(17,16),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1729  DFLD  POS=(17,29),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Supers.date',                                          +        
               POS=(17,42),LTH=11,                                     +        
               ATTR=(PROT)                                                      
FLD1760  DFLD  POS=(17,60),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Split efr',                                            +        
               POS=(18,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Supplier',                                             +        
               POS=(18,42),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1860  DFLD  POS=(18,60),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Stock balance',                                        +        
               POS=(19,2),LTH=13,                                      +        
               ATTR=(PROT)                                                      
FLD1916  DFLD  POS=(19,16),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1929  DFLD  POS=(19,29),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Sort',                                                 +        
               POS=(19,42),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD1963  DFLD  POS=(19,63),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Invest bal',                                           +        
               POS=(20,2),LTH=10,                                      +        
               ATTR=(PROT)                                                      
FLD2016  DFLD  POS=(20,16),LTH=8,                                      +        
               ATTR=(PROT,HI)                                                   
FLD2029  DFLD  POS=(20,29),LTH=8,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Last supplier',                                        +        
               POS=(20,42),LTH=13,                                     +        
               ATTR=(PROT)                                                      
FLD2060  DFLD  POS=(20,60),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLD2071  DFLD  POS=(20,71),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Bo balance',                                           +        
               POS=(21,2),LTH=10,                                      +        
               ATTR=(PROT)                                                      
FLD2116  DFLD  POS=(21,16),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2129  DFLD  POS=(21,29),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Last adv.date',                                        +        
               POS=(21,42),LTH=13,                                     +        
               ATTR=(PROT)                                                      
FLD2158  DFLD  POS=(21,58),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD2169  DFLD  POS=(21,69),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Res quant',                                            +        
               POS=(22,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
FLD2216  DFLD  POS=(22,16),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2229  DFLD  POS=(22,29),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Adv. quant',                                           +        
               POS=(22,42),LTH=10,                                     +        
               ATTR=(PROT)                                                      
FLD2257  DFLD  POS=(22,57),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2268  DFLD  POS=(22,68),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Order rest',                                           +        
               POS=(23,2),LTH=10,                                      +        
               ATTR=(PROT)                                                      
FLD2316  DFLD  POS=(23,16),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'H.bay-bal unenobl',                                    +        
               POS=(23,42),LTH=17,                                     +        
               ATTR=(PROT)                                                      
FLD2360  DFLD  POS=(23,60),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Enobl',                                                +        
               POS=(23,68),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD2374  DFLD  POS=(23,74),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W5O101N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W5N101,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W5I101N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0216,                                                +        
               LTH=9                                                            
         MFLD  FLD0316,                                                +        
               LTH=11                                                           
         MFLD  DGIA0000,                                               +        
               LTH=2                                                            
         MFLD  DGIA0001,                                               +        
               LTH=2                                                            
         MFLD  FLD0415,                                                +        
               LTH=25                                                           
         MFLD  FLD0458,                                                +        
               LTH=10                                                           
         MFLD  FLD0469,                                                +        
               LTH=10                                                           
         MFLD  FLD0513,                                                +        
               LTH=11                                                           
         MFLD  FLD0526,                                                +        
               LTH=11                                                           
         MFLD  FLD0558,                                                +        
               LTH=9                                                            
         MFLD  FLD0569,                                                +        
               LTH=9                                                            
         MFLD  FLD0619,                                                +        
               LTH=5                                                            
         MFLD  FLD0632,                                                +        
               LTH=5                                                            
         MFLD  FLD0660,                                                +        
               LTH=5                                                            
         MFLD  FLD0716,                                                +        
               LTH=8                                                            
         MFLD  FLD0729,                                                +        
               LTH=8                                                            
         MFLD  FLD0764,                                                +        
               LTH=1                                                            
         MFLD  FLD0812,                                                +        
               LTH=12                                                           
         MFLD  FLD0825,                                                +        
               LTH=12                                                           
         MFLD  FLD0864,                                                +        
               LTH=1                                                            
         MFLD  FLD0918,                                                +        
               LTH=6                                                            
         MFLD  FLD0931,                                                +        
               LTH=6                                                            
         MFLD  FLD0964,                                                +        
               LTH=1                                                            
         MFLD  FLD1013,                                                +        
               LTH=10                                                           
         MFLD  FLD1034,                                                +        
               LTH=3                                                            
         MFLD  FLD1064,                                                +        
               LTH=1                                                            
         MFLD  FLD1117,                                                +        
               LTH=10                                                           
         MFLD  KDPSLLOC,                                               +        
               LTH=2                                                            
         MFLD  FLD1164,                                                +        
               LTH=1                                                            
         MFLD  FLD1217,                                                +        
               LTH=10                                                           
         MFLD  FLD1264,                                                +        
               LTH=1                                                            
         MFLD  FLD1317,                                                +        
               LTH=10                                                           
         MFLD  FLD1364,                                                +        
               LTH=1                                                            
         MFLD  FLD1417,                                                +        
               LTH=10                                                           
         MFLD  FLD1460,                                                +        
               LTH=5                                                            
         MFLD  FLD1516,                                                +        
               LTH=8                                                            
         MFLD  FLD1529,                                                +        
               LTH=8                                                            
         MFLD  FLD1562,                                                +        
               LTH=3                                                            
         MFLD  FLD1629,                                                +        
               LTH=8                                                            
         MFLD  FLD1662,                                                +        
               LTH=3                                                            
         MFLD  FLD1716,                                                +        
               LTH=8                                                            
         MFLD  FLD1729,                                                +        
               LTH=8                                                            
         MFLD  FLD1760,                                                +        
               LTH=5                                                            
         MFLD  FLD1860,                                                +        
               LTH=5                                                            
         MFLD  FLD1916,                                                +        
               LTH=8                                                            
         MFLD  FLD1929,                                                +        
               LTH=8                                                            
         MFLD  FLD1963,                                                +        
               LTH=2                                                            
         MFLD  FLD2016,                                                +        
               LTH=8                                                            
         MFLD  FLD2029,                                                +        
               LTH=8                                                            
         MFLD  FLD2060,                                                +        
               LTH=5                                                            
         MFLD  FLD2071,                                                +        
               LTH=5                                                            
         MFLD  FLD2116,                                                +        
               LTH=8                                                            
         MFLD  FLD2129,                                                +        
               LTH=8                                                            
         MFLD  FLD2158,                                                +        
               LTH=7                                                            
         MFLD  FLD2169,                                                +        
               LTH=7                                                            
         MFLD  FLD2216,                                                +        
               LTH=8                                                            
         MFLD  FLD2229,                                                +        
               LTH=8                                                            
         MFLD  FLD2257,                                                +        
               LTH=8                                                            
         MFLD  FLD2268,                                                +        
               LTH=8                                                            
         MFLD  FLD2316,                                                +        
               LTH=8                                                            
         MFLD  FLD2360,                                                +        
               LTH=7                                                            
         MFLD  FLD2374,                                                +        
               LTH=7                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W5I101N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W5N101),                                           +        
               OPT=2,                                                  +        
               NXT=W5O101N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '51012',                                                +        
               LTH=5                                                            
         MFLD  (FLD0216,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0316,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0000,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0001,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
