***********************************************************************         
* CREATED BY V065708   ON 02/08/21  AT 10:23                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W5N107   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W5T107 7',                                           +        
               8='W5T107 8',                                           +        
               9='W5T107 9',                                           +        
               10='WHELP   ',                                          +        
               11='W5T107  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W5T101  ',                                          +        
               14='W5T102  ',                                          +        
               15='W5T103  ',                                          +        
               16='W5T104  ',                                          +        
               17='W5T105  ',                                          +        
               18='W5T106  ',                                          +        
               19='W5T107  ',                                          +        
               20='W5T108  ',                                          +        
               21='W5T109  ',                                          +        
               22='WHELP   ',                                          +        
               23='W5T107  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,9)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'DELIVERY INFORMATION',                                 +        
               POS=(1,12),LTH=20,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Partno',                                               +        
               POS=(2,2),LTH=6,                                        +        
               ATTR=(PROT)                                                      
FLD0209  DFLD  POS=(2,9),LTH=9,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'DC',                                                   +        
               POS=(2,19),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0222  DFLD  POS=(2,22),LTH=2,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Date',                                                 +        
               POS=(2,25),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
DATUMIN  DFLD  POS=(2,30),LTH=6,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'AdvNo',                                                +        
               POS=(2,37),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0243  DFLD  POS=(2,43),LTH=8,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Pt',                                                   +        
               POS=(2,52),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
IDPTYPIN DFLD  POS=(2,55),LTH=3,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Sup',                                                  +        
               POS=(2,59),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
LEVNRIN  DFLD  POS=(2,63),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'At',                                                   +        
               POS=(2,69),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
KDRTIN   DFLD  POS=(2,72),LTH=2,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0309  DFLD  POS=(3,9),LTH=9,                                        +        
               ATTR=(PROT,MOD)                                                  
FLD0322  DFLD  POS=(3,22),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DATUMUT  DFLD  POS=(3,30),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0343  DFLD  POS=(3,43),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
IDPTYPUT DFLD  POS=(3,55),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
LEVNRUT  DFLD  POS=(3,63),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
KDRTUT   DFLD  POS=(3,72),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0402  DFLD  POS=(4,2),LTH=15,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Pt   Currno  Date   Sup At Deldat   Advno',            +        
               POS=(5,5),LTH=41,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Adv  Binned    RET.  D',                               +        
               POS=(5,51),LTH=22,                                      +        
               ATTR=(PROT)                                                      
COL0206  DFLD  POS=(6,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
COL0406  DFLD  POS=(6,4),LTH=3,                                        +        
               ATTR=(NUM,PROT)                                                  
COL0806  DFLD  POS=(6,8),LTH=8,                                        +        
               ATTR=(NUM,PROT)                                                  
COL1706  DFLD  POS=(6,17),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
COL2306  DFLD  POS=(6,23),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
COL2906  DFLD  POS=(6,29),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
COL3206  DFLD  POS=(6,32),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
COL3906  DFLD  POS=(6,39),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
COL4706  DFLD  POS=(6,48),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
COL5506  DFLD  POS=(6,56),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
COL6206  DFLD  POS=(6,64),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
COL6906  DFLD  POS=(6,73),LTH=1,                                       +        
               ATTR=(PROT)                                                      
COL0207  DFLD  POS=(7,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
COL0607  DFLD  POS=(7,4),LTH=3,                                        +        
               ATTR=(NUM,PROT)                                                  
COL1507  DFLD  POS=(7,8),LTH=8,                                        +        
               ATTR=(NUM,PROT)                                                  
COL2107  DFLD  POS=(7,17),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
COL2707  DFLD  POS=(7,23),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
COL3007  DFLD  POS=(7,29),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
COL3707  DFLD  POS=(7,32),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
COL4807  DFLD  POS=(7,39),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
COL5607  DFLD  POS=(7,48),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
COL6407  DFLD  POS=(7,56),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
COL7107  DFLD  POS=(7,64),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
COL7807  DFLD  POS=(7,73),LTH=1,                                       +        
               ATTR=(PROT)                                                      
COL0208  DFLD  POS=(8,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
COL0608  DFLD  POS=(8,4),LTH=3,                                        +        
               ATTR=(NUM,PROT)                                                  
COL1508  DFLD  POS=(8,8),LTH=8,                                        +        
               ATTR=(NUM,PROT)                                                  
COL2108  DFLD  POS=(8,17),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
COL2708  DFLD  POS=(8,23),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
COL3008  DFLD  POS=(8,29),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
COL3708  DFLD  POS=(8,32),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
COL4808  DFLD  POS=(8,39),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
COL5608  DFLD  POS=(8,48),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
COL6408  DFLD  POS=(8,56),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
COL7108  DFLD  POS=(8,64),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
COL7808  DFLD  POS=(8,73),LTH=1,                                       +        
               ATTR=(PROT)                                                      
COL0209  DFLD  POS=(9,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
COL0609  DFLD  POS=(9,4),LTH=3,                                        +        
               ATTR=(NUM,PROT)                                                  
COL1509  DFLD  POS=(9,8),LTH=8,                                        +        
               ATTR=(NUM,PROT)                                                  
COL2109  DFLD  POS=(9,17),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
COL2709  DFLD  POS=(9,23),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
COL3009  DFLD  POS=(9,29),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
COL3709  DFLD  POS=(9,32),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
COL4809  DFLD  POS=(9,39),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
COL5609  DFLD  POS=(9,48),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
COL6409  DFLD  POS=(9,56),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
COL7109  DFLD  POS=(9,64),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
COL7809  DFLD  POS=(9,73),LTH=1,                                       +        
               ATTR=(PROT)                                                      
COL0210  DFLD  POS=(10,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0610  DFLD  POS=(10,4),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
COL1510  DFLD  POS=(10,8),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
COL2110  DFLD  POS=(10,17),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
COL2710  DFLD  POS=(10,23),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
COL3010  DFLD  POS=(10,29),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
COL3710  DFLD  POS=(10,32),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
COL4810  DFLD  POS=(10,39),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
COL5610  DFLD  POS=(10,48),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
COL6410  DFLD  POS=(10,56),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
COL7110  DFLD  POS=(10,64),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
COL7810  DFLD  POS=(10,73),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL0211  DFLD  POS=(11,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0611  DFLD  POS=(11,4),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
COL1511  DFLD  POS=(11,8),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
COL2111  DFLD  POS=(11,17),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
COL2711  DFLD  POS=(11,23),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
COL3011  DFLD  POS=(11,29),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
COL3711  DFLD  POS=(11,32),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
COL4811  DFLD  POS=(11,39),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
COL5611  DFLD  POS=(11,48),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
COL6411  DFLD  POS=(11,56),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
COL7111  DFLD  POS=(11,64),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
COL7811  DFLD  POS=(11,73),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL0212  DFLD  POS=(12,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0612  DFLD  POS=(12,4),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
COL1512  DFLD  POS=(12,8),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
COL2112  DFLD  POS=(12,17),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
COL2712  DFLD  POS=(12,23),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
COL3012  DFLD  POS=(12,29),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
COL3712  DFLD  POS=(12,32),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
COL4812  DFLD  POS=(12,39),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
COL5612  DFLD  POS=(12,48),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
COL6412  DFLD  POS=(12,56),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
COL7112  DFLD  POS=(12,64),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
COL7812  DFLD  POS=(12,73),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL0213  DFLD  POS=(13,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0613  DFLD  POS=(13,4),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
COL1513  DFLD  POS=(13,8),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
COL2113  DFLD  POS=(13,17),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
COL2713  DFLD  POS=(13,23),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
COL3013  DFLD  POS=(13,29),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
COL3713  DFLD  POS=(13,32),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
COL4813  DFLD  POS=(13,39),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
COL5613  DFLD  POS=(13,48),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
COL6413  DFLD  POS=(13,56),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
COL7113  DFLD  POS=(13,64),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
COL7813  DFLD  POS=(13,73),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL0214  DFLD  POS=(14,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0614  DFLD  POS=(14,4),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
COL1514  DFLD  POS=(14,8),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
COL2114  DFLD  POS=(14,17),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
COL2714  DFLD  POS=(14,23),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
COL3014  DFLD  POS=(14,29),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
COL3714  DFLD  POS=(14,32),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
COL4814  DFLD  POS=(14,39),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
COL5614  DFLD  POS=(14,48),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
COL6414  DFLD  POS=(14,56),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
COL7114  DFLD  POS=(14,64),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
COL7814  DFLD  POS=(14,73),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL0215  DFLD  POS=(15,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0615  DFLD  POS=(15,4),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
COL1515  DFLD  POS=(15,8),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
COL2115  DFLD  POS=(15,17),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
COL2715  DFLD  POS=(15,23),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
COL3015  DFLD  POS=(15,29),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
COL3715  DFLD  POS=(15,32),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
COL4815  DFLD  POS=(15,39),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
COL5615  DFLD  POS=(15,48),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
COL6415  DFLD  POS=(15,56),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
COL7115  DFLD  POS=(15,64),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
COL7815  DFLD  POS=(15,73),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL0216  DFLD  POS=(16,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0616  DFLD  POS=(16,4),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
COL1516  DFLD  POS=(16,8),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
COL2116  DFLD  POS=(16,17),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
COL2716  DFLD  POS=(16,23),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
COL3016  DFLD  POS=(16,29),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
COL3716  DFLD  POS=(16,32),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
COL4816  DFLD  POS=(16,39),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
COL5616  DFLD  POS=(16,48),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
COL6416  DFLD  POS=(16,56),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
COL7116  DFLD  POS=(16,64),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
COL7816  DFLD  POS=(16,73),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL0217  DFLD  POS=(17,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0617  DFLD  POS=(17,4),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
COL1517  DFLD  POS=(17,8),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
COL2117  DFLD  POS=(17,17),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
COL2717  DFLD  POS=(17,23),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
COL3017  DFLD  POS=(17,29),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
COL3717  DFLD  POS=(17,32),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
COL4817  DFLD  POS=(17,39),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
COL5617  DFLD  POS=(17,48),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
COL6417  DFLD  POS=(17,56),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
COL7117  DFLD  POS=(17,64),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
COL7817  DFLD  POS=(17,73),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL0218  DFLD  POS=(18,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0618  DFLD  POS=(18,4),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
COL1518  DFLD  POS=(18,8),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
COL2118  DFLD  POS=(18,17),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
COL2718  DFLD  POS=(18,23),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
COL3018  DFLD  POS=(18,29),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
COL3718  DFLD  POS=(18,32),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
COL4818  DFLD  POS=(18,39),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
COL5618  DFLD  POS=(18,48),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
COL6418  DFLD  POS=(18,56),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
COL7118  DFLD  POS=(18,64),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
COL7818  DFLD  POS=(18,73),LTH=1,                                      +        
               ATTR=(PROT)                                                      
COL0219  DFLD  POS=(19,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0619  DFLD  POS=(19,4),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
COL1519  DFLD  POS=(19,8),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
COL2119  DFLD  POS=(19,17),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
COL2719  DFLD  POS=(19,23),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
COL3019  DFLD  POS=(19,29),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
COL3719  DFLD  POS=(19,32),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
COL4819  DFLD  POS=(19,39),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
COL5619  DFLD  POS=(19,48),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
COL6419  DFLD  POS=(19,56),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
COL7119  DFLD  POS=(19,64),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
COL7819  DFLD  POS=(19,73),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'F1=Help F7=First F8=Forward F9=5197 F10=WHELP F12=Logof+        
               f',                                                     +        
               POS=(22,2),LTH=56,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W5O107N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W5N107,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W5I107N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0209,                                                +        
               LTH=9                                                            
         MFLD  FLD0309,                                                +        
               LTH=9                                                            
         MFLD  FLD0222,                                                +        
               LTH=2                                                            
         MFLD  FLD0322,                                                +        
               LTH=2                                                            
         MFLD  DATUMIN,                                                +        
               LTH=6                                                            
         MFLD  DATUMUT,                                                +        
               LTH=6                                                            
         MFLD  FLD0243,                                                +        
               LTH=8                                                            
         MFLD  FLD0343,                                                +        
               LTH=8                                                            
         MFLD  IDPTYPIN,                                               +        
               LTH=3                                                            
         MFLD  IDPTYPUT,                                               +        
               LTH=3                                                            
         MFLD  LEVNRIN,                                                +        
               LTH=5                                                            
         MFLD  LEVNRUT,                                                +        
               LTH=5                                                            
         MFLD  KDRTIN,                                                 +        
               LTH=2                                                            
         MFLD  KDRTUT,                                                 +        
               LTH=2                                                            
         MFLD  FLD0402,                                                +        
               LTH=15                                                           
         MFLD  COL0206,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0406,                                                +        
               LTH=3                                                            
         MFLD  COL0806,                                                +        
               LTH=8                                                            
         MFLD  COL1706,                                                +        
               LTH=5                                                            
         MFLD  COL2306,                                                +        
               LTH=5                                                            
         MFLD  COL2906,                                                +        
               LTH=2                                                            
         MFLD  COL3206,                                                +        
               LTH=6                                                            
         MFLD  COL3906,                                                +        
               LTH=8                                                            
         MFLD  COL4706,                                                +        
               LTH=7                                                            
         MFLD  COL5506,                                                +        
               LTH=7                                                            
         MFLD  COL6206,                                                +        
               LTH=7                                                            
         MFLD  COL6906,                                                +        
               LTH=1                                                            
         MFLD  COL0207,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0607,                                                +        
               LTH=3                                                            
         MFLD  COL1507,                                                +        
               LTH=8                                                            
         MFLD  COL2107,                                                +        
               LTH=5                                                            
         MFLD  COL2707,                                                +        
               LTH=5                                                            
         MFLD  COL3007,                                                +        
               LTH=2                                                            
         MFLD  COL3707,                                                +        
               LTH=6                                                            
         MFLD  COL4807,                                                +        
               LTH=8                                                            
         MFLD  COL5607,                                                +        
               LTH=7                                                            
         MFLD  COL6407,                                                +        
               LTH=7                                                            
         MFLD  COL7107,                                                +        
               LTH=7                                                            
         MFLD  COL7807,                                                +        
               LTH=1                                                            
         MFLD  COL0208,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0608,                                                +        
               LTH=3                                                            
         MFLD  COL1508,                                                +        
               LTH=8                                                            
         MFLD  COL2108,                                                +        
               LTH=5                                                            
         MFLD  COL2708,                                                +        
               LTH=5                                                            
         MFLD  COL3008,                                                +        
               LTH=2                                                            
         MFLD  COL3708,                                                +        
               LTH=6                                                            
         MFLD  COL4808,                                                +        
               LTH=8                                                            
         MFLD  COL5608,                                                +        
               LTH=7                                                            
         MFLD  COL6408,                                                +        
               LTH=7                                                            
         MFLD  COL7108,                                                +        
               LTH=7                                                            
         MFLD  COL7808,                                                +        
               LTH=1                                                            
         MFLD  COL0209,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0609,                                                +        
               LTH=3                                                            
         MFLD  COL1509,                                                +        
               LTH=8                                                            
         MFLD  COL2109,                                                +        
               LTH=5                                                            
         MFLD  COL2709,                                                +        
               LTH=5                                                            
         MFLD  COL3009,                                                +        
               LTH=2                                                            
         MFLD  COL3709,                                                +        
               LTH=6                                                            
         MFLD  COL4809,                                                +        
               LTH=8                                                            
         MFLD  COL5609,                                                +        
               LTH=7                                                            
         MFLD  COL6409,                                                +        
               LTH=7                                                            
         MFLD  COL7109,                                                +        
               LTH=7                                                            
         MFLD  COL7809,                                                +        
               LTH=1                                                            
         MFLD  COL0210,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0610,                                                +        
               LTH=3                                                            
         MFLD  COL1510,                                                +        
               LTH=8                                                            
         MFLD  COL2110,                                                +        
               LTH=5                                                            
         MFLD  COL2710,                                                +        
               LTH=5                                                            
         MFLD  COL3010,                                                +        
               LTH=2                                                            
         MFLD  COL3710,                                                +        
               LTH=6                                                            
         MFLD  COL4810,                                                +        
               LTH=8                                                            
         MFLD  COL5610,                                                +        
               LTH=7                                                            
         MFLD  COL6410,                                                +        
               LTH=7                                                            
         MFLD  COL7110,                                                +        
               LTH=7                                                            
         MFLD  COL7810,                                                +        
               LTH=1                                                            
         MFLD  COL0211,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0611,                                                +        
               LTH=3                                                            
         MFLD  COL1511,                                                +        
               LTH=8                                                            
         MFLD  COL2111,                                                +        
               LTH=5                                                            
         MFLD  COL2711,                                                +        
               LTH=5                                                            
         MFLD  COL3011,                                                +        
               LTH=2                                                            
         MFLD  COL3711,                                                +        
               LTH=6                                                            
         MFLD  COL4811,                                                +        
               LTH=8                                                            
         MFLD  COL5611,                                                +        
               LTH=7                                                            
         MFLD  COL6411,                                                +        
               LTH=7                                                            
         MFLD  COL7111,                                                +        
               LTH=7                                                            
         MFLD  COL7811,                                                +        
               LTH=1                                                            
         MFLD  COL0212,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0612,                                                +        
               LTH=3                                                            
         MFLD  COL1512,                                                +        
               LTH=8                                                            
         MFLD  COL2112,                                                +        
               LTH=5                                                            
         MFLD  COL2712,                                                +        
               LTH=5                                                            
         MFLD  COL3012,                                                +        
               LTH=2                                                            
         MFLD  COL3712,                                                +        
               LTH=6                                                            
         MFLD  COL4812,                                                +        
               LTH=8                                                            
         MFLD  COL5612,                                                +        
               LTH=7                                                            
         MFLD  COL6412,                                                +        
               LTH=7                                                            
         MFLD  COL7112,                                                +        
               LTH=7                                                            
         MFLD  COL7812,                                                +        
               LTH=1                                                            
         MFLD  COL0213,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0613,                                                +        
               LTH=3                                                            
         MFLD  COL1513,                                                +        
               LTH=8                                                            
         MFLD  COL2113,                                                +        
               LTH=5                                                            
         MFLD  COL2713,                                                +        
               LTH=5                                                            
         MFLD  COL3013,                                                +        
               LTH=2                                                            
         MFLD  COL3713,                                                +        
               LTH=6                                                            
         MFLD  COL4813,                                                +        
               LTH=8                                                            
         MFLD  COL5613,                                                +        
               LTH=7                                                            
         MFLD  COL6413,                                                +        
               LTH=7                                                            
         MFLD  COL7113,                                                +        
               LTH=7                                                            
         MFLD  COL7813,                                                +        
               LTH=1                                                            
         MFLD  COL0214,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0614,                                                +        
               LTH=3                                                            
         MFLD  COL1514,                                                +        
               LTH=8                                                            
         MFLD  COL2114,                                                +        
               LTH=5                                                            
         MFLD  COL2714,                                                +        
               LTH=5                                                            
         MFLD  COL3014,                                                +        
               LTH=2                                                            
         MFLD  COL3714,                                                +        
               LTH=6                                                            
         MFLD  COL4814,                                                +        
               LTH=8                                                            
         MFLD  COL5614,                                                +        
               LTH=7                                                            
         MFLD  COL6414,                                                +        
               LTH=7                                                            
         MFLD  COL7114,                                                +        
               LTH=7                                                            
         MFLD  COL7814,                                                +        
               LTH=1                                                            
         MFLD  COL0215,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0615,                                                +        
               LTH=3                                                            
         MFLD  COL1515,                                                +        
               LTH=8                                                            
         MFLD  COL2115,                                                +        
               LTH=5                                                            
         MFLD  COL2715,                                                +        
               LTH=5                                                            
         MFLD  COL3015,                                                +        
               LTH=2                                                            
         MFLD  COL3715,                                                +        
               LTH=6                                                            
         MFLD  COL4815,                                                +        
               LTH=8                                                            
         MFLD  COL5615,                                                +        
               LTH=7                                                            
         MFLD  COL6415,                                                +        
               LTH=7                                                            
         MFLD  COL7115,                                                +        
               LTH=7                                                            
         MFLD  COL7815,                                                +        
               LTH=1                                                            
         MFLD  COL0216,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0616,                                                +        
               LTH=3                                                            
         MFLD  COL1516,                                                +        
               LTH=8                                                            
         MFLD  COL2116,                                                +        
               LTH=5                                                            
         MFLD  COL2716,                                                +        
               LTH=5                                                            
         MFLD  COL3016,                                                +        
               LTH=2                                                            
         MFLD  COL3716,                                                +        
               LTH=6                                                            
         MFLD  COL4816,                                                +        
               LTH=8                                                            
         MFLD  COL5616,                                                +        
               LTH=7                                                            
         MFLD  COL6416,                                                +        
               LTH=7                                                            
         MFLD  COL7116,                                                +        
               LTH=7                                                            
         MFLD  COL7816,                                                +        
               LTH=1                                                            
         MFLD  COL0217,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0617,                                                +        
               LTH=3                                                            
         MFLD  COL1517,                                                +        
               LTH=8                                                            
         MFLD  COL2117,                                                +        
               LTH=5                                                            
         MFLD  COL2717,                                                +        
               LTH=5                                                            
         MFLD  COL3017,                                                +        
               LTH=2                                                            
         MFLD  COL3717,                                                +        
               LTH=6                                                            
         MFLD  COL4817,                                                +        
               LTH=8                                                            
         MFLD  COL5617,                                                +        
               LTH=7                                                            
         MFLD  COL6417,                                                +        
               LTH=7                                                            
         MFLD  COL7117,                                                +        
               LTH=7                                                            
         MFLD  COL7817,                                                +        
               LTH=1                                                            
         MFLD  COL0218,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0618,                                                +        
               LTH=3                                                            
         MFLD  COL1518,                                                +        
               LTH=8                                                            
         MFLD  COL2118,                                                +        
               LTH=5                                                            
         MFLD  COL2718,                                                +        
               LTH=5                                                            
         MFLD  COL3018,                                                +        
               LTH=2                                                            
         MFLD  COL3718,                                                +        
               LTH=6                                                            
         MFLD  COL4818,                                                +        
               LTH=8                                                            
         MFLD  COL5618,                                                +        
               LTH=7                                                            
         MFLD  COL6418,                                                +        
               LTH=7                                                            
         MFLD  COL7118,                                                +        
               LTH=7                                                            
         MFLD  COL7818,                                                +        
               LTH=1                                                            
         MFLD  COL0219,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  COL0619,                                                +        
               LTH=3                                                            
         MFLD  COL1519,                                                +        
               LTH=8                                                            
         MFLD  COL2119,                                                +        
               LTH=5                                                            
         MFLD  COL2719,                                                +        
               LTH=5                                                            
         MFLD  COL3019,                                                +        
               LTH=2                                                            
         MFLD  COL3719,                                                +        
               LTH=6                                                            
         MFLD  COL4819,                                                +        
               LTH=8                                                            
         MFLD  COL5619,                                                +        
               LTH=7                                                            
         MFLD  COL6419,                                                +        
               LTH=7                                                            
         MFLD  COL7119,                                                +        
               LTH=7                                                            
         MFLD  COL7819,                                                +        
               LTH=1                                                            
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W5I107N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W5N107),                                           +        
               OPT=2,                                                  +        
               NXT=W5O107N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '51072',                                                +        
               LTH=5                                                            
         MFLD  (FLD0209,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0309,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0222,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0322,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (DATUMIN,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DATUMUT,                                                +        
               LTH=6                                                            
         MFLD  (FLD0243,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  FLD0343,                                                +        
               LTH=8                                                            
         MFLD  (IDPTYPIN,                                              +        
               '+++'),                                                 +        
               LTH=3                                                            
         MFLD  IDPTYPUT,                                               +        
               LTH=3                                                            
         MFLD  (LEVNRIN,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  LEVNRUT,                                                +        
               LTH=5                                                            
         MFLD  (KDRTIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KDRTUT,                                                 +        
               LTH=2                                                            
         MFLD  FLD0402,                                                +        
               LTH=15,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0206,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (COL0207,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (COL0208,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (COL0209,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (COL0210,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (COL0211,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (COL0212,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (COL0213,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (COL0214,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (COL0215,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (COL0216,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (COL0217,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (COL0218,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (COL0219,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
