***********************************************************************         
* CREATED BY PCC6483   ON 00/09/12  AT 12:51                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'BALANCE LOG, översiktsbild      '                               
W5N162   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W5T162 7',                                           +        
               8='W5T162 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W5T162U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,11)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'BALANCE-LOG OVERVIEW - 1',                             +        
               POS=(1,11),LTH=24,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Part no',                                              +        
               POS=(2,2),LTH=7,                                        +        
               ATTR=(ALPHA,PROT)                                                
ARTNRIN  DFLD  POS=(2,11),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Dc',                                                   +        
               POS=(2,22),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DCIN     DFLD  POS=(2,25),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Logtype',                                              +        
               POS=(2,29),LTH=7,                                       +        
               ATTR=(PROT)                                                      
HUVTYPIN DFLD  POS=(2,37),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
SUBTYPIN DFLD  POS=(2,42),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Date',                                                 +        
               POS=(2,47),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DATFRIN  DFLD  POS=(2,52),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '-',                                                    +        
               POS=(2,59),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
DATTOIN  DFLD  POS=(2,61),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Screen',                                               +        
               POS=(2,69),LTH=6,                                       +        
               ATTR=(PROT)                                                      
BILDIN   DFLD  POS=(2,76),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
ARTNRUT  DFLD  POS=(3,11),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
DCUT     DFLD  POS=(3,25),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
HUVTYPUT DFLD  POS=(3,37),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
SUBTYPUT DFLD  POS=(3,42),LTH=3,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DATFRUT  DFLD  POS=(3,52),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DATTOUT  DFLD  POS=(3,61),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
BILDUT   DFLD  POS=(3,76),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'No of ST-BAL',                                         +        
               POS=(5,2),LTH=12,                                       +        
               ATTR=(PROT)                                                      
LSTOT    DFLD  POS=(5,15),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Acc ST-BAL up',                                        +        
               POS=(5,24),LTH=13,                                      +        
               ATTR=(PROT)                                                      
CHANGEUP DFLD  POS=(5,38),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'down',                                                 +        
               POS=(5,46),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
CHANGEDO DFLD  POS=(5,51),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Save extract',                                         +        
               POS=(5,60),LTH=12,                                      +        
               ATTR=(PROT)                                                      
EXTRIND  DFLD  POS=(5,73),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  '(Y/N)',                                                +        
               POS=(5,75),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'No of trans',                                          +        
               POS=(6,2),LTH=11,                                       +        
               ATTR=(PROT)                                                      
TRANSTOT DFLD  POS=(6,15),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'S Dc Logtype  Date    Change    AKS-OIW',              +        
               POS=(7,2),LTH=39,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'AKS',                                                  +        
               POS=(7,47),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'EFRS',                                                 +        
               POS=(7,59),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'ST-BAL',                                               +        
               POS=(7,71),LTH=6,                                       +        
               ATTR=(PROT)                                                      
CMD1     DFLD  POS=(8,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
DC1      DFLD  POS=(8,4),LTH=2,                                        +        
               ATTR=(PROT)                                                      
HUVTYP1  DFLD  POS=(8,7),LTH=4,                                        +        
               ATTR=(NUM,PROT)                                                  
SUBTYP1  DFLD  POS=(8,12),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
DATE1    DFLD  POS=(8,16),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
CHANGE1  DFLD  POS=(8,23),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
AKSOWT1  DFLD  POS=(8,32),LTH=1,                                       +        
               ATTR=(PROT)                                                      
AKSOW1   DFLD  POS=(8,34),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
AKST1    DFLD  POS=(8,44),LTH=1,                                       +        
               ATTR=(PROT)                                                      
AKS1     DFLD  POS=(8,46),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
EFRST1   DFLD  POS=(8,56),LTH=1,                                       +        
               ATTR=(PROT)                                                      
EFRS1    DFLD  POS=(8,58),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
LST1     DFLD  POS=(8,68),LTH=1,                                       +        
               ATTR=(PROT)                                                      
LS1      DFLD  POS=(8,70),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
CMD2     DFLD  POS=(9,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
DC2      DFLD  POS=(9,4),LTH=2,                                        +        
               ATTR=(PROT)                                                      
HUVTYP2  DFLD  POS=(9,7),LTH=4,                                        +        
               ATTR=(NUM,PROT)                                                  
SUBTYP2  DFLD  POS=(9,12),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
DATE2    DFLD  POS=(9,16),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
CHANGE2  DFLD  POS=(9,23),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
AKSOWT2  DFLD  POS=(9,32),LTH=1,                                       +        
               ATTR=(PROT)                                                      
AKSOW2   DFLD  POS=(9,34),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
AKST2    DFLD  POS=(9,44),LTH=1,                                       +        
               ATTR=(PROT)                                                      
AKS2     DFLD  POS=(9,46),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
EFRST2   DFLD  POS=(9,56),LTH=1,                                       +        
               ATTR=(PROT)                                                      
EFRS2    DFLD  POS=(9,58),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
LST2     DFLD  POS=(9,68),LTH=1,                                       +        
               ATTR=(PROT)                                                      
LS2      DFLD  POS=(9,70),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
CMD3     DFLD  POS=(10,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DC3      DFLD  POS=(10,4),LTH=2,                                       +        
               ATTR=(PROT)                                                      
HUVTYP3  DFLD  POS=(10,7),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
SUBTYP3  DFLD  POS=(10,12),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
DATE3    DFLD  POS=(10,16),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
CHANGE3  DFLD  POS=(10,23),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
AKSOWT3  DFLD  POS=(10,32),LTH=1,                                      +        
               ATTR=(PROT)                                                      
AKSOW3   DFLD  POS=(10,34),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
AKST3    DFLD  POS=(10,44),LTH=1,                                      +        
               ATTR=(PROT)                                                      
AKS3     DFLD  POS=(10,46),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
EFRST3   DFLD  POS=(10,56),LTH=1,                                      +        
               ATTR=(PROT)                                                      
EFRS3    DFLD  POS=(10,58),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
LST3     DFLD  POS=(10,68),LTH=1,                                      +        
               ATTR=(PROT)                                                      
LS3      DFLD  POS=(10,70),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
CMD4     DFLD  POS=(11,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DC4      DFLD  POS=(11,4),LTH=2,                                       +        
               ATTR=(PROT)                                                      
HUVTYP4  DFLD  POS=(11,7),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
SUBTYP4  DFLD  POS=(11,12),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
DATE4    DFLD  POS=(11,16),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
CHANGE4  DFLD  POS=(11,23),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
AKSOWT4  DFLD  POS=(11,32),LTH=1,                                      +        
               ATTR=(PROT)                                                      
AKSOW4   DFLD  POS=(11,34),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
AKST4    DFLD  POS=(11,44),LTH=1,                                      +        
               ATTR=(PROT)                                                      
AKS4     DFLD  POS=(11,46),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
EFRST4   DFLD  POS=(11,56),LTH=1,                                      +        
               ATTR=(PROT)                                                      
EFRS4    DFLD  POS=(11,58),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
LST4     DFLD  POS=(11,68),LTH=1,                                      +        
               ATTR=(PROT)                                                      
LS4      DFLD  POS=(11,70),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
CMD5     DFLD  POS=(12,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DC5      DFLD  POS=(12,4),LTH=2,                                       +        
               ATTR=(PROT)                                                      
HUVTYP5  DFLD  POS=(12,7),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
SUBTYP5  DFLD  POS=(12,12),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
DATE5    DFLD  POS=(12,16),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
CHANGE5  DFLD  POS=(12,23),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
AKSOWT5  DFLD  POS=(12,32),LTH=1,                                      +        
               ATTR=(PROT)                                                      
AKSOW5   DFLD  POS=(12,34),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
AKST5    DFLD  POS=(12,44),LTH=1,                                      +        
               ATTR=(PROT)                                                      
AKS5     DFLD  POS=(12,46),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
EFRST5   DFLD  POS=(12,56),LTH=1,                                      +        
               ATTR=(PROT)                                                      
EFRS5    DFLD  POS=(12,58),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
LST5     DFLD  POS=(12,68),LTH=1,                                      +        
               ATTR=(PROT)                                                      
LS5      DFLD  POS=(12,70),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
CMD6     DFLD  POS=(13,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DC6      DFLD  POS=(13,4),LTH=2,                                       +        
               ATTR=(PROT)                                                      
HUVTYP6  DFLD  POS=(13,7),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
SUBTYP6  DFLD  POS=(13,12),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
DATE6    DFLD  POS=(13,16),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
CHANGE6  DFLD  POS=(13,23),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
AKSOWT6  DFLD  POS=(13,32),LTH=1,                                      +        
               ATTR=(PROT)                                                      
AKSOW6   DFLD  POS=(13,34),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
AKST6    DFLD  POS=(13,44),LTH=1,                                      +        
               ATTR=(PROT)                                                      
AKS6     DFLD  POS=(13,46),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
EFRST6   DFLD  POS=(13,56),LTH=1,                                      +        
               ATTR=(PROT)                                                      
EFRS6    DFLD  POS=(13,58),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
LST6     DFLD  POS=(13,68),LTH=1,                                      +        
               ATTR=(PROT)                                                      
LS6      DFLD  POS=(13,70),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
CMD7     DFLD  POS=(14,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DC7      DFLD  POS=(14,4),LTH=2,                                       +        
               ATTR=(PROT)                                                      
HUVTYP7  DFLD  POS=(14,7),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
SUBTYP7  DFLD  POS=(14,12),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
DATE7    DFLD  POS=(14,16),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
CHANGE7  DFLD  POS=(14,23),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
AKSOWT7  DFLD  POS=(14,32),LTH=1,                                      +        
               ATTR=(PROT)                                                      
AKSOW7   DFLD  POS=(14,34),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
AKST7    DFLD  POS=(14,44),LTH=1,                                      +        
               ATTR=(PROT)                                                      
AKS7     DFLD  POS=(14,46),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
EFRST7   DFLD  POS=(14,56),LTH=1,                                      +        
               ATTR=(PROT)                                                      
EFRS7    DFLD  POS=(14,58),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
LST7     DFLD  POS=(14,68),LTH=1,                                      +        
               ATTR=(PROT)                                                      
LS7      DFLD  POS=(14,70),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
CMD8     DFLD  POS=(15,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DC8      DFLD  POS=(15,4),LTH=2,                                       +        
               ATTR=(PROT)                                                      
HUVTYP8  DFLD  POS=(15,7),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
SUBTYP8  DFLD  POS=(15,12),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
DATE8    DFLD  POS=(15,16),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
CHANGE8  DFLD  POS=(15,23),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
AKSOWT8  DFLD  POS=(15,32),LTH=1,                                      +        
               ATTR=(PROT)                                                      
AKSOW8   DFLD  POS=(15,34),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
AKST8    DFLD  POS=(15,44),LTH=1,                                      +        
               ATTR=(PROT)                                                      
AKS8     DFLD  POS=(15,46),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
EFRST8   DFLD  POS=(15,56),LTH=1,                                      +        
               ATTR=(PROT)                                                      
EFRS8    DFLD  POS=(15,58),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
LST8     DFLD  POS=(15,68),LTH=1,                                      +        
               ATTR=(PROT)                                                      
LS8      DFLD  POS=(15,70),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
CMD9     DFLD  POS=(16,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DC9      DFLD  POS=(16,4),LTH=2,                                       +        
               ATTR=(PROT)                                                      
HUVTYP9  DFLD  POS=(16,7),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
SUBTYP9  DFLD  POS=(16,12),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
DATE9    DFLD  POS=(16,16),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
CHANGE9  DFLD  POS=(16,23),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
AKSOWT9  DFLD  POS=(16,32),LTH=1,                                      +        
               ATTR=(PROT)                                                      
AKSOW9   DFLD  POS=(16,34),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
AKST9    DFLD  POS=(16,44),LTH=1,                                      +        
               ATTR=(PROT)                                                      
AKS9     DFLD  POS=(16,46),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
EFRST9   DFLD  POS=(16,56),LTH=1,                                      +        
               ATTR=(PROT)                                                      
EFRS9    DFLD  POS=(16,58),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
LST9     DFLD  POS=(16,68),LTH=1,                                      +        
               ATTR=(PROT)                                                      
LS9      DFLD  POS=(16,70),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
CMD10    DFLD  POS=(17,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DC10     DFLD  POS=(17,4),LTH=2,                                       +        
               ATTR=(PROT)                                                      
HUVTYP10 DFLD  POS=(17,7),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
SUBTYP10 DFLD  POS=(17,12),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
DATE10   DFLD  POS=(17,16),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
CHANGE10 DFLD  POS=(17,23),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
AKSOWT10 DFLD  POS=(17,32),LTH=1,                                      +        
               ATTR=(PROT)                                                      
AKSOW10  DFLD  POS=(17,34),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
AKST10   DFLD  POS=(17,44),LTH=1,                                      +        
               ATTR=(PROT)                                                      
AKS10    DFLD  POS=(17,46),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
EFRST10  DFLD  POS=(17,56),LTH=1,                                      +        
               ATTR=(PROT)                                                      
EFRS10   DFLD  POS=(17,58),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
LST10    DFLD  POS=(17,68),LTH=1,                                      +        
               ATTR=(PROT)                                                      
LS10     DFLD  POS=(17,70),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
CMD11    DFLD  POS=(18,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DC11     DFLD  POS=(18,4),LTH=2,                                       +        
               ATTR=(PROT)                                                      
HUVTYP11 DFLD  POS=(18,7),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
SUBTYP11 DFLD  POS=(18,12),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
DATE11   DFLD  POS=(18,16),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
CHANGE11 DFLD  POS=(18,23),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
AKSOWT11 DFLD  POS=(18,32),LTH=1,                                      +        
               ATTR=(PROT)                                                      
AKSOW11  DFLD  POS=(18,34),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
AKST11   DFLD  POS=(18,44),LTH=1,                                      +        
               ATTR=(PROT)                                                      
AKS11    DFLD  POS=(18,46),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
EFRST11  DFLD  POS=(18,56),LTH=1,                                      +        
               ATTR=(PROT)                                                      
EFRS11   DFLD  POS=(18,58),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
LST11    DFLD  POS=(18,68),LTH=1,                                      +        
               ATTR=(PROT)                                                      
LS11     DFLD  POS=(18,70),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  '13',                                                   +        
               POS=(21,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '14',                                                   +        
               POS=(21,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15',                                                   +        
               POS=(21,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  '    ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W5O162N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W5N162,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W5I162N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  ARTNRIN,                                                +        
               LTH=9                                                            
         MFLD  ARTNRUT,                                                +        
               LTH=9                                                            
         MFLD  DCIN,                                                   +        
               LTH=2                                                            
         MFLD  DCUT,                                                   +        
               LTH=2                                                            
         MFLD  HUVTYPIN,                                               +        
               LTH=4                                                            
         MFLD  HUVTYPUT,                                               +        
               LTH=4                                                            
         MFLD  SUBTYPIN,                                               +        
               LTH=3                                                            
         MFLD  SUBTYPUT,                                               +        
               LTH=3                                                            
         MFLD  DATFRIN,                                                +        
               LTH=6                                                            
         MFLD  DATFRUT,                                                +        
               LTH=6                                                            
         MFLD  DATTOIN,                                                +        
               LTH=6                                                            
         MFLD  DATTOUT,                                                +        
               LTH=6                                                            
         MFLD  BILDIN,                                                 +        
               LTH=4                                                            
         MFLD  BILDUT,                                                 +        
               LTH=4                                                            
         MFLD  LSTOT,                                                  +        
               LTH=7                                                            
         MFLD  CHANGEUP,                                               +        
               LTH=7                                                            
         MFLD  CHANGEDO,                                               +        
               LTH=7                                                            
         MFLD  EXTRIND,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TRANSTOT,                                               +        
               LTH=7                                                            
         MFLD  CMD1,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC1,                                                    +        
               LTH=2                                                            
         MFLD  HUVTYP1,                                                +        
               LTH=4                                                            
         MFLD  SUBTYP1,                                                +        
               LTH=3                                                            
         MFLD  DATE1,                                                  +        
               LTH=6                                                            
         MFLD  CHANGE1,                                                +        
               LTH=7                                                            
         MFLD  AKSOWT1,                                                +        
               LTH=1                                                            
         MFLD  AKSOW1,                                                 +        
               LTH=8                                                            
         MFLD  AKST1,                                                  +        
               LTH=1                                                            
         MFLD  AKS1,                                                   +        
               LTH=8                                                            
         MFLD  EFRST1,                                                 +        
               LTH=1                                                            
         MFLD  EFRS1,                                                  +        
               LTH=8                                                            
         MFLD  LST1,                                                   +        
               LTH=1                                                            
         MFLD  LS1,                                                    +        
               LTH=8                                                            
         MFLD  CMD2,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC2,                                                    +        
               LTH=2                                                            
         MFLD  HUVTYP2,                                                +        
               LTH=4                                                            
         MFLD  SUBTYP2,                                                +        
               LTH=3                                                            
         MFLD  DATE2,                                                  +        
               LTH=6                                                            
         MFLD  CHANGE2,                                                +        
               LTH=7                                                            
         MFLD  AKSOWT2,                                                +        
               LTH=1                                                            
         MFLD  AKSOW2,                                                 +        
               LTH=8                                                            
         MFLD  AKST2,                                                  +        
               LTH=1                                                            
         MFLD  AKS2,                                                   +        
               LTH=8                                                            
         MFLD  EFRST2,                                                 +        
               LTH=1                                                            
         MFLD  EFRS2,                                                  +        
               LTH=8                                                            
         MFLD  LST2,                                                   +        
               LTH=1                                                            
         MFLD  LS2,                                                    +        
               LTH=8                                                            
         MFLD  CMD3,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC3,                                                    +        
               LTH=2                                                            
         MFLD  HUVTYP3,                                                +        
               LTH=4                                                            
         MFLD  SUBTYP3,                                                +        
               LTH=3                                                            
         MFLD  DATE3,                                                  +        
               LTH=6                                                            
         MFLD  CHANGE3,                                                +        
               LTH=7                                                            
         MFLD  AKSOWT3,                                                +        
               LTH=1                                                            
         MFLD  AKSOW3,                                                 +        
               LTH=8                                                            
         MFLD  AKST3,                                                  +        
               LTH=1                                                            
         MFLD  AKS3,                                                   +        
               LTH=8                                                            
         MFLD  EFRST3,                                                 +        
               LTH=1                                                            
         MFLD  EFRS3,                                                  +        
               LTH=8                                                            
         MFLD  LST3,                                                   +        
               LTH=1                                                            
         MFLD  LS3,                                                    +        
               LTH=8                                                            
         MFLD  CMD4,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC4,                                                    +        
               LTH=2                                                            
         MFLD  HUVTYP4,                                                +        
               LTH=4                                                            
         MFLD  SUBTYP4,                                                +        
               LTH=3                                                            
         MFLD  DATE4,                                                  +        
               LTH=6                                                            
         MFLD  CHANGE4,                                                +        
               LTH=7                                                            
         MFLD  AKSOWT4,                                                +        
               LTH=1                                                            
         MFLD  AKSOW4,                                                 +        
               LTH=8                                                            
         MFLD  AKST4,                                                  +        
               LTH=1                                                            
         MFLD  AKS4,                                                   +        
               LTH=8                                                            
         MFLD  EFRST4,                                                 +        
               LTH=1                                                            
         MFLD  EFRS4,                                                  +        
               LTH=8                                                            
         MFLD  LST4,                                                   +        
               LTH=1                                                            
         MFLD  LS4,                                                    +        
               LTH=8                                                            
         MFLD  CMD5,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC5,                                                    +        
               LTH=2                                                            
         MFLD  HUVTYP5,                                                +        
               LTH=4                                                            
         MFLD  SUBTYP5,                                                +        
               LTH=3                                                            
         MFLD  DATE5,                                                  +        
               LTH=6                                                            
         MFLD  CHANGE5,                                                +        
               LTH=7                                                            
         MFLD  AKSOWT5,                                                +        
               LTH=1                                                            
         MFLD  AKSOW5,                                                 +        
               LTH=8                                                            
         MFLD  AKST5,                                                  +        
               LTH=1                                                            
         MFLD  AKS5,                                                   +        
               LTH=8                                                            
         MFLD  EFRST5,                                                 +        
               LTH=1                                                            
         MFLD  EFRS5,                                                  +        
               LTH=8                                                            
         MFLD  LST5,                                                   +        
               LTH=1                                                            
         MFLD  LS5,                                                    +        
               LTH=8                                                            
         MFLD  CMD6,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC6,                                                    +        
               LTH=2                                                            
         MFLD  HUVTYP6,                                                +        
               LTH=4                                                            
         MFLD  SUBTYP6,                                                +        
               LTH=3                                                            
         MFLD  DATE6,                                                  +        
               LTH=6                                                            
         MFLD  CHANGE6,                                                +        
               LTH=7                                                            
         MFLD  AKSOWT6,                                                +        
               LTH=1                                                            
         MFLD  AKSOW6,                                                 +        
               LTH=8                                                            
         MFLD  AKST6,                                                  +        
               LTH=1                                                            
         MFLD  AKS6,                                                   +        
               LTH=8                                                            
         MFLD  EFRST6,                                                 +        
               LTH=1                                                            
         MFLD  EFRS6,                                                  +        
               LTH=8                                                            
         MFLD  LST6,                                                   +        
               LTH=1                                                            
         MFLD  LS6,                                                    +        
               LTH=8                                                            
         MFLD  CMD7,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC7,                                                    +        
               LTH=2                                                            
         MFLD  HUVTYP7,                                                +        
               LTH=4                                                            
         MFLD  SUBTYP7,                                                +        
               LTH=3                                                            
         MFLD  DATE7,                                                  +        
               LTH=6                                                            
         MFLD  CHANGE7,                                                +        
               LTH=7                                                            
         MFLD  AKSOWT7,                                                +        
               LTH=1                                                            
         MFLD  AKSOW7,                                                 +        
               LTH=8                                                            
         MFLD  AKST7,                                                  +        
               LTH=1                                                            
         MFLD  AKS7,                                                   +        
               LTH=8                                                            
         MFLD  EFRST7,                                                 +        
               LTH=1                                                            
         MFLD  EFRS7,                                                  +        
               LTH=8                                                            
         MFLD  LST7,                                                   +        
               LTH=1                                                            
         MFLD  LS7,                                                    +        
               LTH=8                                                            
         MFLD  CMD8,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC8,                                                    +        
               LTH=2                                                            
         MFLD  HUVTYP8,                                                +        
               LTH=4                                                            
         MFLD  SUBTYP8,                                                +        
               LTH=3                                                            
         MFLD  DATE8,                                                  +        
               LTH=6                                                            
         MFLD  CHANGE8,                                                +        
               LTH=7                                                            
         MFLD  AKSOWT8,                                                +        
               LTH=1                                                            
         MFLD  AKSOW8,                                                 +        
               LTH=8                                                            
         MFLD  AKST8,                                                  +        
               LTH=1                                                            
         MFLD  AKS8,                                                   +        
               LTH=8                                                            
         MFLD  EFRST8,                                                 +        
               LTH=1                                                            
         MFLD  EFRS8,                                                  +        
               LTH=8                                                            
         MFLD  LST8,                                                   +        
               LTH=1                                                            
         MFLD  LS8,                                                    +        
               LTH=8                                                            
         MFLD  CMD9,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC9,                                                    +        
               LTH=2                                                            
         MFLD  HUVTYP9,                                                +        
               LTH=4                                                            
         MFLD  SUBTYP9,                                                +        
               LTH=3                                                            
         MFLD  DATE9,                                                  +        
               LTH=6                                                            
         MFLD  CHANGE9,                                                +        
               LTH=7                                                            
         MFLD  AKSOWT9,                                                +        
               LTH=1                                                            
         MFLD  AKSOW9,                                                 +        
               LTH=8                                                            
         MFLD  AKST9,                                                  +        
               LTH=1                                                            
         MFLD  AKS9,                                                   +        
               LTH=8                                                            
         MFLD  EFRST9,                                                 +        
               LTH=1                                                            
         MFLD  EFRS9,                                                  +        
               LTH=8                                                            
         MFLD  LST9,                                                   +        
               LTH=1                                                            
         MFLD  LS9,                                                    +        
               LTH=8                                                            
         MFLD  CMD10,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC10,                                                   +        
               LTH=2                                                            
         MFLD  HUVTYP10,                                               +        
               LTH=4                                                            
         MFLD  SUBTYP10,                                               +        
               LTH=3                                                            
         MFLD  DATE10,                                                 +        
               LTH=6                                                            
         MFLD  CHANGE10,                                               +        
               LTH=7                                                            
         MFLD  AKSOWT10,                                               +        
               LTH=1                                                            
         MFLD  AKSOW10,                                                +        
               LTH=8                                                            
         MFLD  AKST10,                                                 +        
               LTH=1                                                            
         MFLD  AKS10,                                                  +        
               LTH=8                                                            
         MFLD  EFRST10,                                                +        
               LTH=1                                                            
         MFLD  EFRS10,                                                 +        
               LTH=8                                                            
         MFLD  LST10,                                                  +        
               LTH=1                                                            
         MFLD  LS10,                                                   +        
               LTH=8                                                            
         MFLD  CMD11,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DC11,                                                   +        
               LTH=2                                                            
         MFLD  HUVTYP11,                                               +        
               LTH=4                                                            
         MFLD  SUBTYP11,                                               +        
               LTH=3                                                            
         MFLD  DATE11,                                                 +        
               LTH=6                                                            
         MFLD  CHANGE11,                                               +        
               LTH=7                                                            
         MFLD  AKSOWT11,                                               +        
               LTH=1                                                            
         MFLD  AKSOW11,                                                +        
               LTH=8                                                            
         MFLD  AKST11,                                                 +        
               LTH=1                                                            
         MFLD  AKS11,                                                  +        
               LTH=8                                                            
         MFLD  EFRST11,                                                +        
               LTH=1                                                            
         MFLD  EFRS11,                                                 +        
               LTH=8                                                            
         MFLD  LST11,                                                  +        
               LTH=1                                                            
         MFLD  LS11,                                                   +        
               LTH=8                                                            
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W5I162N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W5N162),                                           +        
               OPT=2,                                                  +        
               NXT=W5O162N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '51622',                                                +        
               LTH=5                                                            
         MFLD  (ARTNRIN,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R                                                           
         MFLD  ARTNRUT,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (DCIN,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R                                                           
         MFLD  DCUT,                                                   +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (HUVTYPIN,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R                                                           
         MFLD  HUVTYPUT,                                               +        
               LTH=4,                                                  +        
               FILL=X'40'                                                       
         MFLD  (SUBTYPIN,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R                                                           
         MFLD  SUBTYPUT,                                               +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DATFRIN,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R                                                           
         MFLD  DATFRUT,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (DATTOIN,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R                                                           
         MFLD  DATTOUT,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (BILDIN,                                                +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R                                                           
         MFLD  BILDUT,                                                 +        
               LTH=4,                                                  +        
               FILL=X'40'                                                       
         MFLD  (EXTRIND,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (CMD1,                                                  +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (CMD2,                                                  +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (CMD3,                                                  +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (CMD4,                                                  +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (CMD5,                                                  +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (CMD6,                                                  +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (CMD7,                                                  +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (CMD8,                                                  +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (CMD9,                                                  +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (CMD10,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (CMD11,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
