***********************************************************************         
* CREATED BY PCC6483   ON 00/09/12  AT 12:33                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W5N105   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W5T101  ',                                           +        
               2='W5T102  ',                                           +        
               3='W5T103  ',                                           +        
               4='W5T104  ',                                           +        
               5='W5T105  ',                                           +        
               6='W5T106  ',                                           +        
               7='W5T107  ',                                           +        
               8='W5T108  ',                                           +        
               9='W5T109  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W5T101  ',                                          +        
               14='W5T102  ',                                          +        
               15='W5T103  ',                                          +        
               16='W5T104  ',                                          +        
               17='W5T105  ',                                          +        
               18='W5T106  ',                                          +        
               19='W5T107  ',                                          +        
               20='W5T108  ',                                          +        
               21='W5T109  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'INVENTORY ADJUSTMENTS',                                +        
               POS=(1,11),LTH=21,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Part.no',                                              +        
               POS=(2,2),LTH=7,                                        +        
               ATTR=(NUM,PROT)                                                  
DGIA0002 DFLD  POS=(2,12),LTH=9,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Dc',                                                   +        
               POS=(2,41),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0008 DFLD  POS=(2,44),LTH=2,                                       +        
               ATTR=(NOPROT,MOD)                                                
DGIA0003 DFLD  POS=(3,12),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0009 DFLD  POS=(3,44),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0004 DFLD  POS=(4,2),LTH=6,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0006 DFLD  POS=(4,9),LTH=6,                                        +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         DFLD  'Cdc',                                                  +        
               POS=(4,17),LTH=3,                                       +        
               ATTR=(PROT)                                                      
DGIA0005 DFLD  POS=(4,25),LTH=6,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0007 DFLD  POS=(4,32),LTH=6,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         DFLD  'Misc. Dc',                                             +        
               POS=(4,54),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Date Type Quant  Date Type Quant',                     +        
               POS=(5,2),LTH=32,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Date Type Quant  Dc  Date  Type Quant   Dc',           +        
               POS=(5,39),LTH=42,                                      +        
               ATTR=(PROT)                                                      
DATCDC1  DFLD  POS=(6,2),LTH=5,                                        +        
               ATTR=(PROT)                                                      
TYPCDC1  DFLD  POS=(6,8),LTH=2,                                        +        
               ATTR=(NUM,PROT)                                                  
QTYCDC1  DFLD  POS=(6,11),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
DATCDC13 DFLD  POS=(6,19),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
TYPCDC13 DFLD  POS=(6,25),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
QTYCDC13 DFLD  POS=(6,28),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
DATSDC1  DFLD  POS=(6,39),LTH=5,                                       +        
               ATTR=(PROT)                                                      
TYPSDC1  DFLD  POS=(6,45),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
QTYSDC1  DFLD  POS=(6,48),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
IDDC1    DFLD  POS=(6,56),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DATSDC13 DFLD  POS=(6,60),LTH=5,                                       +        
               ATTR=(PROT)                                                      
TYPSDC13 DFLD  POS=(6,67),LTH=2,                                       +        
               ATTR=(PROT)                                                      
QTYSDC13 DFLD  POS=(6,70),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
IDDC13   DFLD  POS=(6,79),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DATCDC2  DFLD  POS=(7,2),LTH=5,                                        +        
               ATTR=(NUM,PROT)                                                  
TYPCDC2  DFLD  POS=(7,8),LTH=2,                                        +        
               ATTR=(NUM,PROT)                                                  
QTYCDC2  DFLD  POS=(7,11),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
DATCDC14 DFLD  POS=(7,19),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
TYPCDC14 DFLD  POS=(7,25),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
QTYCDC14 DFLD  POS=(7,28),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
DATSDC2  DFLD  POS=(7,39),LTH=5,                                       +        
               ATTR=(PROT)                                                      
TYPSDC2  DFLD  POS=(7,45),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
QTYSDC2  DFLD  POS=(7,48),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
IDDC2    DFLD  POS=(7,56),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DATSDC14 DFLD  POS=(7,60),LTH=5,                                       +        
               ATTR=(PROT)                                                      
TYPSDC14 DFLD  POS=(7,67),LTH=2,                                       +        
               ATTR=(PROT)                                                      
QTYSDC14 DFLD  POS=(7,70),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
IDDC14   DFLD  POS=(7,79),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DATCDC3  DFLD  POS=(8,2),LTH=5,                                        +        
               ATTR=(NUM,PROT)                                                  
TYPCDC3  DFLD  POS=(8,8),LTH=2,                                        +        
               ATTR=(NUM,PROT)                                                  
QTYCDC3  DFLD  POS=(8,11),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
DATCDC15 DFLD  POS=(8,19),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
TYPCDC15 DFLD  POS=(8,25),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
QTYCDC15 DFLD  POS=(8,28),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
DATSDC3  DFLD  POS=(8,39),LTH=5,                                       +        
               ATTR=(PROT)                                                      
TYPSDC3  DFLD  POS=(8,45),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
QTYSDC3  DFLD  POS=(8,48),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
IDDC3    DFLD  POS=(8,56),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DATSDC15 DFLD  POS=(8,60),LTH=5,                                       +        
               ATTR=(PROT)                                                      
TYPSDC15 DFLD  POS=(8,67),LTH=2,                                       +        
               ATTR=(PROT)                                                      
QTYSDC15 DFLD  POS=(8,70),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
IDDC15   DFLD  POS=(8,79),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DATCDC4  DFLD  POS=(9,2),LTH=5,                                        +        
               ATTR=(NUM,PROT)                                                  
TYPCDC4  DFLD  POS=(9,8),LTH=2,                                        +        
               ATTR=(NUM,PROT)                                                  
QTYCDC4  DFLD  POS=(9,11),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
DATCDC16 DFLD  POS=(9,19),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
TYPCDC16 DFLD  POS=(9,25),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
QTYCDC16 DFLD  POS=(9,28),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
DATSDC4  DFLD  POS=(9,39),LTH=5,                                       +        
               ATTR=(PROT)                                                      
TYPSDC4  DFLD  POS=(9,45),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
QTYSDC4  DFLD  POS=(9,48),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
IDDC4    DFLD  POS=(9,56),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DATSDC16 DFLD  POS=(9,60),LTH=5,                                       +        
               ATTR=(PROT)                                                      
TYPSDC16 DFLD  POS=(9,67),LTH=2,                                       +        
               ATTR=(PROT)                                                      
QTYSDC16 DFLD  POS=(9,70),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
IDDC16   DFLD  POS=(9,79),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DATCDC5  DFLD  POS=(10,2),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
TYPCDC5  DFLD  POS=(10,8),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
QTYCDC5  DFLD  POS=(10,11),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DATCDC17 DFLD  POS=(10,19),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
TYPCDC17 DFLD  POS=(10,25),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
QTYCDC17 DFLD  POS=(10,28),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DATSDC5  DFLD  POS=(10,39),LTH=5,                                      +        
               ATTR=(PROT)                                                      
TYPSDC5  DFLD  POS=(10,45),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
QTYSDC5  DFLD  POS=(10,48),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
IDDC5    DFLD  POS=(10,56),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DATSDC17 DFLD  POS=(10,60),LTH=5,                                      +        
               ATTR=(PROT)                                                      
TYPSDC17 DFLD  POS=(10,67),LTH=2,                                      +        
               ATTR=(PROT)                                                      
QTYSDC17 DFLD  POS=(10,70),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
IDDC17   DFLD  POS=(10,79),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DATCDC6  DFLD  POS=(11,2),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
TYPCDC6  DFLD  POS=(11,8),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
QTYCDC6  DFLD  POS=(11,11),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DATCDC18 DFLD  POS=(11,19),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
TYPCDC18 DFLD  POS=(11,25),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
QTYCDC18 DFLD  POS=(11,28),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DATSDC6  DFLD  POS=(11,39),LTH=5,                                      +        
               ATTR=(PROT)                                                      
TYPSDC6  DFLD  POS=(11,45),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
QTYSDC6  DFLD  POS=(11,48),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
IDDC6    DFLD  POS=(11,56),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DATSDC18 DFLD  POS=(11,60),LTH=5,                                      +        
               ATTR=(PROT)                                                      
TYPSDC18 DFLD  POS=(11,67),LTH=2,                                      +        
               ATTR=(PROT)                                                      
QTYSDC18 DFLD  POS=(11,70),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
IDDC18   DFLD  POS=(11,79),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DATCDC7  DFLD  POS=(12,2),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
TYPCDC7  DFLD  POS=(12,8),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
QTYCDC7  DFLD  POS=(12,11),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DATCDC19 DFLD  POS=(12,19),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
TYPCDC19 DFLD  POS=(12,25),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
QTYCDC19 DFLD  POS=(12,28),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DATSDC7  DFLD  POS=(12,39),LTH=5,                                      +        
               ATTR=(PROT)                                                      
TYPSDC7  DFLD  POS=(12,45),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
QTYSDC7  DFLD  POS=(12,48),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
IDDC7    DFLD  POS=(12,56),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DATSDC19 DFLD  POS=(12,60),LTH=5,                                      +        
               ATTR=(PROT)                                                      
TYPSDC19 DFLD  POS=(12,67),LTH=2,                                      +        
               ATTR=(PROT)                                                      
QTYSDC19 DFLD  POS=(12,70),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
IDDC19   DFLD  POS=(12,79),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DATCDC8  DFLD  POS=(13,2),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
TYPCDC8  DFLD  POS=(13,8),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
QTYCDC8  DFLD  POS=(13,11),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DATCDC20 DFLD  POS=(13,19),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
TYPCDC20 DFLD  POS=(13,25),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
QTYCDC20 DFLD  POS=(13,28),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DATSDC8  DFLD  POS=(13,39),LTH=5,                                      +        
               ATTR=(PROT)                                                      
TYPSDC8  DFLD  POS=(13,45),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
QTYSDC8  DFLD  POS=(13,48),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
IDDC8    DFLD  POS=(13,56),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DATSDC20 DFLD  POS=(13,60),LTH=5,                                      +        
               ATTR=(PROT)                                                      
TYPSDC20 DFLD  POS=(13,67),LTH=2,                                      +        
               ATTR=(PROT)                                                      
QTYSDC20 DFLD  POS=(13,70),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
IDDC20   DFLD  POS=(13,79),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DATCDC9  DFLD  POS=(14,2),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
TYPCDC9  DFLD  POS=(14,8),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
QTYCDC9  DFLD  POS=(14,11),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DATCDC21 DFLD  POS=(14,19),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
TYPCDC21 DFLD  POS=(14,25),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
QTYCDC21 DFLD  POS=(14,28),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DATSDC9  DFLD  POS=(14,39),LTH=5,                                      +        
               ATTR=(PROT)                                                      
TYPSDC9  DFLD  POS=(14,45),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
QTYSDC9  DFLD  POS=(14,48),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
IDDC9    DFLD  POS=(14,56),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DATSDC21 DFLD  POS=(14,60),LTH=5,                                      +        
               ATTR=(PROT)                                                      
TYPSDC21 DFLD  POS=(14,67),LTH=2,                                      +        
               ATTR=(PROT)                                                      
QTYSDC21 DFLD  POS=(14,70),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
IDDC21   DFLD  POS=(14,79),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DATCDC10 DFLD  POS=(15,2),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
TYPCDC10 DFLD  POS=(15,8),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
QTYCDC10 DFLD  POS=(15,11),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DATCDC22 DFLD  POS=(15,19),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
TYPCDC22 DFLD  POS=(15,25),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
QTYCDC22 DFLD  POS=(15,28),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DATSDC10 DFLD  POS=(15,39),LTH=5,                                      +        
               ATTR=(PROT)                                                      
TYPSDC10 DFLD  POS=(15,45),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
QTYSDC10 DFLD  POS=(15,48),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
IDDC10   DFLD  POS=(15,56),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DATSDC22 DFLD  POS=(15,60),LTH=5,                                      +        
               ATTR=(PROT)                                                      
TYPSDC22 DFLD  POS=(15,67),LTH=2,                                      +        
               ATTR=(PROT)                                                      
QTYSDC22 DFLD  POS=(15,70),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
IDDC22   DFLD  POS=(15,79),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DATCDC11 DFLD  POS=(16,2),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
TYPCDC11 DFLD  POS=(16,8),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
QTYCDC11 DFLD  POS=(16,11),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DATCDC23 DFLD  POS=(16,19),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
TYPCDC23 DFLD  POS=(16,25),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
QTYCDC23 DFLD  POS=(16,28),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DATSDC11 DFLD  POS=(16,39),LTH=5,                                      +        
               ATTR=(PROT)                                                      
TYPSDC11 DFLD  POS=(16,45),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
QTYSDC11 DFLD  POS=(16,48),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
IDDC11   DFLD  POS=(16,56),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DATSDC23 DFLD  POS=(16,60),LTH=5,                                      +        
               ATTR=(PROT)                                                      
TYPSDC23 DFLD  POS=(16,67),LTH=2,                                      +        
               ATTR=(PROT)                                                      
QTYSDC23 DFLD  POS=(16,70),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
IDDC23   DFLD  POS=(16,79),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DATCDC12 DFLD  POS=(17,2),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
TYPCDC12 DFLD  POS=(17,8),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
QTYCDC12 DFLD  POS=(17,11),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DATCDC24 DFLD  POS=(17,19),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
TYPCDC24 DFLD  POS=(17,25),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
QTYCDC24 DFLD  POS=(17,28),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DATSDC12 DFLD  POS=(17,39),LTH=5,                                      +        
               ATTR=(PROT)                                                      
TYPSDC12 DFLD  POS=(17,45),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
QTYSDC12 DFLD  POS=(17,48),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
IDDC12   DFLD  POS=(17,56),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DATSDC24 DFLD  POS=(17,60),LTH=5,                                      +        
               ATTR=(PROT)                                                      
TYPSDC24 DFLD  POS=(17,67),LTH=2,                                      +        
               ATTR=(PROT)                                                      
QTYSDC24 DFLD  POS=(17,70),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
IDDC24   DFLD  POS=(17,79),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Net adjust (ex type 6) CDC',                           +        
               POS=(19,2),LTH=26,                                      +        
               ATTR=(PROT)                                                      
DGIA0000 DFLD  POS=(19,29),LTH=10,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Net adjust (ex type 6) Misc.',                         +        
               POS=(19,42),LTH=28,                                     +        
               ATTR=(PROT)                                                      
DGIA0001 DFLD  POS=(19,71),LTH=10,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '1 Stockt. info  2 Stock Account 3 Info-Central  4 Price+        
               -order  5 Old adjustm.',                                +        
               POS=(21,2),LTH=77,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '6 Adjustm. O-L  7 Del. info',                          +        
               POS=(22,2),LTH=27,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '8 Upd. Inv.bal.  9 Fict. clear. 10 WHELP',             +        
               POS=(22,34),LTH=40,                                     +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE4    DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W5O105N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W5N105,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W5I105N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DGIA0002,                                               +        
               LTH=9                                                            
         MFLD  DGIA0003,                                               +        
               LTH=9                                                            
         MFLD  DGIA0008,                                               +        
               LTH=2                                                            
         MFLD  DGIA0009,                                               +        
               LTH=2                                                            
         MFLD  DGIA0004,                                               +        
               LTH=6                                                            
         MFLD  DGIA0006,                                               +        
               LTH=6                                                            
         MFLD  DGIA0005,                                               +        
               LTH=6                                                            
         MFLD  DGIA0007,                                               +        
               LTH=6                                                            
         MFLD  DATCDC1,                                                +        
               LTH=5                                                            
         MFLD  TYPCDC1,                                                +        
               LTH=2                                                            
         MFLD  QTYCDC1,                                                +        
               LTH=7                                                            
         MFLD  DATCDC13,                                               +        
               LTH=5                                                            
         MFLD  TYPCDC13,                                               +        
               LTH=2                                                            
         MFLD  QTYCDC13,                                               +        
               LTH=7                                                            
         MFLD  DATSDC1,                                                +        
               LTH=5                                                            
         MFLD  TYPSDC1,                                                +        
               LTH=2                                                            
         MFLD  QTYSDC1,                                                +        
               LTH=7                                                            
         MFLD  IDDC1,                                                  +        
               LTH=2                                                            
         MFLD  DATSDC13,                                               +        
               LTH=5                                                            
         MFLD  TYPSDC13,                                               +        
               LTH=2                                                            
         MFLD  QTYSDC13,                                               +        
               LTH=7                                                            
         MFLD  IDDC13,                                                 +        
               LTH=2                                                            
         MFLD  DATCDC2,                                                +        
               LTH=5                                                            
         MFLD  TYPCDC2,                                                +        
               LTH=2                                                            
         MFLD  QTYCDC2,                                                +        
               LTH=7                                                            
         MFLD  DATCDC14,                                               +        
               LTH=5                                                            
         MFLD  TYPCDC14,                                               +        
               LTH=2                                                            
         MFLD  QTYCDC14,                                               +        
               LTH=7                                                            
         MFLD  DATSDC2,                                                +        
               LTH=5                                                            
         MFLD  TYPSDC2,                                                +        
               LTH=2                                                            
         MFLD  QTYSDC2,                                                +        
               LTH=7                                                            
         MFLD  IDDC2,                                                  +        
               LTH=2                                                            
         MFLD  DATSDC14,                                               +        
               LTH=5                                                            
         MFLD  TYPSDC14,                                               +        
               LTH=2                                                            
         MFLD  QTYSDC14,                                               +        
               LTH=7                                                            
         MFLD  IDDC14,                                                 +        
               LTH=2                                                            
         MFLD  DATCDC3,                                                +        
               LTH=5                                                            
         MFLD  TYPCDC3,                                                +        
               LTH=2                                                            
         MFLD  QTYCDC3,                                                +        
               LTH=7                                                            
         MFLD  DATCDC15,                                               +        
               LTH=5                                                            
         MFLD  TYPCDC15,                                               +        
               LTH=2                                                            
         MFLD  QTYCDC15,                                               +        
               LTH=7                                                            
         MFLD  DATSDC3,                                                +        
               LTH=5                                                            
         MFLD  TYPSDC3,                                                +        
               LTH=2                                                            
         MFLD  QTYSDC3,                                                +        
               LTH=7                                                            
         MFLD  IDDC3,                                                  +        
               LTH=2                                                            
         MFLD  DATSDC15,                                               +        
               LTH=5                                                            
         MFLD  TYPSDC15,                                               +        
               LTH=2                                                            
         MFLD  QTYSDC15,                                               +        
               LTH=7                                                            
         MFLD  IDDC15,                                                 +        
               LTH=2                                                            
         MFLD  DATCDC4,                                                +        
               LTH=5                                                            
         MFLD  TYPCDC4,                                                +        
               LTH=2                                                            
         MFLD  QTYCDC4,                                                +        
               LTH=7                                                            
         MFLD  DATCDC16,                                               +        
               LTH=5                                                            
         MFLD  TYPCDC16,                                               +        
               LTH=2                                                            
         MFLD  QTYCDC16,                                               +        
               LTH=7                                                            
         MFLD  DATSDC4,                                                +        
               LTH=5                                                            
         MFLD  TYPSDC4,                                                +        
               LTH=2                                                            
         MFLD  QTYSDC4,                                                +        
               LTH=7                                                            
         MFLD  IDDC4,                                                  +        
               LTH=2                                                            
         MFLD  DATSDC16,                                               +        
               LTH=5                                                            
         MFLD  TYPSDC16,                                               +        
               LTH=2                                                            
         MFLD  QTYSDC16,                                               +        
               LTH=7                                                            
         MFLD  IDDC16,                                                 +        
               LTH=2                                                            
         MFLD  DATCDC5,                                                +        
               LTH=5                                                            
         MFLD  TYPCDC5,                                                +        
               LTH=2                                                            
         MFLD  QTYCDC5,                                                +        
               LTH=7                                                            
         MFLD  DATCDC17,                                               +        
               LTH=5                                                            
         MFLD  TYPCDC17,                                               +        
               LTH=2                                                            
         MFLD  QTYCDC17,                                               +        
               LTH=7                                                            
         MFLD  DATSDC5,                                                +        
               LTH=5                                                            
         MFLD  TYPSDC5,                                                +        
               LTH=2                                                            
         MFLD  QTYSDC5,                                                +        
               LTH=7                                                            
         MFLD  IDDC5,                                                  +        
               LTH=2                                                            
         MFLD  DATSDC17,                                               +        
               LTH=5                                                            
         MFLD  TYPSDC17,                                               +        
               LTH=2                                                            
         MFLD  QTYSDC17,                                               +        
               LTH=7                                                            
         MFLD  IDDC17,                                                 +        
               LTH=2                                                            
         MFLD  DATCDC6,                                                +        
               LTH=5                                                            
         MFLD  TYPCDC6,                                                +        
               LTH=2                                                            
         MFLD  QTYCDC6,                                                +        
               LTH=7                                                            
         MFLD  DATCDC18,                                               +        
               LTH=5                                                            
         MFLD  TYPCDC18,                                               +        
               LTH=2                                                            
         MFLD  QTYCDC18,                                               +        
               LTH=7                                                            
         MFLD  DATSDC6,                                                +        
               LTH=5                                                            
         MFLD  TYPSDC6,                                                +        
               LTH=2                                                            
         MFLD  QTYSDC6,                                                +        
               LTH=7                                                            
         MFLD  IDDC6,                                                  +        
               LTH=2                                                            
         MFLD  DATSDC18,                                               +        
               LTH=5                                                            
         MFLD  TYPSDC18,                                               +        
               LTH=2                                                            
         MFLD  QTYSDC18,                                               +        
               LTH=7                                                            
         MFLD  IDDC18,                                                 +        
               LTH=2                                                            
         MFLD  DATCDC7,                                                +        
               LTH=5                                                            
         MFLD  TYPCDC7,                                                +        
               LTH=2                                                            
         MFLD  QTYCDC7,                                                +        
               LTH=7                                                            
         MFLD  DATCDC19,                                               +        
               LTH=5                                                            
         MFLD  TYPCDC19,                                               +        
               LTH=2                                                            
         MFLD  QTYCDC19,                                               +        
               LTH=7                                                            
         MFLD  DATSDC7,                                                +        
               LTH=5                                                            
         MFLD  TYPSDC7,                                                +        
               LTH=2                                                            
         MFLD  QTYSDC7,                                                +        
               LTH=7                                                            
         MFLD  IDDC7,                                                  +        
               LTH=2                                                            
         MFLD  DATSDC19,                                               +        
               LTH=5                                                            
         MFLD  TYPSDC19,                                               +        
               LTH=2                                                            
         MFLD  QTYSDC19,                                               +        
               LTH=7                                                            
         MFLD  IDDC19,                                                 +        
               LTH=2                                                            
         MFLD  DATCDC8,                                                +        
               LTH=5                                                            
         MFLD  TYPCDC8,                                                +        
               LTH=2                                                            
         MFLD  QTYCDC8,                                                +        
               LTH=7                                                            
         MFLD  DATCDC20,                                               +        
               LTH=5                                                            
         MFLD  TYPCDC20,                                               +        
               LTH=2                                                            
         MFLD  QTYCDC20,                                               +        
               LTH=7                                                            
         MFLD  DATSDC8,                                                +        
               LTH=5                                                            
         MFLD  TYPSDC8,                                                +        
               LTH=2                                                            
         MFLD  QTYSDC8,                                                +        
               LTH=7                                                            
         MFLD  IDDC8,                                                  +        
               LTH=2                                                            
         MFLD  DATSDC20,                                               +        
               LTH=5                                                            
         MFLD  TYPSDC20,                                               +        
               LTH=2                                                            
         MFLD  QTYSDC20,                                               +        
               LTH=7                                                            
         MFLD  IDDC20,                                                 +        
               LTH=2                                                            
         MFLD  DATCDC9,                                                +        
               LTH=5                                                            
         MFLD  TYPCDC9,                                                +        
               LTH=2                                                            
         MFLD  QTYCDC9,                                                +        
               LTH=7                                                            
         MFLD  DATCDC21,                                               +        
               LTH=5                                                            
         MFLD  TYPCDC21,                                               +        
               LTH=2                                                            
         MFLD  QTYCDC21,                                               +        
               LTH=7                                                            
         MFLD  DATSDC9,                                                +        
               LTH=5                                                            
         MFLD  TYPSDC9,                                                +        
               LTH=2                                                            
         MFLD  QTYSDC9,                                                +        
               LTH=7                                                            
         MFLD  IDDC9,                                                  +        
               LTH=2                                                            
         MFLD  DATSDC21,                                               +        
               LTH=5                                                            
         MFLD  TYPSDC21,                                               +        
               LTH=2                                                            
         MFLD  QTYSDC21,                                               +        
               LTH=7                                                            
         MFLD  IDDC21,                                                 +        
               LTH=2                                                            
         MFLD  DATCDC10,                                               +        
               LTH=5                                                            
         MFLD  TYPCDC10,                                               +        
               LTH=2                                                            
         MFLD  QTYCDC10,                                               +        
               LTH=7                                                            
         MFLD  DATCDC22,                                               +        
               LTH=5                                                            
         MFLD  TYPCDC22,                                               +        
               LTH=2                                                            
         MFLD  QTYCDC22,                                               +        
               LTH=7                                                            
         MFLD  DATSDC10,                                               +        
               LTH=5                                                            
         MFLD  TYPSDC10,                                               +        
               LTH=2                                                            
         MFLD  QTYSDC10,                                               +        
               LTH=7                                                            
         MFLD  IDDC10,                                                 +        
               LTH=2                                                            
         MFLD  DATSDC22,                                               +        
               LTH=5                                                            
         MFLD  TYPSDC22,                                               +        
               LTH=2                                                            
         MFLD  QTYSDC22,                                               +        
               LTH=7                                                            
         MFLD  IDDC22,                                                 +        
               LTH=2                                                            
         MFLD  DATCDC11,                                               +        
               LTH=5                                                            
         MFLD  TYPCDC11,                                               +        
               LTH=2                                                            
         MFLD  QTYCDC11,                                               +        
               LTH=7                                                            
         MFLD  DATCDC23,                                               +        
               LTH=5                                                            
         MFLD  TYPCDC23,                                               +        
               LTH=2                                                            
         MFLD  QTYCDC23,                                               +        
               LTH=7                                                            
         MFLD  DATSDC11,                                               +        
               LTH=5                                                            
         MFLD  TYPSDC11,                                               +        
               LTH=2                                                            
         MFLD  QTYSDC11,                                               +        
               LTH=7                                                            
         MFLD  IDDC11,                                                 +        
               LTH=2                                                            
         MFLD  DATSDC23,                                               +        
               LTH=5                                                            
         MFLD  TYPSDC23,                                               +        
               LTH=2                                                            
         MFLD  QTYSDC23,                                               +        
               LTH=7                                                            
         MFLD  IDDC23,                                                 +        
               LTH=2                                                            
         MFLD  DATCDC12,                                               +        
               LTH=5                                                            
         MFLD  TYPCDC12,                                               +        
               LTH=2                                                            
         MFLD  QTYCDC12,                                               +        
               LTH=7                                                            
         MFLD  DATCDC24,                                               +        
               LTH=5                                                            
         MFLD  TYPCDC24,                                               +        
               LTH=2                                                            
         MFLD  QTYCDC24,                                               +        
               LTH=7                                                            
         MFLD  DATSDC12,                                               +        
               LTH=5                                                            
         MFLD  TYPSDC12,                                               +        
               LTH=2                                                            
         MFLD  QTYSDC12,                                               +        
               LTH=7                                                            
         MFLD  IDDC12,                                                 +        
               LTH=2                                                            
         MFLD  DATSDC24,                                               +        
               LTH=5                                                            
         MFLD  TYPSDC24,                                               +        
               LTH=2                                                            
         MFLD  QTYSDC24,                                               +        
               LTH=7                                                            
         MFLD  IDDC24,                                                 +        
               LTH=2                                                            
         MFLD  DGIA0000,                                               +        
               LTH=10                                                           
         MFLD  DGIA0001,                                               +        
               LTH=10                                                           
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE4,                                                 +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  FSYSMSG,                                                +        
               LTH=1                                                            
         MSGEND                                                                 
W5I105N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W5N105),                                           +        
               OPT=2,                                                  +        
               NXT=W5O105N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '51052',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0002,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0003,                                               +        
               LTH=9,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DGIA0008,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0009,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0004,                                               +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0006,                                               +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0005,                                               +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0007,                                               +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
