***********************************************************************         
* CREATED BY PC59009   ON 98/08/22  AT 14:33                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'SUBTITUTE A SPARE PART IN A EXCH'                               
W5N151   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W5T151U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,19)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'CHANGE OF STD.TO EXCHANGE PART',                       +        
               POS=(1,10),LTH=30,                                      +        
               ATTR=(NUM,PROT)                                                  
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'FROM PART NO:',                                        +        
               POS=(2,2),LTH=13,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0000 DFLD  POS=(2,19),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'TO PART NO:',                                          +        
               POS=(2,31),LTH=11,                                      +        
               ATTR=(PROT)                                                      
DGIA0001 DFLD  POS=(2,47),LTH=9,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'DC',                                                   +        
               POS=(2,58),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DCIN     DFLD  POS=(2,61),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0002 DFLD  POS=(3,19),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0003 DFLD  POS=(3,47),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
DCOUT    DFLD  POS=(3,61),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'FROM DESCRIPTION',                                     +        
               POS=(5,2),LTH=16,                                       +        
               ATTR=(PROT)                                                      
DGIA0004 DFLD  POS=(5,19),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'TO   DESCRIPTION',                                     +        
               POS=(6,2),LTH=16,                                       +        
               ATTR=(PROT)                                                      
DGIA0009 DFLD  POS=(6,19),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'FROM BALANCE',                                         +        
               POS=(8,10),LTH=12,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'TO BALANCE',                                           +        
               POS=(8,28),LTH=10,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'BEFORE:',                                              +        
               POS=(9,2),LTH=7,                                        +        
               ATTR=(PROT)                                                      
DGIA0006 DFLD  POS=(9,13),LTH=7,                                       +        
               ATTR=(PROT)                                                      
DGIA0008 DFLD  POS=(9,29),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'AFTER :',                                              +        
               POS=(10,2),LTH=7,                                       +        
               ATTR=(PROT)                                                      
DGIA0005 DFLD  POS=(10,13),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0007 DFLD  POS=(10,29),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'QUANTITY    ADVICE NO',                                +        
               POS=(12,2),LTH=21,                                      +        
               ATTR=(PROT)                                                      
KVANTAL  DFLD  POS=(13,2),LTH=6,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDAVINR  DFLD  POS=(13,14),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'ACCOUNT NO  ANALYSIS NO',                              +        
               POS=(14,2),LTH=23,                                      +        
               ATTR=(PROT)                                                      
IDKONTO  DFLD  POS=(15,2),LTH=10,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
ANALYSNR DFLD  POS=(15,14),LTH=12,                                     +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  '13 EXCHANGE PART',                                     +        
               POS=(21,2),LTH=16,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLDDATE  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
FLDTIME  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W5I151N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W5N151),                                           +        
               OPT=2,                                                  +        
               NXT=W5O151N1                                                     
MID      LPAGE SOR=(FORMAT),                                           +        
               NXT=W5O151N1                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '51512',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0000,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0002,                                               +        
               LTH=9                                                            
         MFLD  (DGIA0001,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0003,                                               +        
               LTH=9                                                            
         MFLD  (DCIN,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  DCOUT,                                                  +        
               LTH=2                                                            
         MFLD  (KVANTAL,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDAVINR,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDKONTO,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANALYSNR,                                              +        
               '++++++++++++'),                                        +        
               LTH=12,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
W5O151N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W5N151,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W5I151N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT,                                             +        
               NXT=W5I151N1                                                     
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DGIA0000,                                               +        
               LTH=9                                                            
         MFLD  DGIA0002,                                               +        
               LTH=9                                                            
         MFLD  DGIA0001,                                               +        
               LTH=9                                                            
         MFLD  DGIA0003,                                               +        
               LTH=9                                                            
         MFLD  DCIN,                                                   +        
               LTH=2                                                            
         MFLD  DCOUT,                                                  +        
               LTH=2                                                            
         MFLD  DGIA0004,                                               +        
               LTH=25                                                           
         MFLD  DGIA0009,                                               +        
               LTH=25                                                           
         MFLD  DGIA0006,                                               +        
               LTH=7                                                            
         MFLD  DGIA0008,                                               +        
               LTH=7                                                            
         MFLD  DGIA0005,                                               +        
               LTH=7                                                            
         MFLD  DGIA0007,                                               +        
               LTH=7                                                            
         MFLD  KVANTAL,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDAVINR,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKONTO,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ANALYSNR,                                               +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLDDATE,                                               +        
               DATE4)                                                           
         MFLD  (FLDTIME,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
