***********************************************************************         
* CREATED BY V059625   ON 08/06/02  AT 14:33                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'INLEVERANS, konteringsinfo      '                               
W5N197   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((1,2)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'DELIVERY - ACCOUNTINFO.',                              +        
               POS=(1,11),LTH=23,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,39),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Part no',                                              +        
               POS=(3,2),LTH=7,                                        +        
               ATTR=(PROT)                                                      
ARTNR    DFLD  POS=(3,13),LTH=9,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'DC',                                                   +        
               POS=(3,24),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DC       DFLD  POS=(3,27),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Pt   Currno  Date   Sup At Deldat Shipm no',           +        
               POS=(8,3),LTH=42,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Account  Analysis no Costc',                           +        
               POS=(8,50),LTH=26,                                      +        
               ATTR=(PROT)                                                      
PTYP     DFLD  POS=(9,2),LTH=3,                                        +        
               ATTR=(PROT)                                                      
LOPNR    DFLD  POS=(9,6),LTH=8,                                        +        
               ATTR=(NUM,PROT)                                                  
DAT      DFLD  POS=(9,15),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
LEV      DFLD  POS=(9,21),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
RTYP     DFLD  POS=(9,27),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
AVSDAT   DFLD  POS=(9,30),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
IDSHIPM  DFLD  POS=(9,38),LTH=7,                                       +        
               ATTR=(PROT)                                                      
IDKONTO  DFLD  POS=(9,47),LTH=10,                                      +        
               ATTR=(PROT)                                                      
ANALYS1  DFLD  POS=(9,58),LTH=12,                                      +        
               ATTR=(NUM,PROT)                                                  
KST1     DFLD  POS=(9,71),LTH=10,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Pt Distr',                                             +        
               POS=(11,3),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Sup   Order    Prod   Invoice',                        +        
               POS=(11,16),LTH=29,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Account  Analysis no CostC',                           +        
               POS=(11,50),LTH=26,                                     +        
               ATTR=(PROT)                                                      
PTYP2    DFLD  POS=(12,2),LTH=3,                                       +        
               ATTR=(PROT)                                                      
IDDISTR  DFLD  POS=(12,6),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
IDKUNDNR DFLD  POS=(12,12),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
IDORDER  DFLD  POS=(12,20),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
IDPRODNR DFLD  POS=(12,28),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
IDFAKT   DFLD  POS=(12,38),LTH=7,                                      +        
               ATTR=(PROT)                                                      
IDKONTO2 DFLD  POS=(12,47),LTH=10,                                     +        
               ATTR=(PROT)                                                      
ANALYS2  DFLD  POS=(12,58),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
IDKST2   DFLD  POS=(12,71),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
FLD2302  DFLD  POS=(22,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(22,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(22,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(22,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(23,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W5O197N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W5N197,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W5I197N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  ARTNR,                                                  +        
               LTH=9                                                            
         MFLD  DC,                                                     +        
               LTH=2                                                            
         MFLD  PTYP,                                                   +        
               LTH=3                                                            
         MFLD  LOPNR,                                                  +        
               LTH=8                                                            
         MFLD  DAT,                                                    +        
               LTH=5                                                            
         MFLD  LEV,                                                    +        
               LTH=5                                                            
         MFLD  RTYP,                                                   +        
               LTH=2                                                            
         MFLD  AVSDAT,                                                 +        
               LTH=6                                                            
         MFLD  IDSHIPM,                                                +        
               LTH=7                                                            
         MFLD  IDKONTO,                                                +        
               LTH=10                                                           
         MFLD  ANALYS1,                                                +        
               LTH=12                                                           
         MFLD  KST1,                                                   +        
               LTH=10                                                           
         MFLD  PTYP2,                                                  +        
               LTH=3                                                            
         MFLD  IDDISTR,                                                +        
               LTH=5                                                            
         MFLD  IDKUNDNR,                                               +        
               LTH=7                                                            
         MFLD  IDORDER,                                                +        
               LTH=7                                                            
         MFLD  IDPRODNR,                                               +        
               LTH=7                                                            
         MFLD  IDFAKT,                                                 +        
               LTH=7                                                            
         MFLD  IDKONTO2,                                               +        
               LTH=10                                                           
         MFLD  ANALYS2,                                                +        
               LTH=12                                                           
         MFLD  IDKST2,                                                 +        
               LTH=10                                                           
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W5I197N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W5N197),                                           +        
               OPT=2,                                                  +        
               NXT=W5O197N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F9'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '51972',                                                +        
               LTH=5                                                            
         MFLD  ARTNR,                                                  +        
               LTH=9                                                            
         MFLD  DC,                                                     +        
               LTH=2                                                            
         MFLD  PTYP,                                                   +        
               LTH=3                                                            
         MFLD  LOPNR,                                                  +        
               LTH=8                                                            
         MFLD  DAT,                                                    +        
               LTH=6                                                            
         MFLD  LEV,                                                    +        
               LTH=5                                                            
         MFLD  RTYP,                                                   +        
               LTH=2                                                            
         MFLD  AVSDAT,                                                 +        
               LTH=6                                                            
         MFLD  IDKONTO,                                                +        
               LTH=10                                                           
         MFLD  ANALYS1,                                                +        
               LTH=12                                                           
         MFLD  KST1,                                                   +        
               LTH=10                                                           
         MFLD  PTYP2,                                                  +        
               LTH=3                                                            
         MFLD  IDDISTR,                                                +        
               LTH=5                                                            
         MFLD  IDKUNDNR,                                               +        
               LTH=7                                                            
         MFLD  IDORDER,                                                +        
               LTH=7                                                            
         MFLD  IDPRODNR,                                               +        
               LTH=7                                                            
         MFLD  IDFAKT,                                                 +        
               LTH=7                                                            
         MFLD  IDKONTO2,                                               +        
               LTH=10                                                           
         MFLD  ANALYS2,                                                +        
               LTH=12                                                           
         MFLD  IDKST2,                                                 +        
               LTH=10                                                           
         MSGEND                                                                 
         END                                                                    
