***********************************************************************         
* CREATED BY V0C1505   ON 09/09/15  AT 16:52                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'STD PRICE PROCESS PARAMETERS    '                               
W5N145   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W5T145U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W5T145  ',                                          +        
               14='W5T146  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((5,49)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'STD PRICE PROCESS PARAMETERS',                         +        
               POS=(1,11),LTH=28,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'CC',                                                   +        
               POS=(2,72),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0375  DFLD  POS=(3,75),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Inflation factor for packaging',                       +        
               POS=(5,2),LTH=30,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'New value(%)',                                         +        
               POS=(5,33),LTH=12,                                      +        
               ATTR=(PROT)                                                      
FLD0549  DFLD  POS=(5,49),LTH=6,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Actual value(%)',                                      +        
               POS=(6,30),LTH=15,                                      +        
               ATTR=(PROT)                                                      
FLD0649  DFLD  POS=(6,49),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Stock value change valid interval new value(MSEK)',    +        
               POS=(8,2),LTH=49,                                       +        
               ATTR=(PROT)                                                      
FLD0855  DFLD  POS=(8,55),LTH=6,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  '-',                                                    +        
               POS=(8,62),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0864  DFLD  POS=(8,64),LTH=6,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Actual value(MSEK)',                                   +        
               POS=(9,33),LTH=18,                                      +        
               ATTR=(PROT)                                                      
FLD0955  DFLD  POS=(9,55),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '-',                                                    +        
               POS=(9,62),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0964  DFLD  POS=(9,64),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Changed by',                                           +        
               POS=(13,60),LTH=10,                                     +        
               ATTR=(PROT)                                                      
FLD1371  DFLD  POS=(13,71),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Change date',                                          +        
               POS=(14,60),LTH=11,                                     +        
               ATTR=(PROT)                                                      
FLD1472  DFLD  POS=(14,72),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '13',                                                   +        
               POS=(21,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '14',                                                   +        
               POS=(21,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15',                                                   +        
               POS=(21,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10',                                                   +        
               POS=(22,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W5O145N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W5N145,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W5I145N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  FLD0375,                                                +        
               LTH=2                                                            
         MFLD  FLD0549,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0649,                                                +        
               LTH=6                                                            
         MFLD  FLD0855,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0864,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0955,                                                +        
               LTH=6                                                            
         MFLD  FLD0964,                                                +        
               LTH=6                                                            
         MFLD  FLD1371,                                                +        
               LTH=8                                                            
         MFLD  FLD1472,                                                +        
               LTH=6                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W5I145N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W5N145),                                           +        
               OPT=2,                                                  +        
               NXT=W5O145N1                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '51452',                                                +        
               LTH=5                                                            
         MFLD  (FLD0549,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0855,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0864,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
