***********************************************************************         
* CREATED BY PCC6483   ON 00/12/05  AT 07:23                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'Ordernr/Distrikt-Kund ny/ändr.  '                               
W5N222   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W5T222U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,10)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'ORDERNO/DISTRICT-CUSTOMER R3',                         +        
               POS=(1,10),LTH=28,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Account',                                              +        
               POS=(2,2),LTH=7,                                        +        
               ATTR=(ALPHA,PROT)                                                
KONTOIN  DFLD  POS=(2,10),LTH=10,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Profit center',                                        +        
               POS=(2,22),LTH=13,                                      +        
               ATTR=(PROT)                                                      
PRCTRIN  DFLD  POS=(2,36),LTH=10,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'CC',                                                   +        
               POS=(2,77),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KONTOUT  DFLD  POS=(3,10),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
PRCTRUT  DFLD  POS=(3,36),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
IDFTGUT  DFLD  POS=(3,77),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Orderno or District-Customer',                         +        
               POS=(5,2),LTH=28,                                       +        
               ATTR=(PROT)                                                      
ANALYSNR DFLD  POS=(5,31),LTH=12,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'F10=WHELP F11=INSERT/UPDATE',                          +        
               POS=(22,2),LTH=27,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  '    ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W5O222N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W5N222,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W5I222N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  KONTOIN,                                                +        
               LTH=2                                                            
         MFLD  KONTOUT,                                                +        
               LTH=10                                                           
         MFLD  PRCTRIN,                                                +        
               LTH=2                                                            
         MFLD  PRCTRUT,                                                +        
               LTH=10                                                           
         MFLD  IDFTGUT,                                                +        
               LTH=2                                                            
         MFLD  ANALYSNR,                                               +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W5I222N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W5N222),                                           +        
               OPT=2,                                                  +        
               NXT=W5O222N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '52222',                                                +        
               LTH=5                                                            
         MFLD  (KONTOIN,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R                                                           
         MFLD  (PRCTRIN,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L                                                           
         MFLD  (ANALYSNR,                                              +        
               '++++++++++++'),                                        +        
               LTH=12,                                                 +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
