***********************************************************************         
* CREATED BY TIN2681   ON 12/20/11  AT 14:53                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'INVENTORY VALUE, ACCOUNTING     '                               
W5N205   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W5T205 7',                                           +        
               8='W5T205 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W5T205U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W5T205U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W5N205   DPAGE CURSOR=((2,11)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Inventory value, Accounting',                          +        
               POS=(1,12),LTH=27,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Part No.',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(NUM,PROT)                                                  
IDARTNRI DFLD  POS=(2,11),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,22),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
IDDCI    DFLD  POS=(2,25),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'CC',                                                   +        
               POS=(2,72),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
IDARTNRU DFLD  POS=(3,11),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDCU    DFLD  POS=(3,25),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
IDFTGU   DFLD  POS=(3,75),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Descr',                                                +        
               POS=(5,2),LTH=5,                                        +        
               ATTR=(PROT)                                                      
TEXTBEAR DFLD  POS=(5,8),LTH=25,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Fg',                                                   +        
               POS=(5,36),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDFKNGRP DFLD  POS=(5,39),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'PG',                                                   +        
               POS=(5,46),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KDPRODSL DFLD  POS=(5,49),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Lpc',                                                  +        
               POS=(5,56),LTH=3,                                       +        
               ATTR=(PROT)                                                      
KDPSLLOK DFLD  POS=(5,60),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'DC',                                                   +        
               POS=(7,2),LTH=2,                                        +        
               ATTR=(PROT)                                                      
IDDC01   DFLD  POS=(7,32),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Matrl pr SEK',                                         +        
               POS=(7,36),LTH=12,                                      +        
               ATTR=(PROT)                                                      
PRMTRL01 DFLD  POS=(7,49),LTH=10,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'In transit q.',                                        +        
               POS=(8,2),LTH=13,                                       +        
               ATTR=(PROT)                                                      
KVKPAV01 DFLD  POS=(8,26),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Not yet binned q.',                                    +        
               POS=(9,2),LTH=17,                                       +        
               ATTR=(PROT)                                                      
KVKSDC01 DFLD  POS=(9,26),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'On hand q.',                                           +        
               POS=(10,2),LTH=10,                                      +        
               ATTR=(PROT)                                                      
KVLS01   DFLD  POS=(10,26),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Pending for inv. q.',                                  +        
               POS=(11,2),LTH=19,                                      +        
               ATTR=(PROT)                                                      
KVEFRS01 DFLD  POS=(11,26),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Investigative q.',                                     +        
               POS=(12,2),LTH=16,                                      +        
               ATTR=(PROT)                                                      
KVUTRS01 DFLD  POS=(12,26),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Average cost',                                         +        
               POS=(13,2),LTH=12,                                      +        
               ATTR=(PROT)                                                      
PRVCST01 DFLD  POS=(13,24),LTH=10,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Inventory value ',                                     +        
               POS=(14,2),LTH=16,                                      +        
               ATTR=(PROT)                                                      
SUAVCS01 DFLD  POS=(14,22),LTH=12,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Vendorno.',                                            +        
               POS=(15,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
IDLVNR01 DFLD  POS=(15,29),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Vendor inv. price',                                    +        
               POS=(16,2),LTH=17,                                      +        
               ATTR=(PROT)                                                      
PRARTB01 DFLD  POS=(16,20),LTH=14,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Exchange rate',                                        +        
               POS=(17,2),LTH=13,                                      +        
               ATTR=(PROT)                                                      
PRKURS01 DFLD  POS=(17,22),LTH=12,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Cost local curr',                                      +        
               POS=(18,2),LTH=15,                                      +        
               ATTR=(PROT)                                                      
PRARTB02 DFLD  POS=(18,23),LTH=11,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Max retail price',                                     +        
               POS=(19,2),LTH=16,                                      +        
               ATTR=(PROT)                                                      
PRMRP    DFLD  POS=(19,22),LTH=12,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '1',                                                    +        
               POS=(21,2),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '2',                                                    +        
               POS=(21,18),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '3',                                                    +        
               POS=(21,34),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '4',                                                    +        
               POS=(21,50),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '5',                                                    +        
               POS=(21,66),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '6',                                                    +        
               POS=(22,2),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '7',                                                    +        
               POS=(22,18),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '8',                                                    +        
               POS=(22,34),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '9',                                                    +        
               POS=(22,50),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10',                                                   +        
               POS=(22,65),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W5O205N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W5N205,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W5I205N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W5N205                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  IDARTNRI,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDARTNRU,                                               +        
               LTH=9                                                            
         MFLD  IDDCI,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDDCU,                                                  +        
               LTH=2                                                            
         MFLD  IDFTGU,                                                 +        
               LTH=2                                                            
         MFLD  TEXTBEAR,                                               +        
               LTH=25                                                           
         MFLD  IDFKNGRP,                                               +        
               LTH=4                                                            
         MFLD  KDPRODSL,                                               +        
               LTH=2                                                            
         MFLD  KDPSLLOK,                                               +        
               LTH=2                                                            
         MFLD  IDDC01,                                                 +        
               LTH=2                                                            
         MFLD  PRMTRL01,                                               +        
               LTH=10                                                           
         MFLD  KVKPAV01,                                               +        
               LTH=8                                                            
         MFLD  KVKSDC01,                                               +        
               LTH=8                                                            
         MFLD  KVLS01,                                                 +        
               LTH=8                                                            
         MFLD  KVEFRS01,                                               +        
               LTH=8                                                            
         MFLD  KVUTRS01,                                               +        
               LTH=8                                                            
         MFLD  PRVCST01,                                               +        
               LTH=10                                                           
         MFLD  SUAVCS01,                                               +        
               LTH=12                                                           
         MFLD  IDLVNR01,                                               +        
               LTH=5                                                            
         MFLD  PRARTB01,                                               +        
               LTH=14                                                           
         MFLD  PRKURS01,                                               +        
               LTH=12                                                           
         MFLD  PRARTB02,                                               +        
               LTH=11                                                           
         MFLD  PRMRP,                                                  +        
               LTH=12                                                           
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W5I205N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W5N205),                                           +        
               OPT=2,                                                  +        
               NXT=W5O205N1                                                     
MID      LPAGE SOR=(W5N205),                                           +        
               NXT=W5O205N1                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '52052',                                                +        
               LTH=5                                                            
         MFLD  (IDARTNRI,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDDCI,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
