***********************************************************************         
* CREATED BY PC65797   ON 98/11/12  AT 14:18                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'Ekon. subhändelse nyuppl.       '                               
W5N215   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W5T215 7',                                           +        
               8='W5T215 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W5T215U',                                           +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,13)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'ECONOMICAL SUB EVENT -REG',                            +        
               POS=(1,11),LTH=25,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Main event',                                           +        
               POS=(2,2),LTH=10,                                       +        
               ATTR=(ALPHA,PROT)                                                
EKHHTIN  DFLD  POS=(2,13),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'CC',                                                   +        
               POS=(2,77),LTH=2,                                       +        
               ATTR=(PROT)                                                      
EKHHTUT  DFLD  POS=(3,13),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
IDFTGUT  DFLD  POS=(3,77),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Main event',                                           +        
               POS=(5,2),LTH=10,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Sub event',                                            +        
               POS=(5,32),LTH=9,                                       +        
               ATTR=(PROT)                                                      
EKHHT1   DFLD  POS=(6,2),LTH=3,                                        +        
               ATTR=(PROT)                                                      
BEHHT1   DFLD  POS=(6,6),LTH=25,                                       +        
               ATTR=(NUM,PROT)                                                  
EKSHT1   DFLD  POS=(6,32),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
BESHT1   DFLD  POS=(6,36),LTH=25,                                      +        
               ATTR=(NUM,PROT)                                                  
EKSHT2   DFLD  POS=(7,32),LTH=3,                                       +        
               ATTR=(PROT)                                                      
BESHT2   DFLD  POS=(7,36),LTH=25,                                      +        
               ATTR=(NUM,PROT)                                                  
EKSHT3   DFLD  POS=(8,32),LTH=3,                                       +        
               ATTR=(PROT)                                                      
BESHT3   DFLD  POS=(8,36),LTH=25,                                      +        
               ATTR=(NUM,PROT)                                                  
EKSHT4   DFLD  POS=(9,32),LTH=3,                                       +        
               ATTR=(PROT)                                                      
BESHT4   DFLD  POS=(9,36),LTH=25,                                      +        
               ATTR=(NUM,PROT)                                                  
EKSHT5   DFLD  POS=(10,32),LTH=3,                                      +        
               ATTR=(PROT)                                                      
BESHT5   DFLD  POS=(10,36),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
EKSHT6   DFLD  POS=(11,32),LTH=3,                                      +        
               ATTR=(PROT)                                                      
BESHT6   DFLD  POS=(11,36),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
EKSHT7   DFLD  POS=(12,32),LTH=3,                                      +        
               ATTR=(PROT)                                                      
BESHT7   DFLD  POS=(12,36),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
EKSHT8   DFLD  POS=(13,32),LTH=3,                                      +        
               ATTR=(PROT)                                                      
BESHT8   DFLD  POS=(13,36),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
EKSHT9   DFLD  POS=(14,32),LTH=3,                                      +        
               ATTR=(PROT)                                                      
BESHT9   DFLD  POS=(14,36),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
EKSHT10  DFLD  POS=(15,32),LTH=3,                                      +        
               ATTR=(PROT)                                                      
BESHT10  DFLD  POS=(15,36),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
EKSHT11  DFLD  POS=(16,32),LTH=3,                                      +        
               ATTR=(PROT)                                                      
BESHT11  DFLD  POS=(16,36),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
EKSHT12  DFLD  POS=(17,32),LTH=3,                                      +        
               ATTR=(PROT)                                                      
BESHT12  DFLD  POS=(17,36),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
EKSHT13  DFLD  POS=(18,32),LTH=3,                                      +        
               ATTR=(PROT)                                                      
BESHT13  DFLD  POS=(18,36),LTH=25,                                     +        
               ATTR=(NUM,PROT)                                                  
EKHHT2   DFLD  POS=(20,2),LTH=3,                                       +        
               ATTR=(PROT)                                                      
BEHHT2   DFLD  POS=(20,6),LTH=25,                                      +        
               ATTR=(NUM,PROT)                                                  
EKSHTNY  DFLD  POS=(20,32),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
BESHTNY  DFLD  POS=(20,36),LTH=25,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'F7=FIRST F8=NEXT F10=WHELP F11=UPDATE',                +        
               POS=(22,2),LTH=37,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  '   ',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W5O215N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W5N215,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W5I215N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  EKHHTIN,                                                +        
               LTH=2                                                            
         MFLD  EKHHTUT,                                                +        
               LTH=3                                                            
         MFLD  IDFTGUT,                                                +        
               LTH=2                                                            
         MFLD  EKHHT1,                                                 +        
               LTH=3                                                            
         MFLD  BEHHT1,                                                 +        
               LTH=25                                                           
         MFLD  EKSHT1,                                                 +        
               LTH=3                                                            
         MFLD  BESHT1,                                                 +        
               LTH=25                                                           
         MFLD  EKSHT2,                                                 +        
               LTH=3                                                            
         MFLD  BESHT2,                                                 +        
               LTH=25                                                           
         MFLD  EKSHT3,                                                 +        
               LTH=3                                                            
         MFLD  BESHT3,                                                 +        
               LTH=25                                                           
         MFLD  EKSHT4,                                                 +        
               LTH=3                                                            
         MFLD  BESHT4,                                                 +        
               LTH=25                                                           
         MFLD  EKSHT5,                                                 +        
               LTH=3                                                            
         MFLD  BESHT5,                                                 +        
               LTH=25                                                           
         MFLD  EKSHT6,                                                 +        
               LTH=3                                                            
         MFLD  BESHT6,                                                 +        
               LTH=25                                                           
         MFLD  EKSHT7,                                                 +        
               LTH=3                                                            
         MFLD  BESHT7,                                                 +        
               LTH=25                                                           
         MFLD  EKSHT8,                                                 +        
               LTH=3                                                            
         MFLD  BESHT8,                                                 +        
               LTH=25                                                           
         MFLD  EKSHT9,                                                 +        
               LTH=3                                                            
         MFLD  BESHT9,                                                 +        
               LTH=25                                                           
         MFLD  EKSHT10,                                                +        
               LTH=3                                                            
         MFLD  BESHT10,                                                +        
               LTH=25                                                           
         MFLD  EKSHT11,                                                +        
               LTH=3                                                            
         MFLD  BESHT11,                                                +        
               LTH=25                                                           
         MFLD  EKSHT12,                                                +        
               LTH=3                                                            
         MFLD  BESHT12,                                                +        
               LTH=25                                                           
         MFLD  EKSHT13,                                                +        
               LTH=3                                                            
         MFLD  BESHT13,                                                +        
               LTH=25                                                           
         MFLD  EKHHT2,                                                 +        
               LTH=3                                                            
         MFLD  BEHHT2,                                                 +        
               LTH=25                                                           
         MFLD  EKSHTNY,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BESHTNY,                                                +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W5I215N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W5N215),                                           +        
               OPT=2,                                                  +        
               NXT=W5O215N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '52152',                                                +        
               LTH=5                                                            
         MFLD  (EKHHTIN,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R                                                           
         MFLD  (EKSHTNY,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (BESHTNY,                                               +        
               '+++++++++++++++++++++++++'),                           +        
               LTH=25,                                                 +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
