***********************************************************************         
* CREATED BY PCC6483   ON 00/12/05  AT 07:33                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'Ordernr/Distrikt-Kund bort/visa '                               
W5N223   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W5T223 7',                                           +        
               8='W5T223 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W5T223U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,10)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'ORDERNO/DISTRICT-CUSTOMER R3',                         +        
               POS=(1,10),LTH=28,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Account',                                              +        
               POS=(2,2),LTH=7,                                        +        
               ATTR=(ALPHA,PROT)                                                
KONTOIN  DFLD  POS=(2,10),LTH=10,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'CC',                                                   +        
               POS=(2,77),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KONTOUT  DFLD  POS=(3,10),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
IDFTGUT  DFLD  POS=(3,77),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'S/D Profit center   Orderno or District-Customer',     +        
               POS=(5,2),LTH=48,                                       +        
               ATTR=(PROT)                                                      
CMD1     DFLD  POS=(6,3),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
PRCTR1   DFLD  POS=(6,8),LTH=10,                                       +        
               ATTR=(PROT,MOD)                                                  
ANALNR1  DFLD  POS=(6,27),LTH=12,                                      +        
               ATTR=(PROT,MOD)                                                  
CMD2     DFLD  POS=(7,3),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
PRCTR2   DFLD  POS=(7,8),LTH=10,                                       +        
               ATTR=(PROT,MOD)                                                  
ANALNR2  DFLD  POS=(7,27),LTH=12,                                      +        
               ATTR=(PROT,MOD)                                                  
CMD3     DFLD  POS=(8,3),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
PRCTR3   DFLD  POS=(8,8),LTH=10,                                       +        
               ATTR=(PROT,MOD)                                                  
ANALNR3  DFLD  POS=(8,27),LTH=12,                                      +        
               ATTR=(PROT,MOD)                                                  
CMD4     DFLD  POS=(9,3),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
PRCTR4   DFLD  POS=(9,8),LTH=10,                                       +        
               ATTR=(PROT,MOD)                                                  
ANALNR4  DFLD  POS=(9,27),LTH=12,                                      +        
               ATTR=(PROT,MOD)                                                  
CMD5     DFLD  POS=(10,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
PRCTR5   DFLD  POS=(10,8),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
ANALNR5  DFLD  POS=(10,27),LTH=12,                                     +        
               ATTR=(PROT,MOD)                                                  
CMD6     DFLD  POS=(11,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
PRCTR6   DFLD  POS=(11,8),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
ANALNR6  DFLD  POS=(11,27),LTH=12,                                     +        
               ATTR=(PROT,MOD)                                                  
CMD7     DFLD  POS=(12,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
PRCTR7   DFLD  POS=(12,8),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
ANALNR7  DFLD  POS=(12,27),LTH=12,                                     +        
               ATTR=(PROT,MOD)                                                  
CMD8     DFLD  POS=(13,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
PRCTR8   DFLD  POS=(13,8),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
ANALNR8  DFLD  POS=(13,27),LTH=12,                                     +        
               ATTR=(PROT,MOD)                                                  
CMD9     DFLD  POS=(14,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
PRCTR9   DFLD  POS=(14,8),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
ANALNR9  DFLD  POS=(14,27),LTH=12,                                     +        
               ATTR=(PROT,MOD)                                                  
CMD10    DFLD  POS=(15,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
PRCTR10  DFLD  POS=(15,8),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
ANALNR10 DFLD  POS=(15,27),LTH=12,                                     +        
               ATTR=(PROT,MOD)                                                  
CMD11    DFLD  POS=(16,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
PRCTR11  DFLD  POS=(16,8),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
ANALNR11 DFLD  POS=(16,27),LTH=12,                                     +        
               ATTR=(PROT,MOD)                                                  
CMD12    DFLD  POS=(17,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
PRCTR12  DFLD  POS=(17,8),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
ANALNR12 DFLD  POS=(17,27),LTH=12,                                     +        
               ATTR=(PROT,MOD)                                                  
CMD13    DFLD  POS=(18,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
PRCTR13  DFLD  POS=(18,8),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
ANALNR13 DFLD  POS=(18,27),LTH=12,                                     +        
               ATTR=(PROT,MOD)                                                  
CMD14    DFLD  POS=(19,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
PRCTR14  DFLD  POS=(19,8),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
ANALNR14 DFLD  POS=(19,27),LTH=12,                                     +        
               ATTR=(PROT,MOD)                                                  
CMD15    DFLD  POS=(20,3),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
PRCTR15  DFLD  POS=(20,8),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
ANALNR15 DFLD  POS=(20,27),LTH=12,                                     +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'F10=WHELP F11=DELETE',                                 +        
               POS=(22,2),LTH=20,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  '    ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W5O223N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W5N223,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W5I223N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  KONTOIN,                                                +        
               LTH=2                                                            
         MFLD  KONTOUT,                                                +        
               LTH=10                                                           
         MFLD  IDFTGUT,                                                +        
               LTH=2                                                            
         MFLD  CMD1,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRCTR1,                                                 +        
               LTH=10                                                           
         MFLD  ANALNR1,                                                +        
               LTH=12                                                           
         MFLD  CMD2,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRCTR2,                                                 +        
               LTH=10                                                           
         MFLD  ANALNR2,                                                +        
               LTH=12                                                           
         MFLD  CMD3,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRCTR3,                                                 +        
               LTH=10                                                           
         MFLD  ANALNR3,                                                +        
               LTH=12                                                           
         MFLD  CMD4,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRCTR4,                                                 +        
               LTH=10                                                           
         MFLD  ANALNR4,                                                +        
               LTH=12                                                           
         MFLD  CMD5,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRCTR5,                                                 +        
               LTH=10                                                           
         MFLD  ANALNR5,                                                +        
               LTH=12                                                           
         MFLD  CMD6,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRCTR6,                                                 +        
               LTH=10                                                           
         MFLD  ANALNR6,                                                +        
               LTH=12                                                           
         MFLD  CMD7,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRCTR7,                                                 +        
               LTH=10                                                           
         MFLD  ANALNR7,                                                +        
               LTH=12                                                           
         MFLD  CMD8,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRCTR8,                                                 +        
               LTH=10                                                           
         MFLD  ANALNR8,                                                +        
               LTH=12                                                           
         MFLD  CMD9,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRCTR9,                                                 +        
               LTH=10                                                           
         MFLD  ANALNR9,                                                +        
               LTH=12                                                           
         MFLD  CMD10,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRCTR10,                                                +        
               LTH=10                                                           
         MFLD  ANALNR10,                                               +        
               LTH=12                                                           
         MFLD  CMD11,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRCTR11,                                                +        
               LTH=10                                                           
         MFLD  ANALNR11,                                               +        
               LTH=12                                                           
         MFLD  CMD12,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRCTR12,                                                +        
               LTH=10                                                           
         MFLD  ANALNR12,                                               +        
               LTH=12                                                           
         MFLD  CMD13,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRCTR13,                                                +        
               LTH=10                                                           
         MFLD  ANALNR13,                                               +        
               LTH=12                                                           
         MFLD  CMD14,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRCTR14,                                                +        
               LTH=10                                                           
         MFLD  ANALNR14,                                               +        
               LTH=12                                                           
         MFLD  CMD15,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRCTR15,                                                +        
               LTH=10                                                           
         MFLD  ANALNR15,                                               +        
               LTH=12                                                           
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W5I223N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W5N223),                                           +        
               OPT=2,                                                  +        
               NXT=W5O222N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '52232',                                                +        
               LTH=5                                                            
         MFLD  (KONTOIN,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R                                                           
         MFLD  (CMD1,                                                  +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (CMD2,                                                  +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (CMD3,                                                  +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (CMD4,                                                  +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (CMD5,                                                  +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (CMD6,                                                  +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (CMD7,                                                  +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (CMD8,                                                  +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (CMD9,                                                  +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (CMD10,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (CMD11,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (CMD12,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (CMD13,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (CMD14,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (CMD15,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
