***********************************************************************         
* CREATED BY PCC6483   ON 00/09/12  AT 12:54                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'ECONOMICAL EVENTS FELLOG, övers.'                               
W5N211   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W5T211 7',                                           +        
               8='W5T211 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W5T211U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,16)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'ECONOMICAL EVENTS - ERRORLOG',                         +        
               POS=(1,11),LTH=28,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Reg.Date From',                                        +        
               POS=(2,2),LTH=13,                                       +        
               ATTR=(ALPHA,PROT)                                                
DATFOMIN DFLD  POS=(2,16),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'To',                                                   +        
               POS=(2,25),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DATTOMIN DFLD  POS=(2,28),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Program',                                              +        
               POS=(2,62),LTH=7,                                       +        
               ATTR=(PROT)                                                      
PGMIN    DFLD  POS=(2,70),LTH=8,                                       +        
               ATTR=(NOPROT)                                                    
DATFOMUT DFLD  POS=(3,16),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
DATTOMUT DFLD  POS=(3,28),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
PGMUT    DFLD  POS=(3,70),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'No. of Errors',                                        +        
               POS=(5,2),LTH=13,                                       +        
               ATTR=(PROT)                                                      
FELTOT   DFLD  POS=(5,16),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'S Reg.Date  Event Type   Program  Screen Error Msg.',  +        
               POS=(7,2),LTH=51,                                       +        
               ATTR=(PROT)                                                      
C1       DFLD  POS=(8,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
LADDAT1  DFLD  POS=(8,4),LTH=8,                                        +        
               ATTR=(NUM,PROT)                                                  
HHTYP1   DFLD  POS=(8,13),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
SHTYP1   DFLD  POS=(8,17),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
NIVA1    DFLD  POS=(8,21),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
PGM1     DFLD  POS=(8,27),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
BILD1    DFLD  POS=(8,37),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FELTXT1  DFLD  POS=(8,43),LTH=38,                                      +        
               ATTR=(PROT)                                                      
C2       DFLD  POS=(9,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
LADDAT2  DFLD  POS=(9,4),LTH=8,                                        +        
               ATTR=(NUM,PROT)                                                  
HHTYP2   DFLD  POS=(9,13),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
SHTYP2   DFLD  POS=(9,17),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
NIVA2    DFLD  POS=(9,21),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
PGM2     DFLD  POS=(9,27),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
BILD2    DFLD  POS=(9,37),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FELTXT2  DFLD  POS=(9,43),LTH=38,                                      +        
               ATTR=(PROT)                                                      
C3       DFLD  POS=(10,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
LADDAT3  DFLD  POS=(10,4),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
HHTYP3   DFLD  POS=(10,13),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
SHTYP3   DFLD  POS=(10,17),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
NIVA3    DFLD  POS=(10,21),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
PGM3     DFLD  POS=(10,27),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
BILD3    DFLD  POS=(10,37),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FELTXT3  DFLD  POS=(10,43),LTH=38,                                     +        
               ATTR=(PROT)                                                      
C4       DFLD  POS=(11,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
LADDAT4  DFLD  POS=(11,4),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
HHTYP4   DFLD  POS=(11,13),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
SHTYP4   DFLD  POS=(11,17),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
NIVA4    DFLD  POS=(11,21),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
PGM4     DFLD  POS=(11,27),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
BILD4    DFLD  POS=(11,37),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FELTXT4  DFLD  POS=(11,43),LTH=38,                                     +        
               ATTR=(PROT)                                                      
C5       DFLD  POS=(12,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
LADDAT5  DFLD  POS=(12,4),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
HHTYP5   DFLD  POS=(12,13),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
SHTYP5   DFLD  POS=(12,17),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
NIVA5    DFLD  POS=(12,21),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
PGM5     DFLD  POS=(12,27),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
BILD5    DFLD  POS=(12,37),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FELTXT5  DFLD  POS=(12,43),LTH=38,                                     +        
               ATTR=(PROT)                                                      
C6       DFLD  POS=(13,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
LADDAT6  DFLD  POS=(13,4),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
HHTYP6   DFLD  POS=(13,13),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
SHTYP6   DFLD  POS=(13,17),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
NIVA6    DFLD  POS=(13,21),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
PGM6     DFLD  POS=(13,27),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
BILD6    DFLD  POS=(13,37),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FELTXT6  DFLD  POS=(13,43),LTH=38,                                     +        
               ATTR=(PROT)                                                      
C7       DFLD  POS=(14,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
LADDAT7  DFLD  POS=(14,4),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
HHTYP7   DFLD  POS=(14,13),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
SHTYP7   DFLD  POS=(14,17),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
NIVA7    DFLD  POS=(14,21),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
PGM7     DFLD  POS=(14,27),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
BILD7    DFLD  POS=(14,37),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FELTXT7  DFLD  POS=(14,43),LTH=38,                                     +        
               ATTR=(PROT)                                                      
C8       DFLD  POS=(15,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
LADDAT8  DFLD  POS=(15,4),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
HHTYP8   DFLD  POS=(15,13),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
SHTYP8   DFLD  POS=(15,17),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
NIVA8    DFLD  POS=(15,21),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
PGM8     DFLD  POS=(15,27),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
BILD8    DFLD  POS=(15,37),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FELTXT8  DFLD  POS=(15,43),LTH=38,                                     +        
               ATTR=(PROT)                                                      
C9       DFLD  POS=(16,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
LADDAT9  DFLD  POS=(16,4),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
HHTYP9   DFLD  POS=(16,13),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
SHTYP9   DFLD  POS=(16,17),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
NIVA9    DFLD  POS=(16,21),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
PGM9     DFLD  POS=(16,27),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
BILD9    DFLD  POS=(16,37),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FELTXT9  DFLD  POS=(16,43),LTH=38,                                     +        
               ATTR=(PROT)                                                      
C10      DFLD  POS=(17,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
LADDAT10 DFLD  POS=(17,4),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
HHTYP10  DFLD  POS=(17,13),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
SHTYP10  DFLD  POS=(17,17),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
NIVA10   DFLD  POS=(17,21),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
PGM10    DFLD  POS=(17,27),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
BILD10   DFLD  POS=(17,37),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FELTXT10 DFLD  POS=(17,43),LTH=38,                                     +        
               ATTR=(PROT)                                                      
C11      DFLD  POS=(18,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
LADDAT11 DFLD  POS=(18,4),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
HHTYP11  DFLD  POS=(18,13),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
SHTYP11  DFLD  POS=(18,17),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
NIVA11   DFLD  POS=(18,21),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
PGM11    DFLD  POS=(18,27),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
BILD11   DFLD  POS=(18,37),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FELTXT11 DFLD  POS=(18,43),LTH=38,                                     +        
               ATTR=(PROT)                                                      
C12      DFLD  POS=(19,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
LADDAT12 DFLD  POS=(19,4),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
HHTYP12  DFLD  POS=(19,13),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
SHTYP12  DFLD  POS=(19,17),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
NIVA12   DFLD  POS=(19,21),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
PGM12    DFLD  POS=(19,27),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
BILD12   DFLD  POS=(19,37),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FELTXT12 DFLD  POS=(19,43),LTH=38,                                     +        
               ATTR=(PROT)                                                      
C13      DFLD  POS=(20,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
LADDAT13 DFLD  POS=(20,4),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
HHTYP13  DFLD  POS=(20,13),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
SHTYP13  DFLD  POS=(20,17),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
NIVA13   DFLD  POS=(20,21),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
PGM13    DFLD  POS=(20,27),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
BILD13   DFLD  POS=(20,37),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FELTXT13 DFLD  POS=(20,43),LTH=38,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'F7=First  F8=Next  F10=WHELP',                         +        
               POS=(22,2),LTH=28,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  '    ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W5O211N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W5N211,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W5I211N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  DATFOMIN,                                               +        
               LTH=2                                                            
         MFLD  DATFOMUT,                                               +        
               LTH=8                                                            
         MFLD  DATTOMIN,                                               +        
               LTH=2                                                            
         MFLD  DATTOMUT,                                               +        
               LTH=8                                                            
         MFLD  PGMIN,                                                  +        
               LTH=2                                                            
         MFLD  PGMUT,                                                  +        
               LTH=8                                                            
         MFLD  FELTOT,                                                 +        
               LTH=7                                                            
         MFLD  C1,                                                     +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LADDAT1,                                                +        
               LTH=8                                                            
         MFLD  HHTYP1,                                                 +        
               LTH=3                                                            
         MFLD  SHTYP1,                                                 +        
               LTH=3                                                            
         MFLD  NIVA1,                                                  +        
               LTH=5                                                            
         MFLD  PGM1,                                                   +        
               LTH=8                                                            
         MFLD  BILD1,                                                  +        
               LTH=4                                                            
         MFLD  FELTXT1,                                                +        
               LTH=38                                                           
         MFLD  C2,                                                     +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LADDAT2,                                                +        
               LTH=8                                                            
         MFLD  HHTYP2,                                                 +        
               LTH=3                                                            
         MFLD  SHTYP2,                                                 +        
               LTH=3                                                            
         MFLD  NIVA2,                                                  +        
               LTH=5                                                            
         MFLD  PGM2,                                                   +        
               LTH=8                                                            
         MFLD  BILD2,                                                  +        
               LTH=4                                                            
         MFLD  FELTXT2,                                                +        
               LTH=38                                                           
         MFLD  C3,                                                     +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LADDAT3,                                                +        
               LTH=8                                                            
         MFLD  HHTYP3,                                                 +        
               LTH=3                                                            
         MFLD  SHTYP3,                                                 +        
               LTH=3                                                            
         MFLD  NIVA3,                                                  +        
               LTH=5                                                            
         MFLD  PGM3,                                                   +        
               LTH=8                                                            
         MFLD  BILD3,                                                  +        
               LTH=4                                                            
         MFLD  FELTXT3,                                                +        
               LTH=38                                                           
         MFLD  C4,                                                     +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LADDAT4,                                                +        
               LTH=8                                                            
         MFLD  HHTYP4,                                                 +        
               LTH=3                                                            
         MFLD  SHTYP4,                                                 +        
               LTH=3                                                            
         MFLD  NIVA4,                                                  +        
               LTH=5                                                            
         MFLD  PGM4,                                                   +        
               LTH=8                                                            
         MFLD  BILD4,                                                  +        
               LTH=4                                                            
         MFLD  FELTXT4,                                                +        
               LTH=38                                                           
         MFLD  C5,                                                     +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LADDAT5,                                                +        
               LTH=8                                                            
         MFLD  HHTYP5,                                                 +        
               LTH=3                                                            
         MFLD  SHTYP5,                                                 +        
               LTH=3                                                            
         MFLD  NIVA5,                                                  +        
               LTH=5                                                            
         MFLD  PGM5,                                                   +        
               LTH=8                                                            
         MFLD  BILD5,                                                  +        
               LTH=4                                                            
         MFLD  FELTXT5,                                                +        
               LTH=38                                                           
         MFLD  C6,                                                     +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LADDAT6,                                                +        
               LTH=8                                                            
         MFLD  HHTYP6,                                                 +        
               LTH=3                                                            
         MFLD  SHTYP6,                                                 +        
               LTH=3                                                            
         MFLD  NIVA6,                                                  +        
               LTH=5                                                            
         MFLD  PGM6,                                                   +        
               LTH=8                                                            
         MFLD  BILD6,                                                  +        
               LTH=4                                                            
         MFLD  FELTXT6,                                                +        
               LTH=38                                                           
         MFLD  C7,                                                     +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LADDAT7,                                                +        
               LTH=8                                                            
         MFLD  HHTYP7,                                                 +        
               LTH=3                                                            
         MFLD  SHTYP7,                                                 +        
               LTH=3                                                            
         MFLD  NIVA7,                                                  +        
               LTH=5                                                            
         MFLD  PGM7,                                                   +        
               LTH=8                                                            
         MFLD  BILD7,                                                  +        
               LTH=4                                                            
         MFLD  FELTXT7,                                                +        
               LTH=38                                                           
         MFLD  C8,                                                     +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LADDAT8,                                                +        
               LTH=8                                                            
         MFLD  HHTYP8,                                                 +        
               LTH=3                                                            
         MFLD  SHTYP8,                                                 +        
               LTH=3                                                            
         MFLD  NIVA8,                                                  +        
               LTH=5                                                            
         MFLD  PGM8,                                                   +        
               LTH=8                                                            
         MFLD  BILD8,                                                  +        
               LTH=4                                                            
         MFLD  FELTXT8,                                                +        
               LTH=38                                                           
         MFLD  C9,                                                     +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LADDAT9,                                                +        
               LTH=8                                                            
         MFLD  HHTYP9,                                                 +        
               LTH=3                                                            
         MFLD  SHTYP9,                                                 +        
               LTH=3                                                            
         MFLD  NIVA9,                                                  +        
               LTH=5                                                            
         MFLD  PGM9,                                                   +        
               LTH=8                                                            
         MFLD  BILD9,                                                  +        
               LTH=4                                                            
         MFLD  FELTXT9,                                                +        
               LTH=38                                                           
         MFLD  C10,                                                    +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LADDAT10,                                               +        
               LTH=8                                                            
         MFLD  HHTYP10,                                                +        
               LTH=3                                                            
         MFLD  SHTYP10,                                                +        
               LTH=3                                                            
         MFLD  NIVA10,                                                 +        
               LTH=5                                                            
         MFLD  PGM10,                                                  +        
               LTH=8                                                            
         MFLD  BILD10,                                                 +        
               LTH=4                                                            
         MFLD  FELTXT10,                                               +        
               LTH=38                                                           
         MFLD  C11,                                                    +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LADDAT11,                                               +        
               LTH=8                                                            
         MFLD  HHTYP11,                                                +        
               LTH=3                                                            
         MFLD  SHTYP11,                                                +        
               LTH=3                                                            
         MFLD  NIVA11,                                                 +        
               LTH=5                                                            
         MFLD  PGM11,                                                  +        
               LTH=8                                                            
         MFLD  BILD11,                                                 +        
               LTH=4                                                            
         MFLD  FELTXT11,                                               +        
               LTH=38                                                           
         MFLD  C12,                                                    +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LADDAT12,                                               +        
               LTH=8                                                            
         MFLD  HHTYP12,                                                +        
               LTH=3                                                            
         MFLD  SHTYP12,                                                +        
               LTH=3                                                            
         MFLD  NIVA12,                                                 +        
               LTH=5                                                            
         MFLD  PGM12,                                                  +        
               LTH=8                                                            
         MFLD  BILD12,                                                 +        
               LTH=4                                                            
         MFLD  FELTXT12,                                               +        
               LTH=38                                                           
         MFLD  C13,                                                    +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LADDAT13,                                               +        
               LTH=8                                                            
         MFLD  HHTYP13,                                                +        
               LTH=3                                                            
         MFLD  SHTYP13,                                                +        
               LTH=3                                                            
         MFLD  NIVA13,                                                 +        
               LTH=5                                                            
         MFLD  PGM13,                                                  +        
               LTH=8                                                            
         MFLD  BILD13,                                                 +        
               LTH=4                                                            
         MFLD  FELTXT13,                                               +        
               LTH=38                                                           
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W5I211N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W5N211),                                           +        
               OPT=2,                                                  +        
               NXT=W5O211N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '52112',                                                +        
               LTH=5                                                            
         MFLD  (DATFOMIN,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R                                                           
         MFLD  (DATTOMIN,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R                                                           
         MFLD  (PGMIN,                                                 +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R                                                           
         MFLD  (C1,                                                    +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (C2,                                                    +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (C3,                                                    +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (C4,                                                    +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (C5,                                                    +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (C6,                                                    +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (C7,                                                    +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (C8,                                                    +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (C9,                                                    +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (C10,                                                   +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (C11,                                                   +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (C12,                                                   +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (C13,                                                   +        
               '+'),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
