***********************************************************************         
* CREATED BY PC65797   ON 98/11/12  AT 14:18                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'Ekon. parametrar - översikt     '                               
W5N213   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W5T213 7',                                           +        
               8='W5T213 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,13)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'ECONOMICAL PRM -OVERVIEW',                             +        
               POS=(1,11),LTH=24,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Main event',                                           +        
               POS=(2,2),LTH=10,                                       +        
               ATTR=(ALPHA,PROT)                                                
EKHHTIN  DFLD  POS=(2,13),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Sub event',                                            +        
               POS=(2,18),LTH=9,                                       +        
               ATTR=(PROT)                                                      
EKSHTIN  DFLD  POS=(2,28),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Level',                                                +        
               POS=(2,33),LTH=5,                                       +        
               ATTR=(PROT)                                                      
EKNIVAIN DFLD  POS=(2,39),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Client',                                               +        
               POS=(2,46),LTH=6,                                       +        
               ATTR=(PROT)                                                      
KLIENTIN DFLD  POS=(2,53),LTH=6,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Record Type',                                          +        
               POS=(2,61),LTH=11,                                      +        
               ATTR=(PROT)                                                      
PTYPIN   DFLD  POS=(2,73),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'CC',                                                   +        
               POS=(2,77),LTH=2,                                       +        
               ATTR=(PROT)                                                      
EKHHTUT  DFLD  POS=(3,13),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
EKSHTUT  DFLD  POS=(3,28),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
EKNIVAUT DFLD  POS=(3,39),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
KLIENTUT DFLD  POS=(3,53),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
PTYPUT   DFLD  POS=(3,73),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
IDFTGUT  DFLD  POS=(3,77),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'S Main event',                                         +        
               POS=(5,2),LTH=12,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Sub event',                                            +        
               POS=(5,29),LTH=9,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Level  Client  Record Type',                           +        
               POS=(5,54),LTH=26,                                      +        
               ATTR=(PROT)                                                      
C1       DFLD  POS=(6,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
EKHHT1   DFLD  POS=(6,4),LTH=3,                                        +        
               ATTR=(NUM,PROT)                                                  
BEHHT1   DFLD  POS=(6,8),LTH=20,                                       +        
               ATTR=(NUM,PROT)                                                  
EKSHT1   DFLD  POS=(6,29),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
BESHT1   DFLD  POS=(6,33),LTH=20,                                      +        
               ATTR=(NUM,PROT)                                                  
EKNIVA1  DFLD  POS=(6,54),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
KLIENT1  DFLD  POS=(6,61),LTH=6,                                       +        
               ATTR=(PROT)                                                      
PTYP1    DFLD  POS=(6,72),LTH=3,                                       +        
               ATTR=(PROT)                                                      
C2       DFLD  POS=(7,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
EKHHT2   DFLD  POS=(7,4),LTH=3,                                        +        
               ATTR=(NUM,PROT)                                                  
BEHHT2   DFLD  POS=(7,8),LTH=20,                                       +        
               ATTR=(NUM,PROT)                                                  
EKSHT2   DFLD  POS=(7,29),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
BESHT2   DFLD  POS=(7,33),LTH=20,                                      +        
               ATTR=(NUM,PROT)                                                  
EKNIVA2  DFLD  POS=(7,54),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
KLIENT2  DFLD  POS=(7,61),LTH=6,                                       +        
               ATTR=(PROT)                                                      
PTYP2    DFLD  POS=(7,72),LTH=3,                                       +        
               ATTR=(PROT)                                                      
C3       DFLD  POS=(8,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
EKHHT3   DFLD  POS=(8,4),LTH=3,                                        +        
               ATTR=(NUM,PROT)                                                  
BEHHT3   DFLD  POS=(8,8),LTH=20,                                       +        
               ATTR=(NUM,PROT)                                                  
EKSHT3   DFLD  POS=(8,29),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
BESHT3   DFLD  POS=(8,33),LTH=20,                                      +        
               ATTR=(NUM,PROT)                                                  
EKNIVA3  DFLD  POS=(8,54),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
KLIENT3  DFLD  POS=(8,61),LTH=6,                                       +        
               ATTR=(PROT)                                                      
PTYP3    DFLD  POS=(8,72),LTH=3,                                       +        
               ATTR=(PROT)                                                      
C4       DFLD  POS=(9,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
EKHHT4   DFLD  POS=(9,4),LTH=3,                                        +        
               ATTR=(NUM,PROT)                                                  
BEHHT4   DFLD  POS=(9,8),LTH=20,                                       +        
               ATTR=(NUM,PROT)                                                  
EKSHT4   DFLD  POS=(9,29),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
BESHT4   DFLD  POS=(9,33),LTH=20,                                      +        
               ATTR=(NUM,PROT)                                                  
EKNIVA4  DFLD  POS=(9,54),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
KLIENT4  DFLD  POS=(9,61),LTH=6,                                       +        
               ATTR=(PROT)                                                      
PTYP4    DFLD  POS=(9,72),LTH=3,                                       +        
               ATTR=(PROT)                                                      
C5       DFLD  POS=(10,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
EKHHT5   DFLD  POS=(10,4),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
BEHHT5   DFLD  POS=(10,8),LTH=20,                                      +        
               ATTR=(NUM,PROT)                                                  
EKSHT5   DFLD  POS=(10,29),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
BESHT5   DFLD  POS=(10,33),LTH=20,                                     +        
               ATTR=(NUM,PROT)                                                  
EKNIVA5  DFLD  POS=(10,54),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KLIENT5  DFLD  POS=(10,61),LTH=6,                                      +        
               ATTR=(PROT)                                                      
PTYP5    DFLD  POS=(10,72),LTH=3,                                      +        
               ATTR=(PROT)                                                      
C6       DFLD  POS=(11,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
EKHHT6   DFLD  POS=(11,4),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
BEHHT6   DFLD  POS=(11,8),LTH=20,                                      +        
               ATTR=(NUM,PROT)                                                  
EKSHT6   DFLD  POS=(11,29),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
BESHT6   DFLD  POS=(11,33),LTH=20,                                     +        
               ATTR=(NUM,PROT)                                                  
EKNIVA6  DFLD  POS=(11,54),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KLIENT6  DFLD  POS=(11,61),LTH=6,                                      +        
               ATTR=(PROT)                                                      
PTYP6    DFLD  POS=(11,72),LTH=3,                                      +        
               ATTR=(PROT)                                                      
C7       DFLD  POS=(12,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
EKHHT7   DFLD  POS=(12,4),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
BEHHT7   DFLD  POS=(12,8),LTH=20,                                      +        
               ATTR=(NUM,PROT)                                                  
EKSHT7   DFLD  POS=(12,29),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
BESHT7   DFLD  POS=(12,33),LTH=20,                                     +        
               ATTR=(NUM,PROT)                                                  
EKNIVA7  DFLD  POS=(12,54),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KLIENT7  DFLD  POS=(12,61),LTH=6,                                      +        
               ATTR=(PROT)                                                      
PTYP7    DFLD  POS=(12,72),LTH=3,                                      +        
               ATTR=(PROT)                                                      
C8       DFLD  POS=(13,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
EKHHT8   DFLD  POS=(13,4),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
BEHHT8   DFLD  POS=(13,8),LTH=20,                                      +        
               ATTR=(NUM,PROT)                                                  
EKSHT8   DFLD  POS=(13,29),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
BESHT8   DFLD  POS=(13,33),LTH=20,                                     +        
               ATTR=(NUM,PROT)                                                  
EKNIVA8  DFLD  POS=(13,54),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KLIENT8  DFLD  POS=(13,61),LTH=6,                                      +        
               ATTR=(PROT)                                                      
PTYP8    DFLD  POS=(13,72),LTH=3,                                      +        
               ATTR=(PROT)                                                      
C9       DFLD  POS=(14,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
EKHHT9   DFLD  POS=(14,4),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
BEHHT9   DFLD  POS=(14,8),LTH=20,                                      +        
               ATTR=(NUM,PROT)                                                  
EKSHT9   DFLD  POS=(14,29),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
BESHT9   DFLD  POS=(14,33),LTH=20,                                     +        
               ATTR=(NUM,PROT)                                                  
EKNIVA9  DFLD  POS=(14,54),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KLIENT9  DFLD  POS=(14,61),LTH=6,                                      +        
               ATTR=(PROT)                                                      
PTYP9    DFLD  POS=(14,72),LTH=3,                                      +        
               ATTR=(PROT)                                                      
C10      DFLD  POS=(15,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
EKHHT10  DFLD  POS=(15,4),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
BEHHT10  DFLD  POS=(15,8),LTH=20,                                      +        
               ATTR=(NUM,PROT)                                                  
EKSHT10  DFLD  POS=(15,29),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
BESHT10  DFLD  POS=(15,33),LTH=20,                                     +        
               ATTR=(NUM,PROT)                                                  
EKNIVA10 DFLD  POS=(15,54),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KLIENT10 DFLD  POS=(15,61),LTH=6,                                      +        
               ATTR=(PROT)                                                      
PTYP10   DFLD  POS=(15,72),LTH=3,                                      +        
               ATTR=(PROT)                                                      
C11      DFLD  POS=(16,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
EKHHT11  DFLD  POS=(16,4),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
BEHHT11  DFLD  POS=(16,8),LTH=20,                                      +        
               ATTR=(NUM,PROT)                                                  
EKSHT11  DFLD  POS=(16,29),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
BESHT11  DFLD  POS=(16,33),LTH=20,                                     +        
               ATTR=(NUM,PROT)                                                  
EKNIVA11 DFLD  POS=(16,54),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KLIENT11 DFLD  POS=(16,61),LTH=6,                                      +        
               ATTR=(PROT)                                                      
PTYP11   DFLD  POS=(16,72),LTH=3,                                      +        
               ATTR=(PROT)                                                      
C12      DFLD  POS=(17,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
EKHHT12  DFLD  POS=(17,4),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
BEHHT12  DFLD  POS=(17,8),LTH=20,                                      +        
               ATTR=(NUM,PROT)                                                  
EKSHT12  DFLD  POS=(17,29),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
BESHT12  DFLD  POS=(17,33),LTH=20,                                     +        
               ATTR=(NUM,PROT)                                                  
EKNIVA12 DFLD  POS=(17,54),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KLIENT12 DFLD  POS=(17,61),LTH=6,                                      +        
               ATTR=(PROT)                                                      
PTYP12   DFLD  POS=(17,72),LTH=3,                                      +        
               ATTR=(PROT)                                                      
C13      DFLD  POS=(18,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
EKHHT13  DFLD  POS=(18,4),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
BEHHT13  DFLD  POS=(18,8),LTH=20,                                      +        
               ATTR=(NUM,PROT)                                                  
EKSHT13  DFLD  POS=(18,29),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
BESHT13  DFLD  POS=(18,33),LTH=20,                                     +        
               ATTR=(NUM,PROT)                                                  
EKNIVA13 DFLD  POS=(18,54),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KLIENT13 DFLD  POS=(18,61),LTH=6,                                      +        
               ATTR=(PROT)                                                      
PTYP13   DFLD  POS=(18,72),LTH=3,                                      +        
               ATTR=(PROT)                                                      
C14      DFLD  POS=(19,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
EKHHT14  DFLD  POS=(19,4),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
BEHHT14  DFLD  POS=(19,8),LTH=20,                                      +        
               ATTR=(NUM,PROT)                                                  
EKSHT14  DFLD  POS=(19,29),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
BESHT14  DFLD  POS=(19,33),LTH=20,                                     +        
               ATTR=(NUM,PROT)                                                  
EKNIVA14 DFLD  POS=(19,54),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KLIENT14 DFLD  POS=(19,61),LTH=6,                                      +        
               ATTR=(PROT)                                                      
PTYP14   DFLD  POS=(19,72),LTH=3,                                      +        
               ATTR=(PROT)                                                      
C15      DFLD  POS=(20,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
EKHHT15  DFLD  POS=(20,4),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
BEHHT15  DFLD  POS=(20,8),LTH=20,                                      +        
               ATTR=(NUM,PROT)                                                  
EKSHT15  DFLD  POS=(20,29),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
BESHT15  DFLD  POS=(20,33),LTH=20,                                     +        
               ATTR=(NUM,PROT)                                                  
EKNIVA15 DFLD  POS=(20,54),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KLIENT15 DFLD  POS=(20,61),LTH=6,                                      +        
               ATTR=(PROT)                                                      
PTYP15   DFLD  POS=(20,72),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'F7=First F8=Next F10=WHELP',                           +        
               POS=(22,2),LTH=26,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  '   ',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W5O213N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W5N213,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W5I213N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  EKHHTIN,                                                +        
               LTH=2                                                            
         MFLD  EKHHTUT,                                                +        
               LTH=3                                                            
         MFLD  EKSHTIN,                                                +        
               LTH=2                                                            
         MFLD  EKSHTUT,                                                +        
               LTH=3                                                            
         MFLD  EKNIVAIN,                                               +        
               LTH=2                                                            
         MFLD  EKNIVAUT,                                               +        
               LTH=5                                                            
         MFLD  KLIENTIN,                                               +        
               LTH=2                                                            
         MFLD  KLIENTUT,                                               +        
               LTH=6                                                            
         MFLD  PTYPIN,                                                 +        
               LTH=2                                                            
         MFLD  PTYPUT,                                                 +        
               LTH=3                                                            
         MFLD  IDFTGUT,                                                +        
               LTH=2                                                            
         MFLD  C1,                                                     +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  EKHHT1,                                                 +        
               LTH=3                                                            
         MFLD  BEHHT1,                                                 +        
               LTH=20                                                           
         MFLD  EKSHT1,                                                 +        
               LTH=3                                                            
         MFLD  BESHT1,                                                 +        
               LTH=20                                                           
         MFLD  EKNIVA1,                                                +        
               LTH=5                                                            
         MFLD  KLIENT1,                                                +        
               LTH=6                                                            
         MFLD  PTYP1,                                                  +        
               LTH=3                                                            
         MFLD  C2,                                                     +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  EKHHT2,                                                 +        
               LTH=3                                                            
         MFLD  BEHHT2,                                                 +        
               LTH=20                                                           
         MFLD  EKSHT2,                                                 +        
               LTH=3                                                            
         MFLD  BESHT2,                                                 +        
               LTH=20                                                           
         MFLD  EKNIVA2,                                                +        
               LTH=5                                                            
         MFLD  KLIENT2,                                                +        
               LTH=6                                                            
         MFLD  PTYP2,                                                  +        
               LTH=3                                                            
         MFLD  C3,                                                     +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  EKHHT3,                                                 +        
               LTH=3                                                            
         MFLD  BEHHT3,                                                 +        
               LTH=20                                                           
         MFLD  EKSHT3,                                                 +        
               LTH=3                                                            
         MFLD  BESHT3,                                                 +        
               LTH=20                                                           
         MFLD  EKNIVA3,                                                +        
               LTH=5                                                            
         MFLD  KLIENT3,                                                +        
               LTH=6                                                            
         MFLD  PTYP3,                                                  +        
               LTH=3                                                            
         MFLD  C4,                                                     +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  EKHHT4,                                                 +        
               LTH=3                                                            
         MFLD  BEHHT4,                                                 +        
               LTH=20                                                           
         MFLD  EKSHT4,                                                 +        
               LTH=3                                                            
         MFLD  BESHT4,                                                 +        
               LTH=20                                                           
         MFLD  EKNIVA4,                                                +        
               LTH=5                                                            
         MFLD  KLIENT4,                                                +        
               LTH=6                                                            
         MFLD  PTYP4,                                                  +        
               LTH=3                                                            
         MFLD  C5,                                                     +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  EKHHT5,                                                 +        
               LTH=3                                                            
         MFLD  BEHHT5,                                                 +        
               LTH=20                                                           
         MFLD  EKSHT5,                                                 +        
               LTH=3                                                            
         MFLD  BESHT5,                                                 +        
               LTH=20                                                           
         MFLD  EKNIVA5,                                                +        
               LTH=5                                                            
         MFLD  KLIENT5,                                                +        
               LTH=6                                                            
         MFLD  PTYP5,                                                  +        
               LTH=3                                                            
         MFLD  C6,                                                     +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  EKHHT6,                                                 +        
               LTH=3                                                            
         MFLD  BEHHT6,                                                 +        
               LTH=20                                                           
         MFLD  EKSHT6,                                                 +        
               LTH=3                                                            
         MFLD  BESHT6,                                                 +        
               LTH=20                                                           
         MFLD  EKNIVA6,                                                +        
               LTH=5                                                            
         MFLD  KLIENT6,                                                +        
               LTH=6                                                            
         MFLD  PTYP6,                                                  +        
               LTH=3                                                            
         MFLD  C7,                                                     +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  EKHHT7,                                                 +        
               LTH=3                                                            
         MFLD  BEHHT7,                                                 +        
               LTH=20                                                           
         MFLD  EKSHT7,                                                 +        
               LTH=3                                                            
         MFLD  BESHT7,                                                 +        
               LTH=20                                                           
         MFLD  EKNIVA7,                                                +        
               LTH=5                                                            
         MFLD  KLIENT7,                                                +        
               LTH=6                                                            
         MFLD  PTYP7,                                                  +        
               LTH=3                                                            
         MFLD  C8,                                                     +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  EKHHT8,                                                 +        
               LTH=3                                                            
         MFLD  BEHHT8,                                                 +        
               LTH=20                                                           
         MFLD  EKSHT8,                                                 +        
               LTH=3                                                            
         MFLD  BESHT8,                                                 +        
               LTH=20                                                           
         MFLD  EKNIVA8,                                                +        
               LTH=5                                                            
         MFLD  KLIENT8,                                                +        
               LTH=6                                                            
         MFLD  PTYP8,                                                  +        
               LTH=3                                                            
         MFLD  C9,                                                     +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  EKHHT9,                                                 +        
               LTH=3                                                            
         MFLD  BEHHT9,                                                 +        
               LTH=20                                                           
         MFLD  EKSHT9,                                                 +        
               LTH=3                                                            
         MFLD  BESHT9,                                                 +        
               LTH=20                                                           
         MFLD  EKNIVA9,                                                +        
               LTH=5                                                            
         MFLD  KLIENT9,                                                +        
               LTH=6                                                            
         MFLD  PTYP9,                                                  +        
               LTH=3                                                            
         MFLD  C10,                                                    +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  EKHHT10,                                                +        
               LTH=3                                                            
         MFLD  BEHHT10,                                                +        
               LTH=20                                                           
         MFLD  EKSHT10,                                                +        
               LTH=3                                                            
         MFLD  BESHT10,                                                +        
               LTH=20                                                           
         MFLD  EKNIVA10,                                               +        
               LTH=5                                                            
         MFLD  KLIENT10,                                               +        
               LTH=6                                                            
         MFLD  PTYP10,                                                 +        
               LTH=3                                                            
         MFLD  C11,                                                    +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  EKHHT11,                                                +        
               LTH=3                                                            
         MFLD  BEHHT11,                                                +        
               LTH=20                                                           
         MFLD  EKSHT11,                                                +        
               LTH=3                                                            
         MFLD  BESHT11,                                                +        
               LTH=20                                                           
         MFLD  EKNIVA11,                                               +        
               LTH=5                                                            
         MFLD  KLIENT11,                                               +        
               LTH=6                                                            
         MFLD  PTYP11,                                                 +        
               LTH=3                                                            
         MFLD  C12,                                                    +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  EKHHT12,                                                +        
               LTH=3                                                            
         MFLD  BEHHT12,                                                +        
               LTH=20                                                           
         MFLD  EKSHT12,                                                +        
               LTH=3                                                            
         MFLD  BESHT12,                                                +        
               LTH=20                                                           
         MFLD  EKNIVA12,                                               +        
               LTH=5                                                            
         MFLD  KLIENT12,                                               +        
               LTH=6                                                            
         MFLD  PTYP12,                                                 +        
               LTH=3                                                            
         MFLD  C13,                                                    +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  EKHHT13,                                                +        
               LTH=3                                                            
         MFLD  BEHHT13,                                                +        
               LTH=20                                                           
         MFLD  EKSHT13,                                                +        
               LTH=3                                                            
         MFLD  BESHT13,                                                +        
               LTH=20                                                           
         MFLD  EKNIVA13,                                               +        
               LTH=5                                                            
         MFLD  KLIENT13,                                               +        
               LTH=6                                                            
         MFLD  PTYP13,                                                 +        
               LTH=3                                                            
         MFLD  C14,                                                    +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  EKHHT14,                                                +        
               LTH=3                                                            
         MFLD  BEHHT14,                                                +        
               LTH=20                                                           
         MFLD  EKSHT14,                                                +        
               LTH=3                                                            
         MFLD  BESHT14,                                                +        
               LTH=20                                                           
         MFLD  EKNIVA14,                                               +        
               LTH=5                                                            
         MFLD  KLIENT14,                                               +        
               LTH=6                                                            
         MFLD  PTYP14,                                                 +        
               LTH=3                                                            
         MFLD  C15,                                                    +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  EKHHT15,                                                +        
               LTH=3                                                            
         MFLD  BEHHT15,                                                +        
               LTH=20                                                           
         MFLD  EKSHT15,                                                +        
               LTH=3                                                            
         MFLD  BESHT15,                                                +        
               LTH=20                                                           
         MFLD  EKNIVA15,                                               +        
               LTH=5                                                            
         MFLD  KLIENT15,                                               +        
               LTH=6                                                            
         MFLD  PTYP15,                                                 +        
               LTH=3                                                            
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W5I213N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W5N213),                                           +        
               OPT=2,                                                  +        
               NXT=W5O213N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '52132',                                                +        
               LTH=5                                                            
         MFLD  (EKHHTIN,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R                                                           
         MFLD  (EKSHTIN,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R                                                           
         MFLD  (EKNIVAIN,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L                                                           
         MFLD  (KLIENTIN,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=L                                                           
         MFLD  (PTYPIN,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=L                                                           
         MFLD  (C1,                                                    +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (C2,                                                    +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (C3,                                                    +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (C4,                                                    +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (C5,                                                    +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (C6,                                                    +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (C7,                                                    +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (C8,                                                    +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (C9,                                                    +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (C10,                                                   +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (C11,                                                   +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (C12,                                                   +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (C13,                                                   +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (C14,                                                   +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (C15,                                                   +        
               '+'),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
