***********************************************************************         
* CREATED BY PCC6483   ON 00/09/27  AT 09:43                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'STDPRIS INFO. INNEVARANDE ÅR    '                               
W5N286   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W5T286  ',                                           +        
               4='W0T501  ',                                           +        
               5='W01501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W5T286 7',                                           +        
               8='W5T286 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W5T286U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W5T281  ',                                          +        
               14='W5T282  ',                                          +        
               15='W5T283  ',                                          +        
               16='W5T284  ',                                          +        
               17='W5T285  ',                                          +        
               18='W5T286  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W5T286U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,9)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'RE-COUNT',                                             +        
               POS=(1,10),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'UPDATE',                                               +        
               POS=(1,23),LTH=6,                                       +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Date:',                                                +        
               POS=(2,2),LTH=5,                                        +        
               ATTR=(NUM,PROT)                                                  
DGIA0000 DFLD  POS=(2,9),LTH=6,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Time:',                                                +        
               POS=(2,17),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DGIA0002 DFLD  POS=(2,23),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Counted by:',                                          +        
               POS=(2,30),LTH=11,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0004 DFLD  POS=(2,42),LTH=8,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0001 DFLD  POS=(3,9),LTH=6,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0003 DFLD  POS=(3,23),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0005 DFLD  POS=(3,42),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Location:',                                            +        
               POS=(5,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Partno:',                                              +        
               POS=(5,18),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Count:   Description:',                                +        
               POS=(5,31),LTH=21,                                      +        
               ATTR=(PROT)                                                      
BUFFOM1  DFLD  POS=(7,2),LTH=2,                                        +        
               ATTR=(PROT)                                                      
BUFFG1   DFLD  POS=(7,6),LTH=2,                                        +        
               ATTR=(PROT)                                                      
BUFFPL1  DFLD  POS=(7,10),LTH=5,                                       +        
               ATTR=(PROT)                                                      
ARTNR1   DFLD  POS=(7,18),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
KVLS1    DFLD  POS=(7,30),LTH=7,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
BEART1   DFLD  POS=(7,40),LTH=25,                                      +        
               ATTR=(PROT)                                                      
BUFFOM2  DFLD  POS=(8,2),LTH=2,                                        +        
               ATTR=(PROT)                                                      
BUFFG2   DFLD  POS=(8,6),LTH=2,                                        +        
               ATTR=(PROT)                                                      
BUFFPL2  DFLD  POS=(8,10),LTH=5,                                       +        
               ATTR=(PROT)                                                      
ARTNR2   DFLD  POS=(8,18),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
KVLS2    DFLD  POS=(8,30),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
BEART2   DFLD  POS=(8,40),LTH=25,                                      +        
               ATTR=(PROT)                                                      
BUFFOM3  DFLD  POS=(9,2),LTH=2,                                        +        
               ATTR=(PROT)                                                      
BUFFG3   DFLD  POS=(9,6),LTH=2,                                        +        
               ATTR=(PROT)                                                      
BUFFPL3  DFLD  POS=(9,10),LTH=5,                                       +        
               ATTR=(PROT)                                                      
ARTNR3   DFLD  POS=(9,18),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
KVLS3    DFLD  POS=(9,30),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
BEART3   DFLD  POS=(9,40),LTH=25,                                      +        
               ATTR=(PROT)                                                      
BUFFOM4  DFLD  POS=(10,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
BUFFG4   DFLD  POS=(10,6),LTH=2,                                       +        
               ATTR=(PROT)                                                      
BUFFPL4  DFLD  POS=(10,10),LTH=5,                                      +        
               ATTR=(PROT)                                                      
ARTNR4   DFLD  POS=(10,18),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
KVLS4    DFLD  POS=(10,30),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
BEART4   DFLD  POS=(10,40),LTH=25,                                     +        
               ATTR=(PROT)                                                      
BUFFOM5  DFLD  POS=(11,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
BUFFG5   DFLD  POS=(11,6),LTH=2,                                       +        
               ATTR=(PROT)                                                      
BUFFPL5  DFLD  POS=(11,10),LTH=5,                                      +        
               ATTR=(PROT)                                                      
ARTNR5   DFLD  POS=(11,18),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
KVLS5    DFLD  POS=(11,30),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
BEART5   DFLD  POS=(11,40),LTH=25,                                     +        
               ATTR=(PROT)                                                      
BUFFOM6  DFLD  POS=(12,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
BUFFG6   DFLD  POS=(12,6),LTH=2,                                       +        
               ATTR=(PROT)                                                      
BUFFPL6  DFLD  POS=(12,10),LTH=5,                                      +        
               ATTR=(PROT)                                                      
ARTNR6   DFLD  POS=(12,18),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
KVLS6    DFLD  POS=(12,30),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
BEART6   DFLD  POS=(12,40),LTH=25,                                     +        
               ATTR=(PROT)                                                      
BUFFOM7  DFLD  POS=(13,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
BUFFG7   DFLD  POS=(13,6),LTH=2,                                       +        
               ATTR=(PROT)                                                      
BUFFPL7  DFLD  POS=(13,10),LTH=5,                                      +        
               ATTR=(PROT)                                                      
ARTNR7   DFLD  POS=(13,18),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
KVLS7    DFLD  POS=(13,30),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
BEART7   DFLD  POS=(13,40),LTH=25,                                     +        
               ATTR=(PROT)                                                      
BUFFOM8  DFLD  POS=(14,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
BUFFG8   DFLD  POS=(14,6),LTH=2,                                       +        
               ATTR=(PROT)                                                      
BUFFPL8  DFLD  POS=(14,10),LTH=5,                                      +        
               ATTR=(PROT)                                                      
ARTNR8   DFLD  POS=(14,18),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
KVLS8    DFLD  POS=(14,30),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
BEART8   DFLD  POS=(14,40),LTH=25,                                     +        
               ATTR=(PROT)                                                      
BUFFOM9  DFLD  POS=(15,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
BUFFG9   DFLD  POS=(15,6),LTH=2,                                       +        
               ATTR=(PROT)                                                      
BUFFPL9  DFLD  POS=(15,10),LTH=5,                                      +        
               ATTR=(PROT)                                                      
ARTNR9   DFLD  POS=(15,18),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
KVLS9    DFLD  POS=(15,30),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
BEART9   DFLD  POS=(15,40),LTH=25,                                     +        
               ATTR=(PROT)                                                      
BUFFOM10 DFLD  POS=(16,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
BUFFG10  DFLD  POS=(16,6),LTH=2,                                       +        
               ATTR=(PROT)                                                      
BUFFPL10 DFLD  POS=(16,10),LTH=5,                                      +        
               ATTR=(PROT)                                                      
ARTNR10  DFLD  POS=(16,18),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
KVLS10   DFLD  POS=(16,30),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
BEART10  DFLD  POS=(16,40),LTH=25,                                     +        
               ATTR=(PROT)                                                      
BUFFOM11 DFLD  POS=(17,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
BUFFG11  DFLD  POS=(17,6),LTH=2,                                       +        
               ATTR=(PROT)                                                      
BUFFPL11 DFLD  POS=(17,10),LTH=5,                                      +        
               ATTR=(PROT)                                                      
ARTNR11  DFLD  POS=(17,18),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
KVLS11   DFLD  POS=(17,30),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
BEART11  DFLD  POS=(17,40),LTH=25,                                     +        
               ATTR=(PROT)                                                      
BUFFOM12 DFLD  POS=(18,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
BUFFG12  DFLD  POS=(18,6),LTH=2,                                       +        
               ATTR=(PROT)                                                      
BUFFPL12 DFLD  POS=(18,10),LTH=5,                                      +        
               ATTR=(PROT)                                                      
ARTNR12  DFLD  POS=(18,18),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
KVLS12   DFLD  POS=(18,30),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
BEART12  DFLD  POS=(18,40),LTH=25,                                     +        
               ATTR=(PROT)                                                      
BUFFOM13 DFLD  POS=(19,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
BUFFG13  DFLD  POS=(19,6),LTH=2,                                       +        
               ATTR=(PROT)                                                      
BUFFPL13 DFLD  POS=(19,10),LTH=5,                                      +        
               ATTR=(PROT)                                                      
ARTNR13  DFLD  POS=(19,18),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
KVLS13   DFLD  POS=(19,30),LTH=7,                                      +        
               ATTR=(PROT,MOD)                                                  
BEART13  DFLD  POS=(19,40),LTH=25,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'F7=First  F8=Next  F10=WHELP  F11=Update',             +        
               POS=(22,2),LTH=40,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W5O286N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W5N286,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W5I286N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DGIA0000,                                               +        
               LTH=6                                                            
         MFLD  DGIA0002,                                               +        
               LTH=6                                                            
         MFLD  DGIA0004,                                               +        
               LTH=8                                                            
         MFLD  DGIA0001,                                               +        
               LTH=6                                                            
         MFLD  DGIA0003,                                               +        
               LTH=6                                                            
         MFLD  DGIA0005,                                               +        
               LTH=8                                                            
         MFLD  BUFFOM1,                                                +        
               LTH=2                                                            
         MFLD  BUFFG1,                                                 +        
               LTH=2                                                            
         MFLD  BUFFPL1,                                                +        
               LTH=5                                                            
         MFLD  ARTNR1,                                                 +        
               LTH=8                                                            
         MFLD  KVLS1,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BEART1,                                                 +        
               LTH=25                                                           
         MFLD  BUFFOM2,                                                +        
               LTH=2                                                            
         MFLD  BUFFG2,                                                 +        
               LTH=2                                                            
         MFLD  BUFFPL2,                                                +        
               LTH=5                                                            
         MFLD  ARTNR2,                                                 +        
               LTH=8                                                            
         MFLD  KVLS2,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BEART2,                                                 +        
               LTH=25                                                           
         MFLD  BUFFOM3,                                                +        
               LTH=2                                                            
         MFLD  BUFFG3,                                                 +        
               LTH=2                                                            
         MFLD  BUFFPL3,                                                +        
               LTH=5                                                            
         MFLD  ARTNR3,                                                 +        
               LTH=8                                                            
         MFLD  KVLS3,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BEART3,                                                 +        
               LTH=25                                                           
         MFLD  BUFFOM4,                                                +        
               LTH=2                                                            
         MFLD  BUFFG4,                                                 +        
               LTH=2                                                            
         MFLD  BUFFPL4,                                                +        
               LTH=5                                                            
         MFLD  ARTNR4,                                                 +        
               LTH=8                                                            
         MFLD  KVLS4,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BEART4,                                                 +        
               LTH=25                                                           
         MFLD  BUFFOM5,                                                +        
               LTH=2                                                            
         MFLD  BUFFG5,                                                 +        
               LTH=2                                                            
         MFLD  BUFFPL5,                                                +        
               LTH=5                                                            
         MFLD  ARTNR5,                                                 +        
               LTH=8                                                            
         MFLD  KVLS5,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BEART5,                                                 +        
               LTH=25                                                           
         MFLD  BUFFOM6,                                                +        
               LTH=2                                                            
         MFLD  BUFFG6,                                                 +        
               LTH=2                                                            
         MFLD  BUFFPL6,                                                +        
               LTH=5                                                            
         MFLD  ARTNR6,                                                 +        
               LTH=8                                                            
         MFLD  KVLS6,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BEART6,                                                 +        
               LTH=25                                                           
         MFLD  BUFFOM7,                                                +        
               LTH=2                                                            
         MFLD  BUFFG7,                                                 +        
               LTH=2                                                            
         MFLD  BUFFPL7,                                                +        
               LTH=5                                                            
         MFLD  ARTNR7,                                                 +        
               LTH=8                                                            
         MFLD  KVLS7,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BEART7,                                                 +        
               LTH=25                                                           
         MFLD  BUFFOM8,                                                +        
               LTH=2                                                            
         MFLD  BUFFG8,                                                 +        
               LTH=2                                                            
         MFLD  BUFFPL8,                                                +        
               LTH=5                                                            
         MFLD  ARTNR8,                                                 +        
               LTH=8                                                            
         MFLD  KVLS8,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BEART8,                                                 +        
               LTH=25                                                           
         MFLD  BUFFOM9,                                                +        
               LTH=2                                                            
         MFLD  BUFFG9,                                                 +        
               LTH=2                                                            
         MFLD  BUFFPL9,                                                +        
               LTH=5                                                            
         MFLD  ARTNR9,                                                 +        
               LTH=8                                                            
         MFLD  KVLS9,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BEART9,                                                 +        
               LTH=25                                                           
         MFLD  BUFFOM10,                                               +        
               LTH=2                                                            
         MFLD  BUFFG10,                                                +        
               LTH=2                                                            
         MFLD  BUFFPL10,                                               +        
               LTH=5                                                            
         MFLD  ARTNR10,                                                +        
               LTH=8                                                            
         MFLD  KVLS10,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BEART10,                                                +        
               LTH=25                                                           
         MFLD  BUFFOM11,                                               +        
               LTH=2                                                            
         MFLD  BUFFG11,                                                +        
               LTH=2                                                            
         MFLD  BUFFPL11,                                               +        
               LTH=5                                                            
         MFLD  ARTNR11,                                                +        
               LTH=8                                                            
         MFLD  KVLS11,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BEART11,                                                +        
               LTH=25                                                           
         MFLD  BUFFOM12,                                               +        
               LTH=2                                                            
         MFLD  BUFFG12,                                                +        
               LTH=2                                                            
         MFLD  BUFFPL12,                                               +        
               LTH=5                                                            
         MFLD  ARTNR12,                                                +        
               LTH=8                                                            
         MFLD  KVLS12,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BEART12,                                                +        
               LTH=25                                                           
         MFLD  BUFFOM13,                                               +        
               LTH=2                                                            
         MFLD  BUFFG13,                                                +        
               LTH=2                                                            
         MFLD  BUFFPL13,                                               +        
               LTH=5                                                            
         MFLD  ARTNR13,                                                +        
               LTH=8                                                            
         MFLD  KVLS13,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BEART13,                                                +        
               LTH=25                                                           
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W5I286N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W5N286),                                           +        
               OPT=2,                                                  +        
               NXT=W5O286N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F8'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '52861',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0000,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0002,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0004,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0001,                                               +        
               LTH=6,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0003,                                               +        
               LTH=6,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0005,                                               +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (ARTNR1,                                                +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (KVLS1,                                                 +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (ARTNR2,                                                +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (KVLS2,                                                 +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (ARTNR3,                                                +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (KVLS3,                                                 +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (ARTNR4,                                                +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (KVLS4,                                                 +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (ARTNR5,                                                +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (KVLS5,                                                 +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (ARTNR6,                                                +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (KVLS6,                                                 +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (ARTNR7,                                                +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (KVLS7,                                                 +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (ARTNR8,                                                +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (KVLS8,                                                 +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (ARTNR9,                                                +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (KVLS9,                                                 +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (ARTNR10,                                               +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (KVLS10,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (ARTNR11,                                               +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (KVLS11,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (ARTNR12,                                               +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (KVLS12,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (ARTNR13,                                               +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (KVLS13,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
