***********************************************************************         
* CREATED BY V065708   ON 05/07/12  AT 16:07                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W5N312   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W5T101  ',                                           +        
               2='W5T102  ',                                           +        
               3='W5T103  ',                                           +        
               4='W5T104  ',                                           +        
               5='W5T105  ',                                           +        
               6='W5T106  ',                                           +        
               7='W5T312 7',                                           +        
               8='W5T312 8',                                           +        
               9='W5T109  ',                                           +        
               10='WHELP   ',                                          +        
               11='W5T312U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W5T101  ',                                          +        
               14='W5T102  ',                                          +        
               15='W5T103  ',                                          +        
               16='W5T104  ',                                          +        
               17='W5T105  ',                                          +        
               18='W5T106  ',                                          +        
               19='W5T107  ',                                          +        
               20='W5T108  ',                                          +        
               21='W5T109  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,9)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
         DFLD  'INVENTORY ADJUSTMENTS HISTORY',                        +        
               POS=(1,10),LTH=29,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,40),LTH=41,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'PARTNO',                                               +        
               POS=(2,2),LTH=6,                                        +        
               ATTR=(NUM,PROT)                                                  
ARTNRIN  DFLD  POS=(2,9),LTH=9,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'TYPE',                                                 +        
               POS=(2,19),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
TYPEIN   DFLD  POS=(2,24),LTH=1,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'DC',                                                   +        
               POS=(2,43),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
IDDCIN   DFLD  POS=(2,46),LTH=2,                                       +        
               ATTR=(NOPROT,MOD)                                                
ARTNRUT  DFLD  POS=(3,9),LTH=9,                                        +        
               ATTR=(PROT)                                                      
TYPEUT   DFLD  POS=(3,24),LTH=1,                                       +        
               ATTR=(PROT)                                                      
IDDCUT   DFLD  POS=(3,46),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Mail',                                                 +        
               POS=(5,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
ARBTYP   DFLD  POS=(5,7),LTH=4,                                        +        
               ATTR=(NOPROT)                                                    
PERSON   DFLD  POS=(5,12),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Time',                                                 +        
               POS=(5,32),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Total Time',                                           +        
               POS=(5,46),LTH=10,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Type',                                                 +        
               POS=(6,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Id',                                                   +        
               POS=(6,25),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'From Tom Days From Tom    Days',                       +        
               POS=(6,32),LTH=30,                                      +        
               ATTR=(PROT)                                                      
RADINF01 DFLD  POS=(7,2),LTH=79,                                       +        
               ATTR=(PROT)                                                      
RADINF02 DFLD  POS=(8,2),LTH=79,                                       +        
               ATTR=(NUM,PROT)                                                  
RADINF03 DFLD  POS=(9,2),LTH=79,                                       +        
               ATTR=(NUM,PROT)                                                  
RADINF04 DFLD  POS=(10,2),LTH=79,                                      +        
               ATTR=(NUM,PROT)                                                  
RADINF05 DFLD  POS=(11,2),LTH=79,                                      +        
               ATTR=(NUM,PROT)                                                  
RADINF06 DFLD  POS=(12,2),LTH=79,                                      +        
               ATTR=(NUM,PROT)                                                  
RADINF07 DFLD  POS=(13,2),LTH=79,                                      +        
               ATTR=(NUM,PROT)                                                  
RADINF08 DFLD  POS=(14,2),LTH=79,                                      +        
               ATTR=(NUM,PROT)                                                  
RADINF09 DFLD  POS=(15,2),LTH=79,                                      +        
               ATTR=(NUM,PROT)                                                  
RADINF10 DFLD  POS=(16,2),LTH=79,                                      +        
               ATTR=(NUM,PROT)                                                  
RADINF11 DFLD  POS=(17,2),LTH=79,                                      +        
               ATTR=(NUM,PROT)                                                  
RADINF12 DFLD  POS=(18,2),LTH=79,                                      +        
               ATTR=(NUM,PROT)                                                  
RADINF13 DFLD  POS=(19,2),LTH=79,                                      +        
               ATTR=(NUM,PROT)                                                  
RADINF14 DFLD  POS=(20,2),LTH=79,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'F1=HELP F7=FIRST F8=FORWARD F11=UPDATE F12=LOGOFF',    +        
               POS=(22,2),LTH=49,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE4    DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W5O312N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W5N312,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W5I312N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  ARTNRIN,                                                +        
               LTH=9                                                            
         MFLD  ARTNRUT,                                                +        
               LTH=9                                                            
         MFLD  TYPEIN,                                                 +        
               LTH=1                                                            
         MFLD  TYPEUT,                                                 +        
               LTH=1                                                            
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  ARBTYP,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PERSON,                                                 +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RADINF01,                                               +        
               LTH=79                                                           
         MFLD  RADINF02,                                               +        
               LTH=79                                                           
         MFLD  RADINF03,                                               +        
               LTH=79                                                           
         MFLD  RADINF04,                                               +        
               LTH=79                                                           
         MFLD  RADINF05,                                               +        
               LTH=79                                                           
         MFLD  RADINF06,                                               +        
               LTH=79                                                           
         MFLD  RADINF07,                                               +        
               LTH=79                                                           
         MFLD  RADINF08,                                               +        
               LTH=79                                                           
         MFLD  RADINF09,                                               +        
               LTH=79                                                           
         MFLD  RADINF10,                                               +        
               LTH=79                                                           
         MFLD  RADINF11,                                               +        
               LTH=79                                                           
         MFLD  RADINF12,                                               +        
               LTH=79                                                           
         MFLD  RADINF13,                                               +        
               LTH=79                                                           
         MFLD  RADINF14,                                               +        
               LTH=79                                                           
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE4,                                                 +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W5I312N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W5N312),                                           +        
               OPT=2,                                                  +        
               NXT=W5O312N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '53122',                                                +        
               LTH=5                                                            
         MFLD  (ARTNRIN,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TYPEIN,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARBTYP,                                                +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               FILL=X'40'                                                       
         MFLD  (PERSON,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
