***********************************************************************         
* CREATED BY PC36146   ON 95/06/28  AT 15:08                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W5N303   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W5T303 7',                                           +        
               8='W5T303 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W5T301  ',                                          +        
               14='W5T302  ',                                          +        
               15='W5T303  ',                                          +        
               16='W5T304  ',                                          +        
               17='W5T305  ',                                          +        
               18='W0T501  ',                                          +        
               19='W5T303 7',                                          +        
               20='W5T303 8',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,14)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'INV.QUEUE OVERVIEW',                                   +        
               POS=(1,11),LTH=18,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'DC',                                                   +        
               POS=(2,11),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDDCIN   DFLD  POS=(2,14),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
IDDCUT   DFLD  POS=(3,14),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0430  DFLD  POS=(4,30),LTH=1,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0435  DFLD  POS=(4,35),LTH=2,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0440  DFLD  POS=(4,40),LTH=1,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0445  DFLD  POS=(4,45),LTH=2,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'VVCL  AREA  QUANTITY    VVCL  AREA  QUANTITY    VVCL  A+        
               REA  QUANTITY',                                         +        
               POS=(5,7),LTH=68,                                       +        
               ATTR=(PROT)                                                      
FLD0708  DFLD  POS=(7,8),LTH=1,                                        +        
               ATTR=(PROT)                                                      
FLD0713  DFLD  POS=(7,13),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD0718  DFLD  POS=(7,18),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0732  DFLD  POS=(7,32),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0737  DFLD  POS=(7,37),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD0742  DFLD  POS=(7,42),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0756  DFLD  POS=(7,56),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0761  DFLD  POS=(7,61),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD0766  DFLD  POS=(7,66),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0808  DFLD  POS=(8,8),LTH=1,                                        +        
               ATTR=(PROT)                                                      
FLD0813  DFLD  POS=(8,13),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD0818  DFLD  POS=(8,18),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0832  DFLD  POS=(8,32),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0837  DFLD  POS=(8,37),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD0842  DFLD  POS=(8,42),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0856  DFLD  POS=(8,56),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0861  DFLD  POS=(8,61),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD0866  DFLD  POS=(8,66),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0908  DFLD  POS=(9,8),LTH=1,                                        +        
               ATTR=(PROT)                                                      
FLD0913  DFLD  POS=(9,13),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD0918  DFLD  POS=(9,18),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0932  DFLD  POS=(9,32),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0937  DFLD  POS=(9,37),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD0942  DFLD  POS=(9,42),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0956  DFLD  POS=(9,56),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0961  DFLD  POS=(9,61),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD0966  DFLD  POS=(9,66),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD1008  DFLD  POS=(10,8),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD1013  DFLD  POS=(10,13),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1018  DFLD  POS=(10,18),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1032  DFLD  POS=(10,32),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1037  DFLD  POS=(10,37),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1042  DFLD  POS=(10,42),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1056  DFLD  POS=(10,56),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1061  DFLD  POS=(10,61),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1066  DFLD  POS=(10,66),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1108  DFLD  POS=(11,8),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD1113  DFLD  POS=(11,13),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1118  DFLD  POS=(11,18),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1132  DFLD  POS=(11,32),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1137  DFLD  POS=(11,37),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1142  DFLD  POS=(11,42),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1156  DFLD  POS=(11,56),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1161  DFLD  POS=(11,61),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1166  DFLD  POS=(11,66),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1208  DFLD  POS=(12,8),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD1213  DFLD  POS=(12,13),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1218  DFLD  POS=(12,18),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1232  DFLD  POS=(12,32),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1237  DFLD  POS=(12,37),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1242  DFLD  POS=(12,42),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1256  DFLD  POS=(12,56),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1261  DFLD  POS=(12,61),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1266  DFLD  POS=(12,66),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1308  DFLD  POS=(13,8),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD1313  DFLD  POS=(13,13),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1318  DFLD  POS=(13,18),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1332  DFLD  POS=(13,32),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1337  DFLD  POS=(13,37),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1342  DFLD  POS=(13,42),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1356  DFLD  POS=(13,56),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1361  DFLD  POS=(13,61),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1366  DFLD  POS=(13,66),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1408  DFLD  POS=(14,8),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD1413  DFLD  POS=(14,13),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1418  DFLD  POS=(14,18),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1432  DFLD  POS=(14,32),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1437  DFLD  POS=(14,37),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1442  DFLD  POS=(14,42),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1456  DFLD  POS=(14,56),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1461  DFLD  POS=(14,61),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1466  DFLD  POS=(14,66),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1508  DFLD  POS=(15,8),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD1513  DFLD  POS=(15,13),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1518  DFLD  POS=(15,18),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1532  DFLD  POS=(15,32),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1537  DFLD  POS=(15,37),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1542  DFLD  POS=(15,42),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1556  DFLD  POS=(15,56),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1561  DFLD  POS=(15,61),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1566  DFLD  POS=(15,66),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'TOTALY PRINTED',                                       +        
               POS=(17,4),LTH=14,                                      +        
               ATTR=(PROT)                                                      
FLD1725  DFLD  POS=(17,25),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'TOTALY NOT PRINTED',                                   +        
               POS=(19,4),LTH=18,                                      +        
               ATTR=(PROT)                                                      
FLD1925  DFLD  POS=(19,25),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '13 PRINT INV.   14 INV.QUEUE    15 INV.OVERVIEW 16 INV.+        
                REQUEST 17 QUANT.CARD',                                +        
               POS=(21,2),LTH=77,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W5O303N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W5N303,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W5I303N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  FLD0430,                                                +        
               LTH=1                                                            
         MFLD  FLD0435,                                                +        
               LTH=2                                                            
         MFLD  FLD0440,                                                +        
               LTH=1                                                            
         MFLD  FLD0445,                                                +        
               LTH=2                                                            
         MFLD  FLD0708,                                                +        
               LTH=1                                                            
         MFLD  FLD0713,                                                +        
               LTH=2                                                            
         MFLD  FLD0718,                                                +        
               LTH=6                                                            
         MFLD  FLD0808,                                                +        
               LTH=1                                                            
         MFLD  FLD0813,                                                +        
               LTH=2                                                            
         MFLD  FLD0818,                                                +        
               LTH=6                                                            
         MFLD  FLD0908,                                                +        
               LTH=1                                                            
         MFLD  FLD0913,                                                +        
               LTH=2                                                            
         MFLD  FLD0918,                                                +        
               LTH=6                                                            
         MFLD  FLD1008,                                                +        
               LTH=1                                                            
         MFLD  FLD1013,                                                +        
               LTH=2                                                            
         MFLD  FLD1018,                                                +        
               LTH=6                                                            
         MFLD  FLD1108,                                                +        
               LTH=1                                                            
         MFLD  FLD1113,                                                +        
               LTH=2                                                            
         MFLD  FLD1118,                                                +        
               LTH=6                                                            
         MFLD  FLD1208,                                                +        
               LTH=1                                                            
         MFLD  FLD1213,                                                +        
               LTH=2                                                            
         MFLD  FLD1218,                                                +        
               LTH=6                                                            
         MFLD  FLD1308,                                                +        
               LTH=1                                                            
         MFLD  FLD1313,                                                +        
               LTH=2                                                            
         MFLD  FLD1318,                                                +        
               LTH=6                                                            
         MFLD  FLD1408,                                                +        
               LTH=1                                                            
         MFLD  FLD1413,                                                +        
               LTH=2                                                            
         MFLD  FLD1418,                                                +        
               LTH=6                                                            
         MFLD  FLD1508,                                                +        
               LTH=1                                                            
         MFLD  FLD1513,                                                +        
               LTH=2                                                            
         MFLD  FLD1518,                                                +        
               LTH=6                                                            
         MFLD  FLD0732,                                                +        
               LTH=1                                                            
         MFLD  FLD0737,                                                +        
               LTH=2                                                            
         MFLD  FLD0742,                                                +        
               LTH=6                                                            
         MFLD  FLD0832,                                                +        
               LTH=1                                                            
         MFLD  FLD0837,                                                +        
               LTH=2                                                            
         MFLD  FLD0842,                                                +        
               LTH=6                                                            
         MFLD  FLD0932,                                                +        
               LTH=1                                                            
         MFLD  FLD0937,                                                +        
               LTH=2                                                            
         MFLD  FLD0942,                                                +        
               LTH=6                                                            
         MFLD  FLD1032,                                                +        
               LTH=1                                                            
         MFLD  FLD1037,                                                +        
               LTH=2                                                            
         MFLD  FLD1042,                                                +        
               LTH=6                                                            
         MFLD  FLD1132,                                                +        
               LTH=1                                                            
         MFLD  FLD1137,                                                +        
               LTH=2                                                            
         MFLD  FLD1142,                                                +        
               LTH=6                                                            
         MFLD  FLD1232,                                                +        
               LTH=1                                                            
         MFLD  FLD1237,                                                +        
               LTH=2                                                            
         MFLD  FLD1242,                                                +        
               LTH=6                                                            
         MFLD  FLD1332,                                                +        
               LTH=1                                                            
         MFLD  FLD1337,                                                +        
               LTH=2                                                            
         MFLD  FLD1342,                                                +        
               LTH=6                                                            
         MFLD  FLD1432,                                                +        
               LTH=1                                                            
         MFLD  FLD1437,                                                +        
               LTH=2                                                            
         MFLD  FLD1442,                                                +        
               LTH=6                                                            
         MFLD  FLD1532,                                                +        
               LTH=1                                                            
         MFLD  FLD1537,                                                +        
               LTH=2                                                            
         MFLD  FLD1542,                                                +        
               LTH=6                                                            
         MFLD  FLD0756,                                                +        
               LTH=1                                                            
         MFLD  FLD0761,                                                +        
               LTH=2                                                            
         MFLD  FLD0766,                                                +        
               LTH=6                                                            
         MFLD  FLD0856,                                                +        
               LTH=1                                                            
         MFLD  FLD0861,                                                +        
               LTH=2                                                            
         MFLD  FLD0866,                                                +        
               LTH=6                                                            
         MFLD  FLD0956,                                                +        
               LTH=1                                                            
         MFLD  FLD0961,                                                +        
               LTH=2                                                            
         MFLD  FLD0966,                                                +        
               LTH=6                                                            
         MFLD  FLD1056,                                                +        
               LTH=1                                                            
         MFLD  FLD1061,                                                +        
               LTH=2                                                            
         MFLD  FLD1066,                                                +        
               LTH=6                                                            
         MFLD  FLD1156,                                                +        
               LTH=1                                                            
         MFLD  FLD1161,                                                +        
               LTH=2                                                            
         MFLD  FLD1166,                                                +        
               LTH=6                                                            
         MFLD  FLD1256,                                                +        
               LTH=1                                                            
         MFLD  FLD1261,                                                +        
               LTH=2                                                            
         MFLD  FLD1266,                                                +        
               LTH=6                                                            
         MFLD  FLD1356,                                                +        
               LTH=1                                                            
         MFLD  FLD1361,                                                +        
               LTH=2                                                            
         MFLD  FLD1366,                                                +        
               LTH=6                                                            
         MFLD  FLD1456,                                                +        
               LTH=1                                                            
         MFLD  FLD1461,                                                +        
               LTH=2                                                            
         MFLD  FLD1466,                                                +        
               LTH=6                                                            
         MFLD  FLD1556,                                                +        
               LTH=1                                                            
         MFLD  FLD1561,                                                +        
               LTH=2                                                            
         MFLD  FLD1566,                                                +        
               LTH=6                                                            
         MFLD  FLD1725,                                                +        
               LTH=6                                                            
         MFLD  FLD1925,                                                +        
               LTH=6                                                            
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W5I303N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W5N303),                                           +        
               OPT=2,                                                  +        
               NXT=W5O303N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '53032',                                                +        
               LTH=5                                                            
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDCUT,                                                 +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0430,                                                +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0435,                                                +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0440,                                                +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0445,                                                +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
