***********************************************************************         
* CREATED BY V065708   ON 08/10/10  AT 14:47                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'Automatjustering                '                               
W5N308   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W5T308U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'AUTOMATIC ADJUSTMENT',                                 +        
               POS=(1,11),LTH=20,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'List no',                                              +        
               POS=(2,2),LTH=7,                                        +        
               ATTR=(NUM,PROT)                                                  
PRINTIN  DFLD  POS=(2,12),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'PH-id',                                                +        
               POS=(2,19),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
PCIDIN   DFLD  POS=(2,25),LTH=8,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'DC',                                                   +        
               POS=(2,35),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DC       DFLD  POS=(2,38),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
PRINTUT  DFLD  POS=(3,12),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
PCIDUT   DFLD  POS=(3,25),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'If all partno:s below have difference 0 write Y here', +        
               POS=(5,2),LTH=52,                                       +        
               ATTR=(PROT)                                                      
OKIN     DFLD  POS=(5,55),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Fill in Phys Qty or Diff',                             +        
               POS=(6,2),LTH=24,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Re',                                                   +        
               POS=(7,75),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Partno    Name',                                       +        
               POS=(8,2),LTH=14,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'AK   St bal',                                          +        
               POS=(8,33),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Efr Phys Qty',                                         +        
               POS=(8,50),LTH=12,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Diff count',                                           +        
               POS=(8,69),LTH=10,                                      +        
               ATTR=(PROT)                                                      
ARTTAB1  DFLD  POS=(9,2),LTH=9,                                        +        
               ATTR=(PROT,MOD)                                                  
BENAMN1  DFLD  POS=(9,12),LTH=14,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
AK1      DFLD  POS=(9,27),LTH=8,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
LS1      DFLD  POS=(9,36),LTH=8,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
EFR1     DFLD  POS=(9,45),LTH=8,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
FYSANT1  DFLD  POS=(9,55),LTH=6,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
TECKEN1  DFLD  POS=(9,65),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DIFF1    DFLD  POS=(9,67),LTH=6,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLOMIN01 DFLD  POS=(9,76),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
FELRAD01 DFLD  POS=(9,80),LTH=1,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
ARTTAB2  DFLD  POS=(10,2),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
BENAMN2  DFLD  POS=(10,12),LTH=14,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AK2      DFLD  POS=(10,27),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
LS2      DFLD  POS=(10,36),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
EFR2     DFLD  POS=(10,45),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FYSANT2  DFLD  POS=(10,55),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
TECKEN2  DFLD  POS=(10,65),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
DIFF2    DFLD  POS=(10,67),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLOMIN02 DFLD  POS=(10,76),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
FELRAD02 DFLD  POS=(10,80),LTH=1,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
ARTTAB3  DFLD  POS=(11,2),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
BENAMN3  DFLD  POS=(11,12),LTH=14,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AK3      DFLD  POS=(11,27),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
LS3      DFLD  POS=(11,36),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
EFR3     DFLD  POS=(11,45),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FYSANT3  DFLD  POS=(11,55),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
TECKEN3  DFLD  POS=(11,65),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
DIFF3    DFLD  POS=(11,67),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLOMIN03 DFLD  POS=(11,76),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
FELRAD03 DFLD  POS=(11,80),LTH=1,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
ARTTAB4  DFLD  POS=(12,2),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
BENAMN4  DFLD  POS=(12,12),LTH=14,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AK4      DFLD  POS=(12,27),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
LS4      DFLD  POS=(12,36),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
EFR4     DFLD  POS=(12,45),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FYSANT4  DFLD  POS=(12,55),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
TECKEN4  DFLD  POS=(12,65),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
DIFF4    DFLD  POS=(12,67),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLOMIN04 DFLD  POS=(12,76),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
FELRAD04 DFLD  POS=(12,80),LTH=1,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
ARTTAB5  DFLD  POS=(13,2),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
BENAMN5  DFLD  POS=(13,12),LTH=14,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AK5      DFLD  POS=(13,27),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
LS5      DFLD  POS=(13,36),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
EFR5     DFLD  POS=(13,45),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FYSANT5  DFLD  POS=(13,55),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
TECKEN5  DFLD  POS=(13,65),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
DIFF5    DFLD  POS=(13,67),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLOMIN05 DFLD  POS=(13,76),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
FELRAD05 DFLD  POS=(13,80),LTH=1,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
ARTTAB6  DFLD  POS=(14,2),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
BENAMN6  DFLD  POS=(14,12),LTH=14,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AK6      DFLD  POS=(14,27),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
LS6      DFLD  POS=(14,36),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
EFR6     DFLD  POS=(14,45),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FYSANT6  DFLD  POS=(14,55),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
TECKEN6  DFLD  POS=(14,65),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
DIFF6    DFLD  POS=(14,67),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLOMIN06 DFLD  POS=(14,76),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
FELRAD06 DFLD  POS=(14,80),LTH=1,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
ARTTAB7  DFLD  POS=(15,2),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
BENAMN7  DFLD  POS=(15,12),LTH=14,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AK7      DFLD  POS=(15,27),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
LS7      DFLD  POS=(15,36),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
EFR7     DFLD  POS=(15,45),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FYSANT7  DFLD  POS=(15,55),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
TECKEN7  DFLD  POS=(15,65),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
DIFF7    DFLD  POS=(15,67),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLOMIN07 DFLD  POS=(15,76),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
FELRAD07 DFLD  POS=(15,80),LTH=1,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
ARTTAB8  DFLD  POS=(16,2),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
BENAMN8  DFLD  POS=(16,12),LTH=14,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AK8      DFLD  POS=(16,27),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
LS8      DFLD  POS=(16,36),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
EFR8     DFLD  POS=(16,45),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FYSANT8  DFLD  POS=(16,55),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
TECKEN8  DFLD  POS=(16,65),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
DIFF8    DFLD  POS=(16,67),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLOMIN08 DFLD  POS=(16,76),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
FELRAD08 DFLD  POS=(16,80),LTH=1,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
ARTTAB9  DFLD  POS=(17,2),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
BENAMN9  DFLD  POS=(17,12),LTH=14,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AK9      DFLD  POS=(17,27),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
LS9      DFLD  POS=(17,36),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
EFR9     DFLD  POS=(17,45),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FYSANT9  DFLD  POS=(17,55),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
TECKEN9  DFLD  POS=(17,65),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
DIFF9    DFLD  POS=(17,67),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLOMIN09 DFLD  POS=(17,76),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
FELRAD09 DFLD  POS=(17,80),LTH=1,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
ARTTAB10 DFLD  POS=(18,2),LTH=9,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
BENAMN10 DFLD  POS=(18,12),LTH=14,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
AK10     DFLD  POS=(18,27),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
LS10     DFLD  POS=(18,36),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
EFR10    DFLD  POS=(18,45),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FYSANT10 DFLD  POS=(18,55),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
TECKEN10 DFLD  POS=(18,65),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
DIFF10   DFLD  POS=(18,67),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLOMIN10 DFLD  POS=(18,76),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
FELRAD10 DFLD  POS=(18,80),LTH=1,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'F10=WHELP  F11=Update',                                +        
               POS=(22,2),LTH=21,                                      +        
               ATTR=(PROT)                                                      
FLD2306  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,63),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W5O308N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W5N308,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W5I308N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  PRINTIN,                                                +        
               LTH=6                                                            
         MFLD  PCIDIN,                                                 +        
               LTH=8                                                            
         MFLD  DC,                                                     +        
               LTH=2                                                            
         MFLD  PRINTUT,                                                +        
               LTH=6                                                            
         MFLD  PCIDUT,                                                 +        
               LTH=8                                                            
         MFLD  OKIN,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTTAB1,                                                +        
               LTH=9                                                            
         MFLD  BENAMN1,                                                +        
               LTH=14                                                           
         MFLD  AK1,                                                    +        
               LTH=8                                                            
         MFLD  LS1,                                                    +        
               LTH=8                                                            
         MFLD  EFR1,                                                   +        
               LTH=8                                                            
         MFLD  FYSANT1,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TECKEN1,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DIFF1,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLOMIN01,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FELRAD01,                                               +        
               LTH=1                                                            
         MFLD  ARTTAB2,                                                +        
               LTH=9                                                            
         MFLD  BENAMN2,                                                +        
               LTH=14                                                           
         MFLD  AK2,                                                    +        
               LTH=8                                                            
         MFLD  LS2,                                                    +        
               LTH=8                                                            
         MFLD  EFR2,                                                   +        
               LTH=8                                                            
         MFLD  FYSANT2,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TECKEN2,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DIFF2,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLOMIN02,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FELRAD02,                                               +        
               LTH=1                                                            
         MFLD  ARTTAB3,                                                +        
               LTH=9                                                            
         MFLD  BENAMN3,                                                +        
               LTH=14                                                           
         MFLD  AK3,                                                    +        
               LTH=8                                                            
         MFLD  LS3,                                                    +        
               LTH=8                                                            
         MFLD  EFR3,                                                   +        
               LTH=8                                                            
         MFLD  FYSANT3,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TECKEN3,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DIFF3,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLOMIN03,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FELRAD03,                                               +        
               LTH=1                                                            
         MFLD  ARTTAB4,                                                +        
               LTH=9                                                            
         MFLD  BENAMN4,                                                +        
               LTH=14                                                           
         MFLD  AK4,                                                    +        
               LTH=8                                                            
         MFLD  LS4,                                                    +        
               LTH=8                                                            
         MFLD  EFR4,                                                   +        
               LTH=8                                                            
         MFLD  FYSANT4,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TECKEN4,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DIFF4,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLOMIN04,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FELRAD04,                                               +        
               LTH=1                                                            
         MFLD  ARTTAB5,                                                +        
               LTH=9                                                            
         MFLD  BENAMN5,                                                +        
               LTH=14                                                           
         MFLD  AK5,                                                    +        
               LTH=8                                                            
         MFLD  LS5,                                                    +        
               LTH=8                                                            
         MFLD  EFR5,                                                   +        
               LTH=8                                                            
         MFLD  FYSANT5,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TECKEN5,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DIFF5,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLOMIN05,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FELRAD05,                                               +        
               LTH=1                                                            
         MFLD  ARTTAB6,                                                +        
               LTH=9                                                            
         MFLD  BENAMN6,                                                +        
               LTH=14                                                           
         MFLD  AK6,                                                    +        
               LTH=8                                                            
         MFLD  LS6,                                                    +        
               LTH=8                                                            
         MFLD  EFR6,                                                   +        
               LTH=8                                                            
         MFLD  FYSANT6,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TECKEN6,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DIFF6,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLOMIN06,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FELRAD06,                                               +        
               LTH=1                                                            
         MFLD  ARTTAB7,                                                +        
               LTH=9                                                            
         MFLD  BENAMN7,                                                +        
               LTH=14                                                           
         MFLD  AK7,                                                    +        
               LTH=8                                                            
         MFLD  LS7,                                                    +        
               LTH=8                                                            
         MFLD  EFR7,                                                   +        
               LTH=8                                                            
         MFLD  FYSANT7,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TECKEN7,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DIFF7,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLOMIN07,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FELRAD07,                                               +        
               LTH=1                                                            
         MFLD  ARTTAB8,                                                +        
               LTH=9                                                            
         MFLD  BENAMN8,                                                +        
               LTH=14                                                           
         MFLD  AK8,                                                    +        
               LTH=8                                                            
         MFLD  LS8,                                                    +        
               LTH=8                                                            
         MFLD  EFR8,                                                   +        
               LTH=8                                                            
         MFLD  FYSANT8,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TECKEN8,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DIFF8,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLOMIN08,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FELRAD08,                                               +        
               LTH=1                                                            
         MFLD  ARTTAB9,                                                +        
               LTH=9                                                            
         MFLD  BENAMN9,                                                +        
               LTH=14                                                           
         MFLD  AK9,                                                    +        
               LTH=8                                                            
         MFLD  LS9,                                                    +        
               LTH=8                                                            
         MFLD  EFR9,                                                   +        
               LTH=8                                                            
         MFLD  FYSANT9,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TECKEN9,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DIFF9,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLOMIN09,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FELRAD09,                                               +        
               LTH=1                                                            
         MFLD  ARTTAB10,                                               +        
               LTH=9                                                            
         MFLD  BENAMN10,                                               +        
               LTH=14                                                           
         MFLD  AK10,                                                   +        
               LTH=8                                                            
         MFLD  LS10,                                                   +        
               LTH=8                                                            
         MFLD  EFR10,                                                  +        
               LTH=8                                                            
         MFLD  FYSANT10,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TECKEN10,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DIFF10,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLOMIN10,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FELRAD10,                                               +        
               LTH=1                                                            
         MFLD  FLD2306,                                                +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W5I308N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W5N308),                                           +        
               OPT=2,                                                  +        
               NXT=W5O308N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  (FLD0102,                                               +        
               '5'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  (FLD0104,                                               +        
               '3'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  (FLD0106,                                               +        
               '0'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0108,                                               +        
               '8'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F8'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '53082',                                                +        
               LTH=5                                                            
         MFLD  (PRINTIN,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               FILL=X'40'                                                       
         MFLD  (PCIDIN,                                                +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R                                                           
         MFLD  (OKIN,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FYSANT1,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TECKEN1,                                               +        
               ' '),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DIFF1,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLOMIN01,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (FELRAD01,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FYSANT2,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TECKEN2,                                               +        
               ' '),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DIFF2,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLOMIN02,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (FELRAD02,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FYSANT3,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TECKEN3,                                               +        
               ' '),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DIFF3,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLOMIN03,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (FELRAD03,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FYSANT4,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TECKEN4,                                               +        
               ' '),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DIFF4,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLOMIN04,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (FELRAD04,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FYSANT5,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TECKEN5,                                               +        
               ' '),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DIFF5,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLOMIN05,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (FELRAD05,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FYSANT6,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TECKEN6,                                               +        
               ' '),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DIFF6,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLOMIN06,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (FELRAD06,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FYSANT7,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TECKEN7,                                               +        
               ' '),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DIFF7,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLOMIN07,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (FELRAD07,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FYSANT8,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TECKEN8,                                               +        
               ' '),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DIFF8,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLOMIN08,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (FELRAD08,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FYSANT9,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TECKEN9,                                               +        
               ' '),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DIFF9,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLOMIN09,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (FELRAD09,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FYSANT10,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TECKEN10,                                              +        
               ' '),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DIFF10,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLOMIN10,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (FELRAD10,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
