***********************************************************************         
* CREATED BY V065708   ON 99/09/24  AT 14:22                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'inventeringskö 2                '                               
W5N309   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W5T309 7',                                           +        
               8='W5T309 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W5T309U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W5T302  ',                                          +        
               15='W5T303  ',                                          +        
               16='W5T304  ',                                          +        
               17='W5T305  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W5T308  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'INVENTORY QUEUE 2',                                    +        
               POS=(1,10),LTH=17,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'DC',                                                   +        
               POS=(2,2),LTH=2,                                        +        
               ATTR=(NUM,PROT)                                                  
DCIN     DFLD  POS=(2,5),LTH=2,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'ADR',                                                  +        
               POS=(2,8),LTH=3,                                        +        
               ATTR=(NUM,PROT)                                                  
OMRADEIN DFLD  POS=(2,12),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
GANGIN   DFLD  POS=(2,15),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
PLATSIN  DFLD  POS=(2,18),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'INV.ROUND',                                            +        
               POS=(2,24),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
INVOMGIN DFLD  POS=(2,34),LTH=1,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'PC',                                                   +        
               POS=(2,36),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
PKIN     DFLD  POS=(2,39),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
DCUT     DFLD  POS=(3,5),LTH=2,                                        +        
               ATTR=(PROT,MOD)                                                  
OMRADEUT DFLD  POS=(3,12),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
GANGUT   DFLD  POS=(3,15),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
PLATSUT  DFLD  POS=(3,18),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
INVOMGUT DFLD  POS=(3,34),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
PKUT     DFLD  POS=(3,39),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Qty of part',                                          +        
               POS=(5,2),LTH=11,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'nos.',                                                 +        
               POS=(5,14),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'to be printed',                                        +        
               POS=(5,19),LTH=13,                                      +        
               ATTR=(PROT)                                                      
RADER    DFLD  POS=(5,34),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Qty of parts on queue',                                +        
               POS=(5,38),LTH=21,                                      +        
               ATTR=(PROT)                                                      
RADERKO  DFLD  POS=(5,60),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'AREA AISLE LOC PRIO  VVKL  PARTNO   CAT  PC    PG    FG+        
               RP',                                                    +        
               POS=(8,2),LTH=57,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'DATE LISTNR',                                          +        
               POS=(8,64),LTH=11,                                      +        
               ATTR=(PROT)                                                      
OMR01    DFLD  POS=(10,3),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
GANG01   DFLD  POS=(10,9),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
PLATS01  DFLD  POS=(10,12),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
PRIO01   DFLD  POS=(10,19),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
VVKL01   DFLD  POS=(10,24),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
ARTNR01  DFLD  POS=(10,27),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
KAT01    DFLD  POS=(10,39),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
PK01     DFLD  POS=(10,44),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
PSLAG01  DFLD  POS=(10,49),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
FUNKGR01 DFLD  POS=(10,55),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DATUM01  DFLD  POS=(10,62),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LISTNR01 DFLD  POS=(10,69),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
OMR02    DFLD  POS=(11,3),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
GANG02   DFLD  POS=(11,9),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
PLATS02  DFLD  POS=(11,12),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
PRIO02   DFLD  POS=(11,19),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
VVKL02   DFLD  POS=(11,24),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
ARTNR02  DFLD  POS=(11,27),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
KAT02    DFLD  POS=(11,39),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
PK02     DFLD  POS=(11,44),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
PSLAG02  DFLD  POS=(11,49),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
FUNKGR02 DFLD  POS=(11,55),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DATUM02  DFLD  POS=(11,62),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LISTNR02 DFLD  POS=(11,69),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
OMR03    DFLD  POS=(12,3),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
GANG03   DFLD  POS=(12,9),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
PLATS03  DFLD  POS=(12,12),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
PRIO03   DFLD  POS=(12,19),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
VVKL03   DFLD  POS=(12,24),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
ARTNR03  DFLD  POS=(12,27),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
KAT03    DFLD  POS=(12,39),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
PK03     DFLD  POS=(12,44),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
PSLAG03  DFLD  POS=(12,49),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
FUNKGR03 DFLD  POS=(12,55),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DATUM03  DFLD  POS=(12,62),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LISTNR03 DFLD  POS=(12,69),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
OMR04    DFLD  POS=(13,3),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
GANG04   DFLD  POS=(13,9),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
PLATS04  DFLD  POS=(13,12),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
PRIO04   DFLD  POS=(13,19),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
VVKL04   DFLD  POS=(13,24),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
ARTNR04  DFLD  POS=(13,27),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
KAT04    DFLD  POS=(13,39),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
PK04     DFLD  POS=(13,44),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
PSLAG04  DFLD  POS=(13,49),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
FUNKGR04 DFLD  POS=(13,55),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DATUM04  DFLD  POS=(13,62),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LISTNR04 DFLD  POS=(13,69),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
OMR05    DFLD  POS=(14,3),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
GANG05   DFLD  POS=(14,9),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
PLATS05  DFLD  POS=(14,12),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
PRIO05   DFLD  POS=(14,19),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
VVKL05   DFLD  POS=(14,24),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
ARTNR05  DFLD  POS=(14,27),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
KAT05    DFLD  POS=(14,39),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
PK05     DFLD  POS=(14,44),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
PSLAG05  DFLD  POS=(14,49),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
FUNKGR05 DFLD  POS=(14,55),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DATUM05  DFLD  POS=(14,62),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LISTNR05 DFLD  POS=(14,69),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
OMR06    DFLD  POS=(15,3),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
GANG06   DFLD  POS=(15,9),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
PLATS06  DFLD  POS=(15,12),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
PRIO06   DFLD  POS=(15,19),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
VVKL06   DFLD  POS=(15,24),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
ARTNR06  DFLD  POS=(15,27),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
KAT06    DFLD  POS=(15,39),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
PK06     DFLD  POS=(15,44),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
PSLAG06  DFLD  POS=(15,49),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
FUNKGR06 DFLD  POS=(15,55),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DATUM06  DFLD  POS=(15,62),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LISTNR06 DFLD  POS=(15,69),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
OMR07    DFLD  POS=(16,3),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
GANG07   DFLD  POS=(16,9),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
PLATS07  DFLD  POS=(16,12),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
PRIO07   DFLD  POS=(16,19),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
VVKL07   DFLD  POS=(16,24),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
ARTNR07  DFLD  POS=(16,27),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
KAT07    DFLD  POS=(16,39),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
PK07     DFLD  POS=(16,44),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
PSLAG07  DFLD  POS=(16,49),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
FUNKGR07 DFLD  POS=(16,55),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DATUM07  DFLD  POS=(16,62),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LISTNR07 DFLD  POS=(16,69),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
OMR08    DFLD  POS=(17,3),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
GANG08   DFLD  POS=(17,9),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
PLATS08  DFLD  POS=(17,12),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
PRIO08   DFLD  POS=(17,19),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
VVKL08   DFLD  POS=(17,24),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
ARTNR08  DFLD  POS=(17,27),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
KAT08    DFLD  POS=(17,39),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
PK08     DFLD  POS=(17,44),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
PSLAG08  DFLD  POS=(17,49),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
FUNKGR08 DFLD  POS=(17,55),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DATUM08  DFLD  POS=(17,62),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LISTNR08 DFLD  POS=(17,69),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
OMR09    DFLD  POS=(18,3),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
GANG09   DFLD  POS=(18,9),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
PLATS09  DFLD  POS=(18,12),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
PRIO09   DFLD  POS=(18,19),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
VVKL09   DFLD  POS=(18,24),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
ARTNR09  DFLD  POS=(18,27),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
KAT09    DFLD  POS=(18,39),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
PK09     DFLD  POS=(18,44),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
PSLAG09  DFLD  POS=(18,49),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
FUNKGR09 DFLD  POS=(18,55),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DATUM09  DFLD  POS=(18,62),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LISTNR09 DFLD  POS=(18,69),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
OMR10    DFLD  POS=(19,3),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
GANG10   DFLD  POS=(19,9),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
PLATS10  DFLD  POS=(19,12),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
PRIO10   DFLD  POS=(19,19),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
VVKL10   DFLD  POS=(19,24),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
ARTNR10  DFLD  POS=(19,27),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
KAT10    DFLD  POS=(19,39),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
PK10     DFLD  POS=(19,44),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
PSLAG10  DFLD  POS=(19,49),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
FUNKGR10 DFLD  POS=(19,55),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DATUM10  DFLD  POS=(19,62),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LISTNR10 DFLD  POS=(19,69),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  'F14=5302 F15=5303 F16=5304 F17=5305 F20=5308 F10=WHELP +        
               F11=UPPDATE F12=LOGOFF',                                +        
               POS=(22,3),LTH=77,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE4    DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W5O309N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W5N309,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W5I309N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  DCIN,                                                   +        
               LTH=2                                                            
         MFLD  DCUT,                                                   +        
               LTH=2                                                            
         MFLD  OMRADEIN,                                               +        
               LTH=2                                                            
         MFLD  OMRADEUT,                                               +        
               LTH=2                                                            
         MFLD  GANGIN,                                                 +        
               LTH=2                                                            
         MFLD  GANGUT,                                                 +        
               LTH=2                                                            
         MFLD  PLATSIN,                                                +        
               LTH=5                                                            
         MFLD  PLATSUT,                                                +        
               LTH=5                                                            
         MFLD  INVOMGIN,                                               +        
               LTH=1                                                            
         MFLD  INVOMGUT,                                               +        
               LTH=1                                                            
         MFLD  PKIN,                                                   +        
               LTH=1                                                            
         MFLD  PKUT,                                                   +        
               LTH=1                                                            
         MFLD  RADER,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RADERKO,                                                +        
               LTH=3                                                            
         MFLD  OMR01,                                                  +        
               LTH=2                                                            
         MFLD  GANG01,                                                 +        
               LTH=2                                                            
         MFLD  PLATS01,                                                +        
               LTH=5                                                            
         MFLD  PRIO01,                                                 +        
               LTH=1                                                            
         MFLD  VVKL01,                                                 +        
               LTH=1                                                            
         MFLD  ARTNR01,                                                +        
               LTH=9                                                            
         MFLD  KAT01,                                                  +        
               LTH=2                                                            
         MFLD  PK01,                                                   +        
               LTH=1                                                            
         MFLD  PSLAG01,                                                +        
               LTH=2                                                            
         MFLD  FUNKGR01,                                               +        
               LTH=4                                                            
         MFLD  DATUM01,                                                +        
               LTH=6                                                            
         MFLD  LISTNR01,                                               +        
               LTH=6                                                            
         MFLD  OMR02,                                                  +        
               LTH=2                                                            
         MFLD  GANG02,                                                 +        
               LTH=2                                                            
         MFLD  PLATS02,                                                +        
               LTH=5                                                            
         MFLD  PRIO02,                                                 +        
               LTH=1                                                            
         MFLD  VVKL02,                                                 +        
               LTH=1                                                            
         MFLD  ARTNR02,                                                +        
               LTH=9                                                            
         MFLD  KAT02,                                                  +        
               LTH=2                                                            
         MFLD  PK02,                                                   +        
               LTH=1                                                            
         MFLD  PSLAG02,                                                +        
               LTH=2                                                            
         MFLD  FUNKGR02,                                               +        
               LTH=4                                                            
         MFLD  DATUM02,                                                +        
               LTH=6                                                            
         MFLD  LISTNR02,                                               +        
               LTH=6                                                            
         MFLD  OMR03,                                                  +        
               LTH=2                                                            
         MFLD  GANG03,                                                 +        
               LTH=2                                                            
         MFLD  PLATS03,                                                +        
               LTH=5                                                            
         MFLD  PRIO03,                                                 +        
               LTH=1                                                            
         MFLD  VVKL03,                                                 +        
               LTH=1                                                            
         MFLD  ARTNR03,                                                +        
               LTH=9                                                            
         MFLD  KAT03,                                                  +        
               LTH=2                                                            
         MFLD  PK03,                                                   +        
               LTH=1                                                            
         MFLD  PSLAG03,                                                +        
               LTH=2                                                            
         MFLD  FUNKGR03,                                               +        
               LTH=4                                                            
         MFLD  DATUM03,                                                +        
               LTH=6                                                            
         MFLD  LISTNR03,                                               +        
               LTH=6                                                            
         MFLD  OMR04,                                                  +        
               LTH=2                                                            
         MFLD  GANG04,                                                 +        
               LTH=2                                                            
         MFLD  PLATS04,                                                +        
               LTH=5                                                            
         MFLD  PRIO04,                                                 +        
               LTH=1                                                            
         MFLD  VVKL04,                                                 +        
               LTH=1                                                            
         MFLD  ARTNR04,                                                +        
               LTH=9                                                            
         MFLD  KAT04,                                                  +        
               LTH=2                                                            
         MFLD  PK04,                                                   +        
               LTH=1                                                            
         MFLD  PSLAG04,                                                +        
               LTH=2                                                            
         MFLD  FUNKGR04,                                               +        
               LTH=4                                                            
         MFLD  DATUM04,                                                +        
               LTH=6                                                            
         MFLD  LISTNR04,                                               +        
               LTH=6                                                            
         MFLD  OMR05,                                                  +        
               LTH=2                                                            
         MFLD  GANG05,                                                 +        
               LTH=2                                                            
         MFLD  PLATS05,                                                +        
               LTH=5                                                            
         MFLD  PRIO05,                                                 +        
               LTH=1                                                            
         MFLD  VVKL05,                                                 +        
               LTH=1                                                            
         MFLD  ARTNR05,                                                +        
               LTH=9                                                            
         MFLD  KAT05,                                                  +        
               LTH=2                                                            
         MFLD  PK05,                                                   +        
               LTH=1                                                            
         MFLD  PSLAG05,                                                +        
               LTH=2                                                            
         MFLD  FUNKGR05,                                               +        
               LTH=4                                                            
         MFLD  DATUM05,                                                +        
               LTH=6                                                            
         MFLD  LISTNR05,                                               +        
               LTH=6                                                            
         MFLD  OMR06,                                                  +        
               LTH=2                                                            
         MFLD  GANG06,                                                 +        
               LTH=2                                                            
         MFLD  PLATS06,                                                +        
               LTH=5                                                            
         MFLD  PRIO06,                                                 +        
               LTH=1                                                            
         MFLD  VVKL06,                                                 +        
               LTH=1                                                            
         MFLD  ARTNR06,                                                +        
               LTH=9                                                            
         MFLD  KAT06,                                                  +        
               LTH=2                                                            
         MFLD  PK06,                                                   +        
               LTH=1                                                            
         MFLD  PSLAG06,                                                +        
               LTH=2                                                            
         MFLD  FUNKGR06,                                               +        
               LTH=4                                                            
         MFLD  DATUM06,                                                +        
               LTH=6                                                            
         MFLD  LISTNR06,                                               +        
               LTH=6                                                            
         MFLD  OMR07,                                                  +        
               LTH=2                                                            
         MFLD  GANG07,                                                 +        
               LTH=2                                                            
         MFLD  PLATS07,                                                +        
               LTH=5                                                            
         MFLD  PRIO07,                                                 +        
               LTH=1                                                            
         MFLD  VVKL07,                                                 +        
               LTH=1                                                            
         MFLD  ARTNR07,                                                +        
               LTH=9                                                            
         MFLD  KAT07,                                                  +        
               LTH=2                                                            
         MFLD  PK07,                                                   +        
               LTH=1                                                            
         MFLD  PSLAG07,                                                +        
               LTH=2                                                            
         MFLD  FUNKGR07,                                               +        
               LTH=4                                                            
         MFLD  DATUM07,                                                +        
               LTH=6                                                            
         MFLD  LISTNR07,                                               +        
               LTH=6                                                            
         MFLD  OMR08,                                                  +        
               LTH=2                                                            
         MFLD  GANG08,                                                 +        
               LTH=2                                                            
         MFLD  PLATS08,                                                +        
               LTH=5                                                            
         MFLD  PRIO08,                                                 +        
               LTH=1                                                            
         MFLD  VVKL08,                                                 +        
               LTH=1                                                            
         MFLD  ARTNR08,                                                +        
               LTH=9                                                            
         MFLD  KAT08,                                                  +        
               LTH=2                                                            
         MFLD  PK08,                                                   +        
               LTH=1                                                            
         MFLD  PSLAG08,                                                +        
               LTH=2                                                            
         MFLD  FUNKGR08,                                               +        
               LTH=4                                                            
         MFLD  DATUM08,                                                +        
               LTH=6                                                            
         MFLD  LISTNR08,                                               +        
               LTH=6                                                            
         MFLD  OMR09,                                                  +        
               LTH=2                                                            
         MFLD  GANG09,                                                 +        
               LTH=2                                                            
         MFLD  PLATS09,                                                +        
               LTH=5                                                            
         MFLD  PRIO09,                                                 +        
               LTH=1                                                            
         MFLD  VVKL09,                                                 +        
               LTH=1                                                            
         MFLD  ARTNR09,                                                +        
               LTH=9                                                            
         MFLD  KAT09,                                                  +        
               LTH=2                                                            
         MFLD  PK09,                                                   +        
               LTH=1                                                            
         MFLD  PSLAG09,                                                +        
               LTH=2                                                            
         MFLD  FUNKGR09,                                               +        
               LTH=4                                                            
         MFLD  DATUM09,                                                +        
               LTH=6                                                            
         MFLD  LISTNR09,                                               +        
               LTH=6                                                            
         MFLD  OMR10,                                                  +        
               LTH=2                                                            
         MFLD  GANG10,                                                 +        
               LTH=2                                                            
         MFLD  PLATS10,                                                +        
               LTH=5                                                            
         MFLD  PRIO10,                                                 +        
               LTH=1                                                            
         MFLD  VVKL10,                                                 +        
               LTH=1                                                            
         MFLD  ARTNR10,                                                +        
               LTH=9                                                            
         MFLD  KAT10,                                                  +        
               LTH=2                                                            
         MFLD  PK10,                                                   +        
               LTH=1                                                            
         MFLD  PSLAG10,                                                +        
               LTH=2                                                            
         MFLD  FUNKGR10,                                               +        
               LTH=4                                                            
         MFLD  DATUM10,                                                +        
               LTH=6                                                            
         MFLD  LISTNR10,                                               +        
               LTH=6                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE4,                                                 +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W5I309N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W5N309),                                           +        
               OPT=2,                                                  +        
               NXT=W5O309N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F9'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '53092',                                                +        
               LTH=5                                                            
         MFLD  (DCIN,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DCUT,                                                   +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (OMRADEIN,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  OMRADEUT,                                               +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (GANGIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  GANGUT,                                                 +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (PLATSIN,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  PLATSUT,                                                +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (INVOMGIN,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  INVOMGUT,                                               +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (PKIN,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  PKUT,                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (RADER,                                                 +        
               '10'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  ARTNR01,                                                +        
               LTH=9                                                            
         MFLD  PRIO01,                                                 +        
               LTH=1                                                            
         MFLD  KAT01,                                                  +        
               LTH=2                                                            
         MFLD  ARTNR02,                                                +        
               LTH=9                                                            
         MFLD  PRIO02,                                                 +        
               LTH=1                                                            
         MFLD  KAT02,                                                  +        
               LTH=2                                                            
         MFLD  ARTNR03,                                                +        
               LTH=9                                                            
         MFLD  PRIO03,                                                 +        
               LTH=1                                                            
         MFLD  KAT03,                                                  +        
               LTH=2                                                            
         MFLD  ARTNR04,                                                +        
               LTH=9                                                            
         MFLD  PRIO04,                                                 +        
               LTH=1                                                            
         MFLD  KAT04,                                                  +        
               LTH=2                                                            
         MFLD  ARTNR05,                                                +        
               LTH=9                                                            
         MFLD  PRIO05,                                                 +        
               LTH=1                                                            
         MFLD  KAT05,                                                  +        
               LTH=2                                                            
         MFLD  ARTNR06,                                                +        
               LTH=9                                                            
         MFLD  PRIO06,                                                 +        
               LTH=1                                                            
         MFLD  KAT06,                                                  +        
               LTH=2                                                            
         MFLD  ARTNR07,                                                +        
               LTH=9                                                            
         MFLD  PRIO07,                                                 +        
               LTH=1                                                            
         MFLD  KAT07,                                                  +        
               LTH=2                                                            
         MFLD  ARTNR08,                                                +        
               LTH=9                                                            
         MFLD  PRIO08,                                                 +        
               LTH=1                                                            
         MFLD  KAT08,                                                  +        
               LTH=2                                                            
         MFLD  ARTNR09,                                                +        
               LTH=9                                                            
         MFLD  PRIO09,                                                 +        
               LTH=1                                                            
         MFLD  KAT09,                                                  +        
               LTH=2                                                            
         MFLD  ARTNR10,                                                +        
               LTH=9                                                            
         MFLD  PRIO10,                                                 +        
               LTH=1                                                            
         MFLD  KAT10,                                                  +        
               LTH=2                                                            
         MSGEND                                                                 
         END                                                                    
