***********************************************************************         
* CREATED BY V063442   ON 04/02/05  AT 15:12                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'PÅFYLLNING CDC/SVS              '                               
W6F152   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W6T152 7',                                           +        
               8='W6T152 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W6T152U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W6F152   DPAGE CURSOR=((2,7)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'PÅFYLLNING CDC/SVS',                                   +        
               POS=(1,12),LTH=18,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Från',                                                 +        
               POS=(2,2),LTH=4,                                        +        
               ATTR=(NUM,PROT)                                                  
DESTIN   DFLD  POS=(2,7),LTH=3,                                        +        
               ATTR=(NOPROT)                                                    
         DFLD  'Status',                                               +        
               POS=(2,14),LTH=6,                                       +        
               ATTR=(PROT)                                                      
STATUSIN DFLD  POS=(2,21),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Artnr',                                                +        
               POS=(2,26),LTH=5,                                       +        
               ATTR=(PROT)                                                      
ARTNRIN  DFLD  POS=(2,32),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
DESTUT   DFLD  POS=(3,7),LTH=3,                                        +        
               ATTR=(PROT,MOD)                                                  
STATUSUT DFLD  POS=(3,21),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
ARTNRUT  DFLD  POS=(3,32),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Cmd',                                                  +        
               POS=(5,2),LTH=3,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Artnr  Antal Lagerplats  Fp  Datum Sta User',          +        
               POS=(5,10),LTH=43,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Not',                                                  +        
               POS=(5,58),LTH=3,                                       +        
               ATTR=(PROT)                                                      
CMD1     DFLD  POS=(6,3),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
ARTNR1   DFLD  POS=(6,6),LTH=9,                                        +        
               ATTR=(PROT,MOD)                                                  
ANTAL1   DFLD  POS=(6,16),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
LAGOMR1  DFLD  POS=(6,23),LTH=2,                                       +        
               ATTR=(PROT)                                                      
GANG1    DFLD  POS=(6,26),LTH=2,                                       +        
               ATTR=(PROT)                                                      
PLATS1   DFLD  POS=(6,29),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FP1      DFLD  POS=(6,35),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DATUM1   DFLD  POS=(6,38),LTH=6,                                       +        
               ATTR=(PROT)                                                      
STATUS1  DFLD  POS=(6,46),LTH=1,                                       +        
               ATTR=(PROT)                                                      
USER1    DFLD  POS=(6,49),LTH=8,                                       +        
               ATTR=(PROT)                                                      
NOT1     DFLD  POS=(6,58),LTH=20,                                      +        
               ATTR=(PROT)                                                      
CMD2     DFLD  POS=(7,3),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
ARTNR2   DFLD  POS=(7,6),LTH=9,                                        +        
               ATTR=(PROT,MOD)                                                  
ANTAL2   DFLD  POS=(7,16),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
LAGOMR2  DFLD  POS=(7,23),LTH=2,                                       +        
               ATTR=(PROT)                                                      
GANG2    DFLD  POS=(7,26),LTH=2,                                       +        
               ATTR=(PROT)                                                      
PLATS2   DFLD  POS=(7,29),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FP2      DFLD  POS=(7,35),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DATUM2   DFLD  POS=(7,38),LTH=6,                                       +        
               ATTR=(PROT)                                                      
STATUS2  DFLD  POS=(7,46),LTH=1,                                       +        
               ATTR=(PROT)                                                      
USER2    DFLD  POS=(7,49),LTH=8,                                       +        
               ATTR=(PROT)                                                      
NOT2     DFLD  POS=(7,58),LTH=20,                                      +        
               ATTR=(PROT)                                                      
CMD3     DFLD  POS=(8,3),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
ARTNR3   DFLD  POS=(8,6),LTH=9,                                        +        
               ATTR=(PROT,MOD)                                                  
ANTAL3   DFLD  POS=(8,16),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
LAGOMR3  DFLD  POS=(8,23),LTH=2,                                       +        
               ATTR=(PROT)                                                      
GANG3    DFLD  POS=(8,26),LTH=2,                                       +        
               ATTR=(PROT)                                                      
PLATS3   DFLD  POS=(8,29),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FP3      DFLD  POS=(8,35),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DATUM3   DFLD  POS=(8,38),LTH=6,                                       +        
               ATTR=(PROT)                                                      
STATUS3  DFLD  POS=(8,46),LTH=1,                                       +        
               ATTR=(PROT)                                                      
USER3    DFLD  POS=(8,49),LTH=8,                                       +        
               ATTR=(PROT)                                                      
NOT3     DFLD  POS=(8,58),LTH=20,                                      +        
               ATTR=(PROT)                                                      
CMD4     DFLD  POS=(9,3),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
ARTNR4   DFLD  POS=(9,6),LTH=9,                                        +        
               ATTR=(PROT,MOD)                                                  
ANTAL4   DFLD  POS=(9,16),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
LAGOMR4  DFLD  POS=(9,23),LTH=2,                                       +        
               ATTR=(PROT)                                                      
GANG4    DFLD  POS=(9,26),LTH=2,                                       +        
               ATTR=(PROT)                                                      
PLATS4   DFLD  POS=(9,29),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FP4      DFLD  POS=(9,35),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DATUM4   DFLD  POS=(9,38),LTH=6,                                       +        
               ATTR=(PROT)                                                      
STATUS4  DFLD  POS=(9,46),LTH=1,                                       +        
               ATTR=(PROT)                                                      
USER4    DFLD  POS=(9,49),LTH=8,                                       +        
               ATTR=(PROT)                                                      
NOT4     DFLD  POS=(9,58),LTH=20,                                      +        
               ATTR=(PROT)                                                      
CMD5     DFLD  POS=(10,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
ARTNR5   DFLD  POS=(10,6),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
ANTAL5   DFLD  POS=(10,16),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LAGOMR5  DFLD  POS=(10,23),LTH=2,                                      +        
               ATTR=(PROT)                                                      
GANG5    DFLD  POS=(10,26),LTH=2,                                      +        
               ATTR=(PROT)                                                      
PLATS5   DFLD  POS=(10,29),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FP5      DFLD  POS=(10,35),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DATUM5   DFLD  POS=(10,38),LTH=6,                                      +        
               ATTR=(PROT)                                                      
STATUS5  DFLD  POS=(10,46),LTH=1,                                      +        
               ATTR=(PROT)                                                      
USER5    DFLD  POS=(10,49),LTH=8,                                      +        
               ATTR=(PROT)                                                      
NOT5     DFLD  POS=(10,58),LTH=20,                                     +        
               ATTR=(PROT)                                                      
CMD6     DFLD  POS=(11,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
ARTNR6   DFLD  POS=(11,6),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
ANTAL6   DFLD  POS=(11,16),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LAGOMR6  DFLD  POS=(11,23),LTH=2,                                      +        
               ATTR=(PROT)                                                      
GANG6    DFLD  POS=(11,26),LTH=2,                                      +        
               ATTR=(PROT)                                                      
PLATS6   DFLD  POS=(11,29),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FP6      DFLD  POS=(11,35),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DATUM6   DFLD  POS=(11,38),LTH=6,                                      +        
               ATTR=(PROT)                                                      
STATUS6  DFLD  POS=(11,46),LTH=1,                                      +        
               ATTR=(PROT)                                                      
USER6    DFLD  POS=(11,49),LTH=8,                                      +        
               ATTR=(PROT)                                                      
NOT6     DFLD  POS=(11,58),LTH=20,                                     +        
               ATTR=(PROT)                                                      
CMD7     DFLD  POS=(12,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
ARTNR7   DFLD  POS=(12,6),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
ANTAL7   DFLD  POS=(12,16),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LAGOMR7  DFLD  POS=(12,23),LTH=2,                                      +        
               ATTR=(PROT)                                                      
GANG7    DFLD  POS=(12,26),LTH=2,                                      +        
               ATTR=(PROT)                                                      
PLATS7   DFLD  POS=(12,29),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FP7      DFLD  POS=(12,35),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DATUM7   DFLD  POS=(12,38),LTH=6,                                      +        
               ATTR=(PROT)                                                      
STATUS7  DFLD  POS=(12,46),LTH=1,                                      +        
               ATTR=(PROT)                                                      
USER7    DFLD  POS=(12,49),LTH=8,                                      +        
               ATTR=(PROT)                                                      
NOT7     DFLD  POS=(12,58),LTH=20,                                     +        
               ATTR=(PROT)                                                      
CMD8     DFLD  POS=(13,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
ARTNR8   DFLD  POS=(13,6),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
ANTAL8   DFLD  POS=(13,16),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LAGOMR8  DFLD  POS=(13,23),LTH=2,                                      +        
               ATTR=(PROT)                                                      
GANG8    DFLD  POS=(13,26),LTH=2,                                      +        
               ATTR=(PROT)                                                      
PLATS8   DFLD  POS=(13,29),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FP8      DFLD  POS=(13,35),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DATUM8   DFLD  POS=(13,38),LTH=6,                                      +        
               ATTR=(PROT)                                                      
STATUS8  DFLD  POS=(13,46),LTH=1,                                      +        
               ATTR=(PROT)                                                      
USER8    DFLD  POS=(13,49),LTH=8,                                      +        
               ATTR=(PROT)                                                      
NOT8     DFLD  POS=(13,58),LTH=20,                                     +        
               ATTR=(PROT)                                                      
CMD9     DFLD  POS=(14,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
ARTNR9   DFLD  POS=(14,6),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
ANTAL9   DFLD  POS=(14,16),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LAGOMR9  DFLD  POS=(14,23),LTH=2,                                      +        
               ATTR=(PROT)                                                      
GANG9    DFLD  POS=(14,26),LTH=2,                                      +        
               ATTR=(PROT)                                                      
PLATS9   DFLD  POS=(14,29),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FP9      DFLD  POS=(14,35),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DATUM9   DFLD  POS=(14,38),LTH=6,                                      +        
               ATTR=(PROT)                                                      
STATUS9  DFLD  POS=(14,46),LTH=1,                                      +        
               ATTR=(PROT)                                                      
USER9    DFLD  POS=(14,49),LTH=8,                                      +        
               ATTR=(PROT)                                                      
NOT9     DFLD  POS=(14,58),LTH=20,                                     +        
               ATTR=(PROT)                                                      
CMD10    DFLD  POS=(15,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
ARTNR10  DFLD  POS=(15,6),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
ANTAL10  DFLD  POS=(15,16),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LAGOMR10 DFLD  POS=(15,23),LTH=2,                                      +        
               ATTR=(PROT)                                                      
GANG10   DFLD  POS=(15,26),LTH=2,                                      +        
               ATTR=(PROT)                                                      
PLATS10  DFLD  POS=(15,29),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FP10     DFLD  POS=(15,35),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DATUM10  DFLD  POS=(15,38),LTH=6,                                      +        
               ATTR=(PROT)                                                      
STATUS10 DFLD  POS=(15,46),LTH=1,                                      +        
               ATTR=(PROT)                                                      
USER10   DFLD  POS=(15,49),LTH=8,                                      +        
               ATTR=(PROT)                                                      
NOT10    DFLD  POS=(15,58),LTH=20,                                     +        
               ATTR=(PROT)                                                      
CMD11    DFLD  POS=(16,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
ARTNR11  DFLD  POS=(16,6),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
ANTAL11  DFLD  POS=(16,16),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LAGOMR11 DFLD  POS=(16,23),LTH=2,                                      +        
               ATTR=(PROT)                                                      
GANG11   DFLD  POS=(16,26),LTH=2,                                      +        
               ATTR=(PROT)                                                      
PLATS11  DFLD  POS=(16,29),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FP11     DFLD  POS=(16,35),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DATUM11  DFLD  POS=(16,38),LTH=6,                                      +        
               ATTR=(PROT)                                                      
STATUS11 DFLD  POS=(16,46),LTH=1,                                      +        
               ATTR=(PROT)                                                      
USER11   DFLD  POS=(16,49),LTH=8,                                      +        
               ATTR=(PROT)                                                      
NOT11    DFLD  POS=(16,58),LTH=20,                                     +        
               ATTR=(PROT)                                                      
CMD12    DFLD  POS=(17,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
ARTNR12  DFLD  POS=(17,6),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
ANTAL12  DFLD  POS=(17,16),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LAGOMR12 DFLD  POS=(17,23),LTH=2,                                      +        
               ATTR=(PROT)                                                      
GANG12   DFLD  POS=(17,26),LTH=2,                                      +        
               ATTR=(PROT)                                                      
PLATS12  DFLD  POS=(17,29),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FP12     DFLD  POS=(17,35),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DATUM12  DFLD  POS=(17,38),LTH=6,                                      +        
               ATTR=(PROT)                                                      
STATUS12 DFLD  POS=(17,46),LTH=1,                                      +        
               ATTR=(PROT)                                                      
USER12   DFLD  POS=(17,49),LTH=8,                                      +        
               ATTR=(PROT)                                                      
NOT12    DFLD  POS=(17,58),LTH=20,                                     +        
               ATTR=(PROT)                                                      
CMD13    DFLD  POS=(18,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
ARTNR13  DFLD  POS=(18,6),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
ANTAL13  DFLD  POS=(18,16),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LAGOMR13 DFLD  POS=(18,23),LTH=2,                                      +        
               ATTR=(PROT)                                                      
GANG13   DFLD  POS=(18,26),LTH=2,                                      +        
               ATTR=(PROT)                                                      
PLATS13  DFLD  POS=(18,29),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FP13     DFLD  POS=(18,35),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DATUM13  DFLD  POS=(18,38),LTH=6,                                      +        
               ATTR=(PROT)                                                      
STATUS13 DFLD  POS=(18,46),LTH=1,                                      +        
               ATTR=(PROT)                                                      
USER13   DFLD  POS=(18,49),LTH=8,                                      +        
               ATTR=(PROT)                                                      
NOT13    DFLD  POS=(18,58),LTH=20,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Nytt antal',                                           +        
               POS=(20,3),LTH=10,                                      +        
               ATTR=(PROT)                                                      
KVANTAL  DFLD  POS=(20,14),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Lastning klar',                                        +        
               POS=(20,31),LTH=13,                                     +        
               ATTR=(PROT)                                                      
LASTKLAR DFLD  POS=(20,45),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Printer',                                              +        
               POS=(20,58),LTH=7,                                      +        
               ATTR=(PROT)                                                      
PRINTER  DFLD  POS=(20,66),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W6O15201 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6F152,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I15201,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W6F152,                                             +        
               NXT=W6I15201                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DESTIN,                                                 +        
               LTH=3                                                            
         MFLD  DESTUT,                                                 +        
               LTH=3                                                            
         MFLD  STATUSIN,                                               +        
               LTH=1                                                            
         MFLD  STATUSUT,                                               +        
               LTH=1                                                            
         MFLD  ARTNRIN,                                                +        
               LTH=9                                                            
         MFLD  ARTNRUT,                                                +        
               LTH=9                                                            
         MFLD  CMD1,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTNR1,                                                 +        
               LTH=9                                                            
         MFLD  ANTAL1,                                                 +        
               LTH=6                                                            
         MFLD  LAGOMR1,                                                +        
               LTH=2                                                            
         MFLD  GANG1,                                                  +        
               LTH=2                                                            
         MFLD  PLATS1,                                                 +        
               LTH=5                                                            
         MFLD  FP1,                                                    +        
               LTH=2                                                            
         MFLD  DATUM1,                                                 +        
               LTH=6                                                            
         MFLD  STATUS1,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  USER1,                                                  +        
               LTH=8                                                            
         MFLD  NOT1,                                                   +        
               LTH=20                                                           
         MFLD  CMD2,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTNR2,                                                 +        
               LTH=9                                                            
         MFLD  ANTAL2,                                                 +        
               LTH=6                                                            
         MFLD  LAGOMR2,                                                +        
               LTH=2                                                            
         MFLD  GANG2,                                                  +        
               LTH=2                                                            
         MFLD  PLATS2,                                                 +        
               LTH=5                                                            
         MFLD  FP2,                                                    +        
               LTH=2                                                            
         MFLD  DATUM2,                                                 +        
               LTH=6                                                            
         MFLD  STATUS2,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  USER2,                                                  +        
               LTH=8                                                            
         MFLD  NOT2,                                                   +        
               LTH=20                                                           
         MFLD  CMD3,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTNR3,                                                 +        
               LTH=9                                                            
         MFLD  ANTAL3,                                                 +        
               LTH=6                                                            
         MFLD  LAGOMR3,                                                +        
               LTH=2                                                            
         MFLD  GANG3,                                                  +        
               LTH=2                                                            
         MFLD  PLATS3,                                                 +        
               LTH=5                                                            
         MFLD  FP3,                                                    +        
               LTH=2                                                            
         MFLD  DATUM3,                                                 +        
               LTH=6                                                            
         MFLD  STATUS3,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  USER3,                                                  +        
               LTH=8                                                            
         MFLD  NOT3,                                                   +        
               LTH=20                                                           
         MFLD  CMD4,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTNR4,                                                 +        
               LTH=9                                                            
         MFLD  ANTAL4,                                                 +        
               LTH=6                                                            
         MFLD  LAGOMR4,                                                +        
               LTH=2                                                            
         MFLD  GANG4,                                                  +        
               LTH=2                                                            
         MFLD  PLATS4,                                                 +        
               LTH=5                                                            
         MFLD  FP4,                                                    +        
               LTH=2                                                            
         MFLD  DATUM4,                                                 +        
               LTH=6                                                            
         MFLD  STATUS4,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  USER4,                                                  +        
               LTH=8                                                            
         MFLD  NOT4,                                                   +        
               LTH=20                                                           
         MFLD  CMD5,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTNR5,                                                 +        
               LTH=9                                                            
         MFLD  ANTAL5,                                                 +        
               LTH=6                                                            
         MFLD  LAGOMR5,                                                +        
               LTH=2                                                            
         MFLD  GANG5,                                                  +        
               LTH=2                                                            
         MFLD  PLATS5,                                                 +        
               LTH=5                                                            
         MFLD  FP5,                                                    +        
               LTH=2                                                            
         MFLD  DATUM5,                                                 +        
               LTH=6                                                            
         MFLD  STATUS5,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  USER5,                                                  +        
               LTH=8                                                            
         MFLD  NOT5,                                                   +        
               LTH=20                                                           
         MFLD  CMD6,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTNR6,                                                 +        
               LTH=9                                                            
         MFLD  ANTAL6,                                                 +        
               LTH=6                                                            
         MFLD  LAGOMR6,                                                +        
               LTH=2                                                            
         MFLD  GANG6,                                                  +        
               LTH=2                                                            
         MFLD  PLATS6,                                                 +        
               LTH=5                                                            
         MFLD  FP6,                                                    +        
               LTH=2                                                            
         MFLD  DATUM6,                                                 +        
               LTH=6                                                            
         MFLD  STATUS6,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  USER6,                                                  +        
               LTH=8                                                            
         MFLD  NOT6,                                                   +        
               LTH=20                                                           
         MFLD  CMD7,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTNR7,                                                 +        
               LTH=9                                                            
         MFLD  ANTAL7,                                                 +        
               LTH=6                                                            
         MFLD  LAGOMR7,                                                +        
               LTH=2                                                            
         MFLD  GANG7,                                                  +        
               LTH=2                                                            
         MFLD  PLATS7,                                                 +        
               LTH=5                                                            
         MFLD  FP7,                                                    +        
               LTH=2                                                            
         MFLD  DATUM7,                                                 +        
               LTH=6                                                            
         MFLD  STATUS7,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  USER7,                                                  +        
               LTH=8                                                            
         MFLD  NOT7,                                                   +        
               LTH=20                                                           
         MFLD  CMD8,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTNR8,                                                 +        
               LTH=9                                                            
         MFLD  ANTAL8,                                                 +        
               LTH=6                                                            
         MFLD  LAGOMR8,                                                +        
               LTH=2                                                            
         MFLD  GANG8,                                                  +        
               LTH=2                                                            
         MFLD  PLATS8,                                                 +        
               LTH=5                                                            
         MFLD  FP8,                                                    +        
               LTH=2                                                            
         MFLD  DATUM8,                                                 +        
               LTH=6                                                            
         MFLD  STATUS8,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  USER8,                                                  +        
               LTH=8                                                            
         MFLD  NOT8,                                                   +        
               LTH=20                                                           
         MFLD  CMD9,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTNR9,                                                 +        
               LTH=9                                                            
         MFLD  ANTAL9,                                                 +        
               LTH=6                                                            
         MFLD  LAGOMR9,                                                +        
               LTH=2                                                            
         MFLD  GANG9,                                                  +        
               LTH=2                                                            
         MFLD  PLATS9,                                                 +        
               LTH=5                                                            
         MFLD  FP9,                                                    +        
               LTH=2                                                            
         MFLD  DATUM9,                                                 +        
               LTH=6                                                            
         MFLD  STATUS9,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  USER9,                                                  +        
               LTH=8                                                            
         MFLD  NOT9,                                                   +        
               LTH=20                                                           
         MFLD  CMD10,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTNR10,                                                +        
               LTH=9                                                            
         MFLD  ANTAL10,                                                +        
               LTH=6                                                            
         MFLD  LAGOMR10,                                               +        
               LTH=2                                                            
         MFLD  GANG10,                                                 +        
               LTH=2                                                            
         MFLD  PLATS10,                                                +        
               LTH=5                                                            
         MFLD  FP10,                                                   +        
               LTH=2                                                            
         MFLD  DATUM10,                                                +        
               LTH=6                                                            
         MFLD  STATUS10,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  USER10,                                                 +        
               LTH=8                                                            
         MFLD  NOT10,                                                  +        
               LTH=20                                                           
         MFLD  CMD11,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTNR11,                                                +        
               LTH=9                                                            
         MFLD  ANTAL11,                                                +        
               LTH=6                                                            
         MFLD  LAGOMR11,                                               +        
               LTH=2                                                            
         MFLD  GANG11,                                                 +        
               LTH=2                                                            
         MFLD  PLATS11,                                                +        
               LTH=5                                                            
         MFLD  FP11,                                                   +        
               LTH=2                                                            
         MFLD  DATUM11,                                                +        
               LTH=6                                                            
         MFLD  STATUS11,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  USER11,                                                 +        
               LTH=8                                                            
         MFLD  NOT11,                                                  +        
               LTH=20                                                           
         MFLD  CMD12,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTNR12,                                                +        
               LTH=9                                                            
         MFLD  ANTAL12,                                                +        
               LTH=6                                                            
         MFLD  LAGOMR12,                                               +        
               LTH=2                                                            
         MFLD  GANG12,                                                 +        
               LTH=2                                                            
         MFLD  PLATS12,                                                +        
               LTH=5                                                            
         MFLD  FP12,                                                   +        
               LTH=2                                                            
         MFLD  DATUM12,                                                +        
               LTH=6                                                            
         MFLD  STATUS12,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  USER12,                                                 +        
               LTH=8                                                            
         MFLD  NOT12,                                                  +        
               LTH=20                                                           
         MFLD  CMD13,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTNR13,                                                +        
               LTH=9                                                            
         MFLD  ANTAL13,                                                +        
               LTH=6                                                            
         MFLD  LAGOMR13,                                               +        
               LTH=2                                                            
         MFLD  GANG13,                                                 +        
               LTH=2                                                            
         MFLD  PLATS13,                                                +        
               LTH=5                                                            
         MFLD  FP13,                                                   +        
               LTH=2                                                            
         MFLD  DATUM13,                                                +        
               LTH=6                                                            
         MFLD  STATUS13,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  USER13,                                                 +        
               LTH=8                                                            
         MFLD  NOT13,                                                  +        
               LTH=20                                                           
         MFLD  KVANTAL,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LASTKLAR,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRINTER,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W6I15201 MSG   TYPE=INPUT,                                             +        
               SOR=(W6F152),                                           +        
               OPT=2,                                                  +        
               NXT=W6O15201                                                     
MID      LPAGE SOR=(W6F152),                                           +        
               NXT=W6O15201                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '61521',                                                +        
               LTH=5                                                            
         MFLD  (DESTIN,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DESTUT,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (STATUSIN,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (STATUSUT,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (ARTNRIN,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNRUT,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CMD1,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (STATUS1,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD2,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (STATUS2,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD3,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (STATUS3,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD4,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (STATUS4,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD5,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (STATUS5,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD6,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (STATUS6,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD7,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (STATUS7,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD8,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (STATUS8,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD9,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (STATUS9,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD10,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (STATUS10,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD11,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (STATUS11,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD12,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (STATUS12,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD13,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (STATUS13,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KVANTAL,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LASTKLAR,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (PRINTER,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
