***********************************************************************         
* CREATED BY PC63442   ON 99/09/07  AT 17:01                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'MAKULERA PARTI/BACKA R32        '                               
W6F119   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W6T119U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W6T111  ',                                          +        
               14='W6T112  ',                                          +        
               15='W6T113  ',                                          +        
               16='W6T114  ',                                          +        
               17='W6T115  ',                                          +        
               18='W6T116  ',                                          +        
               19='W6T117  ',                                          +        
               20='W6T118  ',                                          +        
               21='W6T119  ',                                          +        
               22='WHELP   ',                                          +        
               23='W6T119V ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W6F119   DPAGE CURSOR=((2,10)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'MAKULERA PARTI/BACKA R32',                             +        
               POS=(1,11),LTH=24,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Partinr',                                              +        
               POS=(2,2),LTH=7,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDLOPNRI DFLD  POS=(2,10),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,20),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDDCIN   DFLD  POS=(2,23),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
IDLOPNRU DFLD  POS=(3,10),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDCUT   DFLD  POS=(3,23),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Artnr',                                                +        
               POS=(5,2),LTH=5,                                        +        
               ATTR=(PROT)                                                      
IDARTNR  DFLD  POS=(5,10),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Ant avis',                                             +        
               POS=(5,21),LTH=8,                                       +        
               ATTR=(PROT)                                                      
KVAVIS   DFLD  POS=(5,30),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Benämning',                                            +        
               POS=(5,39),LTH=9,                                       +        
               ATTR=(PROT)                                                      
BEART    DFLD  POS=(5,50),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Levnr',                                                +        
               POS=(7,2),LTH=5,                                        +        
               ATTR=(PROT)                                                      
IDLEVNR  DFLD  POS=(7,10),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Avinr',                                                +        
               POS=(7,21),LTH=5,                                       +        
               ATTR=(PROT)                                                      
IDFS     DFLD  POS=(7,28),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Datum',                                                +        
               POS=(7,39),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(7,47),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Makulering',                                           +        
               POS=(13,2),LTH=10,                                      +        
               ATTR=(PROT)                                                      
FLMAKUL  DFLD  POS=(13,13),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Backa R32',                                            +        
               POS=(13,38),LTH=9,                                      +        
               ATTR=(PROT)                                                      
FLBACKA  DFLD  POS=(13,48),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'F10 WHELP  F11 UPDATE  F12 Logoff  F23 UPDATE R32',    +        
               POS=(22,2),LTH=49,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W6O11901 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6F119,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I11901,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W6F119                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDLOPNRI,                                               +        
               LTH=8                                                            
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  IDLOPNRU,                                               +        
               LTH=8                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  IDARTNR,                                                +        
               LTH=8                                                            
         MFLD  KVAVIS,                                                 +        
               LTH=6                                                            
         MFLD  BEART,                                                  +        
               LTH=25                                                           
         MFLD  IDLEVNR,                                                +        
               LTH=5                                                            
         MFLD  IDFS,                                                   +        
               LTH=8                                                            
         MFLD  DATE,                                                   +        
               LTH=6                                                            
         MFLD  FLMAKUL,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLBACKA,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=61                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W6I11901 MSG   TYPE=INPUT,                                             +        
               SOR=(W6F119),                                           +        
               OPT=2,                                                  +        
               NXT=W6O11901                                                     
MID      LPAGE SOR=(W6F119)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F9'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '61191',                                                +        
               LTH=5                                                            
         MFLD  (IDLOPNRI,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  IDLOPNRU,                                               +        
               LTH=8                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  (FLMAKUL,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (FLBACKA,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
