***********************************************************************         
* CREATED BY PCC4448   ON 94/12/05  AT 13:56                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W6F164   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W6T164U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W6T161  ',                                          +        
               14='W6T161  ',                                          +        
               15='W6T163  ',                                          +        
               16='W6T164  ',                                          +        
               17='W6T165  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W6T164U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'FÖRPACKN.DATA REGISTRERING',                           +        
               POS=(1,12),LTH=26,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'ARTIKELNR',                                            +        
               POS=(2,2),LTH=9,                                        +        
               ATTR=(NUM,PROT)                                                  
FLD0212  DFLD  POS=(2,12),LTH=9,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0312  DFLD  POS=(3,12),LTH=11,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'EMBALLAGEARTNR Q0',                                    +        
               POS=(5,2),LTH=17,                                       +        
               ATTR=(PROT)                                                      
FLD0531  DFLD  POS=(5,24),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'EMBALLAGEKOD Q0',                                      +        
               POS=(5,44),LTH=15,                                      +        
               ATTR=(PROT)                                                      
FLD0573  DFLD  POS=(5,66),LTH=3,                                       +        
               ATTR=(PROT)                                                      
FLD0631  DFLD  POS=(6,24),LTH=8,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0673  DFLD  POS=(6,66),LTH=3,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'EMBALLAGEARTNR Q1',                                    +        
               POS=(8,2),LTH=17,                                       +        
               ATTR=(PROT)                                                      
FLD0831  DFLD  POS=(8,24),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'EMBALLAGEKOD Q1',                                      +        
               POS=(8,44),LTH=15,                                      +        
               ATTR=(PROT)                                                      
FLD0873  DFLD  POS=(8,66),LTH=3,                                       +        
               ATTR=(PROT)                                                      
FLD0931  DFLD  POS=(9,24),LTH=8,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0973  DFLD  POS=(9,66),LTH=3,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'EMBALLAGEARTNR Q2',                                    +        
               POS=(11,2),LTH=17,                                      +        
               ATTR=(PROT)                                                      
FLD1131  DFLD  POS=(11,24),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'EMBALLAGEKOD Q2',                                      +        
               POS=(11,44),LTH=15,                                     +        
               ATTR=(PROT)                                                      
FLD1173  DFLD  POS=(11,66),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD1231  DFLD  POS=(12,24),LTH=8,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1273  DFLD  POS=(12,66),LTH=3,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'FÖRPACKNINGSTYP',                                      +        
               POS=(14,2),LTH=15,                                      +        
               ATTR=(PROT)                                                      
FLD1437  DFLD  POS=(14,30),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'KVANTITETSFÖRP Q0',                                    +        
               POS=(14,44),LTH=17,                                     +        
               ATTR=(PROT)                                                      
FLD1471  DFLD  POS=(14,64),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLD1537  DFLD  POS=(15,30),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1571  DFLD  POS=(15,64),LTH=5,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'FÖRPACKNINGSKOD',                                      +        
               POS=(17,2),LTH=15,                                      +        
               ATTR=(PROT)                                                      
FLD1735  DFLD  POS=(17,28),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'KVANTITETSFÖRP Q2',                                    +        
               POS=(17,44),LTH=17,                                     +        
               ATTR=(PROT)                                                      
FLD1771  DFLD  POS=(17,64),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLD1835  DFLD  POS=(18,28),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD1871  DFLD  POS=(18,64),LTH=5,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  '13 HANT.KOD REG 14 BUFFERTINFO 15 LAGERDATA REG 16 FÖRP+        
               .DATA REG 17 INLEV .INFO',                              +        
               POS=(21,2),LTH=79,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,33),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,67),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W6O16401 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6F164,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I16401,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0212,                                                +        
               LTH=9                                                            
         MFLD  FLD0312,                                                +        
               LTH=11                                                           
         MFLD  FLD0531,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD0573,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0831,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD0873,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1131,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD1173,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1437,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1471,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1735,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1771,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0631,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0673,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0931,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD0973,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1231,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1273,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1537,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1571,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1835,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1871,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W6I16401 MSG   TYPE=INPUT,                                             +        
               SOR=(W6F164),                                           +        
               OPT=2,                                                  +        
               NXT=W6O16401                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '61641',                                                +        
               LTH=5                                                            
         MFLD  (FLD0212,                                               +        
               '         '),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0312,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0631,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0673,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0931,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD0973,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1231,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1273,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1537,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1571,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1835,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLD1871,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
