***********************************************************************         
* CREATED BY PC38409   ON 95/02/06  AT 08:46                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'REGISTRERA FÖLJESEDELINFO       '                               
W6F137   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W6T137 4',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W6T137U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W6T131  ',                                          +        
               14='W6T132  ',                                          +        
               15='W6T133  ',                                          +        
               16='W0T501  ',                                          +        
               17='W6T135  ',                                          +        
               18='W6T136  ',                                          +        
               19='W6T137  ',                                          +        
               20='W0T501  ',                                          +        
               21='W6T139  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,8)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Skapa diversekolli',                                   +        
               POS=(1,11),LTH=18,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Levnr',                                                +        
               POS=(2,2),LTH=5,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDLEVNRI DFLD  POS=(2,8),LTH=5,                                        +        
               ATTR=(NOPROT)                                                    
         DFLD  ' ',                                                    +        
               POS=(2,14),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
         DFLD  'Kollinr',                                              +        
               POS=(2,16),LTH=7,                                       +        
               ATTR=(PROT)                                                      
DGIA0023 DFLD  POS=(2,24),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(2,34),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
         DFLD  'DC',                                                   +        
               POS=(2,36),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDDCIN   DFLD  POS=(2,39),LTH=2,                                       +        
               ATTR=(ALPHA,NOPROT)                                              
IDLEVNRU DFLD  POS=(3,8),LTH=5,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0024 DFLD  POS=(3,24),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDCUT   DFLD  POS=(3,39),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'LO',                                                   +        
               POS=(5,2),LTH=2,                                        +        
               ATTR=(PROT)                                                      
DGIA0017 DFLD  POS=(5,5),LTH=2,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(5,8),LTH=1,                                        +        
               ATTR=(ALPHA)                                                     
         DFLD  '(vid utskrift av ny flagga  + PF4)',                   +        
               POS=(5,11),LTH=34,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Plac',                                                 +        
               POS=(7,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
DGIA0014 DFLD  POS=(7,7),LTH=4,                                        +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Prio (j/n)',                                           +        
               POS=(7,13),LTH=10,                                      +        
               ATTR=(PROT)                                                      
DGIA0018 DFLD  POS=(7,26),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(7,28),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
         DFLD  'Lageromr',                                             +        
               POS=(7,31),LTH=8,                                       +        
               ATTR=(PROT)                                                      
LAGOMR   DFLD  POS=(7,40),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Partinr/Etikettnr',                                    +        
               POS=(8,2),LTH=17,                                       +        
               ATTR=(PROT)                                                      
DGIA0000 DFLD  POS=(9,8),LTH=11,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(9,20),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
DGIA0001 DFLD  POS=(10,8),LTH=11,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(10,20),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
DGIA0002 DFLD  POS=(11,8),LTH=11,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(11,20),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
DGIA0003 DFLD  POS=(12,8),LTH=11,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(12,20),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
DGIA0004 DFLD  POS=(13,8),LTH=11,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(13,20),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
DGIA0005 DFLD  POS=(14,8),LTH=11,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(14,20),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
DGIA0006 DFLD  POS=(15,8),LTH=11,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(15,20),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
DGIA0007 DFLD  POS=(16,8),LTH=11,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(16,20),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
DGIA0008 DFLD  POS=(17,8),LTH=11,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(17,20),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
DGIA0009 DFLD  POS=(18,8),LTH=11,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(18,20),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
DGIA0010 DFLD  POS=(19,8),LTH=11,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(19,20),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
FILLER1  DFLD  POS=(19,28),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(19,30),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
         DFLD  'Printer',                                              +        
               POS=(19,69),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0013 DFLD  POS=(19,77),LTH=4,                                      +        
               ATTR=(NOPROT,MOD)                                                
DGIA0019 DFLD  POS=(20,2),LTH=3,                                       +        
               ATTR=(PROT,NODISP)                                               
DGIA0020 DFLD  POS=(20,6),LTH=3,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0015 DFLD  POS=(20,10),LTH=4,                                      +        
               ATTR=(NUM,PROT,NODISP)                                           
DGIA0016 DFLD  POS=(20,15),LTH=4,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0011 DFLD  POS=(20,20),LTH=4,                                      +        
               ATTR=(NUM,PROT,NODISP)                                           
DGIA0012 DFLD  POS=(20,25),LTH=4,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KDINLQI  DFLD  POS=(20,30),LTH=1,                                      +        
               ATTR=(NUM,PROT,NODISP)                                           
KDINLQU  DFLD  POS=(20,32),LTH=1,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
BEFTI    DFLD  POS=(20,34),LTH=2,                                      +        
               ATTR=(NUM,PROT,NODISP)                                           
BEFTU    DFLD  POS=(20,37),LTH=2,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLINLFBI DFLD  POS=(20,40),LTH=1,                                      +        
               ATTR=(NUM,PROT,NODISP)                                           
FLINLFBU DFLD  POS=(20,42),LTH=1,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0021 DFLD  POS=(20,44),LTH=9,                                      +        
               ATTR=(NUM,PROT,NODISP)                                           
DGIA0022 DFLD  POS=(20,54),LTH=9,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KBEFTTI  DFLD  POS=(20,64),LTH=2,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KBEFTTU  DFLD  POS=(20,67),LTH=2,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         DFLD  '13 Kolli/Vagn   14 Kolli kö',                          +        
               POS=(21,2),LTH=27,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15 Åtg/parti    16',                                   +        
               POS=(21,34),LTH=18,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '17 Ta bort koll',                                      +        
               POS=(21,66),LTH=15,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '18 Skapa kolli  19 Div kolli    20',                   +        
               POS=(22,2),LTH=34,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21 Mottagning   10 rhelp',                             +        
               POS=(22,50),LTH=24,                                     +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W6O13701 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6F137,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I13701,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDLEVNRI,                                               +        
               LTH=5                                                            
         MFLD  DGIA0023,                                               +        
               LTH=9                                                            
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  IDLEVNRU,                                               +        
               LTH=5                                                            
         MFLD  DGIA0024,                                               +        
               LTH=9                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  DGIA0017,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0014,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0018,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LAGOMR,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0000,                                               +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0001,                                               +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0002,                                               +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0003,                                               +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0004,                                               +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0005,                                               +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0006,                                               +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0007,                                               +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0008,                                               +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0009,                                               +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0010,                                               +        
               LTH=13,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0013,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0019,                                               +        
               LTH=3                                                            
         MFLD  DGIA0020,                                               +        
               LTH=3                                                            
         MFLD  DGIA0015,                                               +        
               LTH=4                                                            
         MFLD  DGIA0016,                                               +        
               LTH=4                                                            
         MFLD  DGIA0011,                                               +        
               LTH=4                                                            
         MFLD  DGIA0012,                                               +        
               LTH=4                                                            
         MFLD  KDINLQI,                                                +        
               LTH=1                                                            
         MFLD  KDINLQU,                                                +        
               LTH=1                                                            
         MFLD  BEFTI,                                                  +        
               LTH=2                                                            
         MFLD  BEFTU,                                                  +        
               LTH=2                                                            
         MFLD  KBEFTTI,                                                +        
               LTH=2                                                            
         MFLD  KBEFTTU,                                                +        
               LTH=2                                                            
         MFLD  FLINLFBI,                                               +        
               LTH=1                                                            
         MFLD  FLINLFBU,                                               +        
               LTH=1                                                            
         MFLD  DGIA0021,                                               +        
               LTH=9                                                            
         MFLD  DGIA0022,                                               +        
               LTH=9                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=61                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W6I13701 MSG   TYPE=INPUT,                                             +        
               SOR=(W6F137),                                           +        
               OPT=2,                                                  +        
               NXT=W6O13701                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '61371',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0013,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (DGIA0019,                                              +        
               '+++'),                                                 +        
               LTH=3                                                            
         MFLD  DGIA0020,                                               +        
               LTH=3                                                            
         MFLD  (DGIA0015,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  DGIA0016,                                               +        
               LTH=4                                                            
         MFLD  (DGIA0011,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  DGIA0012,                                               +        
               LTH=4                                                            
         MFLD  (KDINLQI,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  KDINLQU,                                                +        
               LTH=1                                                            
         MFLD  (BEFTI,                                                 +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  BEFTU,                                                  +        
               LTH=2                                                            
         MFLD  (KBEFTTI,                                               +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  KBEFTTU,                                                +        
               LTH=2                                                            
         MFLD  (FLINLFBI,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  FLINLFBU,                                               +        
               LTH=1                                                            
         MFLD  (IDLEVNRI,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  IDLEVNRU,                                               +        
               LTH=5                                                            
         MFLD  (DGIA0023,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0024,                                               +        
               LTH=9                                                            
         MFLD  (DGIA0021,                                              +        
               '+++++++++'),                                           +        
               LTH=9                                                            
         MFLD  DGIA0022,                                               +        
               LTH=9                                                            
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDCUT,                                                 +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0017,                                              +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  (DGIA0014,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (DGIA0018,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  LAGOMR,                                                 +        
               LTH=2                                                            
         MFLD  (DGIA0000,                                              +        
               '+++++++++++'),                                         +        
               LTH=11                                                           
         MFLD  (DGIA0001,                                              +        
               '+++++++++++'),                                         +        
               LTH=11                                                           
         MFLD  (DGIA0002,                                              +        
               '+++++++++++'),                                         +        
               LTH=11                                                           
         MFLD  (DGIA0003,                                              +        
               '+++++++++++'),                                         +        
               LTH=11                                                           
         MFLD  (DGIA0004,                                              +        
               '+++++++++++'),                                         +        
               LTH=11                                                           
         MFLD  (DGIA0005,                                              +        
               '+++++++++++'),                                         +        
               LTH=11                                                           
         MFLD  (DGIA0006,                                              +        
               '+++++++++++'),                                         +        
               LTH=11                                                           
         MFLD  (DGIA0007,                                              +        
               '+++++++++++'),                                         +        
               LTH=11                                                           
         MFLD  (DGIA0008,                                              +        
               '+++++++++++'),                                         +        
               LTH=11                                                           
         MFLD  (DGIA0009,                                              +        
               '+++++++++++'),                                         +        
               LTH=11                                                           
         MFLD  (DGIA0010,                                              +        
               '+++++++++++'),                                         +        
               LTH=11                                                           
         MSGEND                                                                 
         END                                                                    
