***********************************************************************         
* CREATED BY PCC4448   ON 94/11/17  AT 10:40                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'UTPLOCK VOR                     '                               
W6F107   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W6T107 7',                                           +        
               8='W6T107 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W6T101  ',                                          +        
               14='W6T102  ',                                          +        
               15='W6T103  ',                                          +        
               16='W6T104  ',                                          +        
               17='W6T105  ',                                          +        
               18='W6T106  ',                                          +        
               19='W6T107  ',                                          +        
               20='W6T108  ',                                          +        
               21='W6T109  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W6F107   DPAGE CURSOR=((2,7))                                                   
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Fråga på placering',                                   +        
               POS=(1,12),LTH=18,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Plac',                                                 +        
               POS=(2,2),LTH=4,                                        +        
               ATTR=(ALPHA,PROT)                                                
DGIA0000 DFLD  POS=(2,7),LTH=4,                                        +        
               ATTR=(NOPROT)                                                    
         DFLD  'Typ',                                                  +        
               POS=(2,13),LTH=3,                                       +        
               ATTR=(PROT)                                                      
DGIA0004 DFLD  POS=(2,17),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Grupp',                                                +        
               POS=(2,21),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0002 DFLD  POS=(2,27),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Status',                                               +        
               POS=(2,32),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0006 DFLD  POS=(2,39),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'DC',                                                   +        
               POS=(2,44),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
IDDCIN   DFLD  POS=(2,47),LTH=2,                                       +        
               ATTR=(ALPHA,NOPROT)                                              
DGIA0001 DFLD  POS=(3,7),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0005 DFLD  POS=(3,17),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0003 DFLD  POS=(3,27),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0007 DFLD  POS=(3,39),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDCUT   DFLD  POS=(3,47),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
SPAR1    DFLD  POS=(4,2),LTH=4,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
SPAR2    DFLD  POS=(4,8),LTH=3,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
SPAR3    DFLD  POS=(4,13),LTH=4,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
SPAR4    DFLD  POS=(4,20),LTH=4,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Plac  Typ  Grupp  Status  Buffomr  Lpl  Plats Fom Tom  +        
               Gång Fom Tom',                                          +        
               POS=(5,2),LTH=67,                                       +        
               ATTR=(PROT)                                                      
ADINLOM1 DFLD  POS=(6,2),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
KDINLOM1 DFLD  POS=(6,8),LTH=3,                                        +        
               ATTR=(PROT,MOD)                                                  
ADINPAR1 DFLD  POS=(6,13),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
KDINLUP1 DFLD  POS=(6,20),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
ADINLBO1 DFLD  POS=(6,28),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
ADINLPL1 DFLD  POS=(6,37),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
ADPLFOM1 DFLD  POS=(6,44),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
ADPLTOM1 DFLD  POS=(6,50),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
ADGAFOM1 DFLD  POS=(6,63),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
ADGATOM1 DFLD  POS=(6,67),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
ADINLOM2 DFLD  POS=(7,2),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
KDINLOM2 DFLD  POS=(7,8),LTH=3,                                        +        
               ATTR=(PROT,MOD)                                                  
ADINPAR2 DFLD  POS=(7,13),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
ADINLUP2 DFLD  POS=(7,20),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
ADINLBO2 DFLD  POS=(7,28),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
ADINLPL2 DFLD  POS=(7,37),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
ADPLFOM2 DFLD  POS=(7,44),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
ADPLTOM2 DFLD  POS=(7,50),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
ADGAFOM2 DFLD  POS=(7,63),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
ADGATOM2 DFLD  POS=(7,67),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
ADINLOM3 DFLD  POS=(8,2),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
KDINLOM3 DFLD  POS=(8,8),LTH=3,                                        +        
               ATTR=(PROT,MOD)                                                  
ADINPAR3 DFLD  POS=(8,13),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
KDINLUP3 DFLD  POS=(8,20),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
ADINLBO3 DFLD  POS=(8,28),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
ADINLPL3 DFLD  POS=(8,37),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
ADPLFOM3 DFLD  POS=(8,44),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
ADPLTOM3 DFLD  POS=(8,50),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
ADGAFOM3 DFLD  POS=(8,63),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
ADGATOM3 DFLD  POS=(8,67),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
ADINLOM4 DFLD  POS=(9,2),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
KDINLOM4 DFLD  POS=(9,8),LTH=3,                                        +        
               ATTR=(PROT,MOD)                                                  
ADINPAR4 DFLD  POS=(9,13),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
KDINLUP4 DFLD  POS=(9,20),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
ADINLBO4 DFLD  POS=(9,28),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
ADINLPL4 DFLD  POS=(9,37),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
ADPLFOM4 DFLD  POS=(9,44),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
ADPLTOM4 DFLD  POS=(9,50),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
ADGAFOM4 DFLD  POS=(9,63),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
ADGATOM4 DFLD  POS=(9,67),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
ADINLOM5 DFLD  POS=(10,2),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
KDINLOM5 DFLD  POS=(10,8),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
ADINPAR5 DFLD  POS=(10,13),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
KDINLUP5 DFLD  POS=(10,20),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
ADINLBO5 DFLD  POS=(10,28),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
ADINLPL5 DFLD  POS=(10,37),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
ADPLFOM5 DFLD  POS=(10,44),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
ADPLTOM5 DFLD  POS=(10,50),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
ADGAFOM5 DFLD  POS=(10,63),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
ADGATOM5 DFLD  POS=(10,67),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
ADINLOM6 DFLD  POS=(11,2),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
KDINLOM6 DFLD  POS=(11,8),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
ADINPAR6 DFLD  POS=(11,13),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
KDINLUP6 DFLD  POS=(11,20),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
ADINLBO6 DFLD  POS=(11,28),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
ADINLPL6 DFLD  POS=(11,37),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
ADPLFOM6 DFLD  POS=(11,44),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
ADPLTOM6 DFLD  POS=(11,50),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
ADGAFOM6 DFLD  POS=(11,63),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
ADGATOM6 DFLD  POS=(11,67),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
ADINLOM7 DFLD  POS=(12,2),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
KDINLOM7 DFLD  POS=(12,8),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
ADINPAR7 DFLD  POS=(12,13),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
KDINLUP7 DFLD  POS=(12,20),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
ADINLBO7 DFLD  POS=(12,28),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
ADINLPL7 DFLD  POS=(12,37),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
ADPLFOM7 DFLD  POS=(12,44),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
ADPLTOM7 DFLD  POS=(12,50),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
ADGAFOM7 DFLD  POS=(12,63),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
ADGATOM7 DFLD  POS=(12,67),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
ADINLOM8 DFLD  POS=(13,2),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
KDINLOM8 DFLD  POS=(13,8),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
ADINPAR8 DFLD  POS=(13,13),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
KDINLUP8 DFLD  POS=(13,20),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
ADINLBO8 DFLD  POS=(13,28),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
ADINLPL8 DFLD  POS=(13,37),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
ADPLFOM8 DFLD  POS=(13,44),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
ADPLTOM8 DFLD  POS=(13,50),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
ADGAFOM8 DFLD  POS=(13,63),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
ADGATOM8 DFLD  POS=(13,67),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
ADINLOM9 DFLD  POS=(14,2),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
KDINLOM9 DFLD  POS=(14,8),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
ADINPAR9 DFLD  POS=(14,13),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
KDINLUP9 DFLD  POS=(14,20),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
ADINLBO9 DFLD  POS=(14,28),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
ADINLPL9 DFLD  POS=(14,37),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
ADPLFOM9 DFLD  POS=(14,44),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
ADPLTOM9 DFLD  POS=(14,50),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
ADGAFOM9 DFLD  POS=(14,63),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
ADGATOM9 DFLD  POS=(14,67),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
ADINLO10 DFLD  POS=(15,2),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
KDINLO10 DFLD  POS=(15,8),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
ADINPA10 DFLD  POS=(15,13),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
KDINLU10 DFLD  POS=(15,20),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
ADINLB10 DFLD  POS=(15,28),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
ADINLP10 DFLD  POS=(15,37),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
ADPLFO10 DFLD  POS=(15,44),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
ADPLTO10 DFLD  POS=(15,50),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
ADGAFO10 DFLD  POS=(15,63),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
ADGATO10 DFLD  POS=(15,67),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
ADINLO11 DFLD  POS=(16,2),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
KDINLO11 DFLD  POS=(16,8),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
ADINPA11 DFLD  POS=(16,13),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
KDINLU11 DFLD  POS=(16,20),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
ADINLB11 DFLD  POS=(16,28),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
ADINLP11 DFLD  POS=(16,37),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
ADPLFO11 DFLD  POS=(16,44),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
ADPLTO11 DFLD  POS=(16,50),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
ADGAFO11 DFLD  POS=(16,63),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
ADGATO11 DFLD  POS=(16,67),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
ADINLO12 DFLD  POS=(17,2),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
KDINLO12 DFLD  POS=(17,8),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
ADINPA12 DFLD  POS=(17,13),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
KDINLU12 DFLD  POS=(17,20),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
ADINLB12 DFLD  POS=(17,28),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
ADINLP12 DFLD  POS=(17,37),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
ADPLFO12 DFLD  POS=(17,44),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
ADPLTO12 DFLD  POS=(17,50),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
ADGAFO12 DFLD  POS=(17,63),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
ADGATO12 DFLD  POS=(17,67),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
ADINLO13 DFLD  POS=(18,2),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
KDINLO13 DFLD  POS=(18,8),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
ADINPA13 DFLD  POS=(18,13),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
KDINLU13 DFLD  POS=(18,20),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
ADINLB13 DFLD  POS=(18,28),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
ADINLP13 DFLD  POS=(18,37),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
ADPLFO13 DFLD  POS=(18,44),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
ADPLTO13 DFLD  POS=(18,50),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
ADGAFO13 DFLD  POS=(18,63),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
ADGATO13 DFLD  POS=(18,67),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
ADINLO14 DFLD  POS=(19,2),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
KDINLO14 DFLD  POS=(19,8),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
ADINPA14 DFLD  POS=(19,13),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
KDINLU14 DFLD  POS=(19,20),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
ADINLB14 DFLD  POS=(19,28),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
ADINLP14 DFLD  POS=(19,37),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
ADPLFO14 DFLD  POS=(19,44),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
ADPLTO14 DFLD  POS=(19,50),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
ADGAFO14 DFLD  POS=(19,63),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
ADGATO14 DFLD  POS=(19,67),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  '13 Adm vagn    14 Flytta kolli15 Ers flagga   16 Utploc+        
               k VOR  17 Def styr',                                    +        
               POS=(21,2),LTH=73,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 Def plac    19 Fråga plac  20 Fråga  FB FP 21 AR - I+        
               nfo    10 WHELP',                                       +        
               POS=(22,2),LTH=70,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W6I10701 MSG   TYPE=INPUT,                                             +        
               SOR=(W6F107),                                           +        
               OPT=2,                                                  +        
               NXT=W6O10701                                                     
MID      LPAGE SOR=(W6F107)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS1,                                              +        
               '6'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS2,                                              +        
               '1'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  (IDTRANS3,                                              +        
               '0'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (IDTRANS4,                                              +        
               '7'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  ' ',                                                    +        
               LTH=2                                                            
         MFLD  '61071',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0000,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (DGIA0001,                                              +        
               '    '),                                                +        
               LTH=4                                                            
         MFLD  (DGIA0004,                                              +        
               '+++'),                                                 +        
               LTH=3                                                            
         MFLD  (DGIA0005,                                              +        
               '   '),                                                 +        
               LTH=3                                                            
         MFLD  (DGIA0002,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (DGIA0003,                                              +        
               '    '),                                                +        
               LTH=4                                                            
         MFLD  (DGIA0006,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (DGIA0007,                                              +        
               '    '),                                                +        
               LTH=4                                                            
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDCUT,                                                 +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (SPAR1,                                                 +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (SPAR2,                                                 +        
               '+++'),                                                 +        
               LTH=3                                                            
         MFLD  (SPAR3,                                                 +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (SPAR4,                                                 +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (ADINLOM1,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (ADINLOM2,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (ADINLOM3,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (ADINLOM4,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (ADINLOM5,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (ADINLOM6,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (ADINLOM7,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (ADINLOM8,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (ADINLOM9,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (ADINLO10,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (ADINLO11,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (ADINLO12,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (ADINLO13,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (ADINLO14,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MSGEND                                                                 
W6O10701 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6F107,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I10701,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W6F107                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DGIA0000,                                               +        
               LTH=4                                                            
         MFLD  DGIA0001,                                               +        
               LTH=4                                                            
         MFLD  DGIA0004,                                               +        
               LTH=3                                                            
         MFLD  DGIA0005,                                               +        
               LTH=3                                                            
         MFLD  DGIA0002,                                               +        
               LTH=4                                                            
         MFLD  DGIA0003,                                               +        
               LTH=4                                                            
         MFLD  DGIA0006,                                               +        
               LTH=4                                                            
         MFLD  DGIA0007,                                               +        
               LTH=4                                                            
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  SPAR1,                                                  +        
               LTH=4                                                            
         MFLD  SPAR2,                                                  +        
               LTH=3                                                            
         MFLD  SPAR3,                                                  +        
               LTH=4                                                            
         MFLD  SPAR4,                                                  +        
               LTH=4                                                            
         MFLD  ADINLOM1,                                               +        
               LTH=4                                                            
         MFLD  KDINLOM1,                                               +        
               LTH=3                                                            
         MFLD  ADINPAR1,                                               +        
               LTH=4                                                            
         MFLD  KDINLUP1,                                               +        
               LTH=4                                                            
         MFLD  ADINLBO1,                                               +        
               LTH=4                                                            
         MFLD  ADINLPL1,                                               +        
               LTH=4                                                            
         MFLD  ADPLFOM1,                                               +        
               LTH=5                                                            
         MFLD  ADPLTOM1,                                               +        
               LTH=5                                                            
         MFLD  ADGAFOM1,                                               +        
               LTH=2                                                            
         MFLD  ADGATOM1,                                               +        
               LTH=2                                                            
         MFLD  ADINLOM2,                                               +        
               LTH=4                                                            
         MFLD  KDINLOM2,                                               +        
               LTH=3                                                            
         MFLD  ADINPAR2,                                               +        
               LTH=4                                                            
         MFLD  ADINLUP2,                                               +        
               LTH=4                                                            
         MFLD  ADINLBO2,                                               +        
               LTH=4                                                            
         MFLD  ADINLPL2,                                               +        
               LTH=4                                                            
         MFLD  ADPLFOM2,                                               +        
               LTH=5                                                            
         MFLD  ADPLTOM2,                                               +        
               LTH=5                                                            
         MFLD  ADGAFOM2,                                               +        
               LTH=2                                                            
         MFLD  ADGATOM2,                                               +        
               LTH=2                                                            
         MFLD  ADINLOM3,                                               +        
               LTH=4                                                            
         MFLD  KDINLOM3,                                               +        
               LTH=3                                                            
         MFLD  ADINPAR3,                                               +        
               LTH=4                                                            
         MFLD  KDINLUP3,                                               +        
               LTH=4                                                            
         MFLD  ADINLBO3,                                               +        
               LTH=4                                                            
         MFLD  ADINLPL3,                                               +        
               LTH=4                                                            
         MFLD  ADPLFOM3,                                               +        
               LTH=5                                                            
         MFLD  ADPLTOM3,                                               +        
               LTH=5                                                            
         MFLD  ADGAFOM3,                                               +        
               LTH=2                                                            
         MFLD  ADGATOM3,                                               +        
               LTH=2                                                            
         MFLD  ADINLOM4,                                               +        
               LTH=4                                                            
         MFLD  KDINLOM4,                                               +        
               LTH=3                                                            
         MFLD  ADINPAR4,                                               +        
               LTH=4                                                            
         MFLD  KDINLUP4,                                               +        
               LTH=4                                                            
         MFLD  ADINLBO4,                                               +        
               LTH=4                                                            
         MFLD  ADINLPL4,                                               +        
               LTH=4                                                            
         MFLD  ADPLFOM4,                                               +        
               LTH=5                                                            
         MFLD  ADPLTOM4,                                               +        
               LTH=5                                                            
         MFLD  ADGAFOM4,                                               +        
               LTH=2                                                            
         MFLD  ADGATOM4,                                               +        
               LTH=2                                                            
         MFLD  ADINLOM5,                                               +        
               LTH=4                                                            
         MFLD  KDINLOM5,                                               +        
               LTH=3                                                            
         MFLD  ADINPAR5,                                               +        
               LTH=4                                                            
         MFLD  KDINLUP5,                                               +        
               LTH=4                                                            
         MFLD  ADINLBO5,                                               +        
               LTH=4                                                            
         MFLD  ADINLPL5,                                               +        
               LTH=4                                                            
         MFLD  ADPLFOM5,                                               +        
               LTH=5                                                            
         MFLD  ADPLTOM5,                                               +        
               LTH=5                                                            
         MFLD  ADGAFOM5,                                               +        
               LTH=2                                                            
         MFLD  ADGATOM5,                                               +        
               LTH=2                                                            
         MFLD  ADINLOM6,                                               +        
               LTH=4                                                            
         MFLD  KDINLOM6,                                               +        
               LTH=3                                                            
         MFLD  ADINPAR6,                                               +        
               LTH=4                                                            
         MFLD  KDINLUP6,                                               +        
               LTH=4                                                            
         MFLD  ADINLBO6,                                               +        
               LTH=4                                                            
         MFLD  ADINLPL6,                                               +        
               LTH=4                                                            
         MFLD  ADPLFOM6,                                               +        
               LTH=5                                                            
         MFLD  ADPLTOM6,                                               +        
               LTH=5                                                            
         MFLD  ADGAFOM6,                                               +        
               LTH=2                                                            
         MFLD  ADGATOM6,                                               +        
               LTH=2                                                            
         MFLD  ADINLOM7,                                               +        
               LTH=4                                                            
         MFLD  KDINLOM7,                                               +        
               LTH=3                                                            
         MFLD  ADINPAR7,                                               +        
               LTH=4                                                            
         MFLD  KDINLUP7,                                               +        
               LTH=4                                                            
         MFLD  ADINLBO7,                                               +        
               LTH=4                                                            
         MFLD  ADINLPL7,                                               +        
               LTH=4                                                            
         MFLD  ADPLFOM7,                                               +        
               LTH=5                                                            
         MFLD  ADPLTOM7,                                               +        
               LTH=5                                                            
         MFLD  ADGAFOM7,                                               +        
               LTH=2                                                            
         MFLD  ADGATOM7,                                               +        
               LTH=2                                                            
         MFLD  ADINLOM8,                                               +        
               LTH=4                                                            
         MFLD  KDINLOM8,                                               +        
               LTH=3                                                            
         MFLD  ADINPAR8,                                               +        
               LTH=4                                                            
         MFLD  KDINLUP8,                                               +        
               LTH=4                                                            
         MFLD  ADINLBO8,                                               +        
               LTH=4                                                            
         MFLD  ADINLPL8,                                               +        
               LTH=4                                                            
         MFLD  ADPLFOM8,                                               +        
               LTH=5                                                            
         MFLD  ADPLTOM8,                                               +        
               LTH=5                                                            
         MFLD  ADGAFOM8,                                               +        
               LTH=2                                                            
         MFLD  ADGATOM8,                                               +        
               LTH=2                                                            
         MFLD  ADINLOM9,                                               +        
               LTH=4                                                            
         MFLD  KDINLOM9,                                               +        
               LTH=3                                                            
         MFLD  ADINPAR9,                                               +        
               LTH=4                                                            
         MFLD  KDINLUP9,                                               +        
               LTH=4                                                            
         MFLD  ADINLBO9,                                               +        
               LTH=4                                                            
         MFLD  ADINLPL9,                                               +        
               LTH=4                                                            
         MFLD  ADPLFOM9,                                               +        
               LTH=5                                                            
         MFLD  ADPLTOM9,                                               +        
               LTH=5                                                            
         MFLD  ADGAFOM9,                                               +        
               LTH=2                                                            
         MFLD  ADGATOM9,                                               +        
               LTH=2                                                            
         MFLD  ADINLO10,                                               +        
               LTH=4                                                            
         MFLD  KDINLO10,                                               +        
               LTH=3                                                            
         MFLD  ADINPA10,                                               +        
               LTH=4                                                            
         MFLD  KDINLU10,                                               +        
               LTH=4                                                            
         MFLD  ADINLB10,                                               +        
               LTH=4                                                            
         MFLD  ADINLP10,                                               +        
               LTH=4                                                            
         MFLD  ADPLFO10,                                               +        
               LTH=5                                                            
         MFLD  ADPLTO10,                                               +        
               LTH=5                                                            
         MFLD  ADGAFO10,                                               +        
               LTH=2                                                            
         MFLD  ADGATO10,                                               +        
               LTH=2                                                            
         MFLD  ADINLO11,                                               +        
               LTH=4                                                            
         MFLD  KDINLO11,                                               +        
               LTH=3                                                            
         MFLD  ADINPA11,                                               +        
               LTH=4                                                            
         MFLD  KDINLU11,                                               +        
               LTH=4                                                            
         MFLD  ADINLB11,                                               +        
               LTH=4                                                            
         MFLD  ADINLP11,                                               +        
               LTH=4                                                            
         MFLD  ADPLFO11,                                               +        
               LTH=5                                                            
         MFLD  ADPLTO11,                                               +        
               LTH=5                                                            
         MFLD  ADGAFO11,                                               +        
               LTH=2                                                            
         MFLD  ADGATO11,                                               +        
               LTH=2                                                            
         MFLD  ADINLO12,                                               +        
               LTH=4                                                            
         MFLD  KDINLO12,                                               +        
               LTH=3                                                            
         MFLD  ADINPA12,                                               +        
               LTH=4                                                            
         MFLD  KDINLU12,                                               +        
               LTH=4                                                            
         MFLD  ADINLB12,                                               +        
               LTH=4                                                            
         MFLD  ADINLP12,                                               +        
               LTH=4                                                            
         MFLD  ADPLFO12,                                               +        
               LTH=5                                                            
         MFLD  ADPLTO12,                                               +        
               LTH=5                                                            
         MFLD  ADGAFO12,                                               +        
               LTH=2                                                            
         MFLD  ADGATO12,                                               +        
               LTH=2                                                            
         MFLD  ADINLO13,                                               +        
               LTH=4                                                            
         MFLD  KDINLO13,                                               +        
               LTH=3                                                            
         MFLD  ADINPA13,                                               +        
               LTH=4                                                            
         MFLD  KDINLU13,                                               +        
               LTH=4                                                            
         MFLD  ADINLB13,                                               +        
               LTH=4                                                            
         MFLD  ADINLP13,                                               +        
               LTH=4                                                            
         MFLD  ADPLFO13,                                               +        
               LTH=5                                                            
         MFLD  ADPLTO13,                                               +        
               LTH=5                                                            
         MFLD  ADGAFO13,                                               +        
               LTH=2                                                            
         MFLD  ADGATO13,                                               +        
               LTH=2                                                            
         MFLD  ADINLO14,                                               +        
               LTH=4                                                            
         MFLD  KDINLO14,                                               +        
               LTH=3                                                            
         MFLD  ADINPA14,                                               +        
               LTH=4                                                            
         MFLD  KDINLU14,                                               +        
               LTH=4                                                            
         MFLD  ADINLB14,                                               +        
               LTH=4                                                            
         MFLD  ADINLP14,                                               +        
               LTH=4                                                            
         MFLD  ADPLFO14,                                               +        
               LTH=5                                                            
         MFLD  ADPLTO14,                                               +        
               LTH=5                                                            
         MFLD  ADGAFO14,                                               +        
               LTH=2                                                            
         MFLD  ADGATO14,                                               +        
               LTH=2                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=61                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=79                                                           
         MSGEND                                                                 
         END                                                                    
