***********************************************************************         
* CREATED BY V063442   ON 02/02/11  AT 10:43                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'ARBETSRAPPORT INFORMATION       '                               
W6F109   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W6T196U ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W6T109 4',                                          +        
               12='/RCL.   ',                                          +        
               13='W6T101  ',                                          +        
               14='W6T102  ',                                          +        
               15='W6T103  ',                                          +        
               16='W6T104  ',                                          +        
               17='W6T105  ',                                          +        
               18='W6T106  ',                                          +        
               19='W6T107  ',                                          +        
               20='W6T108  ',                                          +        
               21='W6T109  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,8)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Arbetsrapport information',                            +        
               POS=(1,11),LTH=25,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Levnr',                                                +        
               POS=(2,2),LTH=5,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDLEVNRI DFLD  POS=(2,8),LTH=5,                                        +        
               ATTR=(NOPROT)                                                    
         DFLD  'Kollinr',                                              +        
               POS=(2,14),LTH=7,                                       +        
               ATTR=(ALPHA,PROT)                                                
KOLLNRIN DFLD  POS=(2,22),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Partinr',                                              +        
               POS=(2,35),LTH=7,                                       +        
               ATTR=(PROT)                                                      
PARTIIN  DFLD  POS=(2,43),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,53),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
IDDCIN   DFLD  POS=(2,56),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
IDLEVNRU DFLD  POS=(3,8),LTH=5,                                        +        
               ATTR=(PROT,MOD)                                                  
KOLLNRUT DFLD  POS=(3,22),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
PARTIUT  DFLD  POS=(3,43),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDCUT   DFLD  POS=(3,56),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Artnr',                                                +        
               POS=(5,2),LTH=5,                                        +        
               ATTR=(PROT)                                                      
IDARTNR  DFLD  POS=(5,8),LTH=8,                                        +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Ant Avis',                                             +        
               POS=(5,17),LTH=8,                                       +        
               ATTR=(PROT)                                                      
KVAVIS   DFLD  POS=(5,26),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Benämning',                                            +        
               POS=(5,33),LTH=9,                                       +        
               ATTR=(PROT)                                                      
BEART    DFLD  POS=(5,43),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Re Refill',                                            +        
               POS=(5,69),LTH=9,                                       +        
               ATTR=(PROT)                                                      
KVAINL   DFLD  POS=(5,79),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'FSnr',                                                 +        
               POS=(6,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
IDFS     DFLD  POS=(6,8),LTH=8,                                        +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Avidat',                                               +        
               POS=(6,17),LTH=6,                                       +        
               ATTR=(PROT)                                                      
TIAVIDAT DFLD  POS=(6,26),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Lastb',                                                +        
               POS=(6,33),LTH=5,                                       +        
               ATTR=(PROT)                                                      
IDLBBET  DFLD  POS=(6,43),LTH=12,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'RT',                                                   +        
               POS=(6,61),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KDRT     DFLD  POS=(6,64),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Akon',                                                 +        
               POS=(6,68),LTH=4,                                       +        
               ATTR=(PROT)                                                      
AKONTR   DFLD  POS=(6,73),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Levnr',                                                +        
               POS=(7,2),LTH=5,                                        +        
               ATTR=(PROT)                                                      
IDLEVNR  DFLD  POS=(7,8),LTH=5,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Motdat',                                               +        
               POS=(7,17),LTH=6,                                       +        
               ATTR=(PROT)                                                      
TIINLMOT DFLD  POS=(7,26),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Möjl adr',                                             +        
               POS=(7,33),LTH=8,                                       +        
               ATTR=(PROT)                                                      
POSSADR1 DFLD  POS=(7,43),LTH=4,                                       +        
               ATTR=(PROT)                                                      
POSSADR2 DFLD  POS=(7,52),LTH=4,                                       +        
               ATTR=(PROT)                                                      
POSSADR3 DFLD  POS=(7,57),LTH=4,                                       +        
               ATTR=(PROT)                                                      
POSSADR4 DFLD  POS=(7,62),LTH=4,                                       +        
               ATTR=(PROT)                                                      
POSSADR5 DFLD  POS=(7,67),LTH=4,                                       +        
               ATTR=(PROT)                                                      
POSSADR6 DFLD  POS=(7,72),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Antalsuppgifter',                                      +        
               POS=(9,2),LTH=15,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Artikeluppgifter',                                     +        
               POS=(9,23),LTH=16,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Beräknat',                                             +        
               POS=(10,11),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Ant',                                                  +        
               POS=(11,2),LTH=3,                                       +        
               ATTR=(PROT)                                                      
KVANT    DFLD  POS=(11,13),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Vikt',                                                 +        
               POS=(11,23),LTH=4,                                      +        
               ATTR=(PROT)                                                      
VIKTSORT DFLD  POS=(11,31),LTH=2,                                      +        
               ATTR=(PROT)                                                      
VKART    DFLD  POS=(11,37),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Lagerplats',                                           +        
               POS=(11,46),LTH=10,                                     +        
               ATTR=(PROT)                                                      
LO       DFLD  POS=(11,60),LTH=2,                                      +        
               ATTR=(PROT)                                                      
GANG     DFLD  POS=(11,63),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
PLATS    DFLD  POS=(11,66),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Prio',                                                 +        
               POS=(12,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KVPRIO   DFLD  POS=(12,13),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Vol',                                                  +        
               POS=(12,23),LTH=3,                                      +        
               ATTR=(PROT)                                                      
VOLSORT  DFLD  POS=(12,27),LTH=6,                                      +        
               ATTR=(PROT)                                                      
VLARTNTO DFLD  POS=(12,34),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Buffplats',                                            +        
               POS=(12,46),LTH=9,                                      +        
               ATTR=(PROT)                                                      
LOBUFF   DFLD  POS=(12,60),LTH=2,                                      +        
               ATTR=(PROT)                                                      
GANGBUFF DFLD  POS=(12,63),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
PLATSBUF DFLD  POS=(12,66),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Ant Prim',                                             +        
               POS=(13,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DGIA0000 DFLD  POS=(13,13),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Emb',                                                  +        
               POS=(13,23),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KDLAGEMB DFLD  POS=(13,40),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Ursprung',                                             +        
               POS=(13,46),LTH=8,                                      +        
               ATTR=(PROT)                                                      
KDARTUR  DFLD  POS=(13,63),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Ant Sek',                                              +        
               POS=(14,2),LTH=7,                                       +        
               ATTR=(PROT)                                                      
KVKVASEK DFLD  POS=(14,13),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'FT',                                                   +        
               POS=(14,23),LTH=2,                                      +        
               ATTR=(PROT)                                                      
BEFT     DFLD  POS=(14,42),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Anskaffare',                                           +        
               POS=(14,46),LTH=10,                                     +        
               ATTR=(PROT)                                                      
IDANSK   DFLD  POS=(14,62),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Sats',                                                 +        
               POS=(15,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
ADTRDEST DFLD  POS=(15,7),LTH=3,                                       +        
               ATTR=(PROT)                                                      
KVOF     DFLD  POS=(15,13),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Enhet',                                                +        
               POS=(15,23),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KDSORT   DFLD  POS=(15,42),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Farligt gods',                                         +        
               POS=(15,46),LTH=12,                                     +        
               ATTR=(PROT)                                                      
KDFARLIG DFLD  POS=(15,60),LTH=15,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Q3-kvant',                                             +        
               POS=(16,23),LTH=8,                                      +        
               ATTR=(PROT)                                                      
KVQ3     DFLD  POS=(16,38),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Kontr kod',                                            +        
               POS=(16,46),LTH=9,                                      +        
               ATTR=(PROT)                                                      
KDKONTR  DFLD  POS=(16,60),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'AR m gods',                                            +        
               POS=(17,23),LTH=9,                                      +        
               ATTR=(PROT)                                                      
FLAR     DFLD  POS=(17,43),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Lev Artnr',                                            +        
               POS=(18,23),LTH=9,                                      +        
               ATTR=(PROT)                                                      
BELEV1   DFLD  POS=(18,33),LTH=33,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Printer',                                              +        
               POS=(18,67),LTH=7,                                      +        
               ATTR=(ALPHA,PROT)                                                
PRINTER  DFLD  POS=(18,76),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  ' ',                                                    +        
               POS=(19,1),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
BELEV2   DFLD  POS=(19,33),LTH=33,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  ' ',                                                    +        
               POS=(19,67),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
         DFLD  '13 Adm vagn',                                          +        
               POS=(21,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '14 Flytta kolli 15 Ers flagga   16 Utplock VOR  17 Def +        
               styr',                                                  +        
               POS=(21,18),LTH=59,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '18 Def plac',                                          +        
               POS=(22,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '19 Fråga plac   20 Fråga FB FP  21 AR - info    10 rhel+        
               p',                                                     +        
               POS=(22,18),LTH=56,                                     +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W6O10902 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6F109,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I10901,                                           +        
               FILL=PT                                                          
MOD2     LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDLEVNRI,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLNRIN,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  PARTIIN,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDDCIN,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRINTER,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=61                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W6O10901 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6F109,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I10901,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDLEVNRI,                                               +        
               LTH=5                                                            
         MFLD  KOLLNRIN,                                               +        
               LTH=9                                                            
         MFLD  PARTIIN,                                                +        
               LTH=9                                                            
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  IDLEVNRU,                                               +        
               LTH=5                                                            
         MFLD  KOLLNRUT,                                               +        
               LTH=9                                                            
         MFLD  PARTIUT,                                                +        
               LTH=9                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  IDARTNR,                                                +        
               LTH=8                                                            
         MFLD  KVAVIS,                                                 +        
               LTH=6                                                            
         MFLD  BEART,                                                  +        
               LTH=25                                                           
         MFLD  KVAINL,                                                 +        
               LTH=2                                                            
         MFLD  IDFS,                                                   +        
               LTH=8                                                            
         MFLD  TIAVIDAT,                                               +        
               LTH=6                                                            
         MFLD  IDLBBET,                                                +        
               LTH=12                                                           
         MFLD  KDRT,                                                   +        
               LTH=2                                                            
         MFLD  AKONTR,                                                 +        
               LTH=1                                                            
         MFLD  IDLEVNR,                                                +        
               LTH=5                                                            
         MFLD  TIINLMOT,                                               +        
               LTH=6                                                            
         MFLD  POSSADR1,                                               +        
               LTH=4                                                            
         MFLD  POSSADR2,                                               +        
               LTH=4                                                            
         MFLD  POSSADR3,                                               +        
               LTH=4                                                            
         MFLD  POSSADR4,                                               +        
               LTH=4                                                            
         MFLD  POSSADR5,                                               +        
               LTH=4                                                            
         MFLD  POSSADR6,                                               +        
               LTH=4                                                            
         MFLD  KVANT,                                                  +        
               LTH=6                                                            
         MFLD  VIKTSORT,                                               +        
               LTH=2                                                            
         MFLD  VKART,                                                  +        
               LTH=7                                                            
         MFLD  LO,                                                     +        
               LTH=2                                                            
         MFLD  GANG,                                                   +        
               LTH=2                                                            
         MFLD  PLATS,                                                  +        
               LTH=5                                                            
         MFLD  KVPRIO,                                                 +        
               LTH=6                                                            
         MFLD  VOLSORT,                                                +        
               LTH=6                                                            
         MFLD  VLARTNTO,                                               +        
               LTH=10                                                           
         MFLD  LOBUFF,                                                 +        
               LTH=2                                                            
         MFLD  GANGBUFF,                                               +        
               LTH=2                                                            
         MFLD  PLATSBUF,                                               +        
               LTH=5                                                            
         MFLD  DGIA0000,                                               +        
               LTH=6                                                            
         MFLD  KDLAGEMB,                                               +        
               LTH=4                                                            
         MFLD  KDARTUR,                                                +        
               LTH=2                                                            
         MFLD  KVKVASEK,                                               +        
               LTH=6                                                            
         MFLD  BEFT,                                                   +        
               LTH=2                                                            
         MFLD  IDANSK,                                                 +        
               LTH=3                                                            
         MFLD  ADTRDEST,                                               +        
               LTH=3                                                            
         MFLD  KVOF,                                                   +        
               LTH=6                                                            
         MFLD  KDSORT,                                                 +        
               LTH=2                                                            
         MFLD  KDFARLIG,                                               +        
               LTH=15                                                           
         MFLD  KVQ3,                                                   +        
               LTH=6                                                            
         MFLD  KDKONTR,                                                +        
               LTH=5                                                            
         MFLD  FLAR,                                                   +        
               LTH=1                                                            
         MFLD  BELEV1,                                                 +        
               LTH=33                                                           
         MFLD  BELEV2,                                                 +        
               LTH=33                                                           
         MFLD  PRINTER,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=61                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W6I10901 MSG   TYPE=INPUT,                                             +        
               SOR=(W6F109),                                           +        
               OPT=2,                                                  +        
               NXT=W6O10901                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F9'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '61091',                                                +        
               LTH=5                                                            
         MFLD  (IDLEVNRI,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  IDLEVNRU,                                               +        
               LTH=5                                                            
         MFLD  (KOLLNRIN,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KOLLNRUT,                                               +        
               LTH=9                                                            
         MFLD  (PARTIIN,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  PARTIUT,                                                +        
               LTH=9                                                            
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  (PRINTER,                                               +        
               '++++'),                                                +        
               LTH=4                                                            
         MSGEND                                                                 
         END                                                                    
