***********************************************************************         
* CREATED BY PC22543   ON 94/11/15  AT 10:39                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'ARBETSRAPPORT INFORMATION       '                               
W6F145   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W6T145U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W6T141  ',                                          +        
               14='W6T142  ',                                          +        
               15='W6T143  ',                                          +        
               16='W6T144  ',                                          +        
               17='W6T145  ',                                          +        
               18='W6T146  ',                                          +        
               19='W6T147  ',                                          +        
               20='W6T148  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,8)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Rapportera diversekolli',                              +        
               POS=(1,11),LTH=23,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Levnr',                                                +        
               POS=(2,2),LTH=5,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDLEVNRI DFLD  POS=(2,8),LTH=5,                                        +        
               ATTR=(NOPROT)                                                    
         DFLD  'Kollinr',                                              +        
               POS=(2,14),LTH=7,                                       +        
               ATTR=(ALPHA,PROT)                                                
KOLLIIN  DFLD  POS=(2,22),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Partinr',                                              +        
               POS=(2,34),LTH=7,                                       +        
               ATTR=(PROT)                                                      
PARTIIN  DFLD  POS=(2,42),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,52),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DCIN     DFLD  POS=(2,55),LTH=2,                                       +        
               ATTR=(ALPHA,NOPROT)                                              
IDLEVNRU DFLD  POS=(3,8),LTH=5,                                        +        
               ATTR=(PROT,MOD)                                                  
KOLLIUT  DFLD  POS=(3,22),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
PARTIUT  DFLD  POS=(3,42),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
DCUT     DFLD  POS=(3,55),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Kollit klart',                                         +        
               POS=(5,2),LTH=12,                                       +        
               ATTR=(PROT)                                                      
FLKLAR   DFLD  POS=(5,15),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Anstnr',                                               +        
               POS=(5,19),LTH=6,                                       +        
               ATTR=(PROT)                                                      
IDANSTNR DFLD  POS=(5,26),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Åtg Inlant Adr  Lagerplats',                           +        
               POS=(7,2),LTH=26,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Artnr Benämning   Antal    VOR  Partinr  Rad F P',     +        
               POS=(7,33),LTH=48,                                      +        
               ATTR=(PROT)                                                      
DGIA0108 DFLD  POS=(8,2),LTH=3,                                        +        
               ATTR=(NOPROT)                                                    
DGIA0144 DFLD  POS=(8,6),LTH=6,                                        +        
               ATTR=(NUM,NOPROT)                                                
DGIA0012 DFLD  POS=(8,13),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0024 DFLD  POS=(8,18),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0000 DFLD  POS=(8,21),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0036 DFLD  POS=(8,24),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DGIA0072 DFLD  POS=(8,30),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DGIA0048 DFLD  POS=(8,39),LTH=10,                                      +        
               ATTR=(PROT)                                                      
DGIA0132 DFLD  POS=(8,50),LTH=6,                                       +        
               ATTR=(PROT)                                                      
DGIA0156 DFLD  POS=(8,57),LTH=6,                                       +        
               ATTR=(PROT)                                                      
DGIA0084 DFLD  POS=(8,64),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0096 DFLD  POS=(8,74),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0060 DFLD  POS=(8,78),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0120 DFLD  POS=(8,80),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0109 DFLD  POS=(9,2),LTH=3,                                        +        
               ATTR=(NOPROT)                                                    
DGIA0145 DFLD  POS=(9,6),LTH=6,                                        +        
               ATTR=(NUM,NOPROT)                                                
DGIA0013 DFLD  POS=(9,13),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0025 DFLD  POS=(9,18),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0001 DFLD  POS=(9,21),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0037 DFLD  POS=(9,24),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DGIA0073 DFLD  POS=(9,30),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DGIA0049 DFLD  POS=(9,39),LTH=10,                                      +        
               ATTR=(PROT)                                                      
DGIA0133 DFLD  POS=(9,50),LTH=6,                                       +        
               ATTR=(PROT)                                                      
DGIA0157 DFLD  POS=(9,57),LTH=6,                                       +        
               ATTR=(PROT)                                                      
DGIA0085 DFLD  POS=(9,64),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0097 DFLD  POS=(9,74),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0061 DFLD  POS=(9,78),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0121 DFLD  POS=(9,80),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0110 DFLD  POS=(10,2),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0146 DFLD  POS=(10,6),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0014 DFLD  POS=(10,13),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0026 DFLD  POS=(10,18),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0002 DFLD  POS=(10,21),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0038 DFLD  POS=(10,24),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0074 DFLD  POS=(10,30),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DGIA0050 DFLD  POS=(10,39),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DGIA0134 DFLD  POS=(10,50),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0158 DFLD  POS=(10,57),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0086 DFLD  POS=(10,64),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0098 DFLD  POS=(10,74),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0062 DFLD  POS=(10,78),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0122 DFLD  POS=(10,80),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0111 DFLD  POS=(11,2),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0147 DFLD  POS=(11,6),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0015 DFLD  POS=(11,13),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0027 DFLD  POS=(11,18),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0003 DFLD  POS=(11,21),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0039 DFLD  POS=(11,24),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0075 DFLD  POS=(11,30),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DGIA0051 DFLD  POS=(11,39),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DGIA0135 DFLD  POS=(11,50),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0159 DFLD  POS=(11,57),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0087 DFLD  POS=(11,64),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0099 DFLD  POS=(11,74),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0063 DFLD  POS=(11,78),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0123 DFLD  POS=(11,80),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0112 DFLD  POS=(12,2),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0148 DFLD  POS=(12,6),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0016 DFLD  POS=(12,13),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0028 DFLD  POS=(12,18),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0004 DFLD  POS=(12,21),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0040 DFLD  POS=(12,24),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0076 DFLD  POS=(12,30),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DGIA0052 DFLD  POS=(12,39),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DGIA0136 DFLD  POS=(12,50),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0160 DFLD  POS=(12,57),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0088 DFLD  POS=(12,64),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0100 DFLD  POS=(12,74),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0064 DFLD  POS=(12,78),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0124 DFLD  POS=(12,80),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0113 DFLD  POS=(13,2),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0149 DFLD  POS=(13,6),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0017 DFLD  POS=(13,13),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0029 DFLD  POS=(13,18),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0005 DFLD  POS=(13,21),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0041 DFLD  POS=(13,24),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0077 DFLD  POS=(13,30),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DGIA0053 DFLD  POS=(13,39),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DGIA0137 DFLD  POS=(13,50),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0161 DFLD  POS=(13,57),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0089 DFLD  POS=(13,64),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0101 DFLD  POS=(13,74),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0065 DFLD  POS=(13,78),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0125 DFLD  POS=(13,80),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0114 DFLD  POS=(14,2),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0150 DFLD  POS=(14,6),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0018 DFLD  POS=(14,13),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0030 DFLD  POS=(14,18),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0006 DFLD  POS=(14,21),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0042 DFLD  POS=(14,24),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0078 DFLD  POS=(14,30),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DGIA0054 DFLD  POS=(14,39),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DGIA0138 DFLD  POS=(14,50),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0162 DFLD  POS=(14,57),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0090 DFLD  POS=(14,64),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0102 DFLD  POS=(14,74),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0066 DFLD  POS=(14,78),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0126 DFLD  POS=(14,80),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0115 DFLD  POS=(15,2),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0151 DFLD  POS=(15,6),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0019 DFLD  POS=(15,13),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0031 DFLD  POS=(15,18),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0007 DFLD  POS=(15,21),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0043 DFLD  POS=(15,24),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0079 DFLD  POS=(15,30),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DGIA0055 DFLD  POS=(15,39),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DGIA0139 DFLD  POS=(15,50),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0163 DFLD  POS=(15,57),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0091 DFLD  POS=(15,64),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0103 DFLD  POS=(15,74),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0067 DFLD  POS=(15,78),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0127 DFLD  POS=(15,80),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0116 DFLD  POS=(16,2),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0152 DFLD  POS=(16,6),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0020 DFLD  POS=(16,13),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0032 DFLD  POS=(16,18),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0008 DFLD  POS=(16,21),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0044 DFLD  POS=(16,24),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0080 DFLD  POS=(16,30),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DGIA0056 DFLD  POS=(16,39),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DGIA0140 DFLD  POS=(16,50),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0164 DFLD  POS=(16,57),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0092 DFLD  POS=(16,64),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0104 DFLD  POS=(16,74),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0068 DFLD  POS=(16,78),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0128 DFLD  POS=(16,80),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0117 DFLD  POS=(17,2),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0153 DFLD  POS=(17,6),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0021 DFLD  POS=(17,13),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0033 DFLD  POS=(17,18),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0009 DFLD  POS=(17,21),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0045 DFLD  POS=(17,24),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0081 DFLD  POS=(17,30),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DGIA0057 DFLD  POS=(17,39),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DGIA0141 DFLD  POS=(17,50),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0165 DFLD  POS=(17,57),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0093 DFLD  POS=(17,64),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0105 DFLD  POS=(17,74),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0069 DFLD  POS=(17,78),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0129 DFLD  POS=(17,80),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0118 DFLD  POS=(18,2),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0154 DFLD  POS=(18,6),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0022 DFLD  POS=(18,13),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0034 DFLD  POS=(18,18),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0010 DFLD  POS=(18,21),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0046 DFLD  POS=(18,24),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0082 DFLD  POS=(18,30),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DGIA0058 DFLD  POS=(18,39),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DGIA0142 DFLD  POS=(18,50),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0166 DFLD  POS=(18,57),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0094 DFLD  POS=(18,64),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0106 DFLD  POS=(18,74),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0070 DFLD  POS=(18,78),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0130 DFLD  POS=(18,80),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0119 DFLD  POS=(19,2),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0155 DFLD  POS=(19,6),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0023 DFLD  POS=(19,13),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0035 DFLD  POS=(19,18),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0011 DFLD  POS=(19,21),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0047 DFLD  POS=(19,24),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0083 DFLD  POS=(19,30),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DGIA0059 DFLD  POS=(19,39),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DGIA0143 DFLD  POS=(19,50),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0167 DFLD  POS=(19,57),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0095 DFLD  POS=(19,64),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0107 DFLD  POS=(19,74),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0071 DFLD  POS=(19,78),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0131 DFLD  POS=(19,80),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '13 Skapa ilist  14 Rapp ilist   15 Rapp kolli   16 Rapp+        
                parti   17 Rapp divkli',                               +        
               POS=(21,2),LTH=78,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 Slutrapp',                                          +        
               POS=(22,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '19 Slutrapp avv 20 Rapp trp anm 21',                   +        
               POS=(22,18),LTH=34,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W6O14501 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6F145,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I14501,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDLEVNRI,                                               +        
               LTH=5                                                            
         MFLD  IDLEVNRU,                                               +        
               LTH=5                                                            
         MFLD  KOLLIIN,                                                +        
               LTH=9                                                            
         MFLD  KOLLIUT,                                                +        
               LTH=9                                                            
         MFLD  PARTIIN,                                                +        
               LTH=9                                                            
         MFLD  PARTIUT,                                                +        
               LTH=9                                                            
         MFLD  DCIN,                                                   +        
               LTH=2                                                            
         MFLD  DCUT,                                                   +        
               LTH=2                                                            
         MFLD  FLKLAR,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDANSTNR,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0108,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0109,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0110,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0111,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0112,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0113,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0114,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0115,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0116,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0117,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0118,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0119,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0144,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0145,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0146,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0147,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0148,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0149,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0150,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0151,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0152,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0153,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0154,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0155,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0012,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0013,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0014,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0015,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0016,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0017,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0018,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0019,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0020,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0021,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0022,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0023,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0024,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0025,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0026,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0027,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0028,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0029,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0030,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0031,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0032,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0033,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0034,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0035,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0000,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0001,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0002,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0003,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0004,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0005,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0006,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0007,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0008,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0009,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0010,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0011,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0036,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0037,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0038,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0039,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0040,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0041,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0042,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0043,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0044,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0045,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0046,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0047,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0072,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0073,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0074,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0075,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0076,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0077,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0078,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0079,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0080,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0081,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0082,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0083,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0048,                                               +        
               LTH=10                                                           
         MFLD  DGIA0049,                                               +        
               LTH=10                                                           
         MFLD  DGIA0050,                                               +        
               LTH=10                                                           
         MFLD  DGIA0051,                                               +        
               LTH=10                                                           
         MFLD  DGIA0052,                                               +        
               LTH=10                                                           
         MFLD  DGIA0053,                                               +        
               LTH=10                                                           
         MFLD  DGIA0054,                                               +        
               LTH=10                                                           
         MFLD  DGIA0055,                                               +        
               LTH=10                                                           
         MFLD  DGIA0056,                                               +        
               LTH=10                                                           
         MFLD  DGIA0057,                                               +        
               LTH=10                                                           
         MFLD  DGIA0058,                                               +        
               LTH=10                                                           
         MFLD  DGIA0059,                                               +        
               LTH=10                                                           
         MFLD  DGIA0132,                                               +        
               LTH=6                                                            
         MFLD  DGIA0133,                                               +        
               LTH=6                                                            
         MFLD  DGIA0134,                                               +        
               LTH=6                                                            
         MFLD  DGIA0135,                                               +        
               LTH=6                                                            
         MFLD  DGIA0136,                                               +        
               LTH=6                                                            
         MFLD  DGIA0137,                                               +        
               LTH=6                                                            
         MFLD  DGIA0138,                                               +        
               LTH=6                                                            
         MFLD  DGIA0139,                                               +        
               LTH=6                                                            
         MFLD  DGIA0140,                                               +        
               LTH=6                                                            
         MFLD  DGIA0141,                                               +        
               LTH=6                                                            
         MFLD  DGIA0142,                                               +        
               LTH=6                                                            
         MFLD  DGIA0143,                                               +        
               LTH=6                                                            
         MFLD  DGIA0156,                                               +        
               LTH=6                                                            
         MFLD  DGIA0157,                                               +        
               LTH=6                                                            
         MFLD  DGIA0158,                                               +        
               LTH=6                                                            
         MFLD  DGIA0159,                                               +        
               LTH=6                                                            
         MFLD  DGIA0160,                                               +        
               LTH=6                                                            
         MFLD  DGIA0161,                                               +        
               LTH=6                                                            
         MFLD  DGIA0162,                                               +        
               LTH=6                                                            
         MFLD  DGIA0163,                                               +        
               LTH=6                                                            
         MFLD  DGIA0164,                                               +        
               LTH=6                                                            
         MFLD  DGIA0165,                                               +        
               LTH=6                                                            
         MFLD  DGIA0166,                                               +        
               LTH=6                                                            
         MFLD  DGIA0167,                                               +        
               LTH=6                                                            
         MFLD  DGIA0084,                                               +        
               LTH=9                                                            
         MFLD  DGIA0085,                                               +        
               LTH=9                                                            
         MFLD  DGIA0086,                                               +        
               LTH=9                                                            
         MFLD  DGIA0087,                                               +        
               LTH=9                                                            
         MFLD  DGIA0088,                                               +        
               LTH=9                                                            
         MFLD  DGIA0089,                                               +        
               LTH=9                                                            
         MFLD  DGIA0090,                                               +        
               LTH=9                                                            
         MFLD  DGIA0091,                                               +        
               LTH=9                                                            
         MFLD  DGIA0092,                                               +        
               LTH=9                                                            
         MFLD  DGIA0093,                                               +        
               LTH=9                                                            
         MFLD  DGIA0094,                                               +        
               LTH=9                                                            
         MFLD  DGIA0095,                                               +        
               LTH=9                                                            
         MFLD  DGIA0096,                                               +        
               LTH=3                                                            
         MFLD  DGIA0097,                                               +        
               LTH=3                                                            
         MFLD  DGIA0098,                                               +        
               LTH=3                                                            
         MFLD  DGIA0099,                                               +        
               LTH=3                                                            
         MFLD  DGIA0100,                                               +        
               LTH=3                                                            
         MFLD  DGIA0101,                                               +        
               LTH=3                                                            
         MFLD  DGIA0102,                                               +        
               LTH=3                                                            
         MFLD  DGIA0103,                                               +        
               LTH=3                                                            
         MFLD  DGIA0104,                                               +        
               LTH=3                                                            
         MFLD  DGIA0105,                                               +        
               LTH=3                                                            
         MFLD  DGIA0106,                                               +        
               LTH=3                                                            
         MFLD  DGIA0107,                                               +        
               LTH=3                                                            
         MFLD  DGIA0060,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0061,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0062,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0063,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0064,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0065,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0066,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0067,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0068,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0069,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0070,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0071,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0120,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0121,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0122,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0123,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0124,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0125,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0126,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0127,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0128,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0129,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0130,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0131,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=61                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W6I14501 MSG   TYPE=INPUT,                                             +        
               SOR=(W6F145),                                           +        
               OPT=2,                                                  +        
               NXT=W6O14501                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '61451',                                                +        
               LTH=5                                                            
         MFLD  (IDLEVNRI,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  IDLEVNRU,                                               +        
               LTH=5                                                            
         MFLD  (KOLLIIN,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KOLLIUT,                                                +        
               LTH=9                                                            
         MFLD  (PARTIIN,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  PARTIUT,                                                +        
               LTH=9                                                            
         MFLD  (DCIN,                                                  +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  DCUT,                                                   +        
               LTH=2                                                            
         MFLD  (FLKLAR,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (IDANSTNR,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0108,                                              +        
               '+++'),                                                 +        
               LTH=3                                                            
         MFLD  (DGIA0109,                                              +        
               '+++'),                                                 +        
               LTH=3                                                            
         MFLD  (DGIA0110,                                              +        
               '+++'),                                                 +        
               LTH=3                                                            
         MFLD  (DGIA0111,                                              +        
               '+++'),                                                 +        
               LTH=3                                                            
         MFLD  (DGIA0112,                                              +        
               '+++'),                                                 +        
               LTH=3                                                            
         MFLD  (DGIA0113,                                              +        
               '+++'),                                                 +        
               LTH=3                                                            
         MFLD  (DGIA0114,                                              +        
               '+++'),                                                 +        
               LTH=3                                                            
         MFLD  (DGIA0115,                                              +        
               '+++'),                                                 +        
               LTH=3                                                            
         MFLD  (DGIA0116,                                              +        
               '+++'),                                                 +        
               LTH=3                                                            
         MFLD  (DGIA0117,                                              +        
               '+++'),                                                 +        
               LTH=3                                                            
         MFLD  (DGIA0118,                                              +        
               '+++'),                                                 +        
               LTH=3                                                            
         MFLD  (DGIA0119,                                              +        
               '+++'),                                                 +        
               LTH=3                                                            
         MFLD  (DGIA0144,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0145,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0146,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0147,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0148,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0149,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0150,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0151,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0152,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0153,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0154,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0155,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0012,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (DGIA0013,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (DGIA0014,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (DGIA0015,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (DGIA0016,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (DGIA0017,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (DGIA0018,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (DGIA0019,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (DGIA0020,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (DGIA0021,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (DGIA0022,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (DGIA0023,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  DGIA0084,                                               +        
               LTH=9                                                            
         MFLD  DGIA0085,                                               +        
               LTH=9                                                            
         MFLD  DGIA0086,                                               +        
               LTH=9                                                            
         MFLD  DGIA0087,                                               +        
               LTH=9                                                            
         MFLD  DGIA0088,                                               +        
               LTH=9                                                            
         MFLD  DGIA0089,                                               +        
               LTH=9                                                            
         MFLD  DGIA0090,                                               +        
               LTH=9                                                            
         MFLD  DGIA0091,                                               +        
               LTH=9                                                            
         MFLD  DGIA0092,                                               +        
               LTH=9                                                            
         MFLD  DGIA0093,                                               +        
               LTH=9                                                            
         MFLD  DGIA0094,                                               +        
               LTH=9                                                            
         MFLD  DGIA0095,                                               +        
               LTH=9                                                            
         MFLD  DGIA0096,                                               +        
               LTH=3                                                            
         MFLD  DGIA0097,                                               +        
               LTH=3                                                            
         MFLD  DGIA0098,                                               +        
               LTH=3                                                            
         MFLD  DGIA0099,                                               +        
               LTH=3                                                            
         MFLD  DGIA0100,                                               +        
               LTH=3                                                            
         MFLD  DGIA0101,                                               +        
               LTH=3                                                            
         MFLD  DGIA0102,                                               +        
               LTH=3                                                            
         MFLD  DGIA0103,                                               +        
               LTH=3                                                            
         MFLD  DGIA0104,                                               +        
               LTH=3                                                            
         MFLD  DGIA0105,                                               +        
               LTH=3                                                            
         MFLD  DGIA0106,                                               +        
               LTH=3                                                            
         MFLD  DGIA0107,                                               +        
               LTH=3                                                            
         MSGEND                                                                 
         END                                                                    
