****** ****************************************************************         
* CREATED BY PC22543   ON 96/10/06  AT 21:25                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'RAPPORTERA KOLLI                '                               
W6F143   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W6T143U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W6T141  ',                                          +        
               14='W6T142  ',                                          +        
               15='W6T143  ',                                          +        
               16='W6T144  ',                                          +        
               17='W6T145  ',                                          +        
               18='W6T146  ',                                          +        
               19='W6T147  ',                                          +        
               20='W6T148  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W6F143   DPAGE CURSOR=((2,9)),                                         +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Rapportera kolli',                                     +        
               POS=(1,12),LTH=16,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Levnr',                                                +        
               POS=(2,2),LTH=5,                                        +        
               ATTR=(ALPHA,PROT)                                                
DGIA0017 DFLD  POS=(2,9),LTH=5,                                        +        
               ATTR=(NOPROT)                                                    
         DFLD  'Kollinr',                                              +        
               POS=(2,17),LTH=7,                                       +        
               ATTR=(PROT)                                                      
DGIA0012 DFLD  POS=(2,26),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0019 DFLD  POS=(2,41),LTH=9,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'DC',                                                   +        
               POS=(2,51),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DCIN     DFLD  POS=(2,54),LTH=2,                                       +        
               ATTR=(ALPHA,NOPROT)                                              
DGIA0018 DFLD  POS=(3,9),LTH=5,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0013 DFLD  POS=(3,26),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0020 DFLD  POS=(3,41),LTH=9,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
DCUT     DFLD  POS=(3,54),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Artnr',                                                +        
               POS=(5,2),LTH=5,                                        +        
               ATTR=(PROT)                                                      
ARTNR    DFLD  POS=(5,9),LTH=8,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Benämning',                                            +        
               POS=(5,42),LTH=9,                                       +        
               ATTR=(PROT)                                                      
BEART    DFLD  POS=(5,56),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Enhet',                                                +        
               POS=(6,2),LTH=5,                                        +        
               ATTR=(ALPHA,PROT)                                                
ENHET    DFLD  POS=(6,9),LTH=2,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'FT',                                                   +        
               POS=(6,15),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FT       DFLD  POS=(6,19),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Farligt gods',                                         +        
               POS=(6,42),LTH=12,                                      +        
               ATTR=(PROT)                                                      
KDFARLIG DFLD  POS=(6,56),LTH=10,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'FBadr',                                                +        
               POS=(6,70),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FBADRESS DFLD  POS=(6,77),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Antal',                                                +        
               POS=(7,2),LTH=5,                                        +        
               ATTR=(ALPHA,PROT)                                                
ANTAL    DFLD  POS=(7,15),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Antal VOR',                                            +        
               POS=(8,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
DGIA0000 DFLD  POS=(8,15),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Lagerplats',                                           +        
               POS=(10,2),LTH=10,                                      +        
               ATTR=(PROT)                                                      
DGIA0015 DFLD  POS=(10,15),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0014 DFLD  POS=(10,19),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0016 DFLD  POS=(10,23),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Buffertplats',                                         +        
               POS=(10,32),LTH=12,                                     +        
               ATTR=(PROT)                                                      
DGIA0005 DFLD  POS=(10,46),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0002 DFLD  POS=(10,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0008 DFLD  POS=(10,54),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0006 DFLD  POS=(11,46),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0003 DFLD  POS=(11,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0009 DFLD  POS=(11,54),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0007 DFLD  POS=(12,46),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0004 DFLD  POS=(12,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
DGIA0010 DFLD  POS=(12,54),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Vid delinläggning',                                    +        
               POS=(16,2),LTH=17,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Inlagt antal',                                         +        
               POS=(16,32),LTH=12,                                     +        
               ATTR=(PROT)                                                      
DGIA0011 DFLD  POS=(16,46),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(16,53),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
         DFLD  'Vid avvikelse',                                        +        
               POS=(17,2),LTH=13,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Inlagt antal',                                         +        
               POS=(17,32),LTH=12,                                     +        
               ATTR=(PROT)                                                      
DGIA0001 DFLD  POS=(17,46),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(17,53),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
         DFLD  'Anstnr',                                               +        
               POS=(17,57),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDANSTNR DFLD  POS=(17,65),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(17,71),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
         DFLD  'Vid retur',                                            +        
               POS=(19,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Adress',                                               +        
               POS=(19,32),LTH=6,                                      +        
               ATTR=(PROT)                                                      
ADRESS   DFLD  POS=(19,46),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  '13 Skapa ilist  14 Rapp ilist   15 Rapp kolli   16 Rapp+        
                parti   17 Rapp divkli',                               +        
               POS=(21,2),LTH=78,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 Slutrapp',                                          +        
               POS=(22,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '19 Slutrapp avv 20 Rapp trp anm 21',                   +        
               POS=(22,18),LTH=34,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W6I14301 MSG   TYPE=INPUT,                                             +        
               SOR=(W6F143),                                           +        
               OPT=2,                                                  +        
               NXT=W6O14301                                                     
MID      LPAGE SOR=(W6F143)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  ' ',                                                    +        
               LTH=2                                                            
         MFLD  '61431',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0017,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  DGIA0018,                                               +        
               LTH=5                                                            
         MFLD  (DGIA0012,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0013,                                               +        
               LTH=9                                                            
         MFLD  (DGIA0019,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0020,                                               +        
               LTH=9                                                            
         MFLD  (DCIN,                                                  +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  DCUT,                                                   +        
               LTH=2                                                            
         MFLD  (DGIA0011,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0001,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDANSTNR,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ADRESS,                                                +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MSGEND                                                                 
W6O14301 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6F143,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I14301,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W6F143                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DGIA0017,                                               +        
               LTH=5                                                            
         MFLD  DGIA0018,                                               +        
               LTH=5                                                            
         MFLD  DGIA0012,                                               +        
               LTH=9                                                            
         MFLD  DGIA0013,                                               +        
               LTH=9                                                            
         MFLD  DGIA0019,                                               +        
               LTH=9                                                            
         MFLD  DGIA0020,                                               +        
               LTH=9                                                            
         MFLD  DCIN,                                                   +        
               LTH=2                                                            
         MFLD  DCUT,                                                   +        
               LTH=2                                                            
         MFLD  ARTNR,                                                  +        
               LTH=8                                                            
         MFLD  BEART,                                                  +        
               LTH=25                                                           
         MFLD  ENHET,                                                  +        
               LTH=2                                                            
         MFLD  FT,                                                     +        
               LTH=2                                                            
         MFLD  KDFARLIG,                                               +        
               LTH=10                                                           
         MFLD  FBADRESS,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTAL,                                                  +        
               LTH=6                                                            
         MFLD  DGIA0000,                                               +        
               LTH=6                                                            
         MFLD  DGIA0015,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0014,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0016,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0005,                                               +        
               LTH=2                                                            
         MFLD  DGIA0002,                                               +        
               LTH=2                                                            
         MFLD  DGIA0008,                                               +        
               LTH=5                                                            
         MFLD  DGIA0006,                                               +        
               LTH=2                                                            
         MFLD  DGIA0003,                                               +        
               LTH=2                                                            
         MFLD  DGIA0009,                                               +        
               LTH=5                                                            
         MFLD  DGIA0007,                                               +        
               LTH=2                                                            
         MFLD  DGIA0004,                                               +        
               LTH=2                                                            
         MFLD  DGIA0010,                                               +        
               LTH=5                                                            
         MFLD  DGIA0011,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0001,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDANSTNR,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADRESS,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=61                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  FSYSMSG,                                                +        
               LTH=79                                                           
         MSGEND                                                                 
         END                                                                    
