***********************************************************************         
* CREATED BY PCC4448   ON 94/11/17  AT 10:39                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'ADMINISTRERA VAGN               '                               
W6F101   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W6T101 7',                                           +        
               8='W6T101 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W6T101U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W6T101  ',                                          +        
               14='W6T102  ',                                          +        
               15='W6T103  ',                                          +        
               16='W6T104  ',                                          +        
               17='W6T105  ',                                          +        
               18='W6T106  ',                                          +        
               19='W6T107  ',                                          +        
               20='W6T108  ',                                          +        
               21='W6T109  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W6F101   DPAGE CURSOR=((2,8)),                                         +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Administrera vagn',                                    +        
               POS=(1,12),LTH=17,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Vagn',                                                 +        
               POS=(2,2),LTH=4,                                        +        
               ATTR=(ALPHA,PROT)                                                
DGIA0003 DFLD  POS=(2,8),LTH=3,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,13),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDDCIN   DFLD  POS=(2,16),LTH=2,                                       +        
               ATTR=(ALPHA,NOPROT)                                              
DGIA0006 DFLD  POS=(3,8),LTH=3,                                        +        
               ATTR=(PROT,MOD)                                                  
IDDCUT   DFLD  POS=(3,16),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0002 DFLD  POS=(4,2),LTH=3,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0004 DFLD  POS=(4,8),LTH=3,                                        +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Åtg  Vagn  Plac  Adress',                              +        
               POS=(5,2),LTH=23,                                       +        
               ATTR=(PROT)                                                      
VAGN1    DFLD  POS=(6,8),LTH=3,                                        +        
               ATTR=(PROT,MOD)                                                  
PLAC1    DFLD  POS=(6,13),LTH=4,                                       +        
               ATTR=(PROT)                                                      
ADRESS1  DFLD  POS=(6,19),LTH=4,                                       +        
               ATTR=(PROT)                                                      
VAGN2    DFLD  POS=(7,8),LTH=3,                                        +        
               ATTR=(PROT,MOD)                                                  
PLAC2    DFLD  POS=(7,13),LTH=4,                                       +        
               ATTR=(PROT)                                                      
ADRESS2  DFLD  POS=(7,19),LTH=4,                                       +        
               ATTR=(PROT)                                                      
VAGN3    DFLD  POS=(8,8),LTH=3,                                        +        
               ATTR=(PROT,MOD)                                                  
PLAC3    DFLD  POS=(8,13),LTH=4,                                       +        
               ATTR=(PROT)                                                      
ADRESS3  DFLD  POS=(8,19),LTH=4,                                       +        
               ATTR=(PROT)                                                      
VAGN4    DFLD  POS=(9,8),LTH=3,                                        +        
               ATTR=(PROT,MOD)                                                  
PLAC4    DFLD  POS=(9,13),LTH=4,                                       +        
               ATTR=(PROT)                                                      
ADRESS4  DFLD  POS=(9,19),LTH=4,                                       +        
               ATTR=(PROT)                                                      
VAGN5    DFLD  POS=(10,8),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
PLAC5    DFLD  POS=(10,13),LTH=4,                                      +        
               ATTR=(PROT)                                                      
ADRESS5  DFLD  POS=(10,19),LTH=4,                                      +        
               ATTR=(PROT)                                                      
VAGN6    DFLD  POS=(11,8),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
PLAC6    DFLD  POS=(11,13),LTH=4,                                      +        
               ATTR=(PROT)                                                      
ADRESS6  DFLD  POS=(11,19),LTH=4,                                      +        
               ATTR=(PROT)                                                      
VAGN7    DFLD  POS=(12,8),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
PLAC7    DFLD  POS=(12,13),LTH=4,                                      +        
               ATTR=(PROT)                                                      
ADRESS7  DFLD  POS=(12,19),LTH=4,                                      +        
               ATTR=(PROT)                                                      
VAGN8    DFLD  POS=(13,8),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
PLAC8    DFLD  POS=(13,13),LTH=4,                                      +        
               ATTR=(PROT)                                                      
ADRESS8  DFLD  POS=(13,19),LTH=4,                                      +        
               ATTR=(PROT)                                                      
VAGN9    DFLD  POS=(14,8),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
PLAC9    DFLD  POS=(14,13),LTH=4,                                      +        
               ATTR=(PROT)                                                      
ADRESS9  DFLD  POS=(14,19),LTH=4,                                      +        
               ATTR=(PROT)                                                      
VAGN10   DFLD  POS=(15,8),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
PLAC10   DFLD  POS=(15,13),LTH=4,                                      +        
               ATTR=(PROT)                                                      
ADRESS10 DFLD  POS=(15,19),LTH=4,                                      +        
               ATTR=(PROT)                                                      
VAGN11   DFLD  POS=(16,8),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
PLAC11   DFLD  POS=(16,13),LTH=4,                                      +        
               ATTR=(PROT)                                                      
ADRESS11 DFLD  POS=(16,19),LTH=4,                                      +        
               ATTR=(PROT)                                                      
VAGN12   DFLD  POS=(17,8),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
PLAC12   DFLD  POS=(17,13),LTH=4,                                      +        
               ATTR=(PROT)                                                      
ADRESS12 DFLD  POS=(17,19),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Åtg  Vagn  Plac  Adress',                              +        
               POS=(18,2),LTH=23,                                      +        
               ATTR=(PROT)                                                      
DGIA0007 DFLD  POS=(19,2),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  ' ',                                                    +        
               POS=(19,6),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
DGIA0005 DFLD  POS=(19,8),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0001 DFLD  POS=(19,13),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0000 DFLD  POS=(19,19),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  ' ',                                                    +        
               POS=(19,24),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
         DFLD  '13 Adm vagn   14 Flytta kolli 15 Ers flagga   16 Utploc+        
               k VOR  17 Def styr',                                    +        
               POS=(21,2),LTH=73,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 Def plac   19 Fråga plac   20 Fråga FB/FP  21 AR - I+        
               nfo    10 WHELP',                                       +        
               POS=(22,2),LTH=70,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W6I10101 MSG   TYPE=INPUT,                                             +        
               SOR=(W6F101),                                           +        
               OPT=2,                                                  +        
               NXT=W6O10101                                                     
MID      LPAGE SOR=(W6F101)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  ' ',                                                    +        
               LTH=2                                                            
         MFLD  '61011',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0003,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0006,                                               +        
               LTH=3                                                            
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  DGIA0002,                                               +        
               LTH=3                                                            
         MFLD  DGIA0004,                                               +        
               LTH=3                                                            
         MFLD  VAGN1,                                                  +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  VAGN2,                                                  +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  VAGN3,                                                  +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  VAGN4,                                                  +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  VAGN5,                                                  +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  VAGN6,                                                  +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  VAGN7,                                                  +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  VAGN8,                                                  +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  VAGN9,                                                  +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  VAGN10,                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  VAGN11,                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  VAGN12,                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0007,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0005,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0001,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0000,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MSGEND                                                                 
W6O10101 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6F101,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I10101,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W6F101                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DGIA0003,                                               +        
               LTH=3                                                            
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  DGIA0006,                                               +        
               LTH=3                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  DGIA0002,                                               +        
               LTH=3                                                            
         MFLD  DGIA0004,                                               +        
               LTH=3                                                            
         MFLD  VAGN1,                                                  +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PLAC1,                                                  +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADRESS1,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VAGN2,                                                  +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PLAC2,                                                  +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADRESS2,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VAGN3,                                                  +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PLAC3,                                                  +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADRESS3,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VAGN4,                                                  +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PLAC4,                                                  +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADRESS4,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VAGN5,                                                  +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PLAC5,                                                  +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADRESS5,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VAGN6,                                                  +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PLAC6,                                                  +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADRESS6,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VAGN7,                                                  +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PLAC7,                                                  +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADRESS7,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VAGN8,                                                  +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PLAC8,                                                  +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADRESS8,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VAGN9,                                                  +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PLAC9,                                                  +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADRESS9,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VAGN10,                                                 +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PLAC10,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADRESS10,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VAGN11,                                                 +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PLAC11,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADRESS11,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VAGN12,                                                 +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PLAC12,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADRESS12,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0007,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0005,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0001,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0000,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=61                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  FSYSMSG,                                                +        
               LTH=79                                                           
         MSGEND                                                                 
         END                                                                    
