***********************************************************************         
* CREATED BY V063442   ON 02/05/29  AT 17:29                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'TA BORT KOLLIN                  '                               
W6F135   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W6T135U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W6T131  ',                                          +        
               14='W6T132  ',                                          +        
               15='W6T133  ',                                          +        
               16='W0T501  ',                                          +        
               17='W6T135  ',                                          +        
               18='W6T136  ',                                          +        
               19='W6T137  ',                                          +        
               20='W0T501  ',                                          +        
               21='W6T139  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W6F135   DPAGE CURSOR=((2,6)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Ta bort kollin',                                       +        
               POS=(1,11),LTH=14,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'DC',                                                   +        
               POS=(2,2),LTH=2,                                        +        
               ATTR=(NUM,PROT)                                                  
IDDCIN   DFLD  POS=(2,6),LTH=2,                                        +        
               ATTR=(NOPROT)                                                    
IDDCUT   DFLD  POS=(3,6),LTH=2,                                        +        
               ATTR=(PROT,MOD)                                                  
IDLOPNRI DFLD  POS=(4,55),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Levnr   Kollinr',                                      +        
               POS=(5,2),LTH=15,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Levnr   Kollinr',                                      +        
               POS=(5,22),LTH=15,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Partinr',                                              +        
               POS=(5,47),LTH=7,                                       +        
               ATTR=(PROT)                                                      
IDLOPNRU DFLD  POS=(5,55),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
IDLEVNR1 DFLD  POS=(6,2),LTH=5,                                        +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(6,8),LTH=1,                                        +        
               ATTR=(ALPHA)                                                     
KOLLI1   DFLD  POS=(6,10),LTH=9,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(6,20),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
IDLEVNR2 DFLD  POS=(6,22),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(6,28),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
KOLLI2   DFLD  POS=(6,30),LTH=9,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(6,40),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
IDLEVNR3 DFLD  POS=(7,2),LTH=5,                                        +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(7,8),LTH=1,                                        +        
               ATTR=(ALPHA)                                                     
KOLLI3   DFLD  POS=(7,10),LTH=9,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(7,20),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
IDLEVNR4 DFLD  POS=(7,22),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(7,28),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
KOLLI4   DFLD  POS=(7,30),LTH=9,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(7,40),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
IDLEVNR5 DFLD  POS=(8,2),LTH=5,                                        +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(8,8),LTH=1,                                        +        
               ATTR=(ALPHA)                                                     
KOLLI5   DFLD  POS=(8,10),LTH=9,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(8,20),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
IDLEVNR6 DFLD  POS=(8,22),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(8,28),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
KOLLI6   DFLD  POS=(8,30),LTH=9,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(8,40),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
IDLEVNR7 DFLD  POS=(9,2),LTH=5,                                        +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(9,8),LTH=1,                                        +        
               ATTR=(ALPHA)                                                     
KOLLI7   DFLD  POS=(9,10),LTH=9,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(9,20),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
IDLEVNR8 DFLD  POS=(9,22),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(9,28),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
KOLLI8   DFLD  POS=(9,30),LTH=9,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(9,40),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
IDLEVNR9 DFLD  POS=(10,2),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(10,8),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
KOLLI9   DFLD  POS=(10,10),LTH=9,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(10,20),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
IDLEVN10 DFLD  POS=(10,22),LTH=5,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(10,28),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
KOLLI10  DFLD  POS=(10,30),LTH=9,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(10,40),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
IDLEVN11 DFLD  POS=(11,2),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(11,8),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
KOLLI11  DFLD  POS=(11,10),LTH=9,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(11,20),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
IDLEVN12 DFLD  POS=(11,22),LTH=5,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(11,28),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
KOLLI12  DFLD  POS=(11,30),LTH=9,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(11,40),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
IDLEVN13 DFLD  POS=(12,2),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(12,8),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
KOLLI13  DFLD  POS=(12,10),LTH=9,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(12,20),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
IDLEVN14 DFLD  POS=(12,22),LTH=5,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(12,28),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
KOLLI14  DFLD  POS=(12,30),LTH=9,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(12,40),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
IDLEVN15 DFLD  POS=(13,2),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(13,8),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
KOLLI15  DFLD  POS=(13,10),LTH=9,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(13,20),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
IDLEVN16 DFLD  POS=(13,22),LTH=5,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(13,28),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
KOLLI16  DFLD  POS=(13,30),LTH=9,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(13,40),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
IDLEVN17 DFLD  POS=(14,2),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(14,8),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
KOLLI17  DFLD  POS=(14,10),LTH=9,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(14,20),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
IDLEVN18 DFLD  POS=(14,22),LTH=5,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(14,28),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
KOLLI18  DFLD  POS=(14,30),LTH=9,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(14,40),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
IDLEVN19 DFLD  POS=(15,2),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(15,8),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
KOLLI19  DFLD  POS=(15,10),LTH=9,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(15,20),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
IDLEVN20 DFLD  POS=(15,22),LTH=5,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(15,28),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
KOLLI20  DFLD  POS=(15,30),LTH=9,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(15,40),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
IDLEVN21 DFLD  POS=(16,2),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(16,8),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
KOLLI21  DFLD  POS=(16,10),LTH=9,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(16,20),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
IDLEVN22 DFLD  POS=(16,22),LTH=5,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(16,28),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
KOLLI22  DFLD  POS=(16,30),LTH=9,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(16,40),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
IDLEVN23 DFLD  POS=(17,2),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(17,8),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
KOLLI23  DFLD  POS=(17,10),LTH=9,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(17,20),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
IDLEVN24 DFLD  POS=(17,22),LTH=5,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(17,28),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
KOLLI24  DFLD  POS=(17,30),LTH=9,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(17,40),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
IDLEVN25 DFLD  POS=(18,2),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(18,8),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
KOLLI25  DFLD  POS=(18,10),LTH=9,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(18,20),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
IDLEVN26 DFLD  POS=(18,22),LTH=5,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(18,28),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
KOLLI26  DFLD  POS=(18,30),LTH=9,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(18,40),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
IDLEVN27 DFLD  POS=(19,2),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
KOLLI27  DFLD  POS=(19,10),LTH=9,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDLEVN28 DFLD  POS=(19,22),LTH=5,                                      +        
               ATTR=(NOPROT,MOD)                                                
KOLLI28  DFLD  POS=(19,30),LTH=9,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Godk(J/N)',                                            +        
               POS=(19,46),LTH=9,                                      +        
               ATTR=(PROT)                                                      
FLGODK   DFLD  POS=(19,56),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
KBEFTTI  DFLD  POS=(19,62),LTH=2,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
KBEFTTU  DFLD  POS=(19,65),LTH=2,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0003 DFLD  POS=(20,2),LTH=4,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0009 DFLD  POS=(20,7),LTH=3,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0010 DFLD  POS=(20,11),LTH=3,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0000 DFLD  POS=(20,15),LTH=4,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0004 DFLD  POS=(20,20),LTH=4,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0001 DFLD  POS=(20,25),LTH=4,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0002 DFLD  POS=(20,30),LTH=4,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0015 DFLD  POS=(20,35),LTH=1,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0016 DFLD  POS=(20,37),LTH=1,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0005 DFLD  POS=(20,39),LTH=2,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0006 DFLD  POS=(20,42),LTH=2,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0007 DFLD  POS=(20,45),LTH=1,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0008 DFLD  POS=(20,47),LTH=1,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0011 DFLD  POS=(20,49),LTH=5,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0012 DFLD  POS=(20,55),LTH=5,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0013 DFLD  POS=(20,61),LTH=9,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0014 DFLD  POS=(20,71),LTH=9,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         DFLD  '13 Kolli Vagn   14 Kolli kö',                          +        
               POS=(21,2),LTH=27,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15 Åtg parti    16',                                   +        
               POS=(21,34),LTH=18,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '17 Ta bort koll',                                      +        
               POS=(21,66),LTH=15,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '18 Skapa kolli  19 Div kolli    20',                   +        
               POS=(22,2),LTH=34,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21 Mottagning   10 whelp',                             +        
               POS=(22,50),LTH=24,                                     +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W6O13501 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6F135,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I13501,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W6F135,                                             +        
               NXT=W6I13501                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  IDLOPNRI,                                               +        
               LTH=9                                                            
         MFLD  IDLOPNRU,                                               +        
               LTH=9                                                            
         MFLD  IDLEVNR1,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLI1,                                                 +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVNR2,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLI2,                                                 +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVNR3,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLI3,                                                 +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVNR4,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLI4,                                                 +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVNR5,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLI5,                                                 +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVNR6,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLI6,                                                 +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVNR7,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLI7,                                                 +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVNR8,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLI8,                                                 +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVNR9,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLI9,                                                 +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVN10,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLI10,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVN11,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLI11,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVN12,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLI12,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVN13,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLI13,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVN14,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLI14,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVN15,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLI15,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVN16,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLI16,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVN17,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLI17,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVN18,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLI18,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVN19,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLI19,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVN20,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLI20,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVN21,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLI21,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVN22,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLI22,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVN23,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLI23,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVN24,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLI24,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVN25,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLI25,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVN26,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLI26,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVN27,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLI27,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVN28,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLI28,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLGODK,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0003,                                               +        
               LTH=4                                                            
         MFLD  DGIA0009,                                               +        
               LTH=3                                                            
         MFLD  DGIA0010,                                               +        
               LTH=3                                                            
         MFLD  DGIA0000,                                               +        
               LTH=4                                                            
         MFLD  DGIA0004,                                               +        
               LTH=4                                                            
         MFLD  DGIA0001,                                               +        
               LTH=4                                                            
         MFLD  DGIA0002,                                               +        
               LTH=4                                                            
         MFLD  DGIA0015,                                               +        
               LTH=1                                                            
         MFLD  DGIA0016,                                               +        
               LTH=1                                                            
         MFLD  DGIA0005,                                               +        
               LTH=2                                                            
         MFLD  DGIA0006,                                               +        
               LTH=2                                                            
         MFLD  KBEFTTI,                                                +        
               LTH=2                                                            
         MFLD  KBEFTTU,                                                +        
               LTH=2                                                            
         MFLD  DGIA0007,                                               +        
               LTH=1                                                            
         MFLD  DGIA0008,                                               +        
               LTH=1                                                            
         MFLD  DGIA0011,                                               +        
               LTH=5                                                            
         MFLD  DGIA0012,                                               +        
               LTH=5                                                            
         MFLD  DGIA0013,                                               +        
               LTH=9                                                            
         MFLD  DGIA0014,                                               +        
               LTH=9                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=61                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W6I13501 MSG   TYPE=INPUT,                                             +        
               SOR=(W6F135),                                           +        
               OPT=2,                                                  +        
               NXT=W6O13501                                                     
MID      LPAGE SOR=(W6F135),                                           +        
               NXT=W6I13501                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '61351',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0003,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0009,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0010,                                               +        
               LTH=3                                                            
         MFLD  (DGIA0000,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0004,                                               +        
               LTH=4                                                            
         MFLD  (DGIA0001,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0002,                                               +        
               LTH=4                                                            
         MFLD  (DGIA0015,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0016,                                               +        
               LTH=1                                                            
         MFLD  (DGIA0005,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  DGIA0006,                                               +        
               LTH=2                                                            
         MFLD  (KBEFTTI,                                               +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  KBEFTTU,                                                +        
               LTH=2                                                            
         MFLD  (DGIA0007,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  DGIA0008,                                               +        
               LTH=1                                                            
         MFLD  (DGIA0011,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0012,                                               +        
               LTH=5                                                            
         MFLD  (DGIA0013,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0014,                                               +        
               LTH=9                                                            
         MFLD  (IDLOPNRI,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLOPNRU,                                              +        
               '         '),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDCUT,                                                 +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLEVNR1,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KOLLI1,                                                +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLEVNR2,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KOLLI2,                                                +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLEVNR3,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KOLLI3,                                                +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLEVNR4,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KOLLI4,                                                +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLEVNR5,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KOLLI5,                                                +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLEVNR6,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KOLLI6,                                                +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLEVNR7,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KOLLI7,                                                +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLEVNR8,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KOLLI8,                                                +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLEVNR9,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KOLLI9,                                                +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLEVN10,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KOLLI10,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLEVN11,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KOLLI11,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLEVN12,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KOLLI12,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLEVN13,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KOLLI13,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLEVN14,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KOLLI14,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLEVN15,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KOLLI15,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLEVN16,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KOLLI16,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLEVN17,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KOLLI17,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLEVN18,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KOLLI18,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLEVN19,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KOLLI19,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLEVN20,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KOLLI20,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLEVN21,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KOLLI21,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLEVN22,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KOLLI22,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLEVN23,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KOLLI23,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLEVN24,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KOLLI24,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLEVN25,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KOLLI25,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLEVN26,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KOLLI26,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLEVN27,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KOLLI27,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLEVN28,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KOLLI28,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLGODK,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
