***********************************************************************         
* CREATED BY PC63557   ON 98/07/06  AT 13:43                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'ETIKETT UTSKRIFT                '                               
W6F168   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W6T168U ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W6T168 7',                                           +        
               8='W6T168 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W6F168   DPAGE CURSOR=((2,15)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'ETIKETT UTSKRIFT',                                     +        
               POS=(1,12),LTH=16,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Artikelnr  ',                                          +        
               POS=(2,2),LTH=11,                                       +        
               ATTR=(NUM,PROT)                                                  
IDARTNRI DFLD  POS=(2,15),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDARTNRU DFLD  POS=(3,15),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Antal styck',                                          +        
               POS=(5,2),LTH=11,                                       +        
               ATTR=(PROT)                                                      
KVETIKIN DFLD  POS=(5,15),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Skrivare',                                             +        
               POS=(5,24),LTH=8,                                       +        
               ATTR=(PROT)                                                      
KDSKRIIN DFLD  POS=(5,34),LTH=8,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Just. ursp.',                                          +        
               POS=(7,2),LTH=11,                                       +        
               ATTR=(PROT)                                                      
JUSTURSI DFLD  POS=(7,15),LTH=15,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Ursprung (eng) ',                                      +        
               POS=(7,35),LTH=15,                                      +        
               ATTR=(PROT)                                                      
BELABURU DFLD  POS=(7,51),LTH=15,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Justerad Q',                                           +        
               POS=(9,2),LTH=10,                                       +        
               ATTR=(PROT)                                                      
JUSTKVAI DFLD  POS=(9,15),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Q-0',                                                  +        
               POS=(9,27),LTH=3,                                       +        
               ATTR=(PROT)                                                      
KVQPAC0U DFLD  POS=(9,31),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Q-1',                                                  +        
               POS=(9,43),LTH=3,                                       +        
               ATTR=(PROT)                                                      
KVQPAC1U DFLD  POS=(9,47),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Q-2',                                                  +        
               POS=(9,59),LTH=3,                                       +        
               ATTR=(PROT)                                                      
KVQPAC2U DFLD  POS=(9,63),LTH=5,                                       +        
               ATTR=(PROT)                                                      
JUSTKVAU DFLD  POS=(10,15),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Sort',                                                 +        
               POS=(10,23),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KDSORTUT DFLD  POS=(10,28),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Batchnr  ',                                            +        
               POS=(12,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
IDBATCHI DFLD  POS=(12,15),LTH=18,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Kommentar',                                            +        
               POS=(14,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
BEKOMMUT DFLD  POS=(14,15),LTH=60,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Benämning',                                            +        
               POS=(16,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
BEARTUT  DFLD  POS=(16,15),LTH=25,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Etikettens artnr  ',                                   +        
               POS=(16,44),LTH=18,                                     +        
               ATTR=(PROT)                                                      
ARTETIUT DFLD  POS=(16,63),LTH=9,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Ändrad av',                                            +        
               POS=(18,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
IDUSERUT DFLD  POS=(18,15),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Senaste ändring',                                      +        
               POS=(18,26),LTH=15,                                     +        
               ATTR=(PROT)                                                      
TIUPPDUT DFLD  POS=(18,42),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Layout-ID',                                            +        
               POS=(18,51),LTH=9,                                      +        
               ATTR=(PROT)                                                      
IDLAYOUT DFLD  POS=(18,63),LTH=11,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Pf4 Print  PF10 WHELP  Pf12 Logoff',                   +        
               POS=(22,2),LTH=34,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W6O16801 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6F168,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I16801,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W6F168                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  IDARTNRI,                                               +        
               LTH=9                                                            
         MFLD  IDARTNRU,                                               +        
               LTH=9                                                            
         MFLD  KVETIKIN,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDSKRIIN,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  JUSTURSI,                                               +        
               LTH=17,                                                 +        
               ATTR=(YES)                                                       
         MFLD  BELABURU,                                               +        
               LTH=15                                                           
         MFLD  JUSTKVAI,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVQPAC0U,                                               +        
               LTH=5                                                            
         MFLD  KVQPAC1U,                                               +        
               LTH=5                                                            
         MFLD  KVQPAC2U,                                               +        
               LTH=5                                                            
         MFLD  JUSTKVAU,                                               +        
               LTH=5                                                            
         MFLD  KDSORTUT,                                               +        
               LTH=2                                                            
         MFLD  IDBATCHI,                                               +        
               LTH=20,                                                 +        
               ATTR=(YES)                                                       
         MFLD  BEKOMMUT,                                               +        
               LTH=60                                                           
         MFLD  BEARTUT,                                                +        
               LTH=25                                                           
         MFLD  ARTETIUT,                                               +        
               LTH=9                                                            
         MFLD  IDUSERUT,                                               +        
               LTH=8                                                            
         MFLD  TIUPPDUT,                                               +        
               LTH=6                                                            
         MFLD  IDLAYOUT,                                               +        
               LTH=10                                                           
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W6I16801 MSG   TYPE=INPUT,                                             +        
               SOR=(W6F168),                                           +        
               OPT=2,                                                  +        
               NXT=W6O16801                                                     
MID      LPAGE SOR=(W6F168)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F8'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '61681',                                                +        
               LTH=5                                                            
         MFLD  (IDARTNRI,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDARTNRU,                                              +        
               '         '),                                           +        
               LTH=9                                                            
         MFLD  (KVETIKIN,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDSKRIIN,                                              +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (JUSTURSI,                                              +        
               '+++++++++++++++'),                                     +        
               LTH=15                                                           
         MFLD  (JUSTKVAI,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDBATCHI,                                              +        
               '++++++++++++++++++'),                                  +        
               LTH=18,                                                 +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
