***********************************************************************         
* CREATED BY PC63442   ON 97/04/08  AT 17:11                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'REGISTRERA FÖLJESEDELINFO       '                               
W6F111   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W6T111  ',                                          +        
               14='W6T112  ',                                          +        
               15='W6T113  ',                                          +        
               16='W6T114  ',                                          +        
               17='W6T115  ',                                          +        
               18='W6T116  ',                                          +        
               19='W6T117  ',                                          +        
               20='W6T118  ',                                          +        
               21='W6T119  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,8)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Registrera följesedelinfo',                            +        
               POS=(1,11),LTH=25,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Levnr',                                                +        
               POS=(2,2),LTH=5,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDLEVNRI DFLD  POS=(2,8),LTH=5,                                        +        
               ATTR=(NOPROT)                                                    
         DFLD  'RT',                                                   +        
               POS=(2,14),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
KDRTI    DFLD  POS=(2,17),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'FSnr',                                                 +        
               POS=(2,20),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
IDFSI    DFLD  POS=(2,25),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Avsdat',                                               +        
               POS=(2,34),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
AVIDATIN DFLD  POS=(2,41),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Printer',                                              +        
               POS=(2,48),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
INLPRTIN DFLD  POS=(2,56),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'DC',                                                   +        
               POS=(2,61),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
IDDCIN   DFLD  POS=(2,64),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
IDLEVNRU DFLD  POS=(3,8),LTH=5,                                        +        
               ATTR=(PROT,MOD)                                                  
KDRTU    DFLD  POS=(3,17),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
IDFSU    DFLD  POS=(3,25),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
AVIDATUT DFLD  POS=(3,41),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
INLPRTUT DFLD  POS=(3,56),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDCUT   DFLD  POS=(3,64),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Lastb',                                                +        
               POS=(5,2),LTH=5,                                        +        
               ATTR=(PROT)                                                      
IDLBBETI DFLD  POS=(5,8),LTH=12,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Godk(j/n)',                                            +        
               POS=(5,48),LTH=9,                                       +        
               ATTR=(PROT)                                                      
FLGODKI  DFLD  POS=(5,58),LTH=1,                                       +        
               ATTR=(PROT)                                                      
IDLBBETU DFLD  POS=(6,8),LTH=12,                                       +        
               ATTR=(PROT,MOD)                                                  
FLGODKU  DFLD  POS=(6,58),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Artnr',                                                +        
               POS=(7,2),LTH=5,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Antal',                                                +        
               POS=(7,13),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Artnr',                                                +        
               POS=(7,25),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Antal',                                                +        
               POS=(7,36),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Artnr',                                                +        
               POS=(7,50),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Antal',                                                +        
               POS=(7,61),LTH=5,                                       +        
               ATTR=(PROT)                                                      
ARTNR1   DFLD  POS=(8,2),LTH=8,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(8,11),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
ANTAL1   DFLD  POS=(8,13),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
ARTNR2   DFLD  POS=(8,25),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(8,34),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
ANTAL2   DFLD  POS=(8,36),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
ARTNR3   DFLD  POS=(8,50),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(8,59),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
ANTAL3   DFLD  POS=(8,61),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
ARTNR4   DFLD  POS=(9,2),LTH=8,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(9,11),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
ANTAL4   DFLD  POS=(9,13),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
ARTNR5   DFLD  POS=(9,25),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(9,34),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
ANTAL5   DFLD  POS=(9,36),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
ARTNR6   DFLD  POS=(9,50),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(9,59),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
ANTAL6   DFLD  POS=(9,61),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
ARTNR7   DFLD  POS=(10,2),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(10,11),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
ANTAL7   DFLD  POS=(10,13),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR8   DFLD  POS=(10,25),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(10,34),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
ANTAL8   DFLD  POS=(10,36),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR9   DFLD  POS=(10,50),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(10,59),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
ANTAL9   DFLD  POS=(10,61),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR10  DFLD  POS=(11,2),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(11,11),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
ANTA10   DFLD  POS=(11,13),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR11  DFLD  POS=(11,25),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(11,34),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
ANTA11   DFLD  POS=(11,36),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR12  DFLD  POS=(11,50),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(11,59),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
ANTA12   DFLD  POS=(11,61),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR13  DFLD  POS=(12,2),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(12,11),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
ANTA13   DFLD  POS=(12,13),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR14  DFLD  POS=(12,25),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(12,34),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
ANTA14   DFLD  POS=(12,36),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR15  DFLD  POS=(12,50),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(12,59),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
ANTA15   DFLD  POS=(12,61),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR16  DFLD  POS=(13,2),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(13,11),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
ANTA16   DFLD  POS=(13,13),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR17  DFLD  POS=(13,25),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(13,34),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
ANTA17   DFLD  POS=(13,36),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR18  DFLD  POS=(13,50),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(13,59),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
ANTA18   DFLD  POS=(13,61),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR19  DFLD  POS=(14,2),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(14,11),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
ANTA19   DFLD  POS=(14,13),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR20  DFLD  POS=(14,25),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(14,34),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
ANTA20   DFLD  POS=(14,36),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR21  DFLD  POS=(14,50),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(14,59),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
ANTA21   DFLD  POS=(14,61),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR22  DFLD  POS=(15,2),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(15,11),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
ANTA22   DFLD  POS=(15,13),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR23  DFLD  POS=(15,25),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(15,34),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
ANTA23   DFLD  POS=(15,36),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR24  DFLD  POS=(15,50),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(15,59),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
ANTA24   DFLD  POS=(15,61),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR25  DFLD  POS=(16,2),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(16,11),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
ANTA25   DFLD  POS=(16,13),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR26  DFLD  POS=(16,25),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(16,34),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
ANTA26   DFLD  POS=(16,36),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR27  DFLD  POS=(16,50),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(16,59),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
ANTA27   DFLD  POS=(16,61),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR28  DFLD  POS=(17,2),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(17,11),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
ANTA28   DFLD  POS=(17,13),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR29  DFLD  POS=(17,25),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(17,34),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
ANTA29   DFLD  POS=(17,36),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR30  DFLD  POS=(17,50),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(17,59),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
ANTA30   DFLD  POS=(17,61),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR31  DFLD  POS=(18,2),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(18,11),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
ANTA31   DFLD  POS=(18,13),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR32  DFLD  POS=(18,25),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(18,34),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
ANTA32   DFLD  POS=(18,36),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR33  DFLD  POS=(18,50),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(18,59),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
ANTA33   DFLD  POS=(18,61),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR34  DFLD  POS=(19,2),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(19,11),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
ANTA34   DFLD  POS=(19,13),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR35  DFLD  POS=(19,25),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(19,34),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
ANTA35   DFLD  POS=(19,36),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR36  DFLD  POS=(19,50),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(19,59),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
ANTA36   DFLD  POS=(19,61),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
STOPPTKN DFLD  POS=(19,69),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
TRAP     DFLD  POS=(19,71),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KLIVISIN DFLD  POS=(20,2),LTH=1,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
KLIVISUT DFLD  POS=(20,4),LTH=1,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
LOPNRIN  DFLD  POS=(20,6),LTH=8,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
LOPNRUT  DFLD  POS=(20,15),LTH=8,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         DFLD  '13 Reg FS',                                            +        
               POS=(21,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '14 Reg 1 lev    15 Reg fler lev 16 Rätta FS',          +        
               POS=(21,18),LTH=43,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '17 Aktivera FS',                                       +        
               POS=(21,66),LTH=14,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '18 Reg FS konto 19 Reg R34-tran 20 Backa del    21 Mak.+        
                parti   10 WHELP',                                     +        
               POS=(22,2),LTH=72,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W6O11101 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6F111,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I11101,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDLEVNRI,                                               +        
               LTH=5                                                            
         MFLD  KDRTI,                                                  +        
               LTH=2                                                            
         MFLD  IDFSI,                                                  +        
               LTH=8                                                            
         MFLD  AVIDATIN,                                               +        
               LTH=6                                                            
         MFLD  INLPRTIN,                                               +        
               LTH=4                                                            
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  IDLEVNRU,                                               +        
               LTH=5                                                            
         MFLD  KDRTU,                                                  +        
               LTH=2                                                            
         MFLD  IDFSU,                                                  +        
               LTH=8                                                            
         MFLD  AVIDATUT,                                               +        
               LTH=6                                                            
         MFLD  INLPRTUT,                                               +        
               LTH=4                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  IDLBBETI,                                               +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLGODKI,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDLBBETU,                                               +        
               LTH=12                                                           
         MFLD  FLGODKU,                                                +        
               LTH=1                                                            
         MFLD  ARTNR1,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR2,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR3,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR4,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR5,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR6,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR7,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR8,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR9,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR10,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR11,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR12,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR13,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR14,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR15,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR16,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR17,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR18,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR19,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR20,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR21,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR22,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR23,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR24,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR25,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR26,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR27,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR28,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR29,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR30,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR31,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR32,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR33,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR34,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR35,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR36,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ANTAL1,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTAL2,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTAL3,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTAL4,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTAL5,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTAL6,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTAL7,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTAL8,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTAL9,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA10,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA11,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA12,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA13,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA14,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA15,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA16,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA17,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA18,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA19,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA20,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA21,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA22,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA23,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA24,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA25,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA26,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA27,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA28,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA29,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA30,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA31,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA32,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA33,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA34,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA35,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA36,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KLIVISIN,                                               +        
               LTH=1                                                            
         MFLD  KLIVISUT,                                               +        
               LTH=1                                                            
         MFLD  LOPNRIN,                                                +        
               LTH=8                                                            
         MFLD  LOPNRUT,                                                +        
               LTH=8                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W6I11101 MSG   TYPE=INPUT,                                             +        
               SOR=(W6F111),                                           +        
               OPT=2,                                                  +        
               NXT=W6O11101                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '61111',                                                +        
               LTH=5                                                            
         MFLD  (IDLEVNRI,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  IDLEVNRU,                                               +        
               LTH=5                                                            
         MFLD  (IDFSI,                                                 +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  IDFSU,                                                  +        
               LTH=8                                                            
         MFLD  (AVIDATIN,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  AVIDATUT,                                               +        
               LTH=6                                                            
         MFLD  (INLPRTIN,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  INLPRTUT,                                               +        
               LTH=4                                                            
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  (KDRTI,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KDRTU,                                                  +        
               LTH=2                                                            
         MFLD  (IDLBBETI,                                              +        
               '++++++++++++'),                                        +        
               LTH=12                                                           
         MFLD  IDLBBETU,                                               +        
               LTH=12                                                           
         MFLD  (KLIVISIN,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  KLIVISUT,                                               +        
               LTH=1                                                            
         MFLD  (LOPNRIN,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  LOPNRUT,                                                +        
               LTH=8                                                            
         MFLD  (FLGODKI,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  FLGODKU,                                                +        
               LTH=1                                                            
         MFLD  (ARTNR1,                                                +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR2,                                                +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR3,                                                +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR4,                                                +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR5,                                                +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR6,                                                +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR7,                                                +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR8,                                                +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR9,                                                +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR10,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR11,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR12,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR13,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR14,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR15,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR16,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR17,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR18,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR19,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR20,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR21,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR22,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR23,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR24,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR25,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR26,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR27,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR28,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR29,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR30,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR31,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR32,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR33,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR34,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR35,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR36,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTAL1,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTAL2,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTAL3,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTAL4,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTAL5,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTAL6,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTAL7,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTAL8,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTAL9,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA10,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA11,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA12,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA13,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA14,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA15,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA16,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA17,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA18,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA19,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA20,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA21,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA22,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA23,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA24,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA25,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA26,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA27,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA28,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA29,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA30,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA31,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA32,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA33,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA34,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA35,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA36,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
