***********************************************************************         
* CREATED BY V059625   ON 01/01/04  AT 14:27                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'BUFFERT UPPDATERING             '                               
W6F162   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W6T162 7',                                           +        
               8='W6T162 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W6T162U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W6T161  ',                                          +        
               14='W6T162  ',                                          +        
               15='W6T163  ',                                          +        
               16='W6T164  ',                                          +        
               17='W6T165  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'BUFFERTINFORMATION',                                   +        
               POS=(1,12),LTH=18,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Artikelnr',                                            +        
               POS=(2,2),LTH=9,                                        +        
               ATTR=(ALPHA,PROT)                                                
ARTIN    DFLD  POS=(2,12),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Antal',                                                +        
               POS=(2,22),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
ANTIN    DFLD  POS=(2,28),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Plats',                                                +        
               POS=(2,36),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
BUFOMRIN DFLD  POS=(2,42),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
BUFGANFI DFLD  POS=(2,45),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
BUFPLATI DFLD  POS=(2,48),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
ARTUT    DFLD  POS=(3,12),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
ANTUT    DFLD  POS=(3,28),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
BUFOMRUT DFLD  POS=(3,42),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
BUFGANGU DFLD  POS=(3,45),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
BUFPLATU DFLD  POS=(3,48),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  'Lagerplats',                                           +        
               POS=(5,2),LTH=10,                                       +        
               ATTR=(PROT)                                                      
ADLAGOMR DFLD  POS=(5,13),LTH=2,                                       +        
               ATTR=(PROT)                                                      
ADGANG   DFLD  POS=(5,16),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
ADPLATS  DFLD  POS=(5,19),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Benämning',                                            +        
               POS=(5,25),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
BEART    DFLD  POS=(5,39),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Fler pl.',                                             +        
               POS=(6,2),LTH=8,                                        +        
               ATTR=(PROT)                                                      
FLERPL   DFLD  POS=(6,13),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Lagersaldo',                                           +        
               POS=(6,25),LTH=10,                                      +        
               ATTR=(PROT)                                                      
KVLS     DFLD  POS=(6,36),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Q-3',                                                  +        
               POS=(6,53),LTH=3,                                       +        
               ATTR=(PROT)                                                      
QPACK3C1 DFLD  POS=(6,57),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Bristkod',                                             +        
               POS=(7,2),LTH=8,                                        +        
               ATTR=(PROT)                                                      
KDBRISTI DFLD  POS=(7,13),LTH=1,                                       +        
               ATTR=(NUM,NOPROT)                                                
KDBRISTU DFLD  POS=(7,15),LTH=1,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  'Påfyllnadskod',                                        +        
               POS=(7,25),LTH=13,                                      +        
               ATTR=(PROT)                                                      
KDPAFIN  DFLD  POS=(7,39),LTH=1,                                       +        
               ATTR=(NUM,NOPROT)                                                
KDPAFUT  DFLD  POS=(7,41),LTH=1,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
LEDTXT   DFLD  POS=(8,2),LTH=28,                                       +        
               ATTR=(PROT,HI)                                                   
ART1     DFLD  POS=(8,32),LTH=9,                                       +        
               ATTR=(PROT,HI)                                                   
         DFLD  'S A L D O',                                            +        
               POS=(9,35),LTH=9,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'K O L L I',                                            +        
               POS=(9,66),LTH=9,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Åtg Buffertplats  Dat',                                +        
               POS=(10,2),LTH=21,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Förädlat',                                             +        
               POS=(10,27),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Oförädlat',                                            +        
               POS=(10,44),LTH=9,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Förädlat  Oförädlat',                                  +        
               POS=(10,61),LTH=19,                                     +        
               ATTR=(PROT)                                                      
CMD1     DFLD  POS=(11,2),LTH=3,                                       +        
               ATTR=(NOPROT,MOD)                                                
OMR1     DFLD  POS=(11,6),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
GANG1    DFLD  POS=(11,9),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
PLATS1   DFLD  POS=(11,12),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DABUFPA1 DFLD  POS=(11,18),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
BUFFF1   DFLD  POS=(11,28),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
BUFFFIN1 DFLD  POS=(11,36),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
BUFFO1   DFLD  POS=(11,44),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
BUFFOIN1 DFLD  POS=(11,53),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
KOLLF1   DFLD  POS=(11,61),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
KOLLFIN1 DFLD  POS=(11,66),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
KOLLO1   DFLD  POS=(11,71),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
KOLLOIN1 DFLD  POS=(11,76),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
CMD2     DFLD  POS=(12,2),LTH=3,                                       +        
               ATTR=(NOPROT,MOD)                                                
OMR2     DFLD  POS=(12,6),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
GANG2    DFLD  POS=(12,9),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
PLATS2   DFLD  POS=(12,12),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DABUFPA2 DFLD  POS=(12,18),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
BUFFF2   DFLD  POS=(12,28),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
BUFFFIN2 DFLD  POS=(12,36),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
BUFFO2   DFLD  POS=(12,44),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
BUFFOIN2 DFLD  POS=(12,53),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
KOLLF2   DFLD  POS=(12,61),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
KOLLFIN2 DFLD  POS=(12,66),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
KOLLO2   DFLD  POS=(12,71),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
KOLLOIN2 DFLD  POS=(12,76),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
CMD3     DFLD  POS=(13,2),LTH=3,                                       +        
               ATTR=(NOPROT,MOD)                                                
OMR3     DFLD  POS=(13,6),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
GANG3    DFLD  POS=(13,9),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
PLATS3   DFLD  POS=(13,12),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DABUFPA3 DFLD  POS=(13,18),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
BUFFF3   DFLD  POS=(13,28),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
BUFFFIN3 DFLD  POS=(13,36),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
BUFFO3   DFLD  POS=(13,44),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
BUFFOIN3 DFLD  POS=(13,53),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
KOLLF3   DFLD  POS=(13,61),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
KOLLFIN3 DFLD  POS=(13,66),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
KOLLO3   DFLD  POS=(13,71),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
KOLLOIN3 DFLD  POS=(13,76),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
CMD4     DFLD  POS=(14,2),LTH=3,                                       +        
               ATTR=(NOPROT,MOD)                                                
OMR4     DFLD  POS=(14,6),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
GANG4    DFLD  POS=(14,9),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
PLATS4   DFLD  POS=(14,12),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DABUFPA4 DFLD  POS=(14,18),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
BUFFF4   DFLD  POS=(14,28),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
BUFFFIN4 DFLD  POS=(14,36),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
BUFFO4   DFLD  POS=(14,44),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
BUFFOIN4 DFLD  POS=(14,53),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
KOLLF4   DFLD  POS=(14,61),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
KOLLFIN4 DFLD  POS=(14,66),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
KOLLO4   DFLD  POS=(14,71),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
KOLLOIN4 DFLD  POS=(14,76),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
CMD5     DFLD  POS=(15,2),LTH=3,                                       +        
               ATTR=(NOPROT,MOD)                                                
OMR5     DFLD  POS=(15,6),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
GANG5    DFLD  POS=(15,9),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
PLATS5   DFLD  POS=(15,12),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DABUFPA5 DFLD  POS=(15,18),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
BUFFF5   DFLD  POS=(15,28),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
BUFFFIN5 DFLD  POS=(15,36),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
BUFFO5   DFLD  POS=(15,44),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
BUFFOIN5 DFLD  POS=(15,53),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
KOLLF5   DFLD  POS=(15,61),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
KOLLFIN5 DFLD  POS=(15,66),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
KOLLO5   DFLD  POS=(15,71),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
KOLLOIN5 DFLD  POS=(15,76),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
CMD6     DFLD  POS=(16,2),LTH=3,                                       +        
               ATTR=(NOPROT,MOD)                                                
OMR6     DFLD  POS=(16,6),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
GANG6    DFLD  POS=(16,9),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
PLATS6   DFLD  POS=(16,12),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DABUFPA6 DFLD  POS=(16,18),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
BUFFF6   DFLD  POS=(16,28),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
BUFFFIN6 DFLD  POS=(16,36),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
BUFFO6   DFLD  POS=(16,44),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
BUFFOIN6 DFLD  POS=(16,53),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
KOLLF6   DFLD  POS=(16,61),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
KOLLFIN6 DFLD  POS=(16,66),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
KOLLO6   DFLD  POS=(16,71),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
KOLLOIN6 DFLD  POS=(16,76),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
CMD7     DFLD  POS=(17,2),LTH=3,                                       +        
               ATTR=(NOPROT,MOD)                                                
OMR7     DFLD  POS=(17,6),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
GANG7    DFLD  POS=(17,9),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
PLATS7   DFLD  POS=(17,12),LTH=5,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DABUFPA7 DFLD  POS=(17,18),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
BUFFF7   DFLD  POS=(17,28),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
BUFFFIN7 DFLD  POS=(17,36),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
BUFFO7   DFLD  POS=(17,44),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
BUFFOIN7 DFLD  POS=(17,53),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
KOLLF7   DFLD  POS=(17,61),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
KOLLFIN7 DFLD  POS=(17,66),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
KOLLO7   DFLD  POS=(17,71),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
KOLLOIN7 DFLD  POS=(17,76),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Summa',                                                +        
               POS=(18,6),LTH=5,                                       +        
               ATTR=(PROT)                                                      
SUFSALDO DFLD  POS=(18,27),LTH=8,                                      +        
               ATTR=(PROT)                                                      
SUOSALDO DFLD  POS=(18,44),LTH=8,                                      +        
               ATTR=(PROT)                                                      
SUFKOLLI DFLD  POS=(18,61),LTH=4,                                      +        
               ATTR=(PROT)                                                      
SUOKOLLI DFLD  POS=(18,71),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Ny',                                                   +        
               POS=(19,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
NYOMR    DFLD  POS=(19,6),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
NYGANG   DFLD  POS=(19,9),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
NYPLATS  DFLD  POS=(19,12),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
NYFSALDO DFLD  POS=(19,36),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
NYOSALDO DFLD  POS=(19,53),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
NYFKOLLI DFLD  POS=(19,66),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
NYOKOLLI DFLD  POS=(19,76),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Quantity',                                             +        
               POS=(20,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
NYQNT    DFLD  POS=(20,11),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '   Förädlat(J/N)',                                     +        
               POS=(20,20),LTH=16,                                     +        
               ATTR=(PROT)                                                      
NYTRT    DFLD  POS=(20,37),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Location',                                             +        
               POS=(20,39),LTH=8,                                      +        
               ATTR=(PROT)                                                      
NYLOC    DFLD  POS=(20,48),LTH=10,                                     +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  '13 HANT.KOD REG 14 BUFFERTINFO 15 LAGERDATA REG 16 FÖRP+        
               .DATA REG 17 INLEV.INFO',                               +        
               POS=(21,1),LTH=78,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,1),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,32),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,49),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W6I16201 MSG   TYPE=INPUT,                                             +        
               SOR=(W6F162),                                           +        
               OPT=2,                                                  +        
               NXT=W6O26201                                                     
DGIN     LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  (FLD0102,                                               +        
               '6'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  (FLD0104,                                               +        
               '1'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  (FLD0106,                                               +        
               '6'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  (FLD0108,                                               +        
               '2'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '61621',                                                +        
               LTH=5                                                            
         MFLD  (ARTIN,                                                 +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTIN,                                                 +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (BUFOMRIN,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (BUFGANFI,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (BUFPLATI,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTUT,                                                 +        
               '+++++++++'),                                           +        
               LTH=9                                                            
         MFLD  (ANTUT,                                                 +        
               '       '),                                             +        
               LTH=7                                                            
         MFLD  (BUFOMRUT,                                              +        
               '  '),                                                  +        
               LTH=2                                                            
         MFLD  (BUFGANGU,                                              +        
               '  '),                                                  +        
               LTH=2                                                            
         MFLD  (BUFPLATU,                                              +        
               '     '),                                               +        
               LTH=5                                                            
         MFLD  (KDBRISTI,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (KDBRISTU,                                              +        
               ' '),                                                   +        
               LTH=1                                                            
         MFLD  (KDPAFIN,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (KDPAFUT,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MFLD  (CMD1,                                                  +        
               '+++'),                                                 +        
               LTH=3                                                            
         MFLD  (OMR1,                                                  +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  (GANG1,                                                 +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  (PLATS1,                                                +        
               '+++++'),                                               +        
               LTH=5                                                            
         MFLD  (DABUFPA1,                                              +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (BUFFFIN1,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (BUFFOIN1,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOLLFIN1,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOLLOIN1,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CMD2,                                                  +        
               '+++'),                                                 +        
               LTH=3                                                            
         MFLD  (OMR2,                                                  +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  (GANG2,                                                 +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  (PLATS2,                                                +        
               '+++++'),                                               +        
               LTH=5                                                            
         MFLD  (DABUFPA2,                                              +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (BUFFFIN2,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (BUFFOIN2,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOLLFIN2,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOLLOIN2,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CMD3,                                                  +        
               '+++'),                                                 +        
               LTH=3                                                            
         MFLD  (OMR3,                                                  +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  (GANG3,                                                 +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  (PLATS3,                                                +        
               '+++++'),                                               +        
               LTH=5                                                            
         MFLD  (DABUFPA3,                                              +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (BUFFFIN3,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (BUFFOIN3,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOLLFIN3,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOLLOIN3,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CMD4,                                                  +        
               '+++'),                                                 +        
               LTH=3                                                            
         MFLD  (OMR4,                                                  +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  (GANG4,                                                 +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  (PLATS4,                                                +        
               '+++++'),                                               +        
               LTH=5                                                            
         MFLD  (DABUFPA4,                                              +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (BUFFFIN4,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (BUFFOIN4,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOLLFIN4,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOLLOIN4,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CMD5,                                                  +        
               '+++'),                                                 +        
               LTH=3                                                            
         MFLD  (OMR5,                                                  +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  (GANG5,                                                 +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  (PLATS5,                                                +        
               '+++++'),                                               +        
               LTH=5                                                            
         MFLD  (DABUFPA5,                                              +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (BUFFFIN5,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (BUFFOIN5,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOLLFIN5,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOLLOIN5,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CMD6,                                                  +        
               '+++'),                                                 +        
               LTH=3                                                            
         MFLD  (OMR6,                                                  +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  (GANG6,                                                 +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  (PLATS6,                                                +        
               '+++++'),                                               +        
               LTH=5                                                            
         MFLD  (DABUFPA6,                                              +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (BUFFFIN6,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (BUFFOIN6,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOLLFIN6,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOLLOIN6,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CMD7,                                                  +        
               '+++'),                                                 +        
               LTH=3                                                            
         MFLD  (OMR7,                                                  +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  (GANG7,                                                 +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  (PLATS7,                                                +        
               '+++++'),                                               +        
               LTH=5                                                            
         MFLD  (DABUFPA7,                                              +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (BUFFFIN7,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (BUFFOIN7,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOLLFIN7,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOLLOIN7,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (NYOMR,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (NYGANG,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (NYPLATS,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (NYFSALDO,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (NYOSALDO,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (NYFKOLLI,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (NYOKOLLI,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (NYQNT,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (NYTRT,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (NYLOC,                                                 +        
               '++++++++++'),                                          +        
               LTH=10                                                           
         MSGEND                                                                 
W6O16201 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6F162,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I16201,                                           +        
               FILL=PT                                                          
DGUT     LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  ARTIN,                                                  +        
               LTH=9                                                            
         MFLD  ANTIN,                                                  +        
               LTH=7                                                            
         MFLD  BUFOMRIN,                                               +        
               LTH=2                                                            
         MFLD  BUFGANFI,                                               +        
               LTH=2                                                            
         MFLD  BUFPLATI,                                               +        
               LTH=5                                                            
         MFLD  ARTUT,                                                  +        
               LTH=9                                                            
         MFLD  ANTUT,                                                  +        
               LTH=7                                                            
         MFLD  BUFOMRUT,                                               +        
               LTH=2                                                            
         MFLD  BUFGANGU,                                               +        
               LTH=2                                                            
         MFLD  BUFPLATU,                                               +        
               LTH=5                                                            
         MFLD  ADLAGOMR,                                               +        
               LTH=2                                                            
         MFLD  ADGANG,                                                 +        
               LTH=2                                                            
         MFLD  ADPLATS,                                                +        
               LTH=5                                                            
         MFLD  FLERPL,                                                 +        
               LTH=1                                                            
         MFLD  BEART,                                                  +        
               LTH=25                                                           
         MFLD  KVLS,                                                   +        
               LTH=8                                                            
         MFLD  QPACK3C1,                                               +        
               LTH=5                                                            
         MFLD  KDBRISTI,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDBRISTU,                                               +        
               LTH=1                                                            
         MFLD  KDPAFIN,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDPAFUT,                                                +        
               LTH=1                                                            
         MFLD  LEDTXT,                                                 +        
               LTH=28                                                           
         MFLD  ART1,                                                   +        
               LTH=9                                                            
         MFLD  CMD1,                                                   +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OMR1,                                                   +        
               LTH=2                                                            
         MFLD  GANG1,                                                  +        
               LTH=2                                                            
         MFLD  PLATS1,                                                 +        
               LTH=5                                                            
         MFLD  DABUFPA1,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  BUFFF1,                                                 +        
               LTH=7                                                            
         MFLD  BUFFFIN1,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BUFFO1,                                                 +        
               LTH=8                                                            
         MFLD  BUFFOIN1,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLF1,                                                 +        
               LTH=4                                                            
         MFLD  KOLLFIN1,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLO1,                                                 +        
               LTH=4                                                            
         MFLD  KOLLOIN1,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CMD2,                                                   +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OMR2,                                                   +        
               LTH=2                                                            
         MFLD  GANG2,                                                  +        
               LTH=2                                                            
         MFLD  PLATS2,                                                 +        
               LTH=5                                                            
         MFLD  DABUFPA2,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  BUFFF2,                                                 +        
               LTH=7                                                            
         MFLD  BUFFFIN2,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BUFFO2,                                                 +        
               LTH=8                                                            
         MFLD  BUFFOIN2,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLF2,                                                 +        
               LTH=4                                                            
         MFLD  KOLLFIN2,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLO2,                                                 +        
               LTH=4                                                            
         MFLD  KOLLOIN2,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CMD3,                                                   +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OMR3,                                                   +        
               LTH=2                                                            
         MFLD  GANG3,                                                  +        
               LTH=2                                                            
         MFLD  PLATS3,                                                 +        
               LTH=5                                                            
         MFLD  DABUFPA3,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  BUFFF3,                                                 +        
               LTH=7                                                            
         MFLD  BUFFFIN3,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BUFFO3,                                                 +        
               LTH=8                                                            
         MFLD  BUFFOIN3,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLF3,                                                 +        
               LTH=4                                                            
         MFLD  KOLLFIN3,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLO3,                                                 +        
               LTH=4                                                            
         MFLD  KOLLOIN3,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CMD4,                                                   +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OMR4,                                                   +        
               LTH=2                                                            
         MFLD  GANG4,                                                  +        
               LTH=2                                                            
         MFLD  PLATS4,                                                 +        
               LTH=5                                                            
         MFLD  DABUFPA4,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  BUFFF4,                                                 +        
               LTH=7                                                            
         MFLD  BUFFFIN4,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BUFFO4,                                                 +        
               LTH=8                                                            
         MFLD  BUFFOIN4,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLF4,                                                 +        
               LTH=4                                                            
         MFLD  KOLLFIN4,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLO4,                                                 +        
               LTH=4                                                            
         MFLD  KOLLOIN4,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CMD5,                                                   +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OMR5,                                                   +        
               LTH=2                                                            
         MFLD  GANG5,                                                  +        
               LTH=2                                                            
         MFLD  PLATS5,                                                 +        
               LTH=5                                                            
         MFLD  DABUFPA5,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  BUFFF5,                                                 +        
               LTH=7                                                            
         MFLD  BUFFFIN5,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BUFFO5,                                                 +        
               LTH=8                                                            
         MFLD  BUFFOIN5,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLF5,                                                 +        
               LTH=4                                                            
         MFLD  KOLLFIN5,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLO5,                                                 +        
               LTH=4                                                            
         MFLD  KOLLOIN5,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CMD6,                                                   +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OMR6,                                                   +        
               LTH=2                                                            
         MFLD  GANG6,                                                  +        
               LTH=2                                                            
         MFLD  PLATS6,                                                 +        
               LTH=5                                                            
         MFLD  DABUFPA6,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  BUFFF6,                                                 +        
               LTH=7                                                            
         MFLD  BUFFFIN6,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BUFFO6,                                                 +        
               LTH=8                                                            
         MFLD  BUFFOIN6,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLF6,                                                 +        
               LTH=4                                                            
         MFLD  KOLLFIN6,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLO6,                                                 +        
               LTH=4                                                            
         MFLD  KOLLOIN6,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CMD7,                                                   +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OMR7,                                                   +        
               LTH=2                                                            
         MFLD  GANG7,                                                  +        
               LTH=2                                                            
         MFLD  PLATS7,                                                 +        
               LTH=5                                                            
         MFLD  DABUFPA7,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  BUFFF7,                                                 +        
               LTH=7                                                            
         MFLD  BUFFFIN7,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BUFFO7,                                                 +        
               LTH=8                                                            
         MFLD  BUFFOIN7,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLF7,                                                 +        
               LTH=4                                                            
         MFLD  KOLLFIN7,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLO7,                                                 +        
               LTH=4                                                            
         MFLD  KOLLOIN7,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SUFSALDO,                                               +        
               LTH=8                                                            
         MFLD  SUOSALDO,                                               +        
               LTH=8                                                            
         MFLD  SUFKOLLI,                                               +        
               LTH=4                                                            
         MFLD  SUOKOLLI,                                               +        
               LTH=4                                                            
         MFLD  NYOMR,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  NYGANG,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  NYPLATS,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  NYFSALDO,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  NYOSALDO,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  NYFKOLLI,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  NYOKOLLI,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  NYQNT,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  NYTRT,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  NYLOC,                                                  +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MSGEND                                                                 
         END                                                                    
