***********************************************************************         
* CREATED BY V059625   ON 01/09/10  AT 14:35                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'HIST. FÖRFLYTTNINGAR CDC/SVS    '                               
W6F155   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W6T155 7',                                           +        
               8='W6T155 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W6T155U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W6F155   DPAGE CURSOR=((2,08)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'HIST. FÖRFLYTTNINGAR CDC/SVS',                         +        
               POS=(1,12),LTH=28,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Artnr',                                                +        
               POS=(2,2),LTH=5,                                        +        
               ATTR=(PROT)                                                      
ARTNRIN  DFLD  POS=(2,08),LTH=9,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Avsdat',                                               +        
               POS=(2,19),LTH=6,                                       +        
               ATTR=(PROT)                                                      
AVSDATIN DFLD  POS=(2,28),LTH=6,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Dest',                                                 +        
               POS=(2,35),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DESTIN   DFLD  POS=(2,40),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Trpid',                                                +        
               POS=(2,44),LTH=5,                                       +        
               ATTR=(PROT)                                                      
TRPIDIN  DFLD  POS=(2,50),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
ARTNRUT  DFLD  POS=(3,08),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
AVSDATUT DFLD  POS=(3,28),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DESTUT   DFLD  POS=(3,40),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
TRPIDUT  DFLD  POS=(3,50),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Artnr  Antal Dest Avsdat Motdat Trpid LPL User',       +        
               POS=(5,6),LTH=46,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Not',                                                  +        
               POS=(5,58),LTH=3,                                       +        
               ATTR=(PROT)                                                      
ARTNR1   DFLD  POS=(6,2),LTH=09,                                       +        
               ATTR=(PROT,MOD)                                                  
ANTAL1   DFLD  POS=(6,12),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DEST1    DFLD  POS=(6,19),LTH=3,                                       +        
               ATTR=(PROT)                                                      
AVSDAT1  DFLD  POS=(6,24),LTH=6,                                       +        
               ATTR=(PROT)                                                      
MOTDAT1  DFLD  POS=(6,31),LTH=6,                                       +        
               ATTR=(PROT)                                                      
TRPID1   DFLD  POS=(6,38),LTH=5,                                       +        
               ATTR=(PROT)                                                      
LPL1     DFLD  POS=(6,44),LTH=4,                                       +        
               ATTR=(PROT)                                                      
IDUSER1  DFLD  POS=(6,49),LTH=8,                                       +        
               ATTR=(PROT)                                                      
NOT1     DFLD  POS=(6,58),LTH=20,                                      +        
               ATTR=(PROT)                                                      
ARTNR2   DFLD  POS=(7,2),LTH=09,                                       +        
               ATTR=(PROT,MOD)                                                  
ANTAL2   DFLD  POS=(7,12),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DEST2    DFLD  POS=(7,19),LTH=3,                                       +        
               ATTR=(PROT)                                                      
AVSDAT2  DFLD  POS=(7,24),LTH=6,                                       +        
               ATTR=(PROT)                                                      
MOTDAT2  DFLD  POS=(7,31),LTH=6,                                       +        
               ATTR=(PROT)                                                      
TRPID2   DFLD  POS=(7,38),LTH=5,                                       +        
               ATTR=(PROT)                                                      
LPL2     DFLD  POS=(7,44),LTH=4,                                       +        
               ATTR=(PROT)                                                      
IDUSER2  DFLD  POS=(7,49),LTH=8,                                       +        
               ATTR=(PROT)                                                      
NOT2     DFLD  POS=(7,58),LTH=20,                                      +        
               ATTR=(PROT)                                                      
ARTNR3   DFLD  POS=(8,2),LTH=09,                                       +        
               ATTR=(PROT,MOD)                                                  
ANTAL3   DFLD  POS=(8,12),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DEST3    DFLD  POS=(8,19),LTH=3,                                       +        
               ATTR=(PROT)                                                      
AVSDAT3  DFLD  POS=(8,24),LTH=6,                                       +        
               ATTR=(PROT)                                                      
MOTDAT3  DFLD  POS=(8,31),LTH=6,                                       +        
               ATTR=(PROT)                                                      
TRPID3   DFLD  POS=(8,38),LTH=5,                                       +        
               ATTR=(PROT)                                                      
LPL3     DFLD  POS=(8,44),LTH=4,                                       +        
               ATTR=(PROT)                                                      
IDUSER3  DFLD  POS=(8,49),LTH=8,                                       +        
               ATTR=(PROT)                                                      
NOT3     DFLD  POS=(8,58),LTH=20,                                      +        
               ATTR=(PROT)                                                      
ARTNR4   DFLD  POS=(9,2),LTH=09,                                       +        
               ATTR=(PROT,MOD)                                                  
ANTAL4   DFLD  POS=(9,12),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DEST4    DFLD  POS=(9,19),LTH=3,                                       +        
               ATTR=(PROT)                                                      
AVSDAT4  DFLD  POS=(9,24),LTH=6,                                       +        
               ATTR=(PROT)                                                      
MOTDAT4  DFLD  POS=(9,31),LTH=6,                                       +        
               ATTR=(PROT)                                                      
TRPID4   DFLD  POS=(9,38),LTH=5,                                       +        
               ATTR=(PROT)                                                      
LPL4     DFLD  POS=(9,44),LTH=4,                                       +        
               ATTR=(PROT)                                                      
IDUSER4  DFLD  POS=(9,49),LTH=8,                                       +        
               ATTR=(PROT)                                                      
NOT4     DFLD  POS=(9,58),LTH=20,                                      +        
               ATTR=(PROT)                                                      
ARTNR5   DFLD  POS=(10,2),LTH=09,                                      +        
               ATTR=(PROT,MOD)                                                  
ANTAL5   DFLD  POS=(10,12),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DEST5    DFLD  POS=(10,19),LTH=3,                                      +        
               ATTR=(PROT)                                                      
AVSDAT5  DFLD  POS=(10,24),LTH=6,                                      +        
               ATTR=(PROT)                                                      
MOTDAT5  DFLD  POS=(10,31),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TRPID5   DFLD  POS=(10,38),LTH=5,                                      +        
               ATTR=(PROT)                                                      
LPL5     DFLD  POS=(10,44),LTH=4,                                      +        
               ATTR=(PROT)                                                      
IDUSER5  DFLD  POS=(10,49),LTH=8,                                      +        
               ATTR=(PROT)                                                      
NOT5     DFLD  POS=(10,58),LTH=20,                                     +        
               ATTR=(PROT)                                                      
ARTNR6   DFLD  POS=(11,2),LTH=09,                                      +        
               ATTR=(PROT,MOD)                                                  
ANTAL6   DFLD  POS=(11,12),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DEST6    DFLD  POS=(11,19),LTH=3,                                      +        
               ATTR=(PROT)                                                      
AVSDAT6  DFLD  POS=(11,24),LTH=6,                                      +        
               ATTR=(PROT)                                                      
MOTDAT6  DFLD  POS=(11,31),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TRPID6   DFLD  POS=(11,38),LTH=5,                                      +        
               ATTR=(PROT)                                                      
LPL6     DFLD  POS=(11,44),LTH=4,                                      +        
               ATTR=(PROT)                                                      
IDUSER6  DFLD  POS=(11,49),LTH=8,                                      +        
               ATTR=(PROT)                                                      
NOT6     DFLD  POS=(11,58),LTH=20,                                     +        
               ATTR=(PROT)                                                      
ARTNR7   DFLD  POS=(12,2),LTH=09,                                      +        
               ATTR=(PROT,MOD)                                                  
ANTAL7   DFLD  POS=(12,12),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DEST7    DFLD  POS=(12,19),LTH=3,                                      +        
               ATTR=(PROT)                                                      
AVSDAT7  DFLD  POS=(12,24),LTH=6,                                      +        
               ATTR=(PROT)                                                      
MOTDAT7  DFLD  POS=(12,31),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TRPID7   DFLD  POS=(12,38),LTH=5,                                      +        
               ATTR=(PROT)                                                      
LPL7     DFLD  POS=(12,44),LTH=4,                                      +        
               ATTR=(PROT)                                                      
IDUSER7  DFLD  POS=(12,49),LTH=8,                                      +        
               ATTR=(PROT)                                                      
NOT7     DFLD  POS=(12,58),LTH=20,                                     +        
               ATTR=(PROT)                                                      
ARTNR8   DFLD  POS=(13,2),LTH=09,                                      +        
               ATTR=(PROT,MOD)                                                  
ANTAL8   DFLD  POS=(13,12),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DEST8    DFLD  POS=(13,19),LTH=3,                                      +        
               ATTR=(PROT)                                                      
AVSDAT8  DFLD  POS=(13,24),LTH=6,                                      +        
               ATTR=(PROT)                                                      
MOTDAT8  DFLD  POS=(13,31),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TRPID8   DFLD  POS=(13,38),LTH=5,                                      +        
               ATTR=(PROT)                                                      
LPL8     DFLD  POS=(13,44),LTH=4,                                      +        
               ATTR=(PROT)                                                      
IDUSER8  DFLD  POS=(13,49),LTH=8,                                      +        
               ATTR=(PROT)                                                      
NOT8     DFLD  POS=(13,58),LTH=20,                                     +        
               ATTR=(PROT)                                                      
ARTNR9   DFLD  POS=(14,2),LTH=09,                                      +        
               ATTR=(PROT,MOD)                                                  
ANTAL9   DFLD  POS=(14,12),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DEST9    DFLD  POS=(14,19),LTH=3,                                      +        
               ATTR=(PROT)                                                      
AVSDAT9  DFLD  POS=(14,24),LTH=6,                                      +        
               ATTR=(PROT)                                                      
MOTDAT9  DFLD  POS=(14,31),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TRPID9   DFLD  POS=(14,38),LTH=5,                                      +        
               ATTR=(PROT)                                                      
LPL9     DFLD  POS=(14,44),LTH=4,                                      +        
               ATTR=(PROT)                                                      
IDUSER9  DFLD  POS=(14,49),LTH=8,                                      +        
               ATTR=(PROT)                                                      
NOT9     DFLD  POS=(14,58),LTH=20,                                     +        
               ATTR=(PROT)                                                      
ARTNR10  DFLD  POS=(15,2),LTH=09,                                      +        
               ATTR=(PROT,MOD)                                                  
ANTAL10  DFLD  POS=(15,12),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DEST10   DFLD  POS=(15,19),LTH=3,                                      +        
               ATTR=(PROT)                                                      
AVSDAT10 DFLD  POS=(15,24),LTH=6,                                      +        
               ATTR=(PROT)                                                      
MOTDAT10 DFLD  POS=(15,31),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TRPID10  DFLD  POS=(15,38),LTH=5,                                      +        
               ATTR=(PROT)                                                      
LPL10    DFLD  POS=(15,44),LTH=4,                                      +        
               ATTR=(PROT)                                                      
IDUSER10 DFLD  POS=(15,49),LTH=8,                                      +        
               ATTR=(PROT)                                                      
NOT10    DFLD  POS=(15,58),LTH=20,                                     +        
               ATTR=(PROT)                                                      
ARTNR11  DFLD  POS=(16,2),LTH=09,                                      +        
               ATTR=(PROT,MOD)                                                  
ANTAL11  DFLD  POS=(16,12),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DEST11   DFLD  POS=(16,19),LTH=3,                                      +        
               ATTR=(PROT)                                                      
AVSDAT11 DFLD  POS=(16,24),LTH=6,                                      +        
               ATTR=(PROT)                                                      
MOTDAT11 DFLD  POS=(16,31),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TRPID11  DFLD  POS=(16,38),LTH=5,                                      +        
               ATTR=(PROT)                                                      
LPL11    DFLD  POS=(16,44),LTH=4,                                      +        
               ATTR=(PROT)                                                      
IDUSER11 DFLD  POS=(16,49),LTH=8,                                      +        
               ATTR=(PROT)                                                      
NOT11    DFLD  POS=(16,58),LTH=20,                                     +        
               ATTR=(PROT)                                                      
ARTNR12  DFLD  POS=(17,2),LTH=09,                                      +        
               ATTR=(PROT,MOD)                                                  
ANTAL12  DFLD  POS=(17,12),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DEST12   DFLD  POS=(17,19),LTH=3,                                      +        
               ATTR=(PROT)                                                      
AVSDAT12 DFLD  POS=(17,24),LTH=6,                                      +        
               ATTR=(PROT)                                                      
MOTDAT12 DFLD  POS=(17,31),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TRPID12  DFLD  POS=(17,38),LTH=5,                                      +        
               ATTR=(PROT)                                                      
LPL12    DFLD  POS=(17,44),LTH=4,                                      +        
               ATTR=(PROT)                                                      
IDUSER12 DFLD  POS=(17,49),LTH=8,                                      +        
               ATTR=(PROT)                                                      
NOT12    DFLD  POS=(17,58),LTH=20,                                     +        
               ATTR=(PROT)                                                      
ARTNR13  DFLD  POS=(18,2),LTH=09,                                      +        
               ATTR=(PROT,MOD)                                                  
ANTAL13  DFLD  POS=(18,12),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DEST13   DFLD  POS=(18,19),LTH=3,                                      +        
               ATTR=(PROT)                                                      
AVSDAT13 DFLD  POS=(18,24),LTH=6,                                      +        
               ATTR=(PROT)                                                      
MOTDAT13 DFLD  POS=(18,31),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TRPID13  DFLD  POS=(18,38),LTH=5,                                      +        
               ATTR=(PROT)                                                      
LPL13    DFLD  POS=(18,44),LTH=4,                                      +        
               ATTR=(PROT)                                                      
IDUSER13 DFLD  POS=(18,49),LTH=8,                                      +        
               ATTR=(PROT)                                                      
NOT13    DFLD  POS=(18,58),LTH=20,                                     +        
               ATTR=(PROT)                                                      
ARTNR14  DFLD  POS=(19,2),LTH=09,                                      +        
               ATTR=(PROT,MOD)                                                  
ANTAL14  DFLD  POS=(19,12),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DEST14   DFLD  POS=(19,19),LTH=3,                                      +        
               ATTR=(PROT)                                                      
AVSDAT14 DFLD  POS=(19,24),LTH=6,                                      +        
               ATTR=(PROT)                                                      
MOTDAT14 DFLD  POS=(19,31),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TRPID14  DFLD  POS=(19,38),LTH=5,                                      +        
               ATTR=(PROT)                                                      
LPL14    DFLD  POS=(19,44),LTH=4,                                      +        
               ATTR=(PROT)                                                      
IDUSER14 DFLD  POS=(19,49),LTH=8,                                      +        
               ATTR=(PROT)                                                      
NOT14    DFLD  POS=(19,58),LTH=20,                                     +        
               ATTR=(PROT)                                                      
ARTNR15  DFLD  POS=(20,2),LTH=09,                                      +        
               ATTR=(PROT,MOD)                                                  
ANTAL15  DFLD  POS=(20,12),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DEST15   DFLD  POS=(20,19),LTH=3,                                      +        
               ATTR=(PROT)                                                      
AVSDAT15 DFLD  POS=(20,24),LTH=6,                                      +        
               ATTR=(PROT)                                                      
MOTDAT15 DFLD  POS=(20,31),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TRPID15  DFLD  POS=(20,38),LTH=5,                                      +        
               ATTR=(PROT)                                                      
LPL15    DFLD  POS=(20,44),LTH=4,                                      +        
               ATTR=(PROT)                                                      
IDUSER15 DFLD  POS=(20,49),LTH=8,                                      +        
               ATTR=(PROT)                                                      
NOT15    DFLD  POS=(20,58),LTH=20,                                     +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W6O15501 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6F155,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I15501,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W6F155,                                             +        
               NXT=W6I15501                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  ARTNRIN,                                                +        
               LTH=9                                                            
         MFLD  ARTNRUT,                                                +        
               LTH=9                                                            
         MFLD  AVSDATIN,                                               +        
               LTH=6                                                            
         MFLD  AVSDATUT,                                               +        
               LTH=6                                                            
         MFLD  DESTIN,                                                 +        
               LTH=3                                                            
         MFLD  DESTUT,                                                 +        
               LTH=3                                                            
         MFLD  TRPIDIN,                                                +        
               LTH=5                                                            
         MFLD  TRPIDUT,                                                +        
               LTH=5                                                            
         MFLD  ARTNR1,                                                 +        
               LTH=9                                                            
         MFLD  ANTAL1,                                                 +        
               LTH=6                                                            
         MFLD  DEST1,                                                  +        
               LTH=3                                                            
         MFLD  AVSDAT1,                                                +        
               LTH=6                                                            
         MFLD  MOTDAT1,                                                +        
               LTH=6                                                            
         MFLD  TRPID1,                                                 +        
               LTH=5                                                            
         MFLD  LPL1,                                                   +        
               LTH=4                                                            
         MFLD  IDUSER1,                                                +        
               LTH=8                                                            
         MFLD  NOT1,                                                   +        
               LTH=20                                                           
         MFLD  ARTNR2,                                                 +        
               LTH=9                                                            
         MFLD  ANTAL2,                                                 +        
               LTH=6                                                            
         MFLD  DEST2,                                                  +        
               LTH=3                                                            
         MFLD  AVSDAT2,                                                +        
               LTH=6                                                            
         MFLD  MOTDAT2,                                                +        
               LTH=6                                                            
         MFLD  TRPID2,                                                 +        
               LTH=5                                                            
         MFLD  LPL2,                                                   +        
               LTH=4                                                            
         MFLD  IDUSER2,                                                +        
               LTH=8                                                            
         MFLD  NOT2,                                                   +        
               LTH=20                                                           
         MFLD  ARTNR3,                                                 +        
               LTH=9                                                            
         MFLD  ANTAL3,                                                 +        
               LTH=6                                                            
         MFLD  DEST3,                                                  +        
               LTH=3                                                            
         MFLD  AVSDAT3,                                                +        
               LTH=6                                                            
         MFLD  MOTDAT3,                                                +        
               LTH=6                                                            
         MFLD  TRPID3,                                                 +        
               LTH=5                                                            
         MFLD  LPL3,                                                   +        
               LTH=4                                                            
         MFLD  IDUSER3,                                                +        
               LTH=8                                                            
         MFLD  NOT3,                                                   +        
               LTH=20                                                           
         MFLD  ARTNR4,                                                 +        
               LTH=9                                                            
         MFLD  ANTAL4,                                                 +        
               LTH=6                                                            
         MFLD  DEST4,                                                  +        
               LTH=3                                                            
         MFLD  AVSDAT4,                                                +        
               LTH=6                                                            
         MFLD  MOTDAT4,                                                +        
               LTH=6                                                            
         MFLD  TRPID4,                                                 +        
               LTH=5                                                            
         MFLD  LPL4,                                                   +        
               LTH=4                                                            
         MFLD  IDUSER4,                                                +        
               LTH=8                                                            
         MFLD  NOT4,                                                   +        
               LTH=20                                                           
         MFLD  ARTNR5,                                                 +        
               LTH=9                                                            
         MFLD  ANTAL5,                                                 +        
               LTH=6                                                            
         MFLD  DEST5,                                                  +        
               LTH=3                                                            
         MFLD  AVSDAT5,                                                +        
               LTH=6                                                            
         MFLD  MOTDAT5,                                                +        
               LTH=6                                                            
         MFLD  TRPID5,                                                 +        
               LTH=5                                                            
         MFLD  LPL5,                                                   +        
               LTH=4                                                            
         MFLD  IDUSER5,                                                +        
               LTH=8                                                            
         MFLD  NOT5,                                                   +        
               LTH=20                                                           
         MFLD  ARTNR6,                                                 +        
               LTH=9                                                            
         MFLD  ANTAL6,                                                 +        
               LTH=6                                                            
         MFLD  DEST6,                                                  +        
               LTH=3                                                            
         MFLD  AVSDAT6,                                                +        
               LTH=6                                                            
         MFLD  MOTDAT6,                                                +        
               LTH=6                                                            
         MFLD  TRPID6,                                                 +        
               LTH=5                                                            
         MFLD  LPL6,                                                   +        
               LTH=4                                                            
         MFLD  IDUSER6,                                                +        
               LTH=8                                                            
         MFLD  NOT6,                                                   +        
               LTH=20                                                           
         MFLD  ARTNR7,                                                 +        
               LTH=9                                                            
         MFLD  ANTAL7,                                                 +        
               LTH=6                                                            
         MFLD  DEST7,                                                  +        
               LTH=3                                                            
         MFLD  AVSDAT7,                                                +        
               LTH=6                                                            
         MFLD  MOTDAT7,                                                +        
               LTH=6                                                            
         MFLD  TRPID7,                                                 +        
               LTH=5                                                            
         MFLD  LPL7,                                                   +        
               LTH=4                                                            
         MFLD  IDUSER7,                                                +        
               LTH=8                                                            
         MFLD  NOT7,                                                   +        
               LTH=20                                                           
         MFLD  ARTNR8,                                                 +        
               LTH=9                                                            
         MFLD  ANTAL8,                                                 +        
               LTH=6                                                            
         MFLD  DEST8,                                                  +        
               LTH=3                                                            
         MFLD  AVSDAT8,                                                +        
               LTH=6                                                            
         MFLD  MOTDAT8,                                                +        
               LTH=6                                                            
         MFLD  TRPID8,                                                 +        
               LTH=5                                                            
         MFLD  LPL8,                                                   +        
               LTH=4                                                            
         MFLD  IDUSER8,                                                +        
               LTH=8                                                            
         MFLD  NOT8,                                                   +        
               LTH=20                                                           
         MFLD  ARTNR9,                                                 +        
               LTH=9                                                            
         MFLD  ANTAL9,                                                 +        
               LTH=6                                                            
         MFLD  DEST9,                                                  +        
               LTH=3                                                            
         MFLD  AVSDAT9,                                                +        
               LTH=6                                                            
         MFLD  MOTDAT9,                                                +        
               LTH=6                                                            
         MFLD  TRPID9,                                                 +        
               LTH=5                                                            
         MFLD  LPL9,                                                   +        
               LTH=4                                                            
         MFLD  IDUSER9,                                                +        
               LTH=8                                                            
         MFLD  NOT9,                                                   +        
               LTH=20                                                           
         MFLD  ARTNR10,                                                +        
               LTH=9                                                            
         MFLD  ANTAL10,                                                +        
               LTH=6                                                            
         MFLD  DEST10,                                                 +        
               LTH=3                                                            
         MFLD  AVSDAT10,                                               +        
               LTH=6                                                            
         MFLD  MOTDAT10,                                               +        
               LTH=6                                                            
         MFLD  TRPID10,                                                +        
               LTH=5                                                            
         MFLD  LPL10,                                                  +        
               LTH=4                                                            
         MFLD  IDUSER10,                                               +        
               LTH=8                                                            
         MFLD  NOT10,                                                  +        
               LTH=20                                                           
         MFLD  ARTNR11,                                                +        
               LTH=9                                                            
         MFLD  ANTAL11,                                                +        
               LTH=6                                                            
         MFLD  DEST11,                                                 +        
               LTH=3                                                            
         MFLD  AVSDAT11,                                               +        
               LTH=6                                                            
         MFLD  MOTDAT11,                                               +        
               LTH=6                                                            
         MFLD  TRPID11,                                                +        
               LTH=5                                                            
         MFLD  LPL11,                                                  +        
               LTH=4                                                            
         MFLD  IDUSER11,                                               +        
               LTH=8                                                            
         MFLD  NOT11,                                                  +        
               LTH=20                                                           
         MFLD  ARTNR12,                                                +        
               LTH=9                                                            
         MFLD  ANTAL12,                                                +        
               LTH=6                                                            
         MFLD  DEST12,                                                 +        
               LTH=3                                                            
         MFLD  AVSDAT12,                                               +        
               LTH=6                                                            
         MFLD  MOTDAT12,                                               +        
               LTH=6                                                            
         MFLD  TRPID12,                                                +        
               LTH=5                                                            
         MFLD  LPL12,                                                  +        
               LTH=4                                                            
         MFLD  IDUSER12,                                               +        
               LTH=8                                                            
         MFLD  NOT12,                                                  +        
               LTH=20                                                           
         MFLD  ARTNR13,                                                +        
               LTH=9                                                            
         MFLD  ANTAL13,                                                +        
               LTH=6                                                            
         MFLD  DEST13,                                                 +        
               LTH=3                                                            
         MFLD  AVSDAT13,                                               +        
               LTH=6                                                            
         MFLD  MOTDAT13,                                               +        
               LTH=6                                                            
         MFLD  TRPID13,                                                +        
               LTH=5                                                            
         MFLD  LPL13,                                                  +        
               LTH=4                                                            
         MFLD  IDUSER13,                                               +        
               LTH=8                                                            
         MFLD  NOT13,                                                  +        
               LTH=20                                                           
         MFLD  ARTNR14,                                                +        
               LTH=9                                                            
         MFLD  ANTAL14,                                                +        
               LTH=6                                                            
         MFLD  DEST14,                                                 +        
               LTH=3                                                            
         MFLD  AVSDAT14,                                               +        
               LTH=6                                                            
         MFLD  MOTDAT14,                                               +        
               LTH=6                                                            
         MFLD  TRPID14,                                                +        
               LTH=5                                                            
         MFLD  LPL14,                                                  +        
               LTH=4                                                            
         MFLD  IDUSER14,                                               +        
               LTH=8                                                            
         MFLD  NOT14,                                                  +        
               LTH=20                                                           
         MFLD  ARTNR15,                                                +        
               LTH=9                                                            
         MFLD  ANTAL15,                                                +        
               LTH=6                                                            
         MFLD  DEST15,                                                 +        
               LTH=3                                                            
         MFLD  AVSDAT15,                                               +        
               LTH=6                                                            
         MFLD  MOTDAT15,                                               +        
               LTH=6                                                            
         MFLD  TRPID15,                                                +        
               LTH=5                                                            
         MFLD  LPL15,                                                  +        
               LTH=4                                                            
         MFLD  IDUSER15,                                               +        
               LTH=8                                                            
         MFLD  NOT15,                                                  +        
               LTH=20                                                           
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W6I15501 MSG   TYPE=INPUT,                                             +        
               SOR=(W6F155),                                           +        
               OPT=2,                                                  +        
               NXT=W6O15501                                                     
MID      LPAGE SOR=(W6F155),                                           +        
               NXT=W6O15501                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '61551',                                                +        
               LTH=5                                                            
         MFLD  (ARTNRIN,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (ARTNRUT,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (AVSDATIN,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (AVSDATUT,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DESTIN,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DESTUT,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TRPIDIN,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TRPIDUT,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
