***********************************************************************         
* CREATED BY V0C9059   ON 09/10/28  AT 08:51                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'Gate Steering'                                                  
W6F158   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W6T158 6',                                           +        
               7='W6T158 7',                                           +        
               8='W6T158 8',                                           +        
               10='WHELP   ',                                          +        
               11='W6T158U ',                                          +        
               12='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,08)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Definiera Gate Styrning  ',                            +        
               POS=(1,12),LTH=25,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'LO/FT',                                                +        
               POS=(2,2),LTH=5,                                        +        
               ATTR=(ALPHA,PROT)                                                
BEFTIN   DFLD  POS=(2,8),LTH=2,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Visa L/F/A',                                           +        
               POS=(2,25),LTH=10,                                      +        
               ATTR=(ALPHA,PROT)                                                
KDSORTIN DFLD  POS=(2,36),LTH=1,                                       +        
               ATTR=(ALPHA,NOPROT)                                              
BEFTUT   DFLD  POS=(3,8),LTH=2,                                        +        
               ATTR=(NUM,PROT)                                                  
KDSORTUT DFLD  POS=(3,36),LTH=1,                                       +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  'DC',                                                   +        
               POS=(4,41),LTH=2,                                       +        
               ATTR=(ALPHA,PROT)                                                
IDDC     DFLD  POS=(4,44),LTH=2,                                       +        
               ATTR=(ALPHA,PROT)                                                
ADPORTDC DFLD  POS=(4,47),LTH=8,                                       +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  'Åtg',                                                  +        
               POS=(6,2),LTH=3,                                        +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  'LO',                                                   +        
               POS=(6,8),LTH=2,                                        +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  'FP-typ',                                               +        
               POS=(6,12),LTH=6,                                       +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  'Artnr',                                                +        
               POS=(6,20),LTH=5,                                       +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  'Gate',                                                 +        
               POS=(6,31),LTH=4,                                       +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  'Fr datum',                                             +        
               POS=(6,41),LTH=8,                                       +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  'ID',                                                   +        
               POS=(6,52),LTH=2,                                       +        
               ATTR=(ALPHA,PROT)                                                
         DFLD  'Uppdat',                                               +        
               POS=(6,63),LTH=6,                                       +        
               ATTR=(ALPHA,PROT)                                                
         DO    12,SUF=07                                                        
KDCMDV   DFLD  POS=(7,2),LTH=1,                                        +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
LAGOMR   DFLD  POS=(7,8),LTH=02,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
BEFT     DFLD  POS=(7,13),LTH=02,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
IDARTNR  DFLD  POS=(7,20),LTH=09,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
ADPORT   DFLD  POS=(7,31),LTH=08,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
DATUM    DFLD  POS=(7,44),LTH=04,                                      +        
               ATTR=(ALPHA,PROT,MOD)                                            
IDUSER   DFLD  POS=(7,52),LTH=8,                                       +        
               ATTR=(ALPHA,PROT,MOD)                                            
TIUPPD   DFLD  POS=(7,63),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
         ENDDO                                                                  
LAGOMRA  DFLD  POS=(20,8),LTH=02,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
BEFTA    DFLD  POS=(20,13),LTH=02,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDARTNRA DFLD  POS=(20,20),LTH=09,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
ADPORTA  DFLD  POS=(20,31),LTH=08,                                     +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
DATUMA   DFLD  POS=(20,44),LTH=04,                                     +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
         DFLD  'F1 Hjälpsida   F6 Föregående sida   F7 Första sida  F8 +        
                Nästa sida  F10 WHELP',                                +        
               POS=(22,2),LTH=77,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W6I158N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W6F158),                                           +        
               OPT=2,                                                  +        
               NXT=W6O15801                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS1,                                              +        
               '6'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS2,                                              +        
               '1'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  (IDTRANS3,                                              +        
               '5'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  (IDTRANS4,                                              +        
               '8'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '61582',                                                +        
               LTH=5                                                            
         MFLD  (BEFTIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KDSORTIN,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         DO    12,SUF=07                                                        
         MFLD  (KDCMDV,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  LAGOMR,                                                 +        
               LTH=02                                                           
         MFLD  BEFT,                                                   +        
               LTH=02                                                           
         MFLD  IDARTNR,                                                +        
               LTH=09                                                           
         MFLD  ADPORT,                                                 +        
               LTH=04                                                           
         MFLD  DATUM,                                                  +        
               LTH=4                                                            
         MFLD  IDUSER,                                                 +        
               LTH=08                                                           
         MFLD  TIUPPD,                                                 +        
               LTH=06                                                           
         ENDDO                                                                  
         MFLD  (LAGOMRA,                                               +        
               '++'),                                                  +        
               LTH=02,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (BEFTA,                                                 +        
               '++'),                                                  +        
               LTH=02,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDARTNRA,                                              +        
               '+++++++++'),                                           +        
               LTH=09,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  ADPORTA,                                                +        
               LTH=04                                                           
         MFLD  DATUMA,                                                 +        
               LTH=04,                                                 +        
               FILL=X'40'                                                       
         MSGEND                                                                 
W6O15801 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6F158,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I158N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  BEFTIN,                                                 +        
               LTH=02                                                           
         MFLD  KDSORTIN,                                               +        
               LTH=01                                                           
         MFLD  BEFTUT,                                                 +        
               LTH=02                                                           
         MFLD  KDSORTUT,                                               +        
               LTH=01                                                           
         MFLD  IDDC,                                                   +        
               LTH=02                                                           
         MFLD  ADPORTDC,                                               +        
               LTH=08                                                           
         DO    12,SUF=07                                                        
         MFLD  KDCMDV,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LAGOMR,                                                 +        
               LTH=04,                                                 +        
               ATTR=(YES)                                                       
         MFLD  BEFT,                                                   +        
               LTH=04,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDARTNR,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ADPORT,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DATUM,                                                  +        
               LTH=06,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDUSER,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TIUPPD,                                                 +        
               LTH=08,                                                 +        
               ATTR=(YES)                                                       
         ENDDO                                                                  
         MFLD  LAGOMRA,                                                +        
               LTH=04,                                                 +        
               ATTR=(YES)                                                       
         MFLD  BEFTA,                                                  +        
               LTH=04,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDARTNRA,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ADPORTA,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DATUMA,                                                 +        
               LTH=06,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
