***********************************************************************         
* CREATED BY V063442   ON 02/03/26  AT 14:03                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'LOSSNING PÅFYLLNINGSGODS        '                               
W6F153   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W6T153 7',                                           +        
               8='W6T153 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W6T153U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W6F153   DPAGE CURSOR=((2,10)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'LOSSNING PÅFYLLNINGSGODS',                             +        
               POS=(1,12),LTH=24,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Loss pl',                                              +        
               POS=(2,2),LTH=7,                                        +        
               ATTR=(NUM,PROT)                                                  
DESTIN   DFLD  POS=(2,10),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Trpid',                                                +        
               POS=(2,17),LTH=5,                                       +        
               ATTR=(PROT)                                                      
TRPIDIN  DFLD  POS=(2,23),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
DESTUT   DFLD  POS=(3,10),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
TRPIDUT  DFLD  POS=(3,23),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Cmd Trpid Datum',                                      +        
               POS=(5,2),LTH=15,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Artnr  Antal Lagerplats',                              +        
               POS=(5,23),LTH=23,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Not',                                                  +        
               POS=(5,54),LTH=3,                                       +        
               ATTR=(PROT)                                                      
CMD1     DFLD  POS=(6,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
TRPID1   DFLD  POS=(6,6),LTH=5,                                        +        
               ATTR=(PROT,MOD)                                                  
DATUM1   DFLD  POS=(6,12),LTH=6,                                       +        
               ATTR=(PROT)                                                      
ARTNR1   DFLD  POS=(6,19),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
ANTAL1   DFLD  POS=(6,29),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
LAGOMR1  DFLD  POS=(6,36),LTH=2,                                       +        
               ATTR=(PROT)                                                      
GANG1    DFLD  POS=(6,39),LTH=2,                                       +        
               ATTR=(PROT)                                                      
PLATS1   DFLD  POS=(6,42),LTH=5,                                       +        
               ATTR=(PROT)                                                      
NOT1     DFLD  POS=(6,54),LTH=20,                                      +        
               ATTR=(PROT)                                                      
CMD2     DFLD  POS=(7,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
TRPID2   DFLD  POS=(7,6),LTH=5,                                        +        
               ATTR=(PROT,MOD)                                                  
DATUM2   DFLD  POS=(7,12),LTH=6,                                       +        
               ATTR=(PROT)                                                      
ARTNR2   DFLD  POS=(7,19),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
ANTAL2   DFLD  POS=(7,29),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
LAGOMR2  DFLD  POS=(7,36),LTH=2,                                       +        
               ATTR=(PROT)                                                      
GANG2    DFLD  POS=(7,39),LTH=2,                                       +        
               ATTR=(PROT)                                                      
PLATS2   DFLD  POS=(7,42),LTH=5,                                       +        
               ATTR=(PROT)                                                      
NOT2     DFLD  POS=(7,54),LTH=20,                                      +        
               ATTR=(PROT)                                                      
CMD3     DFLD  POS=(8,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
TRPID3   DFLD  POS=(8,6),LTH=5,                                        +        
               ATTR=(PROT,MOD)                                                  
DATUM3   DFLD  POS=(8,12),LTH=6,                                       +        
               ATTR=(PROT)                                                      
ARTNR3   DFLD  POS=(8,19),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
ANTAL3   DFLD  POS=(8,29),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
LAGOMR3  DFLD  POS=(8,36),LTH=2,                                       +        
               ATTR=(PROT)                                                      
GANG3    DFLD  POS=(8,39),LTH=2,                                       +        
               ATTR=(PROT)                                                      
PLATS3   DFLD  POS=(8,42),LTH=5,                                       +        
               ATTR=(PROT)                                                      
NOT3     DFLD  POS=(8,54),LTH=20,                                      +        
               ATTR=(PROT)                                                      
CMD4     DFLD  POS=(9,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
TRPID4   DFLD  POS=(9,6),LTH=5,                                        +        
               ATTR=(PROT,MOD)                                                  
DATUM4   DFLD  POS=(9,12),LTH=6,                                       +        
               ATTR=(PROT)                                                      
ARTNR4   DFLD  POS=(9,19),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
ANTAL4   DFLD  POS=(9,29),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
LAGOMR4  DFLD  POS=(9,36),LTH=2,                                       +        
               ATTR=(PROT)                                                      
GANG4    DFLD  POS=(9,39),LTH=2,                                       +        
               ATTR=(PROT)                                                      
PLATS4   DFLD  POS=(9,42),LTH=5,                                       +        
               ATTR=(PROT)                                                      
NOT4     DFLD  POS=(9,54),LTH=20,                                      +        
               ATTR=(PROT)                                                      
CMD5     DFLD  POS=(10,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
TRPID5   DFLD  POS=(10,6),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DATUM5   DFLD  POS=(10,12),LTH=6,                                      +        
               ATTR=(PROT)                                                      
ARTNR5   DFLD  POS=(10,19),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
ANTAL5   DFLD  POS=(10,29),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LAGOMR5  DFLD  POS=(10,36),LTH=2,                                      +        
               ATTR=(PROT)                                                      
GANG5    DFLD  POS=(10,39),LTH=2,                                      +        
               ATTR=(PROT)                                                      
PLATS5   DFLD  POS=(10,42),LTH=5,                                      +        
               ATTR=(PROT)                                                      
NOT5     DFLD  POS=(10,54),LTH=20,                                     +        
               ATTR=(PROT)                                                      
CMD6     DFLD  POS=(11,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
TRPID6   DFLD  POS=(11,6),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DATUM6   DFLD  POS=(11,12),LTH=6,                                      +        
               ATTR=(PROT)                                                      
ARTNR6   DFLD  POS=(11,19),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
ANTAL6   DFLD  POS=(11,29),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LAGOMR6  DFLD  POS=(11,36),LTH=2,                                      +        
               ATTR=(PROT)                                                      
GANG6    DFLD  POS=(11,39),LTH=2,                                      +        
               ATTR=(PROT)                                                      
PLATS6   DFLD  POS=(11,42),LTH=5,                                      +        
               ATTR=(PROT)                                                      
NOT6     DFLD  POS=(11,54),LTH=20,                                     +        
               ATTR=(PROT)                                                      
CMD7     DFLD  POS=(12,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
TRPID7   DFLD  POS=(12,6),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DATUM7   DFLD  POS=(12,12),LTH=6,                                      +        
               ATTR=(PROT)                                                      
ARTNR7   DFLD  POS=(12,19),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
ANTAL7   DFLD  POS=(12,29),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LAGOMR7  DFLD  POS=(12,36),LTH=2,                                      +        
               ATTR=(PROT)                                                      
GANG7    DFLD  POS=(12,39),LTH=2,                                      +        
               ATTR=(PROT)                                                      
PLATS7   DFLD  POS=(12,42),LTH=5,                                      +        
               ATTR=(PROT)                                                      
NOT7     DFLD  POS=(12,54),LTH=20,                                     +        
               ATTR=(PROT)                                                      
CMD8     DFLD  POS=(13,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
TRPID8   DFLD  POS=(13,6),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DATUM8   DFLD  POS=(13,12),LTH=6,                                      +        
               ATTR=(PROT)                                                      
ARTNR8   DFLD  POS=(13,19),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
ANTAL8   DFLD  POS=(13,29),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LAGOMR8  DFLD  POS=(13,36),LTH=2,                                      +        
               ATTR=(PROT)                                                      
GANG8    DFLD  POS=(13,39),LTH=2,                                      +        
               ATTR=(PROT)                                                      
PLATS8   DFLD  POS=(13,42),LTH=5,                                      +        
               ATTR=(PROT)                                                      
NOT8     DFLD  POS=(13,54),LTH=20,                                     +        
               ATTR=(PROT)                                                      
CMD9     DFLD  POS=(14,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
TRPID9   DFLD  POS=(14,6),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DATUM9   DFLD  POS=(14,12),LTH=6,                                      +        
               ATTR=(PROT)                                                      
ARTNR9   DFLD  POS=(14,19),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
ANTAL9   DFLD  POS=(14,29),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LAGOMR9  DFLD  POS=(14,36),LTH=2,                                      +        
               ATTR=(PROT)                                                      
GANG9    DFLD  POS=(14,39),LTH=2,                                      +        
               ATTR=(PROT)                                                      
PLATS9   DFLD  POS=(14,42),LTH=5,                                      +        
               ATTR=(PROT)                                                      
NOT9     DFLD  POS=(14,54),LTH=20,                                     +        
               ATTR=(PROT)                                                      
CMD10    DFLD  POS=(15,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
TRPID10  DFLD  POS=(15,6),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DATUM10  DFLD  POS=(15,12),LTH=6,                                      +        
               ATTR=(PROT)                                                      
ARTNR10  DFLD  POS=(15,19),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
ANTAL10  DFLD  POS=(15,29),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LAGOMR10 DFLD  POS=(15,36),LTH=2,                                      +        
               ATTR=(PROT)                                                      
GANG10   DFLD  POS=(15,39),LTH=2,                                      +        
               ATTR=(PROT)                                                      
PLATS10  DFLD  POS=(15,42),LTH=5,                                      +        
               ATTR=(PROT)                                                      
NOT10    DFLD  POS=(15,54),LTH=20,                                     +        
               ATTR=(PROT)                                                      
CMD11    DFLD  POS=(16,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
TRPID11  DFLD  POS=(16,6),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DATUM11  DFLD  POS=(16,12),LTH=6,                                      +        
               ATTR=(PROT)                                                      
ARTNR11  DFLD  POS=(16,19),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
ANTAL11  DFLD  POS=(16,29),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LAGOMR11 DFLD  POS=(16,36),LTH=2,                                      +        
               ATTR=(PROT)                                                      
GANG11   DFLD  POS=(16,39),LTH=2,                                      +        
               ATTR=(PROT)                                                      
PLATS11  DFLD  POS=(16,42),LTH=5,                                      +        
               ATTR=(PROT)                                                      
NOT11    DFLD  POS=(16,54),LTH=20,                                     +        
               ATTR=(PROT)                                                      
CMD12    DFLD  POS=(17,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
TRPID12  DFLD  POS=(17,6),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DATUM12  DFLD  POS=(17,12),LTH=6,                                      +        
               ATTR=(PROT)                                                      
ARTNR12  DFLD  POS=(17,19),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
ANTAL12  DFLD  POS=(17,29),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LAGOMR12 DFLD  POS=(17,36),LTH=2,                                      +        
               ATTR=(PROT)                                                      
GANG12   DFLD  POS=(17,39),LTH=2,                                      +        
               ATTR=(PROT)                                                      
PLATS12  DFLD  POS=(17,42),LTH=5,                                      +        
               ATTR=(PROT)                                                      
NOT12    DFLD  POS=(17,54),LTH=20,                                     +        
               ATTR=(PROT)                                                      
CMD13    DFLD  POS=(18,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
TRPID13  DFLD  POS=(18,6),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DATUM13  DFLD  POS=(18,12),LTH=6,                                      +        
               ATTR=(PROT)                                                      
ARTNR13  DFLD  POS=(18,19),LTH=9,                                      +        
               ATTR=(PROT,MOD)                                                  
ANTAL13  DFLD  POS=(18,29),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
LAGOMR13 DFLD  POS=(18,36),LTH=2,                                      +        
               ATTR=(PROT)                                                      
GANG13   DFLD  POS=(18,39),LTH=2,                                      +        
               ATTR=(PROT)                                                      
PLATS13  DFLD  POS=(18,42),LTH=5,                                      +        
               ATTR=(PROT)                                                      
NOT13    DFLD  POS=(18,54),LTH=20,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Lossning ok',                                          +        
               POS=(20,31),LTH=11,                                     +        
               ATTR=(PROT)                                                      
LOSSNING DFLD  POS=(20,43),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'LPL',                                                  +        
               POS=(20,47),LTH=3,                                      +        
               ATTR=(PROT)                                                      
LPL      DFLD  POS=(20,51),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Printer',                                              +        
               POS=(20,58),LTH=7,                                      +        
               ATTR=(PROT)                                                      
PRINTER  DFLD  POS=(20,66),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W6O15301 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6F153,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I15301,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W6F153,                                             +        
               NXT=W6I15301                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DESTIN,                                                 +        
               LTH=3                                                            
         MFLD  DESTUT,                                                 +        
               LTH=3                                                            
         MFLD  TRPIDIN,                                                +        
               LTH=5                                                            
         MFLD  TRPIDUT,                                                +        
               LTH=5                                                            
         MFLD  CMD1,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TRPID1,                                                 +        
               LTH=5                                                            
         MFLD  DATUM1,                                                 +        
               LTH=6                                                            
         MFLD  ARTNR1,                                                 +        
               LTH=9                                                            
         MFLD  ANTAL1,                                                 +        
               LTH=6                                                            
         MFLD  LAGOMR1,                                                +        
               LTH=2                                                            
         MFLD  GANG1,                                                  +        
               LTH=2                                                            
         MFLD  PLATS1,                                                 +        
               LTH=5                                                            
         MFLD  NOT1,                                                   +        
               LTH=20                                                           
         MFLD  CMD2,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TRPID2,                                                 +        
               LTH=5                                                            
         MFLD  DATUM2,                                                 +        
               LTH=6                                                            
         MFLD  ARTNR2,                                                 +        
               LTH=9                                                            
         MFLD  ANTAL2,                                                 +        
               LTH=6                                                            
         MFLD  LAGOMR2,                                                +        
               LTH=2                                                            
         MFLD  GANG2,                                                  +        
               LTH=2                                                            
         MFLD  PLATS2,                                                 +        
               LTH=5                                                            
         MFLD  NOT2,                                                   +        
               LTH=20                                                           
         MFLD  CMD3,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TRPID3,                                                 +        
               LTH=5                                                            
         MFLD  DATUM3,                                                 +        
               LTH=6                                                            
         MFLD  ARTNR3,                                                 +        
               LTH=9                                                            
         MFLD  ANTAL3,                                                 +        
               LTH=6                                                            
         MFLD  LAGOMR3,                                                +        
               LTH=2                                                            
         MFLD  GANG3,                                                  +        
               LTH=2                                                            
         MFLD  PLATS3,                                                 +        
               LTH=5                                                            
         MFLD  NOT3,                                                   +        
               LTH=20                                                           
         MFLD  CMD4,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TRPID4,                                                 +        
               LTH=5                                                            
         MFLD  DATUM4,                                                 +        
               LTH=6                                                            
         MFLD  ARTNR4,                                                 +        
               LTH=9                                                            
         MFLD  ANTAL4,                                                 +        
               LTH=6                                                            
         MFLD  LAGOMR4,                                                +        
               LTH=2                                                            
         MFLD  GANG4,                                                  +        
               LTH=2                                                            
         MFLD  PLATS4,                                                 +        
               LTH=5                                                            
         MFLD  NOT4,                                                   +        
               LTH=20                                                           
         MFLD  CMD5,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TRPID5,                                                 +        
               LTH=5                                                            
         MFLD  DATUM5,                                                 +        
               LTH=6                                                            
         MFLD  ARTNR5,                                                 +        
               LTH=9                                                            
         MFLD  ANTAL5,                                                 +        
               LTH=6                                                            
         MFLD  LAGOMR5,                                                +        
               LTH=2                                                            
         MFLD  GANG5,                                                  +        
               LTH=2                                                            
         MFLD  PLATS5,                                                 +        
               LTH=5                                                            
         MFLD  NOT5,                                                   +        
               LTH=20                                                           
         MFLD  CMD6,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TRPID6,                                                 +        
               LTH=5                                                            
         MFLD  DATUM6,                                                 +        
               LTH=6                                                            
         MFLD  ARTNR6,                                                 +        
               LTH=9                                                            
         MFLD  ANTAL6,                                                 +        
               LTH=6                                                            
         MFLD  LAGOMR6,                                                +        
               LTH=2                                                            
         MFLD  GANG6,                                                  +        
               LTH=2                                                            
         MFLD  PLATS6,                                                 +        
               LTH=5                                                            
         MFLD  NOT6,                                                   +        
               LTH=20                                                           
         MFLD  CMD7,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TRPID7,                                                 +        
               LTH=5                                                            
         MFLD  DATUM7,                                                 +        
               LTH=6                                                            
         MFLD  ARTNR7,                                                 +        
               LTH=9                                                            
         MFLD  ANTAL7,                                                 +        
               LTH=6                                                            
         MFLD  LAGOMR7,                                                +        
               LTH=2                                                            
         MFLD  GANG7,                                                  +        
               LTH=2                                                            
         MFLD  PLATS7,                                                 +        
               LTH=5                                                            
         MFLD  NOT7,                                                   +        
               LTH=20                                                           
         MFLD  CMD8,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TRPID8,                                                 +        
               LTH=5                                                            
         MFLD  DATUM8,                                                 +        
               LTH=6                                                            
         MFLD  ARTNR8,                                                 +        
               LTH=9                                                            
         MFLD  ANTAL8,                                                 +        
               LTH=6                                                            
         MFLD  LAGOMR8,                                                +        
               LTH=2                                                            
         MFLD  GANG8,                                                  +        
               LTH=2                                                            
         MFLD  PLATS8,                                                 +        
               LTH=5                                                            
         MFLD  NOT8,                                                   +        
               LTH=20                                                           
         MFLD  CMD9,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TRPID9,                                                 +        
               LTH=5                                                            
         MFLD  DATUM9,                                                 +        
               LTH=6                                                            
         MFLD  ARTNR9,                                                 +        
               LTH=9                                                            
         MFLD  ANTAL9,                                                 +        
               LTH=6                                                            
         MFLD  LAGOMR9,                                                +        
               LTH=2                                                            
         MFLD  GANG9,                                                  +        
               LTH=2                                                            
         MFLD  PLATS9,                                                 +        
               LTH=5                                                            
         MFLD  NOT9,                                                   +        
               LTH=20                                                           
         MFLD  CMD10,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TRPID10,                                                +        
               LTH=5                                                            
         MFLD  DATUM10,                                                +        
               LTH=6                                                            
         MFLD  ARTNR10,                                                +        
               LTH=9                                                            
         MFLD  ANTAL10,                                                +        
               LTH=6                                                            
         MFLD  LAGOMR10,                                               +        
               LTH=2                                                            
         MFLD  GANG10,                                                 +        
               LTH=2                                                            
         MFLD  PLATS10,                                                +        
               LTH=5                                                            
         MFLD  NOT10,                                                  +        
               LTH=20                                                           
         MFLD  CMD11,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TRPID11,                                                +        
               LTH=5                                                            
         MFLD  DATUM11,                                                +        
               LTH=6                                                            
         MFLD  ARTNR11,                                                +        
               LTH=9                                                            
         MFLD  ANTAL11,                                                +        
               LTH=6                                                            
         MFLD  LAGOMR11,                                               +        
               LTH=2                                                            
         MFLD  GANG11,                                                 +        
               LTH=2                                                            
         MFLD  PLATS11,                                                +        
               LTH=5                                                            
         MFLD  NOT11,                                                  +        
               LTH=20                                                           
         MFLD  CMD12,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TRPID12,                                                +        
               LTH=5                                                            
         MFLD  DATUM12,                                                +        
               LTH=6                                                            
         MFLD  ARTNR12,                                                +        
               LTH=9                                                            
         MFLD  ANTAL12,                                                +        
               LTH=6                                                            
         MFLD  LAGOMR12,                                               +        
               LTH=2                                                            
         MFLD  GANG12,                                                 +        
               LTH=2                                                            
         MFLD  PLATS12,                                                +        
               LTH=5                                                            
         MFLD  NOT12,                                                  +        
               LTH=20                                                           
         MFLD  CMD13,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TRPID13,                                                +        
               LTH=5                                                            
         MFLD  DATUM13,                                                +        
               LTH=6                                                            
         MFLD  ARTNR13,                                                +        
               LTH=9                                                            
         MFLD  ANTAL13,                                                +        
               LTH=6                                                            
         MFLD  LAGOMR13,                                               +        
               LTH=2                                                            
         MFLD  GANG13,                                                 +        
               LTH=2                                                            
         MFLD  PLATS13,                                                +        
               LTH=5                                                            
         MFLD  NOT13,                                                  +        
               LTH=20                                                           
         MFLD  LOSSNING,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LPL,                                                    +        
               LTH=4                                                            
         MFLD  PRINTER,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W6I15301 MSG   TYPE=INPUT,                                             +        
               SOR=(W6F153),                                           +        
               OPT=2,                                                  +        
               NXT=W6O15301                                                     
MID      LPAGE SOR=(W6F153),                                           +        
               NXT=W6O15301                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '61531',                                                +        
               LTH=5                                                            
         MFLD  (DESTIN,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DESTUT,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TRPIDIN,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TRPIDUT,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD1,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD2,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD3,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD4,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD5,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD6,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD7,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD8,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD9,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD10,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD11,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD12,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD13,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (LOSSNING,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (LPL,                                                   +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (PRINTER,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
