***********************************************************************         
* CREATED BY PC63442   ON 97/04/08  AT 17:52                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'REGISTRERA FLERA LEVERANTÖRER   '                               
W6F113   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W6T111  ',                                          +        
               14='W6T112  ',                                          +        
               15='W6T113  ',                                          +        
               16='W6T114  ',                                          +        
               17='W6T115  ',                                          +        
               18='W6T116  ',                                          +        
               19='W6T117  ',                                          +        
               20='W6T118  ',                                          +        
               21='W6T119  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W6F113   DPAGE CURSOR=((2,60)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Registrera flera leverantörer',                        +        
               POS=(1,11),LTH=29,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
IDLEVNRI DFLD  POS=(2,8),LTH=5,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
IDFSI    DFLD  POS=(2,19),LTH=8,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
AVIDATIN DFLD  POS=(2,35),LTH=6,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
INLPRTIN DFLD  POS=(2,50),LTH=4,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'DC',                                                   +        
               POS=(2,57),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDDCIN   DFLD  POS=(2,60),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
IDLEVNRU DFLD  POS=(3,8),LTH=5,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
IDFSU    DFLD  POS=(3,19),LTH=8,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
AVIDATUT DFLD  POS=(3,35),LTH=6,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
INLPRTUT DFLD  POS=(3,50),LTH=4,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
IDDCUT   DFLD  POS=(3,60),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Lastb',                                                +        
               POS=(5,2),LTH=5,                                        +        
               ATTR=(PROT)                                                      
IDLBBETI DFLD  POS=(5,8),LTH=12,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Godk(j/n)',                                            +        
               POS=(5,31),LTH=9,                                       +        
               ATTR=(PROT)                                                      
FLGODKI  DFLD  POS=(5,41),LTH=1,                                       +        
               ATTR=(PROT)                                                      
IDLBBETU DFLD  POS=(6,8),LTH=12,                                       +        
               ATTR=(PROT,MOD)                                                  
FLGODKU  DFLD  POS=(6,41),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Levnr  RT  FSnr',                                      +        
               POS=(7,2),LTH=15,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Avsdat  Artnr',                                        +        
               POS=(7,23),LTH=13,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Antal',                                                +        
               POS=(7,42),LTH=5,                                       +        
               ATTR=(PROT)                                                      
LEV1     DFLD  POS=(8,2),LTH=5,                                        +        
               ATTR=(NOPROT)                                                    
DGIA0000 DFLD  POS=(8,9),LTH=2,                                        +        
               ATTR=(NUM,NOPROT)                                                
FS1      DFLD  POS=(8,13),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0024 DFLD  POS=(8,23),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
ART1     DFLD  POS=(8,31),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0012 DFLD  POS=(8,42),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
LEV2     DFLD  POS=(9,2),LTH=5,                                        +        
               ATTR=(NOPROT)                                                    
DGIA0001 DFLD  POS=(9,9),LTH=2,                                        +        
               ATTR=(NUM,NOPROT)                                                
FS2      DFLD  POS=(9,13),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0025 DFLD  POS=(9,23),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
ART2     DFLD  POS=(9,31),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0013 DFLD  POS=(9,42),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
LEV3     DFLD  POS=(10,2),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0002 DFLD  POS=(10,9),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
FS3      DFLD  POS=(10,13),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0026 DFLD  POS=(10,23),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ART3     DFLD  POS=(10,31),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0014 DFLD  POS=(10,42),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
LEV4     DFLD  POS=(11,2),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0003 DFLD  POS=(11,9),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
FS4      DFLD  POS=(11,13),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0027 DFLD  POS=(11,23),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ART4     DFLD  POS=(11,31),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0015 DFLD  POS=(11,42),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
LEV5     DFLD  POS=(12,2),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0004 DFLD  POS=(12,9),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
FS5      DFLD  POS=(12,13),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0028 DFLD  POS=(12,23),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ART5     DFLD  POS=(12,31),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0016 DFLD  POS=(12,42),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
LEV6     DFLD  POS=(13,2),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0005 DFLD  POS=(13,9),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
FS6      DFLD  POS=(13,13),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0029 DFLD  POS=(13,23),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ART6     DFLD  POS=(13,31),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0017 DFLD  POS=(13,42),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
LEV7     DFLD  POS=(14,2),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0006 DFLD  POS=(14,9),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
FS7      DFLD  POS=(14,13),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0030 DFLD  POS=(14,23),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ART7     DFLD  POS=(14,31),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0018 DFLD  POS=(14,42),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
LEV8     DFLD  POS=(15,2),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0007 DFLD  POS=(15,9),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
FS8      DFLD  POS=(15,13),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0031 DFLD  POS=(15,23),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ART8     DFLD  POS=(15,31),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0019 DFLD  POS=(15,42),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
LEV9     DFLD  POS=(16,2),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0008 DFLD  POS=(16,9),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
FS9      DFLD  POS=(16,13),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0032 DFLD  POS=(16,23),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ART9     DFLD  POS=(16,31),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0020 DFLD  POS=(16,42),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
LEV10    DFLD  POS=(17,2),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0009 DFLD  POS=(17,9),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
FS10     DFLD  POS=(17,13),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0033 DFLD  POS=(17,23),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ART10    DFLD  POS=(17,31),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0021 DFLD  POS=(17,42),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
LEV11    DFLD  POS=(18,2),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0010 DFLD  POS=(18,9),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
FS11     DFLD  POS=(18,13),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0034 DFLD  POS=(18,23),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ART11    DFLD  POS=(18,31),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0022 DFLD  POS=(18,42),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
LEV12    DFLD  POS=(19,2),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0011 DFLD  POS=(19,9),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
FS12     DFLD  POS=(19,13),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0035 DFLD  POS=(19,23),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ART12    DFLD  POS=(19,31),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0023 DFLD  POS=(19,42),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
STOPPTKN DFLD  POS=(19,49),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
TRAP     DFLD  POS=(19,51),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
KDRTIN   DFLD  POS=(20,2),LTH=2,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
KDRTUT   DFLD  POS=(20,5),LTH=2,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
KLIVISIN DFLD  POS=(20,8),LTH=1,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
KLIVISUT DFLD  POS=(20,10),LTH=1,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
LOPNRIN  DFLD  POS=(20,12),LTH=8,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
LOPNRUT  DFLD  POS=(20,21),LTH=8,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  '13 Reg FS',                                            +        
               POS=(21,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '14 Reg 1 lev    15 Reg fler lev 16 Rätta FS',          +        
               POS=(21,18),LTH=43,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '17 Aktivera FS',                                       +        
               POS=(21,66),LTH=14,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '18 Reg FS konto 19 Reg R34-tran 20 Backa del    21 Mak.+        
                parti   10 WHELP',                                     +        
               POS=(22,2),LTH=72,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W6O11301 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6F113,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I11301,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W6F113                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDLEVNRI,                                               +        
               LTH=5                                                            
         MFLD  IDFSI,                                                  +        
               LTH=8                                                            
         MFLD  AVIDATIN,                                               +        
               LTH=6                                                            
         MFLD  INLPRTIN,                                               +        
               LTH=4                                                            
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  IDLEVNRU,                                               +        
               LTH=5                                                            
         MFLD  IDFSU,                                                  +        
               LTH=8                                                            
         MFLD  AVIDATUT,                                               +        
               LTH=6                                                            
         MFLD  INLPRTUT,                                               +        
               LTH=4                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  IDLBBETI,                                               +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLGODKI,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDLBBETU,                                               +        
               LTH=12                                                           
         MFLD  FLGODKU,                                                +        
               LTH=1                                                            
         MFLD  LEV1,                                                   +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEV2,                                                   +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEV3,                                                   +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEV4,                                                   +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEV5,                                                   +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEV6,                                                   +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEV7,                                                   +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEV8,                                                   +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEV9,                                                   +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEV10,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEV11,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEV12,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0000,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0001,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0002,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0003,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0004,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0005,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0006,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0007,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0008,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0009,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0010,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0011,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FS1,                                                    +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FS2,                                                    +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FS3,                                                    +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FS4,                                                    +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FS5,                                                    +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FS6,                                                    +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FS7,                                                    +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FS8,                                                    +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FS9,                                                    +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FS10,                                                   +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FS11,                                                   +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FS12,                                                   +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0024,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0025,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0026,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0027,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0028,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0029,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0030,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0031,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0032,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0033,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0034,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0035,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ART1,                                                   +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ART2,                                                   +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ART3,                                                   +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ART4,                                                   +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ART5,                                                   +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ART6,                                                   +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ART7,                                                   +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ART8,                                                   +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ART9,                                                   +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ART10,                                                  +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ART11,                                                  +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ART12,                                                  +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0012,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0013,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0014,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0015,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0016,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0017,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0018,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0019,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0020,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0021,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0022,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0023,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDRTIN,                                                 +        
               LTH=2                                                            
         MFLD  KDRTUT,                                                 +        
               LTH=2                                                            
         MFLD  KLIVISIN,                                               +        
               LTH=1                                                            
         MFLD  KLIVISUT,                                               +        
               LTH=1                                                            
         MFLD  LOPNRIN,                                                +        
               LTH=8                                                            
         MFLD  LOPNRUT,                                                +        
               LTH=8                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W6I11301 MSG   TYPE=INPUT,                                             +        
               SOR=(W6F113),                                           +        
               OPT=2,                                                  +        
               NXT=W6O11301                                                     
MID      LPAGE SOR=(W6F113)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '61131',                                                +        
               LTH=5                                                            
         MFLD  (IDLEVNRI,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  IDLEVNRU,                                               +        
               LTH=5                                                            
         MFLD  (IDFSI,                                                 +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  IDFSU,                                                  +        
               LTH=8                                                            
         MFLD  (AVIDATIN,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  AVIDATUT,                                               +        
               LTH=6                                                            
         MFLD  (INLPRTIN,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  INLPRTUT,                                               +        
               LTH=4                                                            
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  (KDRTIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KDRTUT,                                                 +        
               LTH=2                                                            
         MFLD  (IDLBBETI,                                              +        
               '++++++++++++'),                                        +        
               LTH=12                                                           
         MFLD  IDLBBETU,                                               +        
               LTH=12                                                           
         MFLD  (KLIVISIN,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  KLIVISUT,                                               +        
               LTH=1                                                            
         MFLD  (LOPNRIN,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  LOPNRUT,                                                +        
               LTH=8                                                            
         MFLD  (FLGODKI,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  FLGODKU,                                                +        
               LTH=1                                                            
         MFLD  (LEV1,                                                  +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (LEV2,                                                  +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (LEV3,                                                  +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (LEV4,                                                  +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (LEV5,                                                  +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (LEV6,                                                  +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (LEV7,                                                  +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (LEV8,                                                  +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (LEV9,                                                  +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (LEV10,                                                 +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (LEV11,                                                 +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (LEV12,                                                 +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0000,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0001,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0002,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0003,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0004,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0005,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0006,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0007,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0008,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0009,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0010,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0011,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FS1,                                                   +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (FS2,                                                   +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (FS3,                                                   +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (FS4,                                                   +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (FS5,                                                   +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (FS6,                                                   +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (FS7,                                                   +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (FS8,                                                   +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (FS9,                                                   +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (FS10,                                                  +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (FS11,                                                  +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (FS12,                                                  +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (DGIA0024,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0025,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0026,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0027,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0028,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0029,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0030,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0031,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0032,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0033,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0034,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0035,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ART1,                                                  +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ART2,                                                  +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ART3,                                                  +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ART4,                                                  +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ART5,                                                  +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ART6,                                                  +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ART7,                                                  +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ART8,                                                  +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ART9,                                                  +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ART10,                                                 +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ART11,                                                 +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ART12,                                                 +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0012,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0013,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0014,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0015,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0016,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0017,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0018,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0019,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0020,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0021,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0022,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0023,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
