***********************************************************************         
* CREATED BY V063442   ON 04/02/05  AT 10:41                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'REGISTRERING R34-TRANSAR        '                               
W6F117   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W6T117U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W6T111  ',                                          +        
               14='W6T112  ',                                          +        
               15='W6T113  ',                                          +        
               16='W6T114  ',                                          +        
               17='W6T115  ',                                          +        
               18='W6T116  ',                                          +        
               19='W6T117  ',                                          +        
               20='W6T118  ',                                          +        
               21='W6T119  ',                                          +        
               22='WHELP   ',                                          +        
               23='W6T117V ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W6F117   DPAGE CURSOR=((6,2)),                                         +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Registrering R34-transar',                             +        
               POS=(1,11),LTH=24,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'DC:',                                                  +        
               POS=(2,2),LTH=3,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDDCIN   DFLD  POS=(2,6),LTH=2,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDDCUT   DFLD  POS=(3,6),LTH=2,                                        +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Avidat',                                               +        
               POS=(4,20),LTH=6,                                       +        
               ATTR=(PROT)                                                      
TIAVIDA1 DFLD  POS=(4,27),LTH=6,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Artnr    Levnr RT Konto',                              +        
               POS=(5,2),LTH=23,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Avinr   Antal   Artnr fr Analysn',                     +        
               POS=(5,31),LTH=32,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Kst',                                                  +        
               POS=(5,69),LTH=3,                                       +        
               ATTR=(PROT)                                                      
IDARTNR1 DFLD  POS=(6,2),LTH=8,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDLEVNR1 DFLD  POS=(6,11),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
KDRT1    DFLD  POS=(6,17),LTH=2,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDKONTO1 DFLD  POS=(6,20),LTH=10,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDAVINR1 DFLD  POS=(6,31),LTH=7,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
KVAVIS1  DFLD  POS=(6,39),LTH=7,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDARTF1  DFLD  POS=(6,47),LTH=8,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
ANALYS1  DFLD  POS=(6,56),LTH=12,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
KST1     DFLD  POS=(6,69),LTH=10,                                      +        
               ATTR=(NOPROT,MOD)                                                
IDARTNR2 DFLD  POS=(7,2),LTH=8,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDLEVNR2 DFLD  POS=(7,11),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
KDRT2    DFLD  POS=(7,17),LTH=2,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDKONTO2 DFLD  POS=(7,20),LTH=10,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDAVINR2 DFLD  POS=(7,31),LTH=7,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
KVAVIS2  DFLD  POS=(7,39),LTH=7,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDARTF2  DFLD  POS=(7,47),LTH=8,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
ANALYS2  DFLD  POS=(7,56),LTH=12,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
KST2     DFLD  POS=(7,69),LTH=10,                                      +        
               ATTR=(NOPROT,MOD)                                                
IDARTNR3 DFLD  POS=(8,2),LTH=8,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDLEVNR3 DFLD  POS=(8,11),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
KDRT3    DFLD  POS=(8,17),LTH=2,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDKONTO3 DFLD  POS=(8,20),LTH=10,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDAVINR3 DFLD  POS=(8,31),LTH=7,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
KVAVIS3  DFLD  POS=(8,39),LTH=7,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDARTF3  DFLD  POS=(8,47),LTH=8,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
ANALYS3  DFLD  POS=(8,56),LTH=12,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
KST3     DFLD  POS=(8,69),LTH=10,                                      +        
               ATTR=(NOPROT,MOD)                                                
IDARTNR4 DFLD  POS=(9,2),LTH=8,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDLEVNR4 DFLD  POS=(9,11),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
KDRT4    DFLD  POS=(9,17),LTH=2,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDKONTO4 DFLD  POS=(9,20),LTH=10,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDAVINR4 DFLD  POS=(9,31),LTH=7,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
KVAVIS4  DFLD  POS=(9,39),LTH=7,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDARTF4  DFLD  POS=(9,47),LTH=8,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
ANALYS4  DFLD  POS=(9,56),LTH=12,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
KST4     DFLD  POS=(9,69),LTH=10,                                      +        
               ATTR=(NOPROT,MOD)                                                
IDARTNR5 DFLD  POS=(10,2),LTH=8,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDLEVNR5 DFLD  POS=(10,11),LTH=5,                                      +        
               ATTR=(NOPROT,MOD)                                                
KDRT5    DFLD  POS=(10,17),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDKONTO5 DFLD  POS=(10,20),LTH=10,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDAVINR5 DFLD  POS=(10,31),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
KVAVIS5  DFLD  POS=(10,39),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDARTF5  DFLD  POS=(10,47),LTH=8,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
ANALYS5  DFLD  POS=(10,56),LTH=12,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
KST5     DFLD  POS=(10,69),LTH=10,                                     +        
               ATTR=(NOPROT,MOD)                                                
IDARTNR6 DFLD  POS=(11,2),LTH=8,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDLEVNR6 DFLD  POS=(11,11),LTH=5,                                      +        
               ATTR=(NOPROT,MOD)                                                
KDRT6    DFLD  POS=(11,17),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDKONTO6 DFLD  POS=(11,20),LTH=10,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDAVINR6 DFLD  POS=(11,31),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
KVAVIS6  DFLD  POS=(11,39),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDARTF6  DFLD  POS=(11,47),LTH=8,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
ANALYS6  DFLD  POS=(11,56),LTH=12,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
KST6     DFLD  POS=(11,69),LTH=10,                                     +        
               ATTR=(NOPROT,MOD)                                                
IDARTNR7 DFLD  POS=(12,2),LTH=8,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDLEVNR7 DFLD  POS=(12,11),LTH=5,                                      +        
               ATTR=(NOPROT,MOD)                                                
KDRT7    DFLD  POS=(12,17),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDKONTO7 DFLD  POS=(12,20),LTH=10,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDAVINR7 DFLD  POS=(12,31),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
KVAVIS7  DFLD  POS=(12,39),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDARTF7  DFLD  POS=(12,47),LTH=8,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
ANALYS7  DFLD  POS=(12,56),LTH=12,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
KST7     DFLD  POS=(12,69),LTH=10,                                     +        
               ATTR=(NOPROT,MOD)                                                
IDARTNR8 DFLD  POS=(13,2),LTH=8,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDLEVNR8 DFLD  POS=(13,11),LTH=5,                                      +        
               ATTR=(NOPROT,MOD)                                                
KDRT8    DFLD  POS=(13,17),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDKONTO8 DFLD  POS=(13,20),LTH=10,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDAVINR8 DFLD  POS=(13,31),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
KVAVIS8  DFLD  POS=(13,39),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDARTF8  DFLD  POS=(13,47),LTH=8,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
ANALYS8  DFLD  POS=(13,56),LTH=12,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
KST8     DFLD  POS=(13,69),LTH=10,                                     +        
               ATTR=(NOPROT,MOD)                                                
IDARTNR9 DFLD  POS=(14,2),LTH=8,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDLEVNR9 DFLD  POS=(14,11),LTH=5,                                      +        
               ATTR=(NOPROT,MOD)                                                
KDRT9    DFLD  POS=(14,17),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDKONTO9 DFLD  POS=(14,20),LTH=10,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDAVINR9 DFLD  POS=(14,31),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
KVAVIS9  DFLD  POS=(14,39),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDARTF9  DFLD  POS=(14,47),LTH=8,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
ANALYS9  DFLD  POS=(14,56),LTH=12,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
KST9     DFLD  POS=(14,69),LTH=10,                                     +        
               ATTR=(NOPROT,MOD)                                                
IDARTN10 DFLD  POS=(15,2),LTH=8,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDLEVN10 DFLD  POS=(15,11),LTH=5,                                      +        
               ATTR=(NOPROT,MOD)                                                
KDRT10   DFLD  POS=(15,17),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDKONT10 DFLD  POS=(15,20),LTH=10,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDAVIN10 DFLD  POS=(15,31),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
KVAVIS10 DFLD  POS=(15,39),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDARTF10 DFLD  POS=(15,47),LTH=8,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
ANALYS10 DFLD  POS=(15,56),LTH=12,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
KST10    DFLD  POS=(15,69),LTH=10,                                     +        
               ATTR=(NOPROT,MOD)                                                
IDARTN11 DFLD  POS=(16,2),LTH=8,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDLEVN11 DFLD  POS=(16,11),LTH=5,                                      +        
               ATTR=(NOPROT,MOD)                                                
KDRT11   DFLD  POS=(16,17),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDKONT11 DFLD  POS=(16,20),LTH=10,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDAVIN11 DFLD  POS=(16,31),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
KVAVIS11 DFLD  POS=(16,39),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDARTF11 DFLD  POS=(16,47),LTH=8,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
ANALYS11 DFLD  POS=(16,56),LTH=12,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
KST11    DFLD  POS=(16,69),LTH=10,                                     +        
               ATTR=(NOPROT,MOD)                                                
IDARTN12 DFLD  POS=(17,2),LTH=8,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDLEVN12 DFLD  POS=(17,11),LTH=5,                                      +        
               ATTR=(NOPROT,MOD)                                                
KDRT12   DFLD  POS=(17,17),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDKONT12 DFLD  POS=(17,20),LTH=10,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDAVIN12 DFLD  POS=(17,31),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
KVAVIS12 DFLD  POS=(17,39),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDARTF12 DFLD  POS=(17,47),LTH=8,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
ANALYS12 DFLD  POS=(17,56),LTH=12,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
KST12    DFLD  POS=(17,69),LTH=10,                                     +        
               ATTR=(NOPROT,MOD)                                                
IDARTN13 DFLD  POS=(18,2),LTH=8,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDLEVN13 DFLD  POS=(18,11),LTH=5,                                      +        
               ATTR=(NOPROT,MOD)                                                
KDRT13   DFLD  POS=(18,17),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDKONT13 DFLD  POS=(18,20),LTH=10,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDAVIN13 DFLD  POS=(18,31),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
KVAVIS13 DFLD  POS=(18,39),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDARTF13 DFLD  POS=(18,47),LTH=8,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
ANALYS13 DFLD  POS=(18,56),LTH=12,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
KST13    DFLD  POS=(18,69),LTH=10,                                     +        
               ATTR=(NOPROT,MOD)                                                
IDARTN14 DFLD  POS=(19,2),LTH=8,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDLEVN14 DFLD  POS=(19,11),LTH=5,                                      +        
               ATTR=(NOPROT,MOD)                                                
KDRT14   DFLD  POS=(19,17),LTH=2,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDKONT14 DFLD  POS=(19,20),LTH=10,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDAVIN14 DFLD  POS=(19,31),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
KVAVIS14 DFLD  POS=(19,39),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDARTF14 DFLD  POS=(19,47),LTH=8,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
ANALYS14 DFLD  POS=(19,56),LTH=12,                                     +        
               ATTR=(NUM,NOPROT,MOD)                                            
KST14    DFLD  POS=(19,69),LTH=10,                                     +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  '13 Reg FS',                                            +        
               POS=(21,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '14 Reg 1 lev    15 Reg fler lev 16 Rätta FS',          +        
               POS=(21,18),LTH=43,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '17 Aktivera FS',                                       +        
               POS=(21,66),LTH=14,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '18 Reg FS konto 19 Reg R34-tran 20 Backa del    21 Mak.+        
                parti   10 WHELP',                                     +        
               POS=(22,2),LTH=72,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W6O11701 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6F117,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I11701,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W6F117                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDDCIN,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDDCUT,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TIAVIDA1,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTNR1,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVNR1,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDRT1,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKONTO1,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDAVINR1,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVAVIS1,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTF1,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ANALYS1,                                                +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KST1,                                                   +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDARTNR2,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVNR2,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDRT2,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKONTO2,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDAVINR2,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVAVIS2,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTF2,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ANALYS2,                                                +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KST2,                                                   +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDARTNR3,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVNR3,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDRT3,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKONTO3,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDAVINR3,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVAVIS3,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTF3,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ANALYS3,                                                +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KST3,                                                   +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDARTNR4,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVNR4,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDRT4,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKONTO4,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDAVINR4,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVAVIS4,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTF4,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ANALYS4,                                                +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KST4,                                                   +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDARTNR5,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVNR5,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDRT5,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKONTO5,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDAVINR5,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVAVIS5,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTF5,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ANALYS5,                                                +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KST5,                                                   +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDARTNR6,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVNR6,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDRT6,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKONTO6,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDAVINR6,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVAVIS6,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTF6,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ANALYS6,                                                +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KST6,                                                   +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDARTNR7,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVNR7,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDRT7,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKONTO7,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDAVINR7,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVAVIS7,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTF7,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ANALYS7,                                                +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KST7,                                                   +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDARTNR8,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVNR8,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDRT8,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKONTO8,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDAVINR8,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVAVIS8,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTF8,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ANALYS8,                                                +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KST8,                                                   +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDARTNR9,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVNR9,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDRT9,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKONTO9,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDAVINR9,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVAVIS9,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTF9,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ANALYS9,                                                +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KST9,                                                   +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDARTN10,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVN10,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDRT10,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKONT10,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDAVIN10,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVAVIS10,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTF10,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ANALYS10,                                               +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KST10,                                                  +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDARTN11,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVN11,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDRT11,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKONT11,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDAVIN11,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVAVIS11,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTF11,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ANALYS11,                                               +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KST11,                                                  +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDARTN12,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVN12,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDRT12,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKONT12,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDAVIN12,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVAVIS12,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTF12,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ANALYS12,                                               +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KST12,                                                  +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDARTN13,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVN13,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDRT13,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKONT13,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDAVIN13,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVAVIS13,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTF13,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ANALYS13,                                               +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KST13,                                                  +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDARTN14,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVN14,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDRT14,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKONT14,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDAVIN14,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVAVIS14,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTF14,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ANALYS14,                                               +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KST14,                                                  +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W6I11701 MSG   TYPE=INPUT,                                             +        
               SOR=(W6F117),                                           +        
               OPT=2,                                                  +        
               NXT=W6O11701                                                     
MID      LPAGE SOR=(W6F117)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS1,                                              +        
               '6'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS2,                                              +        
               '1'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  (IDTRANS3,                                              +        
               '1'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  (IDTRANS4,                                              +        
               '7'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '61171',                                                +        
               LTH=5                                                            
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDDCUT,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TIAVIDA1,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDARTNR1,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLEVNR1,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KDRT1,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDKONTO1,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDAVINR1,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVAVIS1,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDARTF1,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANALYS1,                                               +        
               '++++++++++++'),                                        +        
               LTH=12,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KST1,                                                  +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDARTNR2,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLEVNR2,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KDRT2,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDKONTO2,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDAVINR2,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVAVIS2,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDARTF2,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANALYS2,                                               +        
               '++++++++++++'),                                        +        
               LTH=12,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KST2,                                                  +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDARTNR3,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLEVNR3,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KDRT3,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDKONTO3,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDAVINR3,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVAVIS3,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDARTF3,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANALYS3,                                               +        
               '++++++++++++'),                                        +        
               LTH=12,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KST3,                                                  +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDARTNR4,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLEVNR4,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KDRT4,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDKONTO4,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDAVINR4,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVAVIS4,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDARTF4,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANALYS4,                                               +        
               '++++++++++++'),                                        +        
               LTH=12,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KST4,                                                  +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDARTNR5,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLEVNR5,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KDRT5,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDKONTO5,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDAVINR5,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVAVIS5,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDARTF5,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANALYS5,                                               +        
               '++++++++++++'),                                        +        
               LTH=12,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KST5,                                                  +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDARTNR6,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLEVNR6,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KDRT6,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDKONTO6,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDAVINR6,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVAVIS6,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDARTF6,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANALYS6,                                               +        
               '++++++++++++'),                                        +        
               LTH=12,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KST6,                                                  +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDARTNR7,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLEVNR7,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KDRT7,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDKONTO7,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDAVINR7,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVAVIS7,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDARTF7,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANALYS7,                                               +        
               '++++++++++++'),                                        +        
               LTH=12,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KST7,                                                  +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDARTNR8,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLEVNR8,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KDRT8,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDKONTO8,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDAVINR8,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVAVIS8,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDARTF8,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANALYS8,                                               +        
               '++++++++++++'),                                        +        
               LTH=12,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KST8,                                                  +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDARTNR9,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLEVNR9,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KDRT9,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDKONTO9,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDAVINR9,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVAVIS9,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDARTF9,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANALYS9,                                               +        
               '++++++++++++'),                                        +        
               LTH=12,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KST9,                                                  +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDARTN10,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLEVN10,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KDRT10,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDKONT10,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDAVIN10,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVAVIS10,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDARTF10,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANALYS10,                                              +        
               '++++++++++++'),                                        +        
               LTH=12,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KST10,                                                 +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDARTN11,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLEVN11,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KDRT11,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDKONT11,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDAVIN11,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVAVIS11,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDARTF11,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANALYS11,                                              +        
               '++++++++++++'),                                        +        
               LTH=12,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KST11,                                                 +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDARTN12,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLEVN12,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KDRT12,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDKONT12,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDAVIN12,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVAVIS12,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDARTF12,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANALYS12,                                              +        
               '++++++++++++'),                                        +        
               LTH=12,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KST12,                                                 +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDARTN13,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLEVN13,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KDRT13,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDKONT13,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDAVIN13,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVAVIS13,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDARTF13,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANALYS13,                                              +        
               '++++++++++++'),                                        +        
               LTH=12,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KST13,                                                 +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDARTN14,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLEVN14,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KDRT14,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDKONT14,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDAVIN14,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVAVIS14,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDARTF14,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANALYS14,                                              +        
               '++++++++++++'),                                        +        
               LTH=12,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KST14,                                                 +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
