***********************************************************************         
* CREATED BY PCC4448   ON 94/11/17  AT 10:40                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'DEFINIERA STYRPARAMETRAR        '                               
W6F108   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W6T101  ',                                          +        
               14='W6T102  ',                                          +        
               15='W6T103  ',                                          +        
               16='W6T104  ',                                          +        
               17='W6T105  ',                                          +        
               18='W6T106  ',                                          +        
               19='W6T107  ',                                          +        
               20='W6T108  ',                                          +        
               21='W6T109  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W6F108   DPAGE CURSOR=((2,8))                                                   
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Fråga på förbehandlingsadr',                           +        
               POS=(1,12),LTH=26,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Artnr',                                                +        
               POS=(2,2),LTH=5,                                        +        
               ATTR=(ALPHA,PROT)                                                
DGIA0000 DFLD  POS=(2,8),LTH=9,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Levnr',                                                +        
               POS=(2,19),LTH=5,                                       +        
               ATTR=(PROT)                                                      
IDLEVNRI DFLD  POS=(2,25),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'DC',                                                   +        
               POS=(2,32),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDDCIN   DFLD  POS=(2,35),LTH=2,                                       +        
               ATTR=(ALPHA,NOPROT)                                              
DGIA0001 DFLD  POS=(3,8),LTH=9,                                        +        
               ATTR=(PROT,MOD)                                                  
IDLEVNRU DFLD  POS=(3,25),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDCUT   DFLD  POS=(3,35),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'FB',                                                   +        
               POS=(5,2),LTH=2,                                        +        
               ATTR=(PROT)                                                      
FB       DFLD  POS=(5,8),LTH=4,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'F',                                                    +        
               POS=(5,15),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FP       DFLD  POS=(5,17),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'LO',                                                   +        
               POS=(5,23),LTH=2,                                       +        
               ATTR=(PROT)                                                      
LO       DFLD  POS=(5,26),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Inleverans grupps ansvarig:',                          +        
               POS=(7,2),LTH=27,                                       +        
               ATTR=(PROT)                                                      
NAMNINLE DFLD  POS=(7,33),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Tel',                                                  +        
               POS=(7,59),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
TELINLE  DFLD  POS=(7,63),LTH=15,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Lagerområdes ansvarig',                                +        
               POS=(9,2),LTH=21,                                       +        
               ATTR=(PROT)                                                      
         DFLD  ':',                                                    +        
               POS=(9,28),LTH=1,                                       +        
               ATTR=(PROT)                                                      
NAMNLO   DFLD  POS=(9,33),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Tel',                                                  +        
               POS=(9,59),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
TELLO    DFLD  POS=(9,63),LTH=15,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Anskaffare',                                           +        
               POS=(11,2),LTH=10,                                      +        
               ATTR=(PROT)                                                      
         DFLD  ':',                                                    +        
               POS=(11,28),LTH=1,                                      +        
               ATTR=(PROT)                                                      
NAMNANSK DFLD  POS=(11,33),LTH=25,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Tel',                                                  +        
               POS=(11,59),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
TELANSK  DFLD  POS=(11,63),LTH=15,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Beredare',                                             +        
               POS=(13,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  ':',                                                    +        
               POS=(13,28),LTH=1,                                      +        
               ATTR=(PROT)                                                      
NAMNBER  DFLD  POS=(13,33),LTH=25,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Tel',                                                  +        
               POS=(13,59),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
TELBER   DFLD  POS=(13,63),LTH=15,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Inköpare',                                             +        
               POS=(15,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  ':',                                                    +        
               POS=(15,28),LTH=1,                                      +        
               ATTR=(PROT)                                                      
NAMNINK  DFLD  POS=(15,33),LTH=25,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Tel',                                                  +        
               POS=(15,59),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
TELINK   DFLD  POS=(15,63),LTH=15,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Förpacknings tekniker',                                +        
               POS=(17,2),LTH=21,                                      +        
               ATTR=(PROT)                                                      
         DFLD  ':',                                                    +        
               POS=(17,28),LTH=1,                                      +        
               ATTR=(PROT)                                                      
NAMNFORP DFLD  POS=(17,33),LTH=25,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Tel',                                                  +        
               POS=(17,59),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
TELFORP  DFLD  POS=(17,63),LTH=15,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Kvalitets tekniker',                                   +        
               POS=(19,2),LTH=18,                                      +        
               ATTR=(PROT)                                                      
         DFLD  ':',                                                    +        
               POS=(19,28),LTH=1,                                      +        
               ATTR=(PROT)                                                      
NAMNKVAL DFLD  POS=(19,33),LTH=25,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Tel',                                                  +        
               POS=(19,59),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
TELKVAL  DFLD  POS=(19,63),LTH=15,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '13 Adm vagn',                                          +        
               POS=(21,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '14 Flytta kolli 15 Ers flagga   16 Utplock VOR  17 Def +        
               styr',                                                  +        
               POS=(21,18),LTH=59,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '18 Def plac',                                          +        
               POS=(22,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '19 Fråga plac   20 Fråga FB/F   21 AR - info    10 RHEL+        
               P',                                                     +        
               POS=(22,18),LTH=56,                                     +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W6I10801 MSG   TYPE=INPUT,                                             +        
               SOR=(W6F108),                                           +        
               OPT=2,                                                  +        
               NXT=W6O10801                                                     
MID      LPAGE SOR=(W6F108)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS1,                                              +        
               ' '),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS2,                                              +        
               ' '),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  (IDTRANS3,                                              +        
               ' '),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F8'                                                       
         MFLD  ' ',                                                    +        
               LTH=2                                                            
         MFLD  '61081',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0000,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0001,                                               +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLEVNRI,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  IDLEVNRU,                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDCUT,                                                 +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
W6O10801 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6F108,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I10801,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W6F108                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DGIA0000,                                               +        
               LTH=9                                                            
         MFLD  DGIA0001,                                               +        
               LTH=9                                                            
         MFLD  IDLEVNRI,                                               +        
               LTH=5                                                            
         MFLD  IDLEVNRU,                                               +        
               LTH=5                                                            
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  FB,                                                     +        
               LTH=4                                                            
         MFLD  FP,                                                     +        
               LTH=4                                                            
         MFLD  LO,                                                     +        
               LTH=2                                                            
         MFLD  NAMNINLE,                                               +        
               LTH=40                                                           
         MFLD  TELINLE,                                                +        
               LTH=20                                                           
         MFLD  NAMNLO,                                                 +        
               LTH=40                                                           
         MFLD  TELLO,                                                  +        
               LTH=20                                                           
         MFLD  NAMNANSK,                                               +        
               LTH=40                                                           
         MFLD  TELANSK,                                                +        
               LTH=20                                                           
         MFLD  NAMNBER,                                                +        
               LTH=40                                                           
         MFLD  TELBER,                                                 +        
               LTH=20                                                           
         MFLD  NAMNINK,                                                +        
               LTH=40                                                           
         MFLD  TELINK,                                                 +        
               LTH=20                                                           
         MFLD  NAMNFORP,                                               +        
               LTH=40                                                           
         MFLD  TELFORP,                                                +        
               LTH=20                                                           
         MFLD  NAMNKVAL,                                               +        
               LTH=40                                                           
         MFLD  TELKVAL,                                                +        
               LTH=20                                                           
         MFLD  TEMFSINF,                                               +        
               LTH=61                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  FSYSMSG,                                                +        
               LTH=79                                                           
         MSGEND                                                                 
         END                                                                    
