***********************************************************************         
* CREATED BY V063442   oN 99/11/18  AT 13:34                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'MOTTAGNINGSKONTROLL             '                               
W6F139   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W6T139 7',                                           +        
               8='W6T139 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W6T139U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W6T131  ',                                          +        
               14='W6T132  ',                                          +        
               15='W6T133  ',                                          +        
               16='W0T501  ',                                          +        
               17='W6T135  ',                                          +        
               18='W6T136  ',                                          +        
               19='W6T137  ',                                          +        
               20='W0T501  ',                                          +        
               21='W6T139  ',                                          +        
               22='WHELP   ',                                          +        
               23='W6T139V ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W6F139   DPAGE CURSOR=((2,10)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'MOTTAGNINGSKONTROLL',                                  +        
               POS=(1,11),LTH=19,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Partinr',                                              +        
               POS=(2,2),LTH=7,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDLOPNIN DFLD  POS=(2,10),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,21),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDDCIN   DFLD  POS=(2,24),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
IDLOPNUT DFLD  POS=(3,10),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDCUT   DFLD  POS=(3,24),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
IDKRE    DFLD  POS=(4,2),LTH=5,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
IDKRN    DFLD  POS=(4,8),LTH=5,                                        +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDKVAINE DFLD  POS=(4,14),LTH=2,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDKVAINN DFLD  POS=(4,17),LTH=2,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KBEFTTI  DFLD  POS=(4,41),LTH=2,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
KBEFTTU  DFLD  POS=(4,44),LTH=2,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         DFLD  'Artnr',                                                +        
               POS=(5,2),LTH=5,                                        +        
               ATTR=(PROT)                                                      
IDARTNR  DFLD  POS=(5,8),LTH=9,                                        +        
               ATTR=(PROT)                                                      
BEART    DFLD  POS=(5,18),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Levart',                                               +        
               POS=(5,44),LTH=6,                                       +        
               ATTR=(ALPHA,PROT)                                                
BELEVART DFLD  POS=(5,51),LTH=30,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Lev',                                                  +        
               POS=(6,2),LTH=3,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDLEVNR  DFLD  POS=(6,12),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Avis.ant.',                                            +        
               POS=(6,41),LTH=9,                                       +        
               ATTR=(PROT)                                                      
KVAVIS   DFLD  POS=(6,51),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Antal   Anstnr    Godk',                               +        
               POS=(8,12),LTH=22,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Till 6202 KR',                                         +        
               POS=(8,44),LTH=12,                                      +        
               ATTR=(PROT)                                                      
FLAGGAKR DFLD  POS=(8,57),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Primär',                                               +        
               POS=(9,2),LTH=6,                                        +        
               ATTR=(PROT)                                                      
KVKVAPRI DFLD  POS=(9,11),LTH=6,                                       +        
               ATTR=(PROT)                                                      
USERPRI  DFLD  POS=(9,20),LTH=8,                                       +        
               ATTR=(NOPROT)                                                    
FLAGGAGP DFLD  POS=(9,31),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Ej kontroll',                                          +        
               POS=(9,44),LTH=11,                                      +        
               ATTR=(PROT)                                                      
BEANST   DFLD  POS=(9,56),LTH=25,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Adm',                                                  +        
               POS=(10,2),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
USERADM  DFLD  POS=(10,20),LTH=8,                                      +        
               ATTR=(NOPROT)                                                    
FLAGGAGA DFLD  POS=(10,31),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Sekundär',                                             +        
               POS=(11,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
KVKVASEK DFLD  POS=(11,11),LTH=6,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  ' ',                                                    +        
               POS=(11,18),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
USERSEK  DFLD  POS=(11,20),LTH=8,                                      +        
               ATTR=(NOPROT)                                                    
FLAGGAGS DFLD  POS=(11,31),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Kontroll',                                             +        
               POS=(12,14),LTH=8,                                      +        
               ATTR=(PROT)                                                      
KDKVATYP DFLD  POS=(12,23),LTH=15,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Plats',                                                +        
               POS=(13,2),LTH=5,                                       +        
               ATTR=(PROT)                                                      
ADKVAULG DFLD  POS=(13,11),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Underlag',                                             +        
               POS=(13,14),LTH=8,                                      +        
               ATTR=(ALPHA,PROT)                                                
KDKVAULG DFLD  POS=(13,23),LTH=15,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Ansvarig',                                             +        
               POS=(13,44),LTH=8,                                      +        
               ATTR=(PROT)                                                      
BEANSVAR DFLD  POS=(13,53),LTH=25,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Telefon',                                              +        
               POS=(14,44),LTH=7,                                      +        
               ATTR=(PROT)                                                      
IDTFN    DFLD  POS=(14,53),LTH=20,                                     +        
               ATTR=(PROT)                                                      
KONTROLL DFLD  POS=(15,2),LTH=17,                                      +        
               ATTR=(PROT)                                                      
IDKR     DFLD  POS=(15,20),LTH=5,                                      +        
               ATTR=(PROT)                                                      
GODKTEXT DFLD  POS=(15,44),LTH=9,                                      +        
               ATTR=(PROT)                                                      
FLAGGAG  DFLD  POS=(15,54),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
EMPLID   DFLD  POS=(15,60),LTH=8,                                      +        
               ATTR=(PROT)                                                      
USERID   DFLD  POS=(15,69),LTH=8,                                      +        
               ATTR=(NOPROT)                                                    
BEKRFEL1 DFLD  POS=(16,2),LTH=70,                                      +        
               ATTR=(PROT)                                                      
BEKRFEL2 DFLD  POS=(17,2),LTH=70,                                      +        
               ATTR=(PROT)                                                      
BEKRFEL3 DFLD  POS=(18,2),LTH=70,                                      +        
               ATTR=(PROT)                                                      
BEKRFEL4 DFLD  POS=(19,2),LTH=70,                                      +        
               ATTR=(PROT)                                                      
ADINLOMR DFLD  POS=(20,2),LTH=4,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
IDVGNIN  DFLD  POS=(20,7),LTH=3,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
IDVGNUT  DFLD  POS=(20,11),LTH=3,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
ADINLOIN DFLD  POS=(20,15),LTH=4,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
ADINLOUT DFLD  POS=(20,20),LTH=4,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
ADINLNIN DFLD  POS=(20,25),LTH=4,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
ADINLNUT DFLD  POS=(20,30),LTH=4,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
KDINLQIN DFLD  POS=(20,35),LTH=1,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
KDINLQUT DFLD  POS=(20,37),LTH=1,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
BEFTI    DFLD  POS=(20,39),LTH=2,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
BEFTU    DFLD  POS=(20,42),LTH=2,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
FLINLFBI DFLD  POS=(20,45),LTH=1,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
FLINLFBU DFLD  POS=(20,47),LTH=1,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
LEVKOLIN DFLD  POS=(20,49),LTH=5,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
LEVKOLUT DFLD  POS=(20,55),LTH=5,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
KOLLIIN  DFLD  POS=(20,61),LTH=9,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
KOLLIUT  DFLD  POS=(20,71),LTH=9,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  '13 KOLLI/VAGN   14 KOLLI KÖ',                          +        
               POS=(21,2),LTH=27,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15 ÅTG/PARTI    16',                                   +        
               POS=(21,34),LTH=18,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '17 TA BORT koll',                                      +        
               POS=(21,66),LTH=15,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '18 SKAPA KOLLI  19 DIV KOLLI    20',                   +        
               POS=(22,2),LTH=34,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21 MOTTAGNING   10 WHELP',                             +        
               POS=(22,50),LTH=24,                                     +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W6O13901 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6F139,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I13901,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W6F139,                                             +        
               NXT=W6I13901                                                     
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDLOPNIN,                                               +        
               LTH=9                                                            
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  IDLOPNUT,                                               +        
               LTH=9                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  IDKRE,                                                  +        
               LTH=5                                                            
         MFLD  IDKRN,                                                  +        
               LTH=5                                                            
         MFLD  IDKVAINE,                                               +        
               LTH=2                                                            
         MFLD  IDKVAINN,                                               +        
               LTH=2                                                            
         MFLD  IDARTNR,                                                +        
               LTH=9                                                            
         MFLD  BEART,                                                  +        
               LTH=25                                                           
         MFLD  BELEVART,                                               +        
               LTH=30                                                           
         MFLD  IDLEVNR,                                                +        
               LTH=5                                                            
         MFLD  KVAVIS,                                                 +        
               LTH=7                                                            
         MFLD  FLAGGAKR,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVKVAPRI,                                               +        
               LTH=6                                                            
         MFLD  USERPRI,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLAGGAGP,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BEANST,                                                 +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVKVASEK,                                               +        
               LTH=6                                                            
         MFLD  USERSEK,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLAGGAGS,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  USERADM,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLAGGAGA,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDKVATYP,                                               +        
               LTH=15                                                           
         MFLD  ADKVAULG,                                               +        
               LTH=2                                                            
         MFLD  KDKVAULG,                                               +        
               LTH=15                                                           
         MFLD  BEANSVAR,                                               +        
               LTH=25                                                           
         MFLD  KONTROLL,                                               +        
               LTH=17                                                           
         MFLD  IDKR,                                                   +        
               LTH=5                                                            
         MFLD  GODKTEXT,                                               +        
               LTH=9                                                            
         MFLD  FLAGGAG,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  EMPLID,                                                 +        
               LTH=8                                                            
         MFLD  USERID,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDTFN,                                                  +        
               LTH=20                                                           
         MFLD  BEKRFEL1,                                               +        
               LTH=70                                                           
         MFLD  BEKRFEL2,                                               +        
               LTH=70                                                           
         MFLD  BEKRFEL3,                                               +        
               LTH=70                                                           
         MFLD  BEKRFEL4,                                               +        
               LTH=70                                                           
         MFLD  ADINLOMR,                                               +        
               LTH=4                                                            
         MFLD  IDVGNIN,                                                +        
               LTH=3                                                            
         MFLD  IDVGNUT,                                                +        
               LTH=3                                                            
         MFLD  ADINLOIN,                                               +        
               LTH=4                                                            
         MFLD  ADINLOUT,                                               +        
               LTH=4                                                            
         MFLD  ADINLNIN,                                               +        
               LTH=4                                                            
         MFLD  ADINLNUT,                                               +        
               LTH=4                                                            
         MFLD  KDINLQIN,                                               +        
               LTH=1                                                            
         MFLD  KDINLQUT,                                               +        
               LTH=1                                                            
         MFLD  BEFTI,                                                  +        
               LTH=2                                                            
         MFLD  BEFTU,                                                  +        
               LTH=2                                                            
         MFLD  KBEFTTI,                                                +        
               LTH=2                                                            
         MFLD  KBEFTTU,                                                +        
               LTH=2                                                            
         MFLD  FLINLFBI,                                               +        
               LTH=1                                                            
         MFLD  FLINLFBU,                                               +        
               LTH=1                                                            
         MFLD  LEVKOLIN,                                               +        
               LTH=5                                                            
         MFLD  LEVKOLUT,                                               +        
               LTH=5                                                            
         MFLD  KOLLIIN,                                                +        
               LTH=9                                                            
         MFLD  KOLLIUT,                                                +        
               LTH=9                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=61                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W6I13901 MSG   TYPE=INPUT,                                             +        
               SOR=(W6F139),                                           +        
               OPT=2,                                                  +        
               NXT=W6O13601                                                     
MID      LPAGE SOR=(W6F139),                                           +        
               NXT=W6O13601                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F9'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '61391',                                                +        
               LTH=5                                                            
         MFLD  (ADINLOMR,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (IDVGNIN,                                               +        
               '+++'),                                                 +        
               LTH=3                                                            
         MFLD  (IDVGNUT,                                               +        
               '   '),                                                 +        
               LTH=3                                                            
         MFLD  (ADINLOIN,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (ADINLOUT,                                              +        
               '    '),                                                +        
               LTH=4                                                            
         MFLD  (ADINLNIN,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (ADINLNUT,                                              +        
               '    '),                                                +        
               LTH=4                                                            
         MFLD  (KDINLQIN,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (KDINLQUT,                                              +        
               ' '),                                                   +        
               LTH=1                                                            
         MFLD  (BEFTI,                                                 +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  (BEFTU,                                                 +        
               '  '),                                                  +        
               LTH=2                                                            
         MFLD  (KBEFTTI,                                               +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  (KBEFTTU,                                               +        
               '  '),                                                  +        
               LTH=2                                                            
         MFLD  (FLINLFBI,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (FLINLFBU,                                              +        
               ' '),                                                   +        
               LTH=1                                                            
         MFLD  (LEVKOLIN,                                              +        
               '+++++'),                                               +        
               LTH=5                                                            
         MFLD  (LEVKOLUT,                                              +        
               '     '),                                               +        
               LTH=5                                                            
         MFLD  (KOLLIIN,                                               +        
               '+++++++++'),                                           +        
               LTH=9                                                            
         MFLD  (KOLLIUT,                                               +        
               '         '),                                           +        
               LTH=9                                                            
         MFLD  (IDLOPNIN,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLOPNUT,                                              +        
               '         '),                                           +        
               LTH=9,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDCUT,                                                 +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDKRE,                                                  +        
               LTH=5                                                            
         MFLD  IDKRN,                                                  +        
               LTH=5                                                            
         MFLD  IDKVAINE,                                               +        
               LTH=2                                                            
         MFLD  IDKVAINN,                                               +        
               LTH=2                                                            
         MFLD  (FLAGGAKR,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (USERPRI,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLAGGAGP,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (BEANST,                                                +        
               '+++++++++++++++++++++++++'),                           +        
               LTH=25,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (USERSEK,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLAGGAGS,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (USERADM,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FLAGGAGA,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (FLAGGAG,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (USERID,                                                +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MSGEND                                                                 
         END                                                                    
