***********************************************************************         
* CREATED BY V063442   ON 04/02/05  AT 10:39                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'MANUELL PÅFYLLNING CDC/SVS      '                               
W6F154   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0t501  ',                                           +        
               8='W0t501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W6T154U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0t501  ',                                          +        
               14='W0t501  ',                                          +        
               15='W0t501  ',                                          +        
               16='W0t501  ',                                          +        
               17='W0t501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W6T154V ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W6N154   DPAGE CURSOR=((6,2))                                                   
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'MANUELL PÅFYLLNING CDC/SVS',                           +        
               POS=(1,12),LTH=26,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Från   Artnr',                                         +        
               POS=(5,2),LTH=12,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Antal    Sats   Not',                                  +        
               POS=(5,21),LTH=19,                                      +        
               ATTR=(PROT)                                                      
ADTRDEST DFLD  POS=(6,2),LTH=3,                                        +        
               ATTR=(NOPROT)                                                    
IDARTNR  DFLD  POS=(6,9),LTH=9,                                        +        
               ATTR=(NUM,NOPROT)                                                
KVANTAL  DFLD  POS=(6,21),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLEJBOK  DFLD  POS=(6,30),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
TETRPMED DFLD  POS=(6,37),LTH=20,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  '1 INFO  10 WHELP  11 UPPDATERA  12 LOGGA AV',          +        
               POS=(21,2),LTH=43,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W6I15401 MSG   TYPE=INPUT,                                             +        
               SOR=(W6F154),                                           +        
               OPT=2,                                                  +        
               NXT=W6O15401                                                     
MID      LPAGE SOR=(W6N154)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS1,                                              +        
               '6'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS2,                                              +        
               '1'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  (IDTRANS3,                                              +        
               '5'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  (IDTRANS4,                                              +        
               '4'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '61541',                                                +        
               LTH=5                                                            
         MFLD  (ADTRDEST,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDARTNR,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVANTAL,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLEJBOK,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TETRPMED,                                              +        
               '++++++++++++++++++++'),                                +        
               LTH=20,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MSGEND                                                                 
W6O15401 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6F154,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I15401,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W6N154                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  ADTRDEST,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTNR,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVANTAL,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLEJBOK,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TETRPMED,                                               +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=61                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  FSYSMSG,                                                +        
               LTH=79                                                           
         MSGEND                                                                 
         END                                                                    
