***********************************************************************         
* CREATED BY V065708   ON 07/06/01  AT 12:21                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'VISA/UPPDATERA FÖRPACKNINGSTYP  '                               
W6F181   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W6T181 7',                                           +        
               8='W6T181 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W6T181U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W6T181V ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W6F181   DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'VISA UPPD FÖRPACKNINGSTYP',                            +        
               POS=(1,12),LTH=25,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Artikelnr',                                            +        
               POS=(2,2),LTH=9,                                        +        
               ATTR=(NUM,PROT)                                                  
IDARTNRI DFLD  POS=(2,12),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,23),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDDCIN   DFLD  POS=(2,26),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
IDARTNRU DFLD  POS=(3,12),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDCUT   DFLD  POS=(3,26),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Benämning',                                            +        
               POS=(5,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
BEURSPUT DFLD  POS=(5,12),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'FP-Typ  FP-Kod  Ansvarig  Datum   Text',               +        
               POS=(7,2),LTH=38,                                       +        
               ATTR=(PROT)                                                      
BEFTUT   DFLD  POS=(8,2),LTH=2,                                        +        
               ATTR=(PROT)                                                      
KDFORPUT DFLD  POS=(8,10),LTH=4,                                       +        
               ATTR=(PROT)                                                      
IDUSERUT DFLD  POS=(8,18),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DADATEUT DFLD  POS=(8,28),LTH=6,                                       +        
               ATTR=(PROT)                                                      
TEINSTUT DFLD  POS=(8,36),LTH=40,                                      +        
               ATTR=(PROT)                                                      
TEINSUT2 DFLD  POS=(9,2),LTH=79,                                       +        
               ATTR=(PROT)                                                      
TEINSUT3 DFLD  POS=(10,2),LTH=79,                                      +        
               ATTR=(PROT)                                                      
BEFTIN   DFLD  POS=(11,2),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
KDFORPIN DFLD  POS=(11,10),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
TEINSTIN DFLD  POS=(11,36),LTH=40,                                     +        
               ATTR=(NOPROT,MOD)                                                
TEBEFTIN DFLD  POS=(12,2),LTH=79,                                      +        
               ATTR=(NOPROT,MOD)                                                
TEBEFIN2 DFLD  POS=(13,2),LTH=79,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Historik',                                             +        
               POS=(14,2),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
BEFT01   DFLD  POS=(15,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KDFORP01 DFLD  POS=(15,10),LTH=4,                                      +        
               ATTR=(PROT)                                                      
IDUSER01 DFLD  POS=(15,18),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DADATE01 DFLD  POS=(15,28),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TEINST01 DFLD  POS=(15,36),LTH=40,                                     +        
               ATTR=(PROT)                                                      
TEBEFT1A DFLD  POS=(16,2),LTH=79,                                      +        
               ATTR=(PROT)                                                      
TEBEFT1B DFLD  POS=(17,2),LTH=79,                                      +        
               ATTR=(PROT)                                                      
BEFT02   DFLD  POS=(18,2),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
KDFORP02 DFLD  POS=(18,10),LTH=4,                                      +        
               ATTR=(PROT)                                                      
IDUSER02 DFLD  POS=(18,18),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DADATE02 DFLD  POS=(18,28),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TEINST02 DFLD  POS=(18,36),LTH=40,                                     +        
               ATTR=(PROT)                                                      
TEBEFT2A DFLD  POS=(19,2),LTH=79,                                      +        
               ATTR=(PROT)                                                      
TEBEFT2B DFLD  POS=(20,2),LTH=79,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Pf4 Print  PF10 WHELP  Pf12 Logoff',                   +        
               POS=(22,2),LTH=34,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W6O18101 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6F181,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I18101,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W6F181                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  IDARTNRI,                                               +        
               LTH=9                                                            
         MFLD  IDARTNRU,                                               +        
               LTH=9                                                            
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  BEURSPUT,                                               +        
               LTH=25                                                           
         MFLD  BEFTUT,                                                 +        
               LTH=2                                                            
         MFLD  KDFORPUT,                                               +        
               LTH=4                                                            
         MFLD  IDUSERUT,                                               +        
               LTH=8                                                            
         MFLD  DADATEUT,                                               +        
               LTH=6                                                            
         MFLD  TEINSTUT,                                               +        
               LTH=40                                                           
         MFLD  TEINSUT2,                                               +        
               LTH=79                                                           
         MFLD  TEINSUT3,                                               +        
               LTH=79                                                           
         MFLD  BEFTIN,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDFORPIN,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEINSTIN,                                               +        
               LTH=42,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEBEFTIN,                                               +        
               LTH=81,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEBEFIN2,                                               +        
               LTH=81,                                                 +        
               ATTR=(YES)                                                       
         MFLD  BEFT01,                                                 +        
               LTH=2                                                            
         MFLD  KDFORP01,                                               +        
               LTH=4                                                            
         MFLD  IDUSER01,                                               +        
               LTH=8                                                            
         MFLD  DADATE01,                                               +        
               LTH=6                                                            
         MFLD  TEINST01,                                               +        
               LTH=40                                                           
         MFLD  TEBEFT1A,                                               +        
               LTH=79                                                           
         MFLD  TEBEFT1B,                                               +        
               LTH=79                                                           
         MFLD  BEFT02,                                                 +        
               LTH=2                                                            
         MFLD  KDFORP02,                                               +        
               LTH=4                                                            
         MFLD  IDUSER02,                                               +        
               LTH=8                                                            
         MFLD  DADATE02,                                               +        
               LTH=6                                                            
         MFLD  TEINST02,                                               +        
               LTH=40                                                           
         MFLD  TEBEFT2A,                                               +        
               LTH=79                                                           
         MFLD  TEBEFT2B,                                               +        
               LTH=79                                                           
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W6I18101 MSG   TYPE=INPUT,                                             +        
               SOR=(W6F181),                                           +        
               OPT=2,                                                  +        
               NXT=W6O18101                                                     
MID      LPAGE SOR=(W6F181)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F8'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '61811',                                                +        
               LTH=5                                                            
         MFLD  (IDARTNRI,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDARTNRU,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDCUT,                                                 +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (BEFTIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDFORPIN,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TEINSTIN,                                              +        
               '++++++++++++++++++++++++++++++++++++++++'),            +        
               LTH=40                                                           
         MFLD  (TEBEFTIN,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               ++++++++++++++++++++++++'),                             +        
               LTH=79                                                           
         MFLD  (TEBEFIN2,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               ++++++++++++++++++++++++'),                             +        
               LTH=79                                                           
         MSGEND                                                                 
         END                                                                    
