***********************************************************************         
* CREATED BY V063442   ON 02/09/18  AT 10:53                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'DEFINIERA STYRPARAMETRAR        '                               
W6F105   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W6T105 7',                                           +        
               8='W6T105 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W6T105U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W6T101  ',                                          +        
               14='W6T102  ',                                          +        
               15='W6T103  ',                                          +        
               16='W6T104  ',                                          +        
               17='W6T105  ',                                          +        
               18='W6T106  ',                                          +        
               19='W6T107  ',                                          +        
               20='W6T108  ',                                          +        
               21='W6T109  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W6F105   DPAGE CURSOR=((2,8))                                                   
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Definiera styrparametrar',                             +        
               POS=(1,12),LTH=24,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'FB/F',                                                 +        
               POS=(2,2),LTH=4,                                        +        
               ATTR=(ALPHA,PROT)                                                
DGIA0068 DFLD  POS=(2,8),LTH=4,                                        +        
               ATTR=(NOPROT)                                                    
         DFLD  'DC',                                                   +        
               POS=(2,14),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDDCIN   DFLD  POS=(2,17),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0070 DFLD  POS=(3,8),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
IDDCUT   DFLD  POS=(3,17),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0048 DFLD  POS=(4,2),LTH=9,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0049 DFLD  POS=(4,13),LTH=9,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0050 DFLD  POS=(4,24),LTH=4,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0051 DFLD  POS=(4,29),LTH=4,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0052 DFLD  POS=(4,35),LTH=5,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0053 DFLD  POS=(4,42),LTH=5,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0054 DFLD  POS=(4,49),LTH=2,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0055 DFLD  POS=(4,53),LTH=2,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Åtg FB/F   Artnr fom  tom',                            +        
               POS=(5,2),LTH=25,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Fgrp fom tom   Levnr   Ft fom tom',                    +        
               POS=(5,34),LTH=33,                                      +        
               ATTR=(PROT)                                                      
CMD1     DFLD  POS=(6,3),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
OMR1     DFLD  POS=(6,6),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0000 DFLD  POS=(6,13),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0012 DFLD  POS=(6,23),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0024 DFLD  POS=(6,36),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0036 DFLD  POS=(6,42),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0056 DFLD  POS=(6,49),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0071 DFLD  POS=(6,60),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0083 DFLD  POS=(6,64),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
CMD2     DFLD  POS=(7,3),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
OMR2     DFLD  POS=(7,6),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0001 DFLD  POS=(7,13),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0013 DFLD  POS=(7,23),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0025 DFLD  POS=(7,36),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0037 DFLD  POS=(7,42),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0057 DFLD  POS=(7,49),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0072 DFLD  POS=(7,60),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0084 DFLD  POS=(7,64),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
CMD3     DFLD  POS=(8,3),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
OMR3     DFLD  POS=(8,6),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0002 DFLD  POS=(8,13),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0014 DFLD  POS=(8,23),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0026 DFLD  POS=(8,36),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0038 DFLD  POS=(8,42),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0058 DFLD  POS=(8,49),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0073 DFLD  POS=(8,60),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0085 DFLD  POS=(8,64),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
CMD4     DFLD  POS=(9,3),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
OMR4     DFLD  POS=(9,6),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0003 DFLD  POS=(9,13),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0015 DFLD  POS=(9,23),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0027 DFLD  POS=(9,36),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0039 DFLD  POS=(9,42),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0059 DFLD  POS=(9,49),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0074 DFLD  POS=(9,60),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0086 DFLD  POS=(9,64),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
CMD5     DFLD  POS=(10,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
OMR5     DFLD  POS=(10,6),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0004 DFLD  POS=(10,13),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0016 DFLD  POS=(10,23),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0028 DFLD  POS=(10,36),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0040 DFLD  POS=(10,42),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0060 DFLD  POS=(10,49),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0075 DFLD  POS=(10,60),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0087 DFLD  POS=(10,64),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
CMD6     DFLD  POS=(11,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
OMR6     DFLD  POS=(11,6),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0005 DFLD  POS=(11,13),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0017 DFLD  POS=(11,23),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0029 DFLD  POS=(11,36),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0041 DFLD  POS=(11,42),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0061 DFLD  POS=(11,49),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0076 DFLD  POS=(11,60),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0088 DFLD  POS=(11,64),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
CMD7     DFLD  POS=(12,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
OMR7     DFLD  POS=(12,6),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0006 DFLD  POS=(12,13),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0018 DFLD  POS=(12,23),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0030 DFLD  POS=(12,36),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0042 DFLD  POS=(12,42),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0062 DFLD  POS=(12,49),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0077 DFLD  POS=(12,60),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0089 DFLD  POS=(12,64),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
CMD8     DFLD  POS=(13,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
OMR8     DFLD  POS=(13,6),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0007 DFLD  POS=(13,13),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0019 DFLD  POS=(13,23),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0031 DFLD  POS=(13,36),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0043 DFLD  POS=(13,42),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0063 DFLD  POS=(13,49),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0078 DFLD  POS=(13,60),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0090 DFLD  POS=(13,64),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
CMD9     DFLD  POS=(14,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
OMR9     DFLD  POS=(14,6),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0008 DFLD  POS=(14,13),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0020 DFLD  POS=(14,23),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0032 DFLD  POS=(14,36),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0044 DFLD  POS=(14,42),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0064 DFLD  POS=(14,49),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0079 DFLD  POS=(14,60),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0091 DFLD  POS=(14,64),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
CMD10    DFLD  POS=(15,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
OMR10    DFLD  POS=(15,6),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0009 DFLD  POS=(15,13),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0021 DFLD  POS=(15,23),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0033 DFLD  POS=(15,36),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0045 DFLD  POS=(15,42),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0065 DFLD  POS=(15,49),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0080 DFLD  POS=(15,60),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0092 DFLD  POS=(15,64),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
CMD11    DFLD  POS=(16,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
OMR11    DFLD  POS=(16,6),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0010 DFLD  POS=(16,13),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0022 DFLD  POS=(16,23),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0034 DFLD  POS=(16,36),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0046 DFLD  POS=(16,42),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0066 DFLD  POS=(16,49),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0081 DFLD  POS=(16,60),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0093 DFLD  POS=(16,64),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
CMD12    DFLD  POS=(17,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
OMR12    DFLD  POS=(17,6),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0011 DFLD  POS=(17,13),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0023 DFLD  POS=(17,23),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0035 DFLD  POS=(17,36),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0047 DFLD  POS=(17,42),LTH=4,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0067 DFLD  POS=(17,49),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0082 DFLD  POS=(17,60),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0094 DFLD  POS=(17,64),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0069 DFLD  POS=(19,6),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
ARTFINP  DFLD  POS=(19,13),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTTINP  DFLD  POS=(19,23),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
GRPFINP  DFLD  POS=(19,36),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
GRPTINP  DFLD  POS=(19,42),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
LEVFINP  DFLD  POS=(19,49),LTH=5,                                      +        
               ATTR=(NOPROT)                                                    
TYPFINP  DFLD  POS=(19,60),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
TYPTINP  DFLD  POS=(19,64),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '13 Adm vagn',                                          +        
               POS=(21,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '14 Flytta kolli 15 Ers flagga   16 Utplock VOR  17 Def +        
               styr',                                                  +        
               POS=(21,18),LTH=59,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '18 Def plac',                                          +        
               POS=(22,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '19 Fråga plac   20 Fråga FB/F   21 AR - Info    10 RHEL+        
               P',                                                     +        
               POS=(22,18),LTH=56,                                     +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W6I10501 MSG   TYPE=INPUT,                                             +        
               SOR=(W6F105),                                           +        
               OPT=2,                                                  +        
               NXT=W6O10501                                                     
MID      LPAGE SOR=(W6F105)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS1,                                              +        
               '6'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS2,                                              +        
               '1'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  (IDTRANS3,                                              +        
               '0'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (IDTRANS4,                                              +        
               '5'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  ' ',                                                    +        
               LTH=2                                                            
         MFLD  '61051',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0068,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  DGIA0070,                                               +        
               LTH=4                                                            
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDCUT,                                                 +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0048,                                               +        
               LTH=9                                                            
         MFLD  DGIA0049,                                               +        
               LTH=9                                                            
         MFLD  DGIA0050,                                               +        
               LTH=4                                                            
         MFLD  DGIA0051,                                               +        
               LTH=4                                                            
         MFLD  DGIA0052,                                               +        
               LTH=5                                                            
         MFLD  DGIA0053,                                               +        
               LTH=5                                                            
         MFLD  DGIA0054,                                               +        
               LTH=2                                                            
         MFLD  DGIA0055,                                               +        
               LTH=2                                                            
         MFLD  (CMD1,                                                  +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  OMR1,                                                   +        
               LTH=4                                                            
         MFLD  DGIA0000,                                               +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0012,                                               +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0024,                                               +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0036,                                               +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0056,                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  DGIA0071,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0083,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CMD2,                                                  +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  OMR2,                                                   +        
               LTH=4                                                            
         MFLD  DGIA0001,                                               +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0013,                                               +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0025,                                               +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0037,                                               +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0057,                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  DGIA0072,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0084,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CMD3,                                                  +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  OMR3,                                                   +        
               LTH=4                                                            
         MFLD  DGIA0002,                                               +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0014,                                               +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0026,                                               +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0038,                                               +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0058,                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  DGIA0073,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0085,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CMD4,                                                  +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  OMR4,                                                   +        
               LTH=4                                                            
         MFLD  DGIA0003,                                               +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0015,                                               +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0027,                                               +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0039,                                               +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0059,                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  DGIA0074,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0086,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CMD5,                                                  +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  OMR5,                                                   +        
               LTH=4                                                            
         MFLD  DGIA0004,                                               +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0016,                                               +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0028,                                               +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0040,                                               +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0060,                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  DGIA0075,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0087,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CMD6,                                                  +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  OMR6,                                                   +        
               LTH=4                                                            
         MFLD  DGIA0005,                                               +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0017,                                               +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0029,                                               +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0041,                                               +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0061,                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  DGIA0076,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0088,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CMD7,                                                  +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  OMR7,                                                   +        
               LTH=4                                                            
         MFLD  DGIA0006,                                               +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0018,                                               +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0030,                                               +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0042,                                               +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0062,                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  DGIA0077,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0089,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CMD8,                                                  +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  OMR8,                                                   +        
               LTH=4                                                            
         MFLD  DGIA0007,                                               +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0019,                                               +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0031,                                               +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0043,                                               +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0063,                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  DGIA0078,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0090,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CMD9,                                                  +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  OMR9,                                                   +        
               LTH=4                                                            
         MFLD  DGIA0008,                                               +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0020,                                               +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0032,                                               +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0044,                                               +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0064,                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  DGIA0079,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0091,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CMD10,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  OMR10,                                                  +        
               LTH=4                                                            
         MFLD  DGIA0009,                                               +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0021,                                               +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0033,                                               +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0045,                                               +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0065,                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  DGIA0080,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0092,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CMD11,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  OMR11,                                                  +        
               LTH=4                                                            
         MFLD  DGIA0010,                                               +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0022,                                               +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0034,                                               +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0046,                                               +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0066,                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  DGIA0081,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0093,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CMD12,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  OMR12,                                                  +        
               LTH=4                                                            
         MFLD  DGIA0011,                                               +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0023,                                               +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0035,                                               +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0047,                                               +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0067,                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  DGIA0082,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0094,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0069,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (ARTFINP,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTTINP,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (GRPFINP,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (GRPTINP,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LEVFINP,                                               +        
               '+++++'),                                               +        
               LTH=5                                                            
         MFLD  (TYPFINP,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TYPTINP,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
W6O10501 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6F105,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I10501,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W6F105                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DGIA0068,                                               +        
               LTH=4                                                            
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  DGIA0070,                                               +        
               LTH=4                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  DGIA0048,                                               +        
               LTH=9                                                            
         MFLD  DGIA0049,                                               +        
               LTH=9                                                            
         MFLD  DGIA0050,                                               +        
               LTH=4                                                            
         MFLD  DGIA0051,                                               +        
               LTH=4                                                            
         MFLD  DGIA0052,                                               +        
               LTH=5                                                            
         MFLD  DGIA0053,                                               +        
               LTH=5                                                            
         MFLD  DGIA0054,                                               +        
               LTH=2                                                            
         MFLD  DGIA0055,                                               +        
               LTH=2                                                            
         MFLD  CMD1,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OMR1,                                                   +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0000,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0012,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0024,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0036,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0056,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0071,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0083,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CMD2,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OMR2,                                                   +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0001,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0013,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0025,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0037,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0057,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0072,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0084,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CMD3,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OMR3,                                                   +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0002,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0014,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0026,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0038,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0058,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0073,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0085,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CMD4,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OMR4,                                                   +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0003,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0015,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0027,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0039,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0059,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0074,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0086,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CMD5,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OMR5,                                                   +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0004,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0016,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0028,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0040,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0060,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0075,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0087,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CMD6,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OMR6,                                                   +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0005,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0017,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0029,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0041,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0061,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0076,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0088,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CMD7,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OMR7,                                                   +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0006,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0018,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0030,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0042,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0062,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0077,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0089,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CMD8,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OMR8,                                                   +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0007,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0019,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0031,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0043,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0063,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0078,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0090,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CMD9,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OMR9,                                                   +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0008,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0020,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0032,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0044,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0064,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0079,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0091,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CMD10,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OMR10,                                                  +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0009,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0021,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0033,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0045,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0065,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0080,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0092,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CMD11,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OMR11,                                                  +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0010,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0022,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0034,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0046,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0066,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0081,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0093,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CMD12,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OMR12,                                                  +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0011,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0023,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0035,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0047,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0067,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0082,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0094,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0069,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTFINP,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTTINP,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  GRPFINP,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  GRPTINP,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVFINP,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TYPFINP,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TYPTINP,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  FSYSMSG,                                                +        
               LTH=79                                                           
         MSGEND                                                                 
         END                                                                    
