***********************************************************************         
* CREATED BY PC59625   ON 98/05/08  AT 14:15                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'ETIKETT REGISTRERING 2          '                               
W6F167   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W6T167 7',                                           +        
               8='W6T167 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W6T167U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W6T167U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W6F167   DPAGE CURSOR=((2,14)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'ETIKETT REGISTRERING 2',                               +        
               POS=(1,12),LTH=22,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Artikelnr  ',                                          +        
               POS=(2,2),LTH=11,                                       +        
               ATTR=(NUM,PROT)                                                  
IDARTNRI DFLD  POS=(2,14),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDARTNRU DFLD  POS=(3,14),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Spec.fält 1',                                          +        
               POS=(5,2),LTH=11,                                       +        
               ATTR=(PROT)                                                      
TEFRI01  DFLD  POS=(5,15),LTH=60,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Spec.fält 2',                                          +        
               POS=(6,2),LTH=11,                                       +        
               ATTR=(PROT)                                                      
TEFRI02  DFLD  POS=(6,15),LTH=60,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Spec.fält 3',                                          +        
               POS=(7,2),LTH=11,                                       +        
               ATTR=(PROT)                                                      
TEFRI03  DFLD  POS=(7,15),LTH=60,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Spec.fält 4',                                          +        
               POS=(8,2),LTH=11,                                       +        
               ATTR=(PROT)                                                      
TEFRI04  DFLD  POS=(8,15),LTH=60,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Spec.fält 5',                                          +        
               POS=(9,2),LTH=11,                                       +        
               ATTR=(PROT)                                                      
TEFRI05  DFLD  POS=(9,15),LTH=60,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Spec.fält 6',                                          +        
               POS=(10,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
TEFRI06  DFLD  POS=(10,15),LTH=60,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Spec.fält 7',                                          +        
               POS=(11,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
TEFRI07  DFLD  POS=(11,15),LTH=60,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Spec.fält 8',                                          +        
               POS=(12,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
TEFRI08  DFLD  POS=(12,15),LTH=60,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Spec.fält 9',                                          +        
               POS=(13,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
TEFRI09  DFLD  POS=(13,15),LTH=60,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Spec.fält 10',                                         +        
               POS=(14,2),LTH=12,                                      +        
               ATTR=(PROT)                                                      
TEFRI10  DFLD  POS=(14,15),LTH=60,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Spec.fält 11',                                         +        
               POS=(15,2),LTH=12,                                      +        
               ATTR=(PROT)                                                      
TEFRI11  DFLD  POS=(15,15),LTH=60,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Spec.fält 12',                                         +        
               POS=(16,2),LTH=12,                                      +        
               ATTR=(PROT)                                                      
TEFRI12  DFLD  POS=(16,15),LTH=60,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Ändrad av',                                            +        
               POS=(18,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
IDUSERUT DFLD  POS=(18,18),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Senast ändring',                                       +        
               POS=(19,2),LTH=14,                                      +        
               ATTR=(PROT)                                                      
TIUPPDUT DFLD  POS=(19,18),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Upplagd',                                              +        
               POS=(20,2),LTH=7,                                       +        
               ATTR=(PROT)                                                      
DAREGDUT DFLD  POS=(20,18),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Pf10 WHELP  Pf11 Update  Pf12 Logoff',                 +        
               POS=(22,2),LTH=36,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP ',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W6O16701 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6F167,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I16701,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W6F167                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  IDARTNRI,                                               +        
               LTH=9                                                            
         MFLD  IDARTNRU,                                               +        
               LTH=9                                                            
         MFLD  TEFRI01,                                                +        
               LTH=62,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEFRI02,                                                +        
               LTH=62,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEFRI03,                                                +        
               LTH=62,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEFRI04,                                                +        
               LTH=62,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEFRI05,                                                +        
               LTH=62,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEFRI06,                                                +        
               LTH=62,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEFRI07,                                                +        
               LTH=62,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEFRI08,                                                +        
               LTH=62,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEFRI09,                                                +        
               LTH=62,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEFRI10,                                                +        
               LTH=62,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEFRI11,                                                +        
               LTH=62,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEFRI12,                                                +        
               LTH=62,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDUSERUT,                                               +        
               LTH=8                                                            
         MFLD  TIUPPDUT,                                               +        
               LTH=6                                                            
         MFLD  DAREGDUT,                                               +        
               LTH=8                                                            
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W6I16701 MSG   TYPE=INPUT,                                             +        
               SOR=(W6F167),                                           +        
               OPT=2,                                                  +        
               NXT=W6O16701                                                     
MID      LPAGE SOR=(W6F167)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  (FLD0102,                                               +        
               '6'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  (FLD0104,                                               +        
               '1'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  (FLD0106,                                               +        
               '6'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  (FLD0108,                                               +        
               '7'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '61671',                                                +        
               LTH=5                                                            
         MFLD  (IDARTNRI,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDARTNRU,                                               +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (TEFRI01,                                               +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++'),                                                +        
               LTH=60,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TEFRI02,                                               +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++'),                                                +        
               LTH=60,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TEFRI03,                                               +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++'),                                                +        
               LTH=60,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TEFRI04,                                               +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++'),                                                +        
               LTH=60,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TEFRI05,                                               +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++'),                                                +        
               LTH=60,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TEFRI06,                                               +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++'),                                                +        
               LTH=60,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TEFRI07,                                               +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++'),                                                +        
               LTH=60,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TEFRI08,                                               +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++'),                                                +        
               LTH=60,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TEFRI09,                                               +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++'),                                                +        
               LTH=60,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TEFRI10,                                               +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++'),                                                +        
               LTH=60,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TEFRI11,                                               +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++'),                                                +        
               LTH=60,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TEFRI12,                                               +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++'),                                                +        
               LTH=60,                                                 +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
