***********************************************************************         
* CREATED BY V065708   ON 07/09/19  AT 15:22                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'KONTROLLRAPPORT FELRAPP.        '                               
W6F202   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W6T202U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W6T201  ',                                          +        
               14='W6T202  ',                                          +        
               15='W6T203  ',                                          +        
               16='W6T204  ',                                          +        
               17='W0T501 ',                                           +        
               18='W0T501 ',                                           +        
               19='W6T207  ',                                          +        
               20='W6T208  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W6T202V ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,9)),                                         +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'KR FELRAPPORTERING',                                   +        
               POS=(1,12),LTH=18,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'KR-NR',                                                +        
               POS=(2,2),LTH=5,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDKRIN   DFLD  POS=(2,9),LTH=5,                                        +        
               ATTR=(NOPROT)                                                    
IDKRUT   DFLD  POS=(3,9),LTH=5,                                        +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Partinr',                                              +        
               POS=(5,2),LTH=7,                                        +        
               ATTR=(PROT)                                                      
LOPNRMIN DFLD  POS=(5,10),LTH=8,                                       +        
               ATTR=(PROT)                                                      
LOPNRMUT DFLD  POS=(5,21),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'F-nr',                                                 +        
               POS=(5,35),LTH=4,                                       +        
               ATTR=(PROT)                                                      
IDAVINR  DFLD  POS=(5,40),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Avis.ant',                                             +        
               POS=(5,49),LTH=8,                                       +        
               ATTR=(PROT)                                                      
KVAVIS   DFLD  POS=(5,58),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Avis.dat',                                             +        
               POS=(5,66),LTH=8,                                       +        
               ATTR=(ALPHA,PROT)                                                
TIAVSDAT DFLD  POS=(5,75),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Artnr',                                                +        
               POS=(6,2),LTH=5,                                        +        
               ATTR=(ALPHA,PROT)                                                
ARTNRIN  DFLD  POS=(6,10),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
ARTNRUT  DFLD  POS=(6,20),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
BEART    DFLD  POS=(6,35),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Reg.dat',                                              +        
               POS=(6,66),LTH=7,                                       +        
               ATTR=(PROT)                                                      
TIREGDAT DFLD  POS=(6,75),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Lev',                                                  +        
               POS=(7,2),LTH=3,                                        +        
               ATTR=(ALPHA,PROT)                                                
LEVNRIN  DFLD  POS=(7,6),LTH=5,                                        +        
               ATTR=(NOPROT)                                                    
LEVNRUT  DFLD  POS=(7,12),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Gadr',                                                 +        
               POS=(7,18),LTH=4,                                       +        
               ATTR=(ALPHA,PROT)                                                
ADGODSIN DFLD  POS=(7,23),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
ADGODSUT DFLD  POS=(7,29),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
BELEV    DFLD  POS=(7,35),LTH=30,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Status',                                               +        
               POS=(7,66),LTH=6,                                       +        
               ATTR=(ALPHA,PROT)                                                
KDKRSTA  DFLD  POS=(7,75),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'R e s u l t a t',                                      +        
               POS=(8,10),LTH=15,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Åtgärd',                                               +        
               POS=(8,52),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Mottaget antal',                                       +        
               POS=(9,2),LTH=14,                                       +        
               ATTR=(PROT)                                                      
KVMOTIN  DFLD  POS=(9,20),LTH=6,                                       +        
               ATTR=(PROT)                                                      
KVMOTUT  DFLD  POS=(9,28),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Returneras',                                           +        
               POS=(9,35),LTH=10,                                      +        
               ATTR=(NUM,PROT)                                                  
KVRETIN  DFLD  POS=(9,50),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
KVRETUT  DFLD  POS=(9,58),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'varav ext DC',                                         +        
               POS=(9,66),LTH=12,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Antalsavvikelse',                                      +        
               POS=(10,2),LTH=15,                                      +        
               ATTR=(PROT)                                                      
KVAVV    DFLD  POS=(10,27),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Skrotas',                                              +        
               POS=(10,35),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
KVSKROTI DFLD  POS=(10,50),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
KVSKROTU DFLD  POS=(10,58),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
LDCSKROI DFLD  POS=(10,66),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
LDCSKROU DFLD  POS=(10,74),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Justeras',                                             +        
               POS=(11,35),LTH=8,                                      +        
               ATTR=(PROT)                                                      
KVJUSTIN DFLD  POS=(11,50),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
KVJUSTUT DFLD  POS=(11,58),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Kontrollerade',                                        +        
               POS=(12,2),LTH=13,                                      +        
               ATTR=(PROT)                                                      
KVKOLLIN DFLD  POS=(12,19),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
KVKOLLUT DFLD  POS=(12,27),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Ingen åtgärd',                                         +        
               POS=(12,35),LTH=12,                                     +        
               ATTR=(NUM,PROT)                                                  
KVNOAKIN DFLD  POS=(12,50),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
KVNOAKUT DFLD  POS=(12,58),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Ej godkända',                                          +        
               POS=(13,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
KVEJOKIN DFLD  POS=(13,19),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
KVEJOKUT DFLD  POS=(13,27),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Saldojustering',                                       +        
               POS=(13,35),LTH=14,                                     +        
               ATTR=(NUM,PROT)                                                  
KVSADJIN DFLD  POS=(13,50),LTH=7,                                      +        
               ATTR=(NOPROT)                                                    
KVSADJUT DFLD  POS=(13,58),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Fkod',                                                 +        
               POS=(14,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
IDKRFEL  DFLD  POS=(14,7),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
BEKRFEL  DFLD  POS=(14,11),LTH=60,                                     +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Disp.kod',                                             +        
               POS=(15,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
KDDISP   DFLD  POS=(15,11),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
DISPTEXT DFLD  POS=(15,14),LTH=66,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  'Hanteringskod',                                        +        
               POS=(16,2),LTH=13,                                      +        
               ATTR=(PROT)                                                      
HANDLCOD DFLD  POS=(16,17),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
HANDLTXT DFLD  POS=(16,19),LTH=51,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  'Feltext finns',                                        +        
               POS=(17,2),LTH=13,                                      +        
               ATTR=(PROT)                                                      
TEXTFINN DFLD  POS=(17,17),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Boka ned 6308',                                        +        
               POS=(18,2),LTH=13,                                      +        
               ATTR=(PROT)                                                      
FLKVALIN DFLD  POS=(18,17),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
FLKVALUT DFLD  POS=(18,20),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Boka ned buffert',                                     +        
               POS=(18,41),LTH=16,                                     +        
               ATTR=(PROT)                                                      
FLBUFJIN DFLD  POS=(18,59),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
FLBUFJUT DFLD  POS=(18,62),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Pers',                                                 +        
               POS=(19,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KDPERSON DFLD  POS=(19,7),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
BEKRBEH  DFLD  POS=(19,11),LTH=25,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Tid',                                                  +        
               POS=(19,37),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
ARBTIDIN DFLD  POS=(19,41),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARBTIDUT DFLD  POS=(19,46),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Gods plac',                                            +        
               POS=(19,51),LTH=9,                                      +        
               ATTR=(ALPHA,PROT)                                                
TEKRPLT  DFLD  POS=(19,61),LTH=20,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'F10=WHELP F11=Update F12=Logoff',                      +        
               POS=(22,2),LTH=31,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATUM    DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TID      DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W6O20202 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6F202,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I20201,                                           +        
               FILL=PT                                                          
MOD2     LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=79                                                           
         MSGEND                                                                 
W6I20201 MSG   TYPE=INPUT,                                             +        
               SOR=(W6F202),                                           +        
               OPT=2,                                                  +        
               NXT=W6O20201                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '62021',                                                +        
               LTH=5                                                            
         MFLD  (IDKRIN,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDKRUT,                                                +        
               '     '),                                               +        
               LTH=5                                                            
         MFLD  (LOPNRMIN,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TIAVSDAT,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNRIN,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LEVNRIN,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (ADGODSIN,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVMOTIN,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVRETIN,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVSKROTI,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LDCSKROI,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVKOLLIN,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVJUSTIN,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVEJOKIN,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVNOAKIN,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVSADJIN,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDKRFEL,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLKVALIN,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDDISP,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLBUFJIN,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (HANDLCOD,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDPERSON,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (BEKRBEH,                                               +        
               '+++++++++++++++++++++++++'),                           +        
               LTH=25,                                                 +        
               FILL=X'40'                                                       
         MFLD  (ARBTIDIN,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TEKRPLT,                                               +        
               '++++++++++++++++++++'),                                +        
               LTH=20,                                                 +        
               FILL=X'40'                                                       
         MSGEND                                                                 
W6O20201 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6F202,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I20201,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDKRIN,                                                 +        
               LTH=2                                                            
         MFLD  IDKRUT,                                                 +        
               LTH=5                                                            
         MFLD  LOPNRMIN,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  LOPNRMUT,                                               +        
               LTH=8                                                            
         MFLD  IDAVINR,                                                +        
               LTH=7                                                            
         MFLD  KVAVIS,                                                 +        
               LTH=6                                                            
         MFLD  TIAVSDAT,                                               +        
               LTH=6                                                            
         MFLD  ARTNRIN,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNRUT,                                                +        
               LTH=9                                                            
         MFLD  BEART,                                                  +        
               LTH=25                                                           
         MFLD  TIREGDAT,                                               +        
               LTH=6                                                            
         MFLD  LEVNRIN,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVNRUT,                                                +        
               LTH=5                                                            
         MFLD  ADGODSIN,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADGODSUT,                                               +        
               LTH=5                                                            
         MFLD  BELEV,                                                  +        
               LTH=30                                                           
         MFLD  KDKRSTA,                                                +        
               LTH=1                                                            
         MFLD  KVMOTIN,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVMOTUT,                                                +        
               LTH=6                                                            
         MFLD  KVRETIN,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVRETUT,                                                +        
               LTH=7                                                            
         MFLD  KVAVV,                                                  +        
               LTH=7                                                            
         MFLD  KVSKROTI,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVSKROTU,                                               +        
               LTH=7                                                            
         MFLD  LDCSKROI,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LDCSKROU,                                               +        
               LTH=7                                                            
         MFLD  KVJUSTIN,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVJUSTUT,                                               +        
               LTH=7                                                            
         MFLD  KVKOLLIN,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVKOLLUT,                                               +        
               LTH=7                                                            
         MFLD  KVNOAKIN,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVNOAKUT,                                               +        
               LTH=7                                                            
         MFLD  KVEJOKIN,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVEJOKUT,                                               +        
               LTH=7                                                            
         MFLD  KVSADJIN,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVSADJUT,                                               +        
               LTH=7                                                            
         MFLD  IDKRFEL,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BEKRFEL,                                                +        
               LTH=60                                                           
         MFLD  FLKVALIN,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLKVALUT,                                               +        
               LTH=1                                                            
         MFLD  KDDISP,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLBUFJIN,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLBUFJUT,                                               +        
               LTH=1                                                            
         MFLD  DISPTEXT,                                               +        
               LTH=66                                                           
         MFLD  HANDLCOD,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  HANDLTXT,                                               +        
               LTH=51                                                           
         MFLD  TEXTFINN,                                               +        
               LTH=1                                                            
         MFLD  KDPERSON,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BEKRBEH,                                                +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARBTIDIN,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARBTIDUT,                                               +        
               LTH=4                                                            
         MFLD  TEKRPLT,                                                +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATUM,                                                 +        
               DATE4)                                                           
         MFLD  (TID,                                                   +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=79                                                           
         MSGEND                                                                 
         END                                                                    
