***********************************************************************         
* CREATED BY V063442   ON 00/10/17  AT 07:56                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'KONTROLLRAPPORT SÖKBILD         '                               
W6F201   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W6T201 7',                                           +        
               8='W6T201 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W6T201  ',                                          +        
               14='W6T201 A ',                                         +        
               15='W6T201 B ',                                         +        
               16='W6T201 C ',                                         +        
               17='W0T501 ',                                           +        
               18='W0T501 ',                                           +        
               19='W6T201 D',                                          +        
               20='W6T201 E',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W6F201   DPAGE CURSOR=((2,9)),                                         +        
               FILL=PT                                                          
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'KONTROLLRAPPORT SÖKBILD',                              +        
               POS=(1,10),LTH=23,                                      +        
               ATTR=(NUM,PROT)                                                  
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Status',                                               +        
               POS=(2,2),LTH=6,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDKRSTAI DFLD  POS=(2,9),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'A/Q',                                                  +        
               POS=(2,12),LTH=3,                                       +        
               ATTR=(PROT)                                                      
AORQI    DFLD  POS=(2,16),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Pers.',                                                +        
               POS=(2,19),LTH=5,                                       +        
               ATTR=(PROT)                                                      
IDPERSI  DFLD  POS=(2,25),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'I/L',                                                  +        
               POS=(2,30),LTH=3,                                       +        
               ATTR=(PROT)                                                      
IORLI    DFLD  POS=(2,34),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Typ',                                                  +        
               POS=(2,37),LTH=3,                                       +        
               ATTR=(PROT)                                                      
IDTYPI   DFLD  POS=(2,41),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Artikel',                                              +        
               POS=(2,44),LTH=7,                                       +        
               ATTR=(PROT)                                                      
IDARTNRI DFLD  POS=(2,52),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Ann',                                                  +        
               POS=(2,63),LTH=3,                                       +        
               ATTR=(PROT)                                                      
FLANNULI DFLD  POS=(2,67),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'DC',                                                   +        
               POS=(2,70),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDDCI    DFLD  POS=(2,73),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
IDKRSTAU DFLD  POS=(3,9),LTH=1,                                        +        
               ATTR=(PROT,MOD)                                                  
AORQU    DFLD  POS=(3,16),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
IDPERSU  DFLD  POS=(3,25),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
IORLU    DFLD  POS=(3,34),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
IDTYPU   DFLD  POS=(3,41),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
IDARTNRU DFLD  POS=(3,52),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
FLANNULU DFLD  POS=(3,67),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDCU    DFLD  POS=(3,73),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDCENT  DFLD  POS=(4,2),LTH=2,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
IDDCNEXT DFLD  POS=(4,5),LTH=2,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0147 DFLD  POS=(4,8),LTH=6,                                        +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0148 DFLD  POS=(4,15),LTH=6,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KDKRSTAE DFLD  POS=(4,22),LTH=1,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
KDKRSTAN DFLD  POS=(4,24),LTH=1,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0143 DFLD  POS=(4,26),LTH=9,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0144 DFLD  POS=(4,36),LTH=9,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDFTGE   DFLD  POS=(4,46),LTH=2,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDFTGN   DFLD  POS=(4,49),LTH=2,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDKRE    DFLD  POS=(4,52),LTH=5,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDKRN    DFLD  POS=(4,58),LTH=5,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
DAREG9E  DFLD  POS=(4,64),LTH=8,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DAREG9N  DFLD  POS=(4,73),LTH=8,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         DFLD  'K Artikelnr Benämning',                                +        
               POS=(5,2),LTH=21,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Reg.dat KR-nr   Partinr Levnr Typ Ret.ant Behand. av', +        
               POS=(5,29),LTH=52,                                      +        
               ATTR=(PROT)                                                      
DGIA0026 DFLD  POS=(6,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
DGIA0039 DFLD  POS=(6,4),LTH=9,                                        +        
               ATTR=(NUM,PROT)                                                  
DGIA0000 DFLD  POS=(6,14),LTH=14,                                      +        
               ATTR=(PROT)                                                      
DGIA0104 DFLD  POS=(6,30),LTH=6,                                       +        
               ATTR=(PROT)                                                      
DGIA0052 DFLD  POS=(6,37),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0091 DFLD  POS=(6,43),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0078 DFLD  POS=(6,53),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0117 DFLD  POS=(6,60),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0065 DFLD  POS=(6,63),LTH=7,                                       +        
               ATTR=(PROT)                                                      
DGIA0013 DFLD  POS=(6,71),LTH=10,                                      +        
               ATTR=(PROT)                                                      
DGIA0027 DFLD  POS=(7,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
DGIA0040 DFLD  POS=(7,4),LTH=9,                                        +        
               ATTR=(NUM,PROT)                                                  
DGIA0001 DFLD  POS=(7,14),LTH=14,                                      +        
               ATTR=(PROT)                                                      
DGIA0105 DFLD  POS=(7,30),LTH=6,                                       +        
               ATTR=(PROT)                                                      
DGIA0053 DFLD  POS=(7,37),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0092 DFLD  POS=(7,43),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0079 DFLD  POS=(7,53),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0118 DFLD  POS=(7,60),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0066 DFLD  POS=(7,63),LTH=7,                                       +        
               ATTR=(PROT)                                                      
DGIA0014 DFLD  POS=(7,71),LTH=10,                                      +        
               ATTR=(PROT)                                                      
DGIA0028 DFLD  POS=(8,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
DGIA0041 DFLD  POS=(8,4),LTH=9,                                        +        
               ATTR=(NUM,PROT)                                                  
DGIA0002 DFLD  POS=(8,14),LTH=14,                                      +        
               ATTR=(PROT)                                                      
DGIA0106 DFLD  POS=(8,30),LTH=6,                                       +        
               ATTR=(PROT)                                                      
DGIA0054 DFLD  POS=(8,37),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0093 DFLD  POS=(8,43),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0080 DFLD  POS=(8,53),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0119 DFLD  POS=(8,60),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0067 DFLD  POS=(8,63),LTH=7,                                       +        
               ATTR=(PROT)                                                      
DGIA0015 DFLD  POS=(8,71),LTH=10,                                      +        
               ATTR=(PROT)                                                      
DGIA0029 DFLD  POS=(9,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
DGIA0042 DFLD  POS=(9,4),LTH=9,                                        +        
               ATTR=(NUM,PROT)                                                  
DGIA0003 DFLD  POS=(9,14),LTH=14,                                      +        
               ATTR=(PROT)                                                      
DGIA0107 DFLD  POS=(9,30),LTH=6,                                       +        
               ATTR=(PROT)                                                      
DGIA0055 DFLD  POS=(9,37),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0094 DFLD  POS=(9,43),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0081 DFLD  POS=(9,53),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0120 DFLD  POS=(9,60),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0068 DFLD  POS=(9,63),LTH=7,                                       +        
               ATTR=(PROT)                                                      
DGIA0016 DFLD  POS=(9,71),LTH=10,                                      +        
               ATTR=(PROT)                                                      
DGIA0030 DFLD  POS=(10,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0043 DFLD  POS=(10,4),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0004 DFLD  POS=(10,14),LTH=14,                                     +        
               ATTR=(PROT)                                                      
DGIA0108 DFLD  POS=(10,30),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0056 DFLD  POS=(10,37),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0095 DFLD  POS=(10,43),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0082 DFLD  POS=(10,53),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0121 DFLD  POS=(10,60),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0069 DFLD  POS=(10,63),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0017 DFLD  POS=(10,71),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DGIA0031 DFLD  POS=(11,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0044 DFLD  POS=(11,4),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0005 DFLD  POS=(11,14),LTH=14,                                     +        
               ATTR=(PROT)                                                      
DGIA0109 DFLD  POS=(11,30),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0057 DFLD  POS=(11,37),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0096 DFLD  POS=(11,43),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0083 DFLD  POS=(11,53),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0122 DFLD  POS=(11,60),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0070 DFLD  POS=(11,63),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0018 DFLD  POS=(11,71),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DGIA0032 DFLD  POS=(12,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0045 DFLD  POS=(12,4),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0006 DFLD  POS=(12,14),LTH=14,                                     +        
               ATTR=(PROT)                                                      
DGIA0110 DFLD  POS=(12,30),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0058 DFLD  POS=(12,37),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0097 DFLD  POS=(12,43),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0084 DFLD  POS=(12,53),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0123 DFLD  POS=(12,60),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0071 DFLD  POS=(12,63),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0019 DFLD  POS=(12,71),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DGIA0033 DFLD  POS=(13,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0046 DFLD  POS=(13,4),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0007 DFLD  POS=(13,14),LTH=14,                                     +        
               ATTR=(PROT)                                                      
DGIA0111 DFLD  POS=(13,30),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0059 DFLD  POS=(13,37),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0098 DFLD  POS=(13,43),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0085 DFLD  POS=(13,53),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0124 DFLD  POS=(13,60),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0072 DFLD  POS=(13,63),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0020 DFLD  POS=(13,71),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DGIA0034 DFLD  POS=(14,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0047 DFLD  POS=(14,4),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0008 DFLD  POS=(14,14),LTH=14,                                     +        
               ATTR=(PROT)                                                      
DGIA0112 DFLD  POS=(14,30),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0060 DFLD  POS=(14,37),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0099 DFLD  POS=(14,43),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0086 DFLD  POS=(14,53),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0125 DFLD  POS=(14,60),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0073 DFLD  POS=(14,63),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0021 DFLD  POS=(14,71),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DGIA0035 DFLD  POS=(15,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0048 DFLD  POS=(15,4),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0009 DFLD  POS=(15,14),LTH=14,                                     +        
               ATTR=(PROT)                                                      
DGIA0113 DFLD  POS=(15,30),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0061 DFLD  POS=(15,37),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0100 DFLD  POS=(15,43),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0087 DFLD  POS=(15,53),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0126 DFLD  POS=(15,60),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0074 DFLD  POS=(15,63),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0022 DFLD  POS=(15,71),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DGIA0036 DFLD  POS=(16,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0049 DFLD  POS=(16,4),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0010 DFLD  POS=(16,14),LTH=14,                                     +        
               ATTR=(PROT)                                                      
DGIA0114 DFLD  POS=(16,30),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0062 DFLD  POS=(16,37),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0101 DFLD  POS=(16,43),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0088 DFLD  POS=(16,53),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0127 DFLD  POS=(16,60),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0075 DFLD  POS=(16,63),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0023 DFLD  POS=(16,71),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DGIA0037 DFLD  POS=(17,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0050 DFLD  POS=(17,4),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0011 DFLD  POS=(17,14),LTH=14,                                     +        
               ATTR=(PROT)                                                      
DGIA0115 DFLD  POS=(17,30),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0063 DFLD  POS=(17,37),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0102 DFLD  POS=(17,43),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0089 DFLD  POS=(17,53),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0128 DFLD  POS=(17,60),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0076 DFLD  POS=(17,63),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0024 DFLD  POS=(17,71),LTH=10,                                     +        
               ATTR=(PROT)                                                      
DGIA0038 DFLD  POS=(18,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0051 DFLD  POS=(18,4),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0012 DFLD  POS=(18,14),LTH=14,                                     +        
               ATTR=(PROT)                                                      
DGIA0116 DFLD  POS=(18,30),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0064 DFLD  POS=(18,37),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0103 DFLD  POS=(18,43),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0090 DFLD  POS=(18,53),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0129 DFLD  POS=(18,60),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0077 DFLD  POS=(18,63),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0025 DFLD  POS=(18,71),LTH=10,                                     +        
               ATTR=(PROT)                                                      
IDARTNRE DFLD  POS=(19,2),LTH=9,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDARTNRN DFLD  POS=(19,12),LTH=9,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDLEVNRE DFLD  POS=(19,22),LTH=5,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
IDLEVNRN DFLD  POS=(19,28),LTH=5,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0145 DFLD  POS=(19,34),LTH=1,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0146 DFLD  POS=(19,36),LTH=1,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0130 DFLD  POS=(19,38),LTH=5,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0131 DFLD  POS=(19,46),LTH=5,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0132 DFLD  POS=(19,54),LTH=5,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0133 DFLD  POS=(19,62),LTH=5,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0134 DFLD  POS=(19,70),LTH=5,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0135 DFLD  POS=(20,2),LTH=5,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0136 DFLD  POS=(20,10),LTH=5,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0137 DFLD  POS=(20,18),LTH=5,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0138 DFLD  POS=(20,26),LTH=5,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0139 DFLD  POS=(20,34),LTH=5,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0140 DFLD  POS=(20,42),LTH=5,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0141 DFLD  POS=(20,50),LTH=5,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0142 DFLD  POS=(20,58),LTH=5,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'F7=First F8=Forward F10=WHELP F12=Logoff',             +        
               POS=(22,2),LTH=40,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W6I20101 MSG   TYPE=INPUT,                                             +        
               SOR=(W6F201),                                           +        
               OPT=2,                                                  +        
               NXT=W6O20101                                                     
MID      LPAGE SOR=(W6F201)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS1,                                              +        
               '6'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS2,                                              +        
               '2'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  (IDTRANS3,                                              +        
               '0'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (IDTRANS4,                                              +        
               '1'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '62011',                                                +        
               LTH=5                                                            
         MFLD  (IDKRSTAI,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDKRSTAU,                                               +        
               LTH=1                                                            
         MFLD  (AORQI,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  AORQU,                                                  +        
               LTH=1                                                            
         MFLD  (IDPERSI,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDPERSU,                                                +        
               LTH=3                                                            
         MFLD  (IORLI,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IORLU,                                                  +        
               LTH=1                                                            
         MFLD  (IDTYPI,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDTYPU,                                                 +        
               LTH=1                                                            
         MFLD  (IDARTNRI,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDARTNRU,                                               +        
               LTH=9                                                            
         MFLD  FLANNULI,                                               +        
               LTH=1                                                            
         MFLD  FLANNULU,                                               +        
               LTH=1                                                            
         MFLD  (IDDCI,                                                 +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  IDDCU,                                                  +        
               LTH=2                                                            
         MFLD  IDDCENT,                                                +        
               LTH=2                                                            
         MFLD  IDDCNEXT,                                               +        
               LTH=2                                                            
         MFLD  DGIA0147,                                               +        
               LTH=6                                                            
         MFLD  DGIA0148,                                               +        
               LTH=6                                                            
         MFLD  KDKRSTAE,                                               +        
               LTH=1                                                            
         MFLD  KDKRSTAN,                                               +        
               LTH=1                                                            
         MFLD  DGIA0143,                                               +        
               LTH=9                                                            
         MFLD  DGIA0144,                                               +        
               LTH=9                                                            
         MFLD  IDFTGE,                                                 +        
               LTH=2                                                            
         MFLD  IDFTGN,                                                 +        
               LTH=2                                                            
         MFLD  IDKRE,                                                  +        
               LTH=5                                                            
         MFLD  IDKRN,                                                  +        
               LTH=5                                                            
         MFLD  IDARTNRE,                                               +        
               LTH=9                                                            
         MFLD  IDARTNRN,                                               +        
               LTH=9                                                            
         MFLD  DAREG9E,                                                +        
               LTH=8                                                            
         MFLD  DAREG9N,                                                +        
               LTH=8                                                            
         MFLD  IDLEVNRE,                                               +        
               LTH=5                                                            
         MFLD  IDLEVNRN,                                               +        
               LTH=5                                                            
         MFLD  DGIA0145,                                               +        
               LTH=1                                                            
         MFLD  DGIA0146,                                               +        
               LTH=1                                                            
         MFLD  DGIA0130,                                               +        
               LTH=5                                                            
         MFLD  DGIA0131,                                               +        
               LTH=5                                                            
         MFLD  DGIA0132,                                               +        
               LTH=5                                                            
         MFLD  DGIA0133,                                               +        
               LTH=5                                                            
         MFLD  DGIA0134,                                               +        
               LTH=5                                                            
         MFLD  DGIA0135,                                               +        
               LTH=5                                                            
         MFLD  DGIA0136,                                               +        
               LTH=5                                                            
         MFLD  DGIA0137,                                               +        
               LTH=5                                                            
         MFLD  DGIA0138,                                               +        
               LTH=5                                                            
         MFLD  DGIA0139,                                               +        
               LTH=5                                                            
         MFLD  DGIA0140,                                               +        
               LTH=5                                                            
         MFLD  DGIA0141,                                               +        
               LTH=5                                                            
         MFLD  DGIA0142,                                               +        
               LTH=5                                                            
         MFLD  (DGIA0026,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (DGIA0027,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (DGIA0028,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (DGIA0029,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (DGIA0030,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (DGIA0031,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (DGIA0032,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (DGIA0033,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (DGIA0034,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (DGIA0035,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (DGIA0036,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (DGIA0037,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (DGIA0038,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W6O20101 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6F201,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I20101,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W6F201                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDKRSTAI,                                               +        
               LTH=1                                                            
         MFLD  IDKRSTAU,                                               +        
               LTH=1                                                            
         MFLD  AORQI,                                                  +        
               LTH=1                                                            
         MFLD  AORQU,                                                  +        
               LTH=1                                                            
         MFLD  IDPERSI,                                                +        
               LTH=3                                                            
         MFLD  IDPERSU,                                                +        
               LTH=3                                                            
         MFLD  IORLI,                                                  +        
               LTH=1                                                            
         MFLD  IORLU,                                                  +        
               LTH=1                                                            
         MFLD  IDTYPI,                                                 +        
               LTH=1                                                            
         MFLD  IDTYPU,                                                 +        
               LTH=1                                                            
         MFLD  IDARTNRI,                                               +        
               LTH=9                                                            
         MFLD  IDARTNRU,                                               +        
               LTH=9                                                            
         MFLD  FLANNULI,                                               +        
               LTH=1                                                            
         MFLD  FLANNULU,                                               +        
               LTH=1                                                            
         MFLD  IDDCI,                                                  +        
               LTH=2                                                            
         MFLD  IDDCU,                                                  +        
               LTH=2                                                            
         MFLD  IDDCENT,                                                +        
               LTH=2                                                            
         MFLD  IDDCNEXT,                                               +        
               LTH=2                                                            
         MFLD  DGIA0147,                                               +        
               LTH=6                                                            
         MFLD  DGIA0148,                                               +        
               LTH=6                                                            
         MFLD  KDKRSTAE,                                               +        
               LTH=1                                                            
         MFLD  KDKRSTAN,                                               +        
               LTH=1                                                            
         MFLD  DGIA0143,                                               +        
               LTH=9                                                            
         MFLD  DGIA0144,                                               +        
               LTH=9                                                            
         MFLD  IDFTGE,                                                 +        
               LTH=2                                                            
         MFLD  IDFTGN,                                                 +        
               LTH=2                                                            
         MFLD  IDKRE,                                                  +        
               LTH=5                                                            
         MFLD  IDKRN,                                                  +        
               LTH=5                                                            
         MFLD  DGIA0026,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0027,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0028,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0029,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0030,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0031,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0032,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0033,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0034,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0035,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0036,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0037,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0038,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0039,                                               +        
               LTH=9                                                            
         MFLD  DGIA0040,                                               +        
               LTH=9                                                            
         MFLD  DGIA0041,                                               +        
               LTH=9                                                            
         MFLD  DGIA0042,                                               +        
               LTH=9                                                            
         MFLD  DGIA0043,                                               +        
               LTH=9                                                            
         MFLD  DGIA0044,                                               +        
               LTH=9                                                            
         MFLD  DGIA0045,                                               +        
               LTH=9                                                            
         MFLD  DGIA0046,                                               +        
               LTH=9                                                            
         MFLD  DGIA0047,                                               +        
               LTH=9                                                            
         MFLD  DGIA0048,                                               +        
               LTH=9                                                            
         MFLD  DGIA0049,                                               +        
               LTH=9                                                            
         MFLD  DGIA0050,                                               +        
               LTH=9                                                            
         MFLD  DGIA0051,                                               +        
               LTH=9                                                            
         MFLD  DGIA0000,                                               +        
               LTH=14                                                           
         MFLD  DGIA0001,                                               +        
               LTH=14                                                           
         MFLD  DGIA0002,                                               +        
               LTH=14                                                           
         MFLD  DGIA0003,                                               +        
               LTH=14                                                           
         MFLD  DGIA0004,                                               +        
               LTH=14                                                           
         MFLD  DGIA0005,                                               +        
               LTH=14                                                           
         MFLD  DGIA0006,                                               +        
               LTH=14                                                           
         MFLD  DGIA0007,                                               +        
               LTH=14                                                           
         MFLD  DGIA0008,                                               +        
               LTH=14                                                           
         MFLD  DGIA0009,                                               +        
               LTH=14                                                           
         MFLD  DGIA0010,                                               +        
               LTH=14                                                           
         MFLD  DGIA0011,                                               +        
               LTH=14                                                           
         MFLD  DGIA0012,                                               +        
               LTH=14                                                           
         MFLD  DGIA0104,                                               +        
               LTH=6                                                            
         MFLD  DGIA0105,                                               +        
               LTH=6                                                            
         MFLD  DGIA0106,                                               +        
               LTH=6                                                            
         MFLD  DGIA0107,                                               +        
               LTH=6                                                            
         MFLD  DGIA0108,                                               +        
               LTH=6                                                            
         MFLD  DGIA0109,                                               +        
               LTH=6                                                            
         MFLD  DGIA0110,                                               +        
               LTH=6                                                            
         MFLD  DGIA0111,                                               +        
               LTH=6                                                            
         MFLD  DGIA0112,                                               +        
               LTH=6                                                            
         MFLD  DGIA0113,                                               +        
               LTH=6                                                            
         MFLD  DGIA0114,                                               +        
               LTH=6                                                            
         MFLD  DGIA0115,                                               +        
               LTH=6                                                            
         MFLD  DGIA0116,                                               +        
               LTH=6                                                            
         MFLD  DGIA0052,                                               +        
               LTH=5                                                            
         MFLD  DGIA0053,                                               +        
               LTH=5                                                            
         MFLD  DGIA0054,                                               +        
               LTH=5                                                            
         MFLD  DGIA0055,                                               +        
               LTH=5                                                            
         MFLD  DGIA0056,                                               +        
               LTH=5                                                            
         MFLD  DGIA0057,                                               +        
               LTH=5                                                            
         MFLD  DGIA0058,                                               +        
               LTH=5                                                            
         MFLD  DGIA0059,                                               +        
               LTH=5                                                            
         MFLD  DGIA0060,                                               +        
               LTH=5                                                            
         MFLD  DGIA0061,                                               +        
               LTH=5                                                            
         MFLD  DGIA0062,                                               +        
               LTH=5                                                            
         MFLD  DGIA0063,                                               +        
               LTH=5                                                            
         MFLD  DGIA0064,                                               +        
               LTH=5                                                            
         MFLD  DGIA0091,                                               +        
               LTH=9                                                            
         MFLD  DGIA0092,                                               +        
               LTH=9                                                            
         MFLD  DGIA0093,                                               +        
               LTH=9                                                            
         MFLD  DGIA0094,                                               +        
               LTH=9                                                            
         MFLD  DGIA0095,                                               +        
               LTH=9                                                            
         MFLD  DGIA0096,                                               +        
               LTH=9                                                            
         MFLD  DGIA0097,                                               +        
               LTH=9                                                            
         MFLD  DGIA0098,                                               +        
               LTH=9                                                            
         MFLD  DGIA0099,                                               +        
               LTH=9                                                            
         MFLD  DGIA0100,                                               +        
               LTH=9                                                            
         MFLD  DGIA0101,                                               +        
               LTH=9                                                            
         MFLD  DGIA0102,                                               +        
               LTH=9                                                            
         MFLD  DGIA0103,                                               +        
               LTH=9                                                            
         MFLD  DGIA0078,                                               +        
               LTH=5                                                            
         MFLD  DGIA0079,                                               +        
               LTH=5                                                            
         MFLD  DGIA0080,                                               +        
               LTH=5                                                            
         MFLD  DGIA0081,                                               +        
               LTH=5                                                            
         MFLD  DGIA0082,                                               +        
               LTH=5                                                            
         MFLD  DGIA0083,                                               +        
               LTH=5                                                            
         MFLD  DGIA0084,                                               +        
               LTH=5                                                            
         MFLD  DGIA0085,                                               +        
               LTH=5                                                            
         MFLD  DGIA0086,                                               +        
               LTH=5                                                            
         MFLD  DGIA0087,                                               +        
               LTH=5                                                            
         MFLD  DGIA0088,                                               +        
               LTH=5                                                            
         MFLD  DGIA0089,                                               +        
               LTH=5                                                            
         MFLD  DGIA0090,                                               +        
               LTH=5                                                            
         MFLD  DGIA0117,                                               +        
               LTH=1                                                            
         MFLD  DGIA0118,                                               +        
               LTH=1                                                            
         MFLD  DGIA0119,                                               +        
               LTH=1                                                            
         MFLD  DGIA0120,                                               +        
               LTH=1                                                            
         MFLD  DGIA0121,                                               +        
               LTH=1                                                            
         MFLD  DGIA0122,                                               +        
               LTH=1                                                            
         MFLD  DGIA0123,                                               +        
               LTH=1                                                            
         MFLD  DGIA0124,                                               +        
               LTH=1                                                            
         MFLD  DGIA0125,                                               +        
               LTH=1                                                            
         MFLD  DGIA0126,                                               +        
               LTH=1                                                            
         MFLD  DGIA0127,                                               +        
               LTH=1                                                            
         MFLD  DGIA0128,                                               +        
               LTH=1                                                            
         MFLD  DGIA0129,                                               +        
               LTH=1                                                            
         MFLD  DGIA0065,                                               +        
               LTH=7                                                            
         MFLD  DGIA0066,                                               +        
               LTH=7                                                            
         MFLD  DGIA0067,                                               +        
               LTH=7                                                            
         MFLD  DGIA0068,                                               +        
               LTH=7                                                            
         MFLD  DGIA0069,                                               +        
               LTH=7                                                            
         MFLD  DGIA0070,                                               +        
               LTH=7                                                            
         MFLD  DGIA0071,                                               +        
               LTH=7                                                            
         MFLD  DGIA0072,                                               +        
               LTH=7                                                            
         MFLD  DGIA0073,                                               +        
               LTH=7                                                            
         MFLD  DGIA0074,                                               +        
               LTH=7                                                            
         MFLD  DGIA0075,                                               +        
               LTH=7                                                            
         MFLD  DGIA0076,                                               +        
               LTH=7                                                            
         MFLD  DGIA0077,                                               +        
               LTH=7                                                            
         MFLD  DGIA0013,                                               +        
               LTH=10                                                           
         MFLD  DGIA0014,                                               +        
               LTH=10                                                           
         MFLD  DGIA0015,                                               +        
               LTH=10                                                           
         MFLD  DGIA0016,                                               +        
               LTH=10                                                           
         MFLD  DGIA0017,                                               +        
               LTH=10                                                           
         MFLD  DGIA0018,                                               +        
               LTH=10                                                           
         MFLD  DGIA0019,                                               +        
               LTH=10                                                           
         MFLD  DGIA0020,                                               +        
               LTH=10                                                           
         MFLD  DGIA0021,                                               +        
               LTH=10                                                           
         MFLD  DGIA0022,                                               +        
               LTH=10                                                           
         MFLD  DGIA0023,                                               +        
               LTH=10                                                           
         MFLD  DGIA0024,                                               +        
               LTH=10                                                           
         MFLD  DGIA0025,                                               +        
               LTH=10                                                           
         MFLD  IDARTNRE,                                               +        
               LTH=9                                                            
         MFLD  IDARTNRN,                                               +        
               LTH=9                                                            
         MFLD  DAREG9E,                                                +        
               LTH=8                                                            
         MFLD  DAREG9N,                                                +        
               LTH=8                                                            
         MFLD  IDLEVNRE,                                               +        
               LTH=5                                                            
         MFLD  IDLEVNRN,                                               +        
               LTH=5                                                            
         MFLD  DGIA0145,                                               +        
               LTH=1                                                            
         MFLD  DGIA0146,                                               +        
               LTH=1                                                            
         MFLD  DGIA0130,                                               +        
               LTH=5                                                            
         MFLD  DGIA0131,                                               +        
               LTH=5                                                            
         MFLD  DGIA0132,                                               +        
               LTH=5                                                            
         MFLD  DGIA0133,                                               +        
               LTH=5                                                            
         MFLD  DGIA0134,                                               +        
               LTH=5                                                            
         MFLD  DGIA0135,                                               +        
               LTH=5                                                            
         MFLD  DGIA0136,                                               +        
               LTH=5                                                            
         MFLD  DGIA0137,                                               +        
               LTH=5                                                            
         MFLD  DGIA0138,                                               +        
               LTH=5                                                            
         MFLD  DGIA0139,                                               +        
               LTH=5                                                            
         MFLD  DGIA0140,                                               +        
               LTH=5                                                            
         MFLD  DGIA0141,                                               +        
               LTH=5                                                            
         MFLD  DGIA0142,                                               +        
               LTH=5                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=79                                                           
         MSGEND                                                                 
         END                                                                    
