***********************************************************************         
* CREATED BY PC38409   ON 94/01/20  AT 16:42                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'KVALITET PROVPLAN               '                               
W6F231   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W6T231 7',                                           +        
               8='W6T231 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W6T231U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W6T231  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W1T166  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,11)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Provplan',                                             +        
               POS=(1,12),LTH=8,                                       +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Provplan',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(ALPHA,PROT)                                                
DGIA0000 DFLD  POS=(2,11),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Uttag (Init/Red)',                                     +        
               POS=(2,14),LTH=16,                                      +        
               ATTR=(PROT)                                                      
DGIA0002 DFLD  POS=(2,31),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0001 DFLD  POS=(3,11),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0003 DFLD  POS=(3,31),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
TEXT     DFLD  POS=(4,2),LTH=16,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  ' ',                                                    +        
               POS=(4,19),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
SKPLOT3  DFLD  POS=(4,21),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
SKPLOT4  DFLD  POS=(4,24),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  ' ',                                                    +        
               POS=(4,27),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
         DFLD  'Antal    Antal    Antal',                              +        
               POS=(6,2),LTH=23,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'fom',                                                  +        
               POS=(7,2),LTH=3,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'tom',                                                  +        
               POS=(7,11),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'kontr.',                                               +        
               POS=(7,20),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FOM1     DFLD  POS=(8,2),LTH=7,                                        +        
               ATTR=(PROT)                                                      
TOM1     DFLD  POS=(8,11),LTH=7,                                       +        
               ATTR=(PROT)                                                      
ANTAL1   DFLD  POS=(8,20),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FOM2     DFLD  POS=(9,2),LTH=7,                                        +        
               ATTR=(PROT)                                                      
TOM2     DFLD  POS=(9,11),LTH=7,                                       +        
               ATTR=(PROT)                                                      
ANTAL2   DFLD  POS=(9,20),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FOM3     DFLD  POS=(10,2),LTH=7,                                       +        
               ATTR=(PROT)                                                      
TOM3     DFLD  POS=(10,11),LTH=7,                                      +        
               ATTR=(PROT)                                                      
ANTAL3   DFLD  POS=(10,20),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FOM4     DFLD  POS=(11,2),LTH=7,                                       +        
               ATTR=(PROT)                                                      
TOM4     DFLD  POS=(11,11),LTH=7,                                      +        
               ATTR=(PROT)                                                      
ANTAL4   DFLD  POS=(11,20),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FOM5     DFLD  POS=(12,2),LTH=7,                                       +        
               ATTR=(PROT)                                                      
TOM5     DFLD  POS=(12,11),LTH=7,                                      +        
               ATTR=(PROT)                                                      
ANTAL5   DFLD  POS=(12,20),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Nyupplägg/ändring:',                                   +        
               POS=(18,2),LTH=18,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Borttag',                                              +        
               POS=(18,44),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0004 DFLD  POS=(19,3),LTH=7,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0006 DFLD  POS=(19,12),LTH=7,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0005 DFLD  POS=(19,21),LTH=6,                                      +        
               ATTR=(NOPROT)                                                    
BORTTAG  DFLD  POS=(19,47),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  '13',                                                   +        
               POS=(21,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '14',                                                   +        
               POS=(21,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15',                                                   +        
               POS=(21,33),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,49),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,33),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,49),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W6I23101 MSG   TYPE=INPUT,                                             +        
               SOR=(W6F231),                                           +        
               OPT=2,                                                  +        
               NXT=W6O23101                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS1,                                              +        
               '6'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS2,                                              +        
               '2'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  (IDTRANS3,                                              +        
               '3'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  (IDTRANS4,                                              +        
               '1'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '62311',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0000,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  DGIA0001,                                               +        
               LTH=1                                                            
         MFLD  (DGIA0002,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (DGIA0003,                                              +        
               ' '),                                                   +        
               LTH=1                                                            
         MFLD  (SKPLOT3,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0004,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0006,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0005,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (BORTTAG,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W6O23101 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6F231,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I23101,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DGIA0000,                                               +        
               LTH=2                                                            
         MFLD  DGIA0001,                                               +        
               LTH=1                                                            
         MFLD  DGIA0002,                                               +        
               LTH=2                                                            
         MFLD  DGIA0003,                                               +        
               LTH=1                                                            
         MFLD  TEXT,                                                   +        
               LTH=16                                                           
         MFLD  SKPLOT3,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SKPLOT4,                                                +        
               LTH=2                                                            
         MFLD  FOM1,                                                   +        
               LTH=7                                                            
         MFLD  TOM1,                                                   +        
               LTH=7                                                            
         MFLD  ANTAL1,                                                 +        
               LTH=6                                                            
         MFLD  FOM2,                                                   +        
               LTH=7                                                            
         MFLD  TOM2,                                                   +        
               LTH=7                                                            
         MFLD  ANTAL2,                                                 +        
               LTH=6                                                            
         MFLD  FOM3,                                                   +        
               LTH=7                                                            
         MFLD  TOM3,                                                   +        
               LTH=7                                                            
         MFLD  ANTAL3,                                                 +        
               LTH=6                                                            
         MFLD  FOM4,                                                   +        
               LTH=7                                                            
         MFLD  TOM4,                                                   +        
               LTH=7                                                            
         MFLD  ANTAL4,                                                 +        
               LTH=6                                                            
         MFLD  FOM5,                                                   +        
               LTH=7                                                            
         MFLD  TOM5,                                                   +        
               LTH=7                                                            
         MFLD  ANTAL5,                                                 +        
               LTH=6                                                            
         MFLD  DGIA0004,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0006,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0005,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BORTTAG,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=61                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=79                                                           
         MSGEND                                                                 
         END                                                                    
