***********************************************************************         
* CREATED BY V063442   ON 01/04/04  AT 16:57                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'LEVERANTÖR                      '                               
W6F221   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W6T221 7',                                           +        
               8='W6T221 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W6T221U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W6T221V ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,8)),                                         +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'LEVERANTÖR',                                           +        
               POS=(1,12),LTH=10,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Levnr',                                                +        
               POS=(2,2),LTH=5,                                        +        
               ATTR=(ALPHA,PROT)                                                
DGIA0005 DFLD  POS=(2,8),LTH=5,                                        +        
               ATTR=(NOPROT)                                                    
         DFLD  'Gadr',                                                 +        
               POS=(2,14),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0001 DFLD  POS=(2,19),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0006 DFLD  POS=(3,8),LTH=5,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0004 DFLD  POS=(3,19),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0000 DFLD  POS=(4,2),LTH=5,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0002 DFLD  POS=(4,8),LTH=5,                                        +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0003 DFLD  POS=(4,14),LTH=5,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         DFLD  'Leverantör:',                                          +        
               POS=(5,2),LTH=11,                                       +        
               ATTR=(PROT)                                                      
LEVNAMN  DFLD  POS=(6,2),LTH=35,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  ' ',                                                    +        
               POS=(6,38),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
         DFLD  'Kvalitets kontroll',                                   +        
               POS=(7,2),LTH=18,                                       +        
               ATTR=(PROT)                                                      
FLSKPLOT DFLD  POS=(7,21),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Borttag av leverantör:',                               +        
               POS=(7,47),LTH=22,                                      +        
               ATTR=(PROT)                                                      
DGIA0008 DFLD  POS=(7,70),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'memo/e-mail1:',                                        +        
               POS=(8,2),LTH=13,                                       +        
               ATTR=(PROT)                                                      
IDMAIL1  DFLD  POS=(8,16),LTH=60,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'memo/e-mail2:',                                        +        
               POS=(9,2),LTH=13,                                       +        
               ATTR=(PROT)                                                      
IDMAIL2  DFLD  POS=(9,16),LTH=60,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'memo/e-mail3:',                                        +        
               POS=(10,2),LTH=13,                                      +        
               ATTR=(PROT)                                                      
IDMAIL3  DFLD  POS=(10,16),LTH=60,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Godsadress:',                                          +        
               POS=(11,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Namn',                                                 +        
               POS=(12,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
BELEV    DFLD  POS=(12,10),LTH=35,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Borttag av godsadress:',                               +        
               POS=(12,47),LTH=22,                                     +        
               ATTR=(PROT)                                                      
DGIA0007 DFLD  POS=(12,70),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Adress',                                               +        
               POS=(13,2),LTH=6,                                       +        
               ATTR=(PROT)                                                      
ADRESS1  DFLD  POS=(13,10),LTH=35,                                     +        
               ATTR=(NOPROT)                                                    
ADRESS2  DFLD  POS=(14,10),LTH=35,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Q-Fax1',                                               +        
               POS=(14,47),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDFAX1   DFLD  POS=(14,54),LTH=16,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Postadr',                                              +        
               POS=(15,2),LTH=7,                                       +        
               ATTR=(PROT)                                                      
POSTADR  DFLD  POS=(15,10),LTH=35,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Q-Fax2',                                               +        
               POS=(15,47),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDFAX2   DFLD  POS=(15,54),LTH=16,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Land',                                                 +        
               POS=(16,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
ADLEVLND DFLD  POS=(16,10),LTH=20,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'A-Fax3',                                               +        
               POS=(16,47),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDFAX3   DFLD  POS=(16,54),LTH=16,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Telefon',                                              +        
               POS=(17,2),LTH=7,                                       +        
               ATTR=(PROT)                                                      
IDLEVTLF DFLD  POS=(17,10),LTH=20,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'A-Fax4',                                               +        
               POS=(17,47),LTH=6,                                      +        
               ATTR=(PROT)                                                      
IDFAX4   DFLD  POS=(17,54),LTH=16,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Attention Q:',                                         +        
               POS=(18,2),LTH=12,                                      +        
               ATTR=(PROT)                                                      
ATTENTQ  DFLD  POS=(18,15),LTH=40,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Attention A:',                                         +        
               POS=(19,2),LTH=12,                                      +        
               ATTR=(PROT)                                                      
ATTENTA  DFLD  POS=(19,15),LTH=40,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'F10=WHELP F11=UPDATE F12=Logoff',                      +        
               POS=(22,2),LTH=31,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W6I22101 MSG   TYPE=INPUT,                                             +        
               SOR=(W6F221),                                           +        
               OPT=2,                                                  +        
               NXT=W6O22101                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '62211',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0005,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  DGIA0006,                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0001,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0004,                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0000,                                               +        
               LTH=5                                                            
         MFLD  DGIA0002,                                               +        
               LTH=5                                                            
         MFLD  DGIA0003,                                               +        
               LTH=5                                                            
         MFLD  (FLSKPLOT,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (DGIA0008,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (IDMAIL1,                                               +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++'),                                                +        
               LTH=60                                                           
         MFLD  (IDMAIL2,                                               +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++'),                                                +        
               LTH=60                                                           
         MFLD  (IDMAIL3,                                               +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++'),                                                +        
               LTH=60                                                           
         MFLD  (BELEV,                                                 +        
               '+++++++++++++++++++++++++++++++++++'),                 +        
               LTH=35                                                           
         MFLD  (DGIA0007,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (ADRESS1,                                               +        
               '+++++++++++++++++++++++++++++++++++'),                 +        
               LTH=35                                                           
         MFLD  (ADRESS2,                                               +        
               '+++++++++++++++++++++++++++++++++++'),                 +        
               LTH=35                                                           
         MFLD  (IDFAX1,                                                +        
               '++++++++++++++++'),                                    +        
               LTH=16                                                           
         MFLD  (POSTADR,                                               +        
               '+++++++++++++++++++++++++++++++++++'),                 +        
               LTH=35                                                           
         MFLD  (IDFAX2,                                                +        
               '++++++++++++++++'),                                    +        
               LTH=16                                                           
         MFLD  (ADLEVLND,                                              +        
               '++++++++++++++++++++'),                                +        
               LTH=20                                                           
         MFLD  (IDFAX3,                                                +        
               '++++++++++++++++'),                                    +        
               LTH=16                                                           
         MFLD  (IDLEVTLF,                                              +        
               '++++++++++++++++++++'),                                +        
               LTH=20                                                           
         MFLD  (IDFAX4,                                                +        
               '++++++++++++++++'),                                    +        
               LTH=16                                                           
         MFLD  (ATTENTQ,                                               +        
               '++++++++++++++++++++++++++++++++++++++++'),            +        
               LTH=40                                                           
         MFLD  (ATTENTA,                                               +        
               '++++++++++++++++++++++++++++++++++++++++'),            +        
               LTH=40                                                           
         MSGEND                                                                 
W6O22101 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6F221,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I22101,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DGIA0005,                                               +        
               LTH=5                                                            
         MFLD  DGIA0006,                                               +        
               LTH=5                                                            
         MFLD  DGIA0001,                                               +        
               LTH=5                                                            
         MFLD  DGIA0004,                                               +        
               LTH=5                                                            
         MFLD  DGIA0000,                                               +        
               LTH=5                                                            
         MFLD  DGIA0002,                                               +        
               LTH=5                                                            
         MFLD  DGIA0003,                                               +        
               LTH=5                                                            
         MFLD  FLSKPLOT,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0008,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDMAIL1,                                                +        
               LTH=62,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDMAIL2,                                                +        
               LTH=62,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDMAIL3,                                                +        
               LTH=62,                                                 +        
               ATTR=(YES)                                                       
         MFLD  BELEV,                                                  +        
               LTH=37,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0007,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADRESS1,                                                +        
               LTH=37,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ADRESS2,                                                +        
               LTH=37,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDFAX1,                                                 +        
               LTH=18,                                                 +        
               ATTR=(YES)                                                       
         MFLD  POSTADR,                                                +        
               LTH=37,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDFAX2,                                                 +        
               LTH=18,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ADLEVLND,                                               +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDFAX3,                                                 +        
               LTH=18,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVTLF,                                               +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDFAX4,                                                 +        
               LTH=18,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ATTENTQ,                                                +        
               LTH=42,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ATTENTA,                                                +        
               LTH=42,                                                 +        
               ATTR=(YES)                                                       
         MFLD  LEVNAMN,                                                +        
               LTH=35                                                           
         MFLD  TEMFSINF,                                               +        
               LTH=61                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=55                                                           
         MSGEND                                                                 
         END                                                                    
