***********************************************************************         
* CREATED BY V063442   ON 06/03/07  AT 13:57                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'KONTROLLRAPPORT BEDÖMD          '                               
W6F203   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W6T203U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W6T201  ',                                          +        
               14='W6T202  ',                                          +        
               15='W6T203  ',                                          +        
               16='W6T204  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W6T207  ',                                          +        
               20='W6T208  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W6T203V ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,8)),                                         +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'KONTROLLRAPPORT BEDÖMD',                               +        
               POS=(1,12),LTH=22,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'KR-nr',                                                +        
               POS=(2,2),LTH=5,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDKRIN   DFLD  POS=(2,8),LTH=5,                                        +        
               ATTR=(NOPROT)                                                    
IDKRUT   DFLD  POS=(3,8),LTH=5,                                        +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Artikel',                                              +        
               POS=(5,2),LTH=7,                                        +        
               ATTR=(PROT)                                                      
IDARTNR  DFLD  POS=(5,13),LTH=9,                                       +        
               ATTR=(PROT)                                                      
BEART    DFLD  POS=(5,23),LTH=24,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Status',                                               +        
               POS=(5,48),LTH=6,                                       +        
               ATTR=(ALPHA,PROT)                                                
KDKRSTA  DFLD  POS=(5,55),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Regdat',                                               +        
               POS=(5,57),LTH=6,                                       +        
               ATTR=(ALPHA,PROT)                                                
TIREGDAT DFLD  POS=(5,65),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Ansk',                                                 +        
               POS=(5,72),LTH=4,                                       +        
               ATTR=(ALPHA,PROT)                                                
IDANSK   DFLD  POS=(5,78),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Lev',                                                  +        
               POS=(6,2),LTH=3,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDLEVNR  DFLD  POS=(6,6),LTH=5,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Gadr',                                                 +        
               POS=(6,12),LTH=4,                                       +        
               ATTR=(ALPHA,PROT)                                                
IDLEVG   DFLD  POS=(6,17),LTH=5,                                       +        
               ATTR=(PROT)                                                      
BELEV    DFLD  POS=(6,23),LTH=30,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Lev.fel',                                              +        
               POS=(6,57),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLKRLFEL DFLD  POS=(6,65),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Åtg.beg',                                              +        
               POS=(6,72),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLKRATG  DFLD  POS=(6,80),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Inköp',                                                +        
               POS=(7,57),LTH=5,                                       +        
               ATTR=(PROT)                                                      
INKOP    DFLD  POS=(7,65),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Att.kontor',                                           +        
               POS=(8,2),LTH=10,                                       +        
               ATTR=(PROT)                                                      
ADATTENT DFLD  POS=(8,13),LTH=40,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Ej avslutad KR VIR',                                   +        
               POS=(8,54),LTH=18,                                      +        
               ATTR=(NUM,PROT)                                                  
KRTOVIR  DFLD  POS=(8,73),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Ingen kontroll',                                       +        
               POS=(9,54),LTH=14,                                      +        
               ATTR=(NUM,PROT)                                                  
EJKNTRL  DFLD  POS=(9,73),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Specifikation',                                        +        
               POS=(12,40),LTH=13,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Arb.tid',                                              +        
               POS=(13,2),LTH=7,                                       +        
               ATTR=(PROT)                                                      
ARBTIDIN DFLD  POS=(13,17),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARBTIDUT DFLD  POS=(13,33),LTH=4,                                      +        
               ATTR=(PROT)                                                      
ARBSPEC  DFLD  POS=(13,40),LTH=30,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Transport kost',                                       +        
               POS=(14,2),LTH=14,                                      +        
               ATTR=(PROT)                                                      
PRARBIN  DFLD  POS=(14,17),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
PRARBUT  DFLD  POS=(14,28),LTH=7,                                      +        
               ATTR=(PROT)                                                      
COSTSPEC DFLD  POS=(14,40),LTH=30,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Material kost.',                                       +        
               POS=(15,2),LTH=14,                                      +        
               ATTR=(PROT)                                                      
PRMATIN  DFLD  POS=(15,17),LTH=10,                                     +        
               ATTR=(NUM,NOPROT)                                                
PRMATUT  DFLD  POS=(15,28),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
MATSPEC  DFLD  POS=(15,40),LTH=30,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Omkostnad klar(J/N)',                                  +        
               POS=(16,2),LTH=19,                                      +        
               ATTR=(PROT)                                                      
FLKLAR   DFLD  POS=(16,22),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Deb. arbetstid',                                       +        
               POS=(16,40),LTH=14,                                     +        
               ATTR=(PROT)                                                      
FLTID    DFLD  POS=(16,55),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Lågt värde OK.(J/N)',                                  +        
               POS=(16,57),LTH=19,                                     +        
               ATTR=(PROT)                                                      
FLKRLIM  DFLD  POS=(16,77),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Värde.',                                               +        
               POS=(17,61),LTH=6,                                      +        
               ATTR=(PROT)                                                      
SUKRLIM  DFLD  POS=(17,68),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Pers',                                                 +        
               POS=(18,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KDPERSON DFLD  POS=(18,7),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
BEKRANS  DFLD  POS=(18,11),LTH=25,                                     +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  'Tel',                                                  +        
               POS=(18,37),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
IDKRATLF DFLD  POS=(18,41),LTH=20,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Godk.(J/N)',                                           +        
               POS=(18,62),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
FLKRGODK DFLD  POS=(18,73),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Fax/Tlx',                                              +        
               POS=(19,2),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FAXTLX   DFLD  POS=(19,11),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
KDFAX    DFLD  POS=(19,15),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
IDFAX    DFLD  POS=(19,17),LTH=16,                                     +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Ann. (J/N)',                                           +        
               POS=(19,62),LTH=10,                                     +        
               ATTR=(PROT)                                                      
FLANN    DFLD  POS=(19,73),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'memo/e-mail',                                          +        
               POS=(20,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
KDMEMO   DFLD  POS=(20,14),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
IDMAIL   DFLD  POS=(20,16),LTH=60,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'F10=WHELP F11=UPDATE F12=Logoff',                      +        
               POS=(22,2),LTH=31,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATUM    DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TID      DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W6O20302 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6F203,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I20301,                                           +        
               FILL=C' '                                                        
MOD2     LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=79                                                           
         MSGEND                                                                 
W6I20301 MSG   TYPE=INPUT,                                             +        
               SOR=(W6F203),                                           +        
               OPT=2,                                                  +        
               NXT=W6O20301                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '62031',                                                +        
               LTH=5                                                            
         MFLD  (IDKRIN,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDKRUT,                                                 +        
               LTH=5                                                            
         MFLD  (FLKRLFEL,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (FLKRATG,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (INKOP,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (ADATTENT,                                              +        
               '++++++++++++++++++++++++++++++++++++++++'),            +        
               LTH=40,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KRTOVIR,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (EJKNTRL,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (ARBTIDIN,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARBSPEC,                                               +        
               '++++++++++++++++++++++++++++++'),                      +        
               LTH=30                                                           
         MFLD  (PRARBIN,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COSTSPEC,                                              +        
               '++++++++++++++++++++++++++++++'),                      +        
               LTH=30                                                           
         MFLD  (PRMATIN,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (MATSPEC,                                               +        
               '++++++++++++++++++++++++++++++'),                      +        
               LTH=30                                                           
         MFLD  (FLKLAR,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (FLTID,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (FLKRLIM,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (KDPERSON,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDKRATLF,                                              +        
               '++++++++++++++++++++'),                                +        
               LTH=20                                                           
         MFLD  (FLKRGODK,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (FAXTLX,                                                +        
               '+++'),                                                 +        
               LTH=3                                                            
         MFLD  (KDFAX,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (FLANN,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (KDMEMO,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W6O20301 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6F203,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I20301,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDKRIN,                                                 +        
               LTH=2                                                            
         MFLD  IDKRUT,                                                 +        
               LTH=5                                                            
         MFLD  IDARTNR,                                                +        
               LTH=9                                                            
         MFLD  BEART,                                                  +        
               LTH=24                                                           
         MFLD  KDKRSTA,                                                +        
               LTH=1                                                            
         MFLD  TIREGDAT,                                               +        
               LTH=6                                                            
         MFLD  IDANSK,                                                 +        
               LTH=3                                                            
         MFLD  IDLEVNR,                                                +        
               LTH=5                                                            
         MFLD  IDLEVG,                                                 +        
               LTH=5                                                            
         MFLD  BELEV,                                                  +        
               LTH=30                                                           
         MFLD  FLKRLFEL,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLKRATG,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  INKOP,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADATTENT,                                               +        
               LTH=42,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KRTOVIR,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  EJKNTRL,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARBTIDIN,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARBTIDUT,                                               +        
               LTH=4                                                            
         MFLD  ARBSPEC,                                                +        
               LTH=32,                                                 +        
               ATTR=(YES)                                                       
         MFLD  PRARBIN,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRARBUT,                                                +        
               LTH=7                                                            
         MFLD  COSTSPEC,                                               +        
               LTH=32,                                                 +        
               ATTR=(YES)                                                       
         MFLD  PRMATIN,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  PRMATUT,                                                +        
               LTH=10                                                           
         MFLD  MATSPEC,                                                +        
               LTH=32,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLKLAR,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLTID,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLKRLIM,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SUKRLIM,                                                +        
               LTH=6                                                            
         MFLD  KDPERSON,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BEKRANS,                                                +        
               LTH=25                                                           
         MFLD  IDKRATLF,                                               +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLKRGODK,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FAXTLX,                                                 +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDFAX,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDFAX,                                                  +        
               LTH=18,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLANN,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDMEMO,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDMAIL,                                                 +        
               LTH=62,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATUM,                                                 +        
               DATE4)                                                           
         MFLD  (TID,                                                   +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=79                                                           
         MSGEND                                                                 
         END                                                                    
