***********************************************************************         
* CREATED BY V059625   ON 01/07/06  AT 15:31                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'NDC LOST CASE FOUND             '                               
W6F309   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W6T309 7',                                           +        
               8='W6T309 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W6T309U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W6T301  ',                                          +        
               14='W6T302  ',                                          +        
               15='W6T303  ',                                          +        
               16='W6T304  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W6F309   DPAGE CURSOR=((2,10)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC LOST CASE FOUND',                                   +        
               POS=(1,13),LTH=18,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Invoice',                                              +        
               POS=(2,2),LTH=7,                                        +        
               ATTR=(NUM,PROT)                                                  
FAKTI    DFLD  POS=(2,10),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Order',                                                +        
               POS=(2,20),LTH=5,                                       +        
               ATTR=(PROT)                                                      
ORDNRIN  DFLD  POS=(2,26),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Cust.',                                                +        
               POS=(2,34),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KUNDI    DFLD  POS=(2,40),LTH=6,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Case',                                                 +        
               POS=(2,49),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KOLLII   DFLD  POS=(2,54),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'DC-inv',                                               +        
               POS=(2,60),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
DCSI     DFLD  POS=(2,68),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'DC',                                                   +        
               POS=(2,72),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DCI      DFLD  POS=(2,75),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
FAKTU    DFLD  POS=(3,10),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
ORDNRUT  DFLD  POS=(3,26),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
KUNDU    DFLD  POS=(3,40),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
KOLLIU   DFLD  POS=(3,54),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DCSU     DFLD  POS=(3,68),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DCU      DFLD  POS=(3,75),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
BEKR     DFLD  POS=(4,2),LTH=1,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Part No.',                                             +        
               POS=(6,2),LTH=8,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Binned    Scrap',                                      +        
               POS=(6,15),LTH=15,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Area',                                                 +        
               POS=(6,39),LTH=4,                                       +        
               ATTR=(PROT)                                                      
ART1     DFLD  POS=(7,2),LTH=9,                                        +        
               ATTR=(NOPROT)                                                    
KVANT1   DFLD  POS=(7,15),LTH=6,                                       +        
               ATTR=(NOPROT)                                                    
SCRAP1   DFLD  POS=(7,25),LTH=7,                                       +        
               ATTR=(NOPROT)                                                    
ADOM1    DFLD  POS=(7,39),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
ADG1     DFLD  POS=(7,43),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
ADPL1    DFLD  POS=(7,47),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
ART2     DFLD  POS=(8,2),LTH=9,                                        +        
               ATTR=(NOPROT)                                                    
KVANT2   DFLD  POS=(8,15),LTH=6,                                       +        
               ATTR=(NOPROT)                                                    
SCRAP2   DFLD  POS=(8,25),LTH=7,                                       +        
               ATTR=(NOPROT)                                                    
ADOM2    DFLD  POS=(8,39),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
ADG2     DFLD  POS=(8,43),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
ADPL2    DFLD  POS=(8,47),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
ART3     DFLD  POS=(9,2),LTH=9,                                        +        
               ATTR=(NOPROT)                                                    
KVANT3   DFLD  POS=(9,15),LTH=6,                                       +        
               ATTR=(NOPROT)                                                    
SCRAP3   DFLD  POS=(9,25),LTH=7,                                       +        
               ATTR=(NOPROT)                                                    
ADOM3    DFLD  POS=(9,39),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
ADG3     DFLD  POS=(9,43),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
ADPL3    DFLD  POS=(9,47),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
ART4     DFLD  POS=(10,2),LTH=9,                                       +        
               ATTR=(NOPROT)                                                    
KVANT4   DFLD  POS=(10,15),LTH=6,                                      +        
               ATTR=(NOPROT)                                                    
SCRAP4   DFLD  POS=(10,25),LTH=7,                                      +        
               ATTR=(NOPROT)                                                    
ADOM4    DFLD  POS=(10,39),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
ADG4     DFLD  POS=(10,43),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
ADPL4    DFLD  POS=(10,47),LTH=5,                                      +        
               ATTR=(NOPROT)                                                    
ART5     DFLD  POS=(11,2),LTH=9,                                       +        
               ATTR=(NOPROT)                                                    
KVANT5   DFLD  POS=(11,15),LTH=6,                                      +        
               ATTR=(NOPROT)                                                    
SCRAP5   DFLD  POS=(11,25),LTH=7,                                      +        
               ATTR=(NOPROT)                                                    
ADOM5    DFLD  POS=(11,39),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
ADG5     DFLD  POS=(11,43),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
ADPL5    DFLD  POS=(11,47),LTH=5,                                      +        
               ATTR=(NOPROT)                                                    
ART6     DFLD  POS=(12,2),LTH=9,                                       +        
               ATTR=(NOPROT)                                                    
KVANT6   DFLD  POS=(12,15),LTH=6,                                      +        
               ATTR=(NOPROT)                                                    
SCRAP6   DFLD  POS=(12,25),LTH=7,                                      +        
               ATTR=(NOPROT)                                                    
ADOM6    DFLD  POS=(12,39),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
ADG6     DFLD  POS=(12,43),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
ADPL6    DFLD  POS=(12,47),LTH=5,                                      +        
               ATTR=(NOPROT)                                                    
ART7     DFLD  POS=(13,2),LTH=9,                                       +        
               ATTR=(NOPROT)                                                    
KVANT7   DFLD  POS=(13,15),LTH=6,                                      +        
               ATTR=(NOPROT)                                                    
SCRAP7   DFLD  POS=(13,25),LTH=7,                                      +        
               ATTR=(NOPROT)                                                    
ADOM7    DFLD  POS=(13,39),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
ADG7     DFLD  POS=(13,43),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
ADPL7    DFLD  POS=(13,47),LTH=5,                                      +        
               ATTR=(NOPROT)                                                    
ART8     DFLD  POS=(14,2),LTH=9,                                       +        
               ATTR=(NOPROT)                                                    
KVANT8   DFLD  POS=(14,15),LTH=6,                                      +        
               ATTR=(NOPROT)                                                    
SCRAP8   DFLD  POS=(14,25),LTH=7,                                      +        
               ATTR=(NOPROT)                                                    
ADOM8    DFLD  POS=(14,39),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
ADG8     DFLD  POS=(14,43),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
ADPL8    DFLD  POS=(14,47),LTH=5,                                      +        
               ATTR=(NOPROT)                                                    
ART9     DFLD  POS=(15,2),LTH=9,                                       +        
               ATTR=(NOPROT)                                                    
KVANT9   DFLD  POS=(15,15),LTH=6,                                      +        
               ATTR=(NOPROT)                                                    
SCRAP9   DFLD  POS=(15,25),LTH=7,                                      +        
               ATTR=(NOPROT)                                                    
ADOM9    DFLD  POS=(15,39),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
ADG9     DFLD  POS=(15,43),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
ADPL9    DFLD  POS=(15,47),LTH=5,                                      +        
               ATTR=(NOPROT)                                                    
ART10    DFLD  POS=(16,2),LTH=9,                                       +        
               ATTR=(NOPROT)                                                    
KVANT10  DFLD  POS=(16,15),LTH=6,                                      +        
               ATTR=(NOPROT)                                                    
SCRAP10  DFLD  POS=(16,25),LTH=7,                                      +        
               ATTR=(NOPROT)                                                    
ADOM10   DFLD  POS=(16,39),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
ADG10    DFLD  POS=(16,43),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
ADPL10   DFLD  POS=(16,47),LTH=5,                                      +        
               ATTR=(NOPROT)                                                    
ART11    DFLD  POS=(17,2),LTH=9,                                       +        
               ATTR=(NOPROT)                                                    
KVANT11  DFLD  POS=(17,15),LTH=6,                                      +        
               ATTR=(NOPROT)                                                    
SCRAP11  DFLD  POS=(17,25),LTH=7,                                      +        
               ATTR=(NOPROT)                                                    
ADOM11   DFLD  POS=(17,39),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
ADG11    DFLD  POS=(17,43),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
ADPL11   DFLD  POS=(17,47),LTH=5,                                      +        
               ATTR=(NOPROT)                                                    
ART12    DFLD  POS=(18,2),LTH=9,                                       +        
               ATTR=(NOPROT)                                                    
KVANT12  DFLD  POS=(18,15),LTH=6,                                      +        
               ATTR=(NOPROT)                                                    
SCRAP12  DFLD  POS=(18,25),LTH=7,                                      +        
               ATTR=(NOPROT)                                                    
ADOM12   DFLD  POS=(18,39),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
ADG12    DFLD  POS=(18,43),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
ADPL12   DFLD  POS=(18,47),LTH=5,                                      +        
               ATTR=(NOPROT)                                                    
ART13    DFLD  POS=(19,2),LTH=9,                                       +        
               ATTR=(NOPROT)                                                    
KVANT13  DFLD  POS=(19,15),LTH=6,                                      +        
               ATTR=(NOPROT)                                                    
SCRAP13  DFLD  POS=(19,25),LTH=7,                                      +        
               ATTR=(NOPROT)                                                    
ADOM13   DFLD  POS=(19,39),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
ADG13    DFLD  POS=(19,43),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
ADPL13   DFLD  POS=(19,47),LTH=5,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Case ready',                                           +        
               POS=(19,54),LTH=10,                                     +        
               ATTR=(PROT)                                                      
KLARFL   DFLD  POS=(19,65),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Empl.ID',                                              +        
               POS=(19,67),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
IDUSER   DFLD  POS=(19,75),LTH=5,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  '13  DC Received 14  DC Unload   15  DC Binning  16',   +        
               POS=(21,1),LTH=50,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,65),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,1),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,33),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,49),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10  WHELP',                                            +        
               POS=(22,65),LTH=9,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W6O30901 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6F309,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I30901,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W6F309,                                             +        
               NXT=W6I30901                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  FAKTI,                                                  +        
               LTH=7                                                            
         MFLD  FAKTU,                                                  +        
               LTH=7                                                            
         MFLD  ORDNRIN,                                                +        
               LTH=5                                                            
         MFLD  ORDNRUT,                                                +        
               LTH=5                                                            
         MFLD  KUNDI,                                                  +        
               LTH=6                                                            
         MFLD  KUNDU,                                                  +        
               LTH=6                                                            
         MFLD  KOLLII,                                                 +        
               LTH=5                                                            
         MFLD  KOLLIU,                                                 +        
               LTH=5                                                            
         MFLD  DCSI,                                                   +        
               LTH=2                                                            
         MFLD  DCSU,                                                   +        
               LTH=2                                                            
         MFLD  DCI,                                                    +        
               LTH=2                                                            
         MFLD  DCU,                                                    +        
               LTH=2                                                            
         MFLD  BEKR,                                                   +        
               LTH=1                                                            
         MFLD  ART1,                                                   +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVANT1,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SCRAP1,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADOM1,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADG1,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADPL1,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ART2,                                                   +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVANT2,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SCRAP2,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADOM2,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADG2,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADPL2,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ART3,                                                   +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVANT3,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SCRAP3,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADOM3,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADG3,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADPL3,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ART4,                                                   +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVANT4,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SCRAP4,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADOM4,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADG4,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADPL4,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ART5,                                                   +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVANT5,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SCRAP5,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADOM5,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADG5,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADPL5,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ART6,                                                   +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVANT6,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SCRAP6,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADOM6,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADG6,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADPL6,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ART7,                                                   +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVANT7,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SCRAP7,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADOM7,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADG7,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADPL7,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ART8,                                                   +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVANT8,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SCRAP8,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADOM8,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADG8,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADPL8,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ART9,                                                   +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVANT9,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SCRAP9,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADOM9,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADG9,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADPL9,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ART10,                                                  +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVANT10,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SCRAP10,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADOM10,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADG10,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADPL10,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ART11,                                                  +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVANT11,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SCRAP11,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADOM11,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADG11,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADPL11,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ART12,                                                  +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVANT12,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SCRAP12,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADOM12,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADG12,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADPL12,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ART13,                                                  +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVANT13,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SCRAP13,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADOM13,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADG13,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADPL13,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KLARFL,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDUSER,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  DATE,                                                   +        
               LTH=8                                                            
         MFLD  TIME,                                                   +        
               LTH=8                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W6I30901 MSG   TYPE=INPUT,                                             +        
               SOR=(W6F309),                                           +        
               OPT=2,                                                  +        
               NXT=W6O30901                                                     
MID      LPAGE SOR=(W6F309),                                           +        
               NXT=W6O30901                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F9'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '63091',                                                +        
               LTH=5                                                            
         MFLD  (FAKTI,                                                 +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FAKTU,                                                 +        
               '       '),                                             +        
               LTH=7                                                            
         MFLD  (ORDNRIN,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ORDNRUT,                                               +        
               '     '),                                               +        
               LTH=5                                                            
         MFLD  (KUNDI,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KUNDU,                                                 +        
               '      '),                                              +        
               LTH=6                                                            
         MFLD  (KOLLII,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOLLIU,                                                +        
               '     '),                                               +        
               LTH=5                                                            
         MFLD  (DCSI,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DCSU,                                                  +        
               '  '),                                                  +        
               LTH=2                                                            
         MFLD  (DCI,                                                   +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DCU,                                                   +        
               '  '),                                                  +        
               LTH=2                                                            
         MFLD  (BEKR,                                                  +        
               ' '),                                                   +        
               LTH=1                                                            
         MFLD  (ART1,                                                  +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVANT1,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (SCRAP1,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ADOM1,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ADG1,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ADPL1,                                                 +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ART2,                                                  +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVANT2,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (SCRAP2,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ADOM2,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ADG2,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ADPL2,                                                 +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ART3,                                                  +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVANT3,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (SCRAP3,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ADOM3,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ADG3,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ADPL3,                                                 +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ART4,                                                  +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVANT4,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (SCRAP4,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ADOM4,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ADG4,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ADPL4,                                                 +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ART5,                                                  +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVANT5,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (SCRAP5,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ADOM5,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ADG5,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ADPL5,                                                 +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ART6,                                                  +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVANT6,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (SCRAP6,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ADOM6,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ADG6,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ADPL6,                                                 +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ART7,                                                  +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVANT7,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (SCRAP7,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ADOM7,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ADG7,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ADPL7,                                                 +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ART8,                                                  +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVANT8,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (SCRAP8,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ADOM8,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ADG8,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ADPL8,                                                 +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ART9,                                                  +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVANT9,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (SCRAP9,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ADOM9,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ADG9,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ADPL9,                                                 +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ART10,                                                 +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVANT10,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (SCRAP10,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ADOM10,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ADG10,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ADPL10,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ART11,                                                 +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVANT11,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (SCRAP11,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ADOM11,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ADG11,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ADPL11,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ART12,                                                 +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVANT12,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (SCRAP12,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ADOM12,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ADG12,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ADPL12,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ART13,                                                 +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVANT13,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (SCRAP13,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ADOM13,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ADG13,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ADPL13,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KLARFL,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDUSER,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
