***********************************************************************         
* CREATED BY V059625   ON 99/12/20  AT 13:32                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'PREPACKING INSTRUCTOIONS        '                               
W6N183   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W6T183 4',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W6T183 7',                                           +        
               8='W6T183 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W6T183U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W6T183V ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W6N183   DPAGE CURSOR=((2,13)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'PREPACKING INSTRUCTIONS',                              +        
               POS=(1,12),LTH=23,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Suppl No.',                                            +        
               POS=(2,2),LTH=10,                                       +        
               ATTR=(NUM,PROT)                                                  
IDLEVNRI DFLD  POS=(2,13),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Part No. ',                                            +        
               POS=(2,20),LTH=9,                                       +        
               ATTR=(PROT)                                                      
IDARTNRI DFLD  POS=(2,30),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Reg No.',                                              +        
               POS=(2,41),LTH=7,                                       +        
               ATTR=(PROT)                                                      
IDREGNRI DFLD  POS=(2,49),LTH=7,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDLEVNRU DFLD  POS=(3,13),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
IDARTNRU DFLD  POS=(3,30),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
IDREGNRU DFLD  POS=(3,49),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Copy to Part No.      ',                               +        
               POS=(5,2),LTH=22,                                       +        
               ATTR=(PROT)                                                      
KOARTNRI DFLD  POS=(5,25),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Suppl No.',                                            +        
               POS=(5,37),LTH=9,                                       +        
               ATTR=(PROT)                                                      
KOLEVNRI DFLD  POS=(5,47),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
MODRAD   DFLD  POS=(6,2),LTH=16,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Reg No.',                                              +        
               POS=(7,2),LTH=7,                                        +        
               ATTR=(PROT)                                                      
REGNRUT  DFLD  POS=(7,10),LTH=7,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'P-type',                                               +        
               POS=(7,20),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FPTYPUT  DFLD  POS=(7,29),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Reg date ',                                            +        
               POS=(7,37),LTH=9,                                       +        
               ATTR=(PROT)                                                      
DATUMUT  DFLD  POS=(7,47),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Changed',                                              +        
               POS=(7,58),LTH=7,                                       +        
               ATTR=(PROT)                                                      
MODDATEU DFLD  POS=(7,66),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'New instruct. ',                                       +        
               POS=(8,2),LTH=14,                                       +        
               ATTR=(PROT)                                                      
KDNYINST DFLD  POS=(8,17),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Resp.   ',                                             +        
               POS=(8,20),LTH=8,                                       +        
               ATTR=(PROT)                                                      
KDUSER   DFLD  POS=(8,29),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Delete instruction  (Y)',                              +        
               POS=(8,37),LTH=23,                                      +        
               ATTR=(PROT)                                                      
KDDELETE DFLD  POS=(8,61),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
TEINST01 DFLD  POS=(10,2),LTH=60,                                      +        
               ATTR=(NOPROT)                                                    
TEINST02 DFLD  POS=(11,2),LTH=60,                                      +        
               ATTR=(NOPROT)                                                    
TEINST03 DFLD  POS=(12,2),LTH=60,                                      +        
               ATTR=(NOPROT)                                                    
TEINST04 DFLD  POS=(13,2),LTH=60,                                      +        
               ATTR=(NOPROT)                                                    
TEINST05 DFLD  POS=(14,2),LTH=60,                                      +        
               ATTR=(NOPROT)                                                    
TEINST06 DFLD  POS=(15,2),LTH=60,                                      +        
               ATTR=(NOPROT)                                                    
TEINST07 DFLD  POS=(16,2),LTH=60,                                      +        
               ATTR=(NOPROT)                                                    
TEINST08 DFLD  POS=(17,2),LTH=60,                                      +        
               ATTR=(NOPROT)                                                    
TEINST09 DFLD  POS=(18,2),LTH=60,                                      +        
               ATTR=(NOPROT)                                                    
TEINST10 DFLD  POS=(19,2),LTH=60,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'PrinterID',                                            +        
               POS=(20,53),LTH=9,                                      +        
               ATTR=(PROT)                                                      
IDPRINTI DFLD  POS=(20,63),LTH=8,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Pf4 Print  PF10 WHELP  Pf12 Logoff',                   +        
               POS=(22,2),LTH=34,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W6O183N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6N183,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I183N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W6N183                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  IDLEVNRI,                                               +        
               LTH=5                                                            
         MFLD  IDLEVNRU,                                               +        
               LTH=5                                                            
         MFLD  IDARTNRI,                                               +        
               LTH=9                                                            
         MFLD  IDARTNRU,                                               +        
               LTH=9                                                            
         MFLD  IDREGNRI,                                               +        
               LTH=7                                                            
         MFLD  IDREGNRU,                                               +        
               LTH=7                                                            
         MFLD  REGNRUT,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOARTNRI,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KOLEVNRI,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  MODRAD,                                                 +        
               LTH=16                                                           
         MFLD  FPTYPUT,                                                +        
               LTH=2                                                            
         MFLD  DATUMUT,                                                +        
               LTH=6                                                            
         MFLD  MODDATEU,                                               +        
               LTH=6                                                            
         MFLD  KDNYINST,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDUSER,                                                 +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDDELETE,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEINST01,                                               +        
               LTH=62,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEINST02,                                               +        
               LTH=62,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEINST03,                                               +        
               LTH=62,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEINST04,                                               +        
               LTH=62,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEINST05,                                               +        
               LTH=62,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEINST06,                                               +        
               LTH=62,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEINST07,                                               +        
               LTH=62,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEINST08,                                               +        
               LTH=62,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEINST09,                                               +        
               LTH=62,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEINST10,                                               +        
               LTH=62,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDPRINTI,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W6I183N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W6N183),                                           +        
               OPT=2,                                                  +        
               NXT=W6O183N1                                                     
MID      LPAGE SOR=(W6N183)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F8'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '61831',                                                +        
               LTH=5                                                            
         MFLD  (IDLEVNRI,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDLEVNRU,                                              +        
               '     '),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDARTNRI,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  IDARTNRU,                                               +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDREGNRI,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  IDREGNRU,                                               +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  REGNRUT,                                                +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KOARTNRI,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KOLEVNRI,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KDNYINST,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDUSER,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDDELETE,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TEINST01,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++'),                                                +        
               LTH=60,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TEINST02,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++'),                                                +        
               LTH=60,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TEINST03,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++'),                                                +        
               LTH=60,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TEINST04,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++'),                                                +        
               LTH=60,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TEINST05,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++'),                                                +        
               LTH=60,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TEINST06,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++'),                                                +        
               LTH=60,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TEINST07,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++'),                                                +        
               LTH=60,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TEINST08,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++'),                                                +        
               LTH=60,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TEINST09,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++'),                                                +        
               LTH=60,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TEINST10,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++'),                                                +        
               LTH=60,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDPRINTI,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
