****** ****************************************************************         
* CREATED BY PC22543   ON 95/01/04  AT 15:36                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'REGISTER SEVERAL SUPPLIERS      '                               
W6N113   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W6T111  ',                                          +        
               14='W6T112  ',                                          +        
               15='W6T113  ',                                          +        
               16='W6T114  ',                                          +        
               17='W6T115  ',                                          +        
               18='W6T116  ',                                          +        
               19='W6T117  ',                                          +        
               20='W6T118  ',                                          +        
               21='W6T119  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W6N113   DPAGE CURSOR=((2,60)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Register Several Suppliers',                           +        
               POS=(1,11),LTH=26,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
IDLEVNRI DFLD  POS=(2,8),LTH=5,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
IDFSI    DFLD  POS=(2,19),LTH=8,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
AVIDATIN DFLD  POS=(2,35),LTH=6,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
INLPRTIN DFLD  POS=(2,50),LTH=4,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'DC',                                                   +        
               POS=(2,57),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDDCIN   DFLD  POS=(2,60),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
IDLEVNRU DFLD  POS=(3,8),LTH=5,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
IDFSU    DFLD  POS=(3,19),LTH=8,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
AVIDATUT DFLD  POS=(3,35),LTH=6,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
INLPRTUT DFLD  POS=(3,50),LTH=4,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
IDDCUT   DFLD  POS=(3,60),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Carrier',                                              +        
               POS=(5,2),LTH=7,                                        +        
               ATTR=(PROT)                                                      
IDLBBETI DFLD  POS=(5,10),LTH=12,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Approved (y/n)',                                       +        
               POS=(5,34),LTH=14,                                      +        
               ATTR=(PROT)                                                      
FLGODKI  DFLD  POS=(5,49),LTH=1,                                       +        
               ATTR=(PROT)                                                      
IDLBBETU DFLD  POS=(6,10),LTH=12,                                      +        
               ATTR=(PROT,MOD)                                                  
FLGODKU  DFLD  POS=(6,49),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Suppl.No RT    Adv No',                                +        
               POS=(7,2),LTH=21,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Del.date  Part No.  Qty',                              +        
               POS=(7,28),LTH=23,                                      +        
               ATTR=(PROT)                                                      
LEV1     DFLD  POS=(8,2),LTH=5,                                        +        
               ATTR=(NOPROT)                                                    
KDRT1    DFLD  POS=(8,11),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
FS1      DFLD  POS=(8,17),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
AVID1    DFLD  POS=(8,28),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
ART1     DFLD  POS=(8,37),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
AVIS1    DFLD  POS=(8,47),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
LEV2     DFLD  POS=(9,2),LTH=5,                                        +        
               ATTR=(NOPROT)                                                    
KDRT2    DFLD  POS=(9,11),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
FS2      DFLD  POS=(9,17),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
AVID2    DFLD  POS=(9,28),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
ART2     DFLD  POS=(9,37),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
AVIS2    DFLD  POS=(9,47),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
LEV3     DFLD  POS=(10,2),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
KDRT3    DFLD  POS=(10,11),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
FS3      DFLD  POS=(10,17),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
AVID3    DFLD  POS=(10,28),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ART3     DFLD  POS=(10,37),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
AVIS3    DFLD  POS=(10,47),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
LEV4     DFLD  POS=(11,2),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
KDRT4    DFLD  POS=(11,11),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
FS4      DFLD  POS=(11,17),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
AVID4    DFLD  POS=(11,28),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ART4     DFLD  POS=(11,37),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
AVIS4    DFLD  POS=(11,47),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
LEV5     DFLD  POS=(12,2),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
KDRT5    DFLD  POS=(12,11),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
FS5      DFLD  POS=(12,17),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
AVID5    DFLD  POS=(12,28),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ART5     DFLD  POS=(12,37),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
AVIS5    DFLD  POS=(12,47),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
LEV6     DFLD  POS=(13,2),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
KDRT6    DFLD  POS=(13,11),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
FS6      DFLD  POS=(13,17),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
AVID6    DFLD  POS=(13,28),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ART6     DFLD  POS=(13,37),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
AVIS6    DFLD  POS=(13,47),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
LEV7     DFLD  POS=(14,2),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
KDRT7    DFLD  POS=(14,11),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
FS7      DFLD  POS=(14,17),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
AVID7    DFLD  POS=(14,28),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ART7     DFLD  POS=(14,37),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
AVIS7    DFLD  POS=(14,47),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
LEV8     DFLD  POS=(15,2),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
KDRT8    DFLD  POS=(15,11),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
FS8      DFLD  POS=(15,17),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
AVID8    DFLD  POS=(15,28),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ART8     DFLD  POS=(15,37),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
AVIS8    DFLD  POS=(15,47),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
LEV9     DFLD  POS=(16,2),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
KDRT9    DFLD  POS=(16,11),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
FS9      DFLD  POS=(16,17),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
AVID9    DFLD  POS=(16,28),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ART9     DFLD  POS=(16,37),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
AVIS9    DFLD  POS=(16,47),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
LEV10    DFLD  POS=(17,2),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
KDRT10   DFLD  POS=(17,11),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
FS10     DFLD  POS=(17,17),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
AVID10   DFLD  POS=(17,28),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ART10    DFLD  POS=(17,37),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
AVIS10   DFLD  POS=(17,47),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
LEV11    DFLD  POS=(18,2),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
KDRT11   DFLD  POS=(18,11),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
FS11     DFLD  POS=(18,17),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
AVID11   DFLD  POS=(18,28),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ART11    DFLD  POS=(18,37),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
AVIS11   DFLD  POS=(18,47),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
LEV12    DFLD  POS=(19,2),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
KDRT12   DFLD  POS=(19,11),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
FS12     DFLD  POS=(19,17),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
AVID12   DFLD  POS=(19,28),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ART12    DFLD  POS=(19,37),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
AVIS12   DFLD  POS=(19,47),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
STOPPTKN DFLD  POS=(19,54),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
TRAP     DFLD  POS=(19,56),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KDRTIN   DFLD  POS=(20,2),LTH=2,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
KDRTUT   DFLD  POS=(20,5),LTH=2,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KLIVISIN DFLD  POS=(20,8),LTH=1,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KLIVISUT DFLD  POS=(20,10),LTH=1,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
LOPNRMIN DFLD  POS=(20,12),LTH=8,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
LOPNRMUT DFLD  POS=(20,21),LTH=8,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         DFLD  '13 Reg Adv info 14 Reg 1 suppl  15 Reg sev suppl16 Corr+        
               ect Adv  17 Act.Adv.note',                              +        
               POS=(21,2),LTH=79,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 Reg Adv Acco 19 Reg R34-tran',                      +        
               POS=(22,2),LTH=31,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20 Back out...  21 Cancel Batch 10 WHELP',             +        
               POS=(22,34),LTH=40,                                     +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W6O113N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6N113,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I113N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W6N113                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDLEVNRI,                                               +        
               LTH=5                                                            
         MFLD  IDFSI,                                                  +        
               LTH=8                                                            
         MFLD  AVIDATIN,                                               +        
               LTH=6                                                            
         MFLD  INLPRTIN,                                               +        
               LTH=4                                                            
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  IDLEVNRU,                                               +        
               LTH=5                                                            
         MFLD  IDFSU,                                                  +        
               LTH=8                                                            
         MFLD  AVIDATUT,                                               +        
               LTH=6                                                            
         MFLD  INLPRTUT,                                               +        
               LTH=4                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  IDLBBETI,                                               +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLGODKI,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDLBBETU,                                               +        
               LTH=12                                                           
         MFLD  FLGODKU,                                                +        
               LTH=1                                                            
         MFLD  LEV1,                                                   +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEV2,                                                   +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEV3,                                                   +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEV4,                                                   +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEV5,                                                   +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEV6,                                                   +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEV7,                                                   +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEV8,                                                   +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEV9,                                                   +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEV10,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEV11,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEV12,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDRT1,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDRT2,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDRT3,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDRT4,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDRT5,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDRT6,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDRT7,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDRT8,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDRT9,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDRT10,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDRT11,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDRT12,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FS1,                                                    +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FS2,                                                    +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FS3,                                                    +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FS4,                                                    +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FS5,                                                    +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FS6,                                                    +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FS7,                                                    +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FS8,                                                    +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FS9,                                                    +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FS10,                                                   +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FS11,                                                   +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FS12,                                                   +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  AVID1,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVID2,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVID3,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVID4,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVID5,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVID6,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVID7,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVID8,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVID9,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVID10,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVID11,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVID12,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ART1,                                                   +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ART2,                                                   +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ART3,                                                   +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ART4,                                                   +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ART5,                                                   +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ART6,                                                   +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ART7,                                                   +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ART8,                                                   +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ART9,                                                   +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ART10,                                                  +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ART11,                                                  +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ART12,                                                  +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  AVIS1,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVIS2,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVIS3,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVIS4,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVIS5,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVIS6,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVIS7,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVIS8,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVIS9,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVIS10,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVIS11,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVIS12,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDRTIN,                                                 +        
               LTH=2                                                            
         MFLD  KDRTUT,                                                 +        
               LTH=2                                                            
         MFLD  KLIVISIN,                                               +        
               LTH=1                                                            
         MFLD  KLIVISUT,                                               +        
               LTH=1                                                            
         MFLD  LOPNRMIN,                                               +        
               LTH=8                                                            
         MFLD  LOPNRMUT,                                               +        
               LTH=8                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W6I113N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W6N113),                                           +        
               OPT=2,                                                  +        
               NXT=W6O113N1                                                     
MID      LPAGE SOR=(W6N113)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '61132',                                                +        
               LTH=5                                                            
         MFLD  (IDLEVNRI,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  IDLEVNRU,                                               +        
               LTH=5                                                            
         MFLD  (IDFSI,                                                 +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  IDFSU,                                                  +        
               LTH=8                                                            
         MFLD  (AVIDATIN,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  AVIDATUT,                                               +        
               LTH=6                                                            
         MFLD  (INLPRTIN,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  INLPRTUT,                                               +        
               LTH=4                                                            
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  (KDRTIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KDRTUT,                                                 +        
               LTH=2                                                            
         MFLD  (IDLBBETI,                                              +        
               '++++++++++++'),                                        +        
               LTH=12                                                           
         MFLD  IDLBBETU,                                               +        
               LTH=12                                                           
         MFLD  (KLIVISIN,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  KLIVISUT,                                               +        
               LTH=1                                                            
         MFLD  (LOPNRMIN,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  LOPNRMUT,                                               +        
               LTH=8                                                            
         MFLD  (FLGODKI,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  FLGODKU,                                                +        
               LTH=1                                                            
         MFLD  (LEV1,                                                  +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (LEV2,                                                  +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (LEV3,                                                  +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (LEV4,                                                  +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (LEV5,                                                  +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (LEV6,                                                  +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (LEV7,                                                  +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (LEV8,                                                  +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (LEV9,                                                  +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (LEV10,                                                 +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (LEV11,                                                 +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (LEV12,                                                 +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KDRT1,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDRT2,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDRT3,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDRT4,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDRT5,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDRT6,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDRT7,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDRT8,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDRT9,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDRT10,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDRT11,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDRT12,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FS1,                                                   +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (FS2,                                                   +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (FS3,                                                   +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (FS4,                                                   +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (FS5,                                                   +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (FS6,                                                   +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (FS7,                                                   +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (FS8,                                                   +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (FS9,                                                   +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (FS10,                                                  +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (FS11,                                                  +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (FS12,                                                  +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (AVID1,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVID2,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVID3,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVID4,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVID5,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVID6,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVID7,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVID8,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVID9,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVID10,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVID11,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVID12,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ART1,                                                  +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ART2,                                                  +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ART3,                                                  +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ART4,                                                  +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ART5,                                                  +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ART6,                                                  +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ART7,                                                  +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ART8,                                                  +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ART9,                                                  +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ART10,                                                 +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ART11,                                                 +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ART12,                                                 +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVIS1,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVIS2,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVIS3,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVIS4,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVIS5,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVIS6,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVIS7,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVIS8,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVIS9,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVIS10,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVIS11,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVIS12,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
