***********************************************************************         
* CREATED BY PC63442   ON 98/10/07  AT 13:20                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'GOODS RECEIVING INFORMATION     '                               
W6N165   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W6T165 7',                                           +        
               8='W6T165 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W5T107  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W6T161  ',                                          +        
               14='W6T162  ',                                          +        
               15='W6T163  ',                                          +        
               16='W6T164  ',                                          +        
               17='W6T165  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W6T165  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'GOODS RECEIVING INFORMATION',                          +        
               POS=(1,12),LTH=27,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Part No.',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(NUM,PROT)                                                  
FLD0212  DFLD  POS=(2,12),LTH=9,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'DC',                                                   +        
               POS=(2,22),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0225  DFLD  POS=(2,25),LTH=2,                                       +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
FLD0312  DFLD  POS=(3,12),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0325  DFLD  POS=(3,25),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0402  DFLD  POS=(4,2),LTH=15,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0420  DFLD  POS=(4,20),LTH=6,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'RT',                                                   +        
               POS=(5,3),LTH=2,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Seq Date    Sup AT Location    AK   Adv.No.  Qty   Spli+        
               t   Return Dv',                                         +        
               POS=(5,11),LTH=68,                                      +        
               ATTR=(PROT)                                                      
COL0206  DFLD  POS=(6,2),LTH=78,                                       +        
               ATTR=(PROT)                                                      
COL0207  DFLD  POS=(7,2),LTH=78,                                       +        
               ATTR=(PROT)                                                      
COL0208  DFLD  POS=(8,2),LTH=78,                                       +        
               ATTR=(PROT)                                                      
COL0209  DFLD  POS=(9,2),LTH=78,                                       +        
               ATTR=(PROT)                                                      
COL0210  DFLD  POS=(10,2),LTH=78,                                      +        
               ATTR=(PROT)                                                      
COL0211  DFLD  POS=(11,2),LTH=78,                                      +        
               ATTR=(PROT)                                                      
COL0212  DFLD  POS=(12,2),LTH=78,                                      +        
               ATTR=(PROT)                                                      
COL0213  DFLD  POS=(13,2),LTH=78,                                      +        
               ATTR=(PROT)                                                      
COL0214  DFLD  POS=(14,2),LTH=78,                                      +        
               ATTR=(PROT)                                                      
COL0215  DFLD  POS=(15,2),LTH=78,                                      +        
               ATTR=(PROT)                                                      
COL0216  DFLD  POS=(16,2),LTH=78,                                      +        
               ATTR=(PROT)                                                      
COL0217  DFLD  POS=(17,2),LTH=78,                                      +        
               ATTR=(PROT)                                                      
COL0218  DFLD  POS=(18,2),LTH=78,                                      +        
               ATTR=(PROT)                                                      
COL0219  DFLD  POS=(19,2),LTH=78,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W6O165N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6N165,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I165N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0212,                                                +        
               LTH=9                                                            
         MFLD  FLD0312,                                                +        
               LTH=9                                                            
         MFLD  FLD0225,                                                +        
               LTH=2                                                            
         MFLD  FLD0325,                                                +        
               LTH=2                                                            
         MFLD  FLD0402,                                                +        
               LTH=15                                                           
         MFLD  FLD0420,                                                +        
               LTH=6                                                            
         MFLD  COL0206,                                                +        
               LTH=78                                                           
         MFLD  COL0207,                                                +        
               LTH=78                                                           
         MFLD  COL0208,                                                +        
               LTH=78                                                           
         MFLD  COL0209,                                                +        
               LTH=78                                                           
         MFLD  COL0210,                                                +        
               LTH=78                                                           
         MFLD  COL0211,                                                +        
               LTH=78                                                           
         MFLD  COL0212,                                                +        
               LTH=78                                                           
         MFLD  COL0213,                                                +        
               LTH=78                                                           
         MFLD  COL0214,                                                +        
               LTH=78                                                           
         MFLD  COL0215,                                                +        
               LTH=78                                                           
         MFLD  COL0216,                                                +        
               LTH=78                                                           
         MFLD  COL0217,                                                +        
               LTH=78                                                           
         MFLD  COL0218,                                                +        
               LTH=78                                                           
         MFLD  COL0219,                                                +        
               LTH=78                                                           
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W6I165N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W6N165),                                           +        
               OPT=2,                                                  +        
               NXT=W6O165N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '61652',                                                +        
               LTH=5                                                            
         MFLD  (FLD0212,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0312,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0225,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0325,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0402,                                                +        
               LTH=15,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0420,                                                +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
