***********************************************************************         
* CREATED BY V063442   ON 02/02/11  AT 10:43                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'RECEIVING REPORTS INFO          '                               
W6N109   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W6T196U ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W6T109 4',                                          +        
               12='/RCL.   ',                                          +        
               13='W6T101  ',                                          +        
               14='W6T102  ',                                          +        
               15='W6T103  ',                                          +        
               16='W6T104  ',                                          +        
               17='W6T105  ',                                          +        
               18='W6T106  ',                                          +        
               19='W6T107  ',                                          +        
               20='W6T108  ',                                          +        
               21='W6T109  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,8)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Receiving report information',                         +        
               POS=(1,11),LTH=28,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Suppl',                                                +        
               POS=(2,2),LTH=5,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDLEVNRI DFLD  POS=(2,8),LTH=5,                                        +        
               ATTR=(NOPROT)                                                    
         DFLD  'Case.No',                                              +        
               POS=(2,14),LTH=7,                                       +        
               ATTR=(ALPHA,PROT)                                                
CASEIN   DFLD  POS=(2,22),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Seq.No',                                               +        
               POS=(2,35),LTH=6,                                       +        
               ATTR=(PROT)                                                      
SEQUENIN DFLD  POS=(2,43),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,53),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
IDDCIN   DFLD  POS=(2,56),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
IDLEVNRU DFLD  POS=(3,8),LTH=5,                                        +        
               ATTR=(PROT,MOD)                                                  
CASEUT   DFLD  POS=(3,22),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
SEQUENUT DFLD  POS=(3,43),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDCUT   DFLD  POS=(3,56),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Part',                                                 +        
               POS=(5,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
IDARTNR  DFLD  POS=(5,9),LTH=8,                                        +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Qty',                                                  +        
               POS=(5,18),LTH=3,                                       +        
               ATTR=(PROT)                                                      
KVAVIS   DFLD  POS=(5,27),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Descr',                                                +        
               POS=(5,34),LTH=5,                                       +        
               ATTR=(PROT)                                                      
BEART    DFLD  POS=(5,43),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Re Refill',                                            +        
               POS=(5,69),LTH=9,                                       +        
               ATTR=(PROT)                                                      
KVAINL   DFLD  POS=(5,79),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Adv No',                                               +        
               POS=(6,2),LTH=6,                                        +        
               ATTR=(PROT)                                                      
IDFS     DFLD  POS=(6,9),LTH=8,                                        +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Adv date',                                             +        
               POS=(6,18),LTH=8,                                       +        
               ATTR=(PROT)                                                      
TIAVIDAT DFLD  POS=(6,27),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Carrier',                                              +        
               POS=(6,34),LTH=7,                                       +        
               ATTR=(PROT)                                                      
IDLBBET  DFLD  POS=(6,43),LTH=12,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'RT',                                                   +        
               POS=(6,57),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KDRT     DFLD  POS=(6,60),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Qty.c',                                                +        
               POS=(6,63),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
AKONTR   DFLD  POS=(6,69),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Suppl',                                                +        
               POS=(7,2),LTH=5,                                        +        
               ATTR=(PROT)                                                      
IDLEVNR  DFLD  POS=(7,9),LTH=5,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Rec date',                                             +        
               POS=(7,18),LTH=8,                                       +        
               ATTR=(PROT)                                                      
TIINLMOT DFLD  POS=(7,27),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Poss add',                                             +        
               POS=(7,34),LTH=8,                                       +        
               ATTR=(PROT)                                                      
POSSADD1 DFLD  POS=(7,43),LTH=4,                                       +        
               ATTR=(PROT)                                                      
POSSADD2 DFLD  POS=(7,48),LTH=4,                                       +        
               ATTR=(PROT)                                                      
POSSADD3 DFLD  POS=(7,53),LTH=4,                                       +        
               ATTR=(PROT)                                                      
POSSADD4 DFLD  POS=(7,58),LTH=4,                                       +        
               ATTR=(PROT)                                                      
POSSADD5 DFLD  POS=(7,63),LTH=4,                                       +        
               ATTR=(PROT)                                                      
POSSADD6 DFLD  POS=(7,68),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Qty info',                                             +        
               POS=(9,2),LTH=8,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Part info',                                            +        
               POS=(9,23),LTH=9,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Estimated',                                            +        
               POS=(10,11),LTH=9,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Qty',                                                  +        
               POS=(11,2),LTH=3,                                       +        
               ATTR=(PROT)                                                      
KVANT    DFLD  POS=(11,13),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Weight',                                               +        
               POS=(11,23),LTH=6,                                      +        
               ATTR=(PROT)                                                      
VIKTSORT DFLD  POS=(11,31),LTH=2,                                      +        
               ATTR=(PROT)                                                      
VKART    DFLD  POS=(11,37),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Storage loc',                                          +        
               POS=(11,46),LTH=11,                                     +        
               ATTR=(PROT)                                                      
LO       DFLD  POS=(11,60),LTH=2,                                      +        
               ATTR=(PROT)                                                      
GANG     DFLD  POS=(11,63),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
PLATS    DFLD  POS=(11,66),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Prio',                                                 +        
               POS=(12,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KVPRIO   DFLD  POS=(12,13),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Vol',                                                  +        
               POS=(12,23),LTH=3,                                      +        
               ATTR=(PROT)                                                      
VOLSORT  DFLD  POS=(12,27),LTH=6,                                      +        
               ATTR=(PROT)                                                      
VLARTNTO DFLD  POS=(12,34),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Buffer loc',                                           +        
               POS=(12,46),LTH=10,                                     +        
               ATTR=(PROT)                                                      
LOBUFF   DFLD  POS=(12,60),LTH=2,                                      +        
               ATTR=(PROT)                                                      
GANGBUFF DFLD  POS=(12,63),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
PLATSBUF DFLD  POS=(12,66),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Qty prim',                                             +        
               POS=(13,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
KVPRIM   DFLD  POS=(13,13),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Tpack',                                                +        
               POS=(13,23),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KDLAGEMB DFLD  POS=(13,40),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Origin',                                               +        
               POS=(13,46),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KDARTUR  DFLD  POS=(13,63),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Qty sec',                                              +        
               POS=(14,2),LTH=7,                                       +        
               ATTR=(PROT)                                                      
KVKVASEK DFLD  POS=(14,13),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'PT',                                                   +        
               POS=(14,23),LTH=2,                                      +        
               ATTR=(PROT)                                                      
BEFT     DFLD  POS=(14,42),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Procurer',                                             +        
               POS=(14,46),LTH=8,                                      +        
               ATTR=(PROT)                                                      
IDANSK   DFLD  POS=(14,62),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Kit',                                                  +        
               POS=(15,2),LTH=3,                                       +        
               ATTR=(PROT)                                                      
ADTRDEST DFLD  POS=(15,6),LTH=3,                                       +        
               ATTR=(PROT)                                                      
KVSATS   DFLD  POS=(15,13),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Unit',                                                 +        
               POS=(15,23),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KDSORT   DFLD  POS=(15,42),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Dang  goods',                                          +        
               POS=(15,46),LTH=11,                                     +        
               ATTR=(PROT)                                                      
KDFARLIG DFLD  POS=(15,60),LTH=15,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Q3 qty',                                               +        
               POS=(16,23),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KVQ3     DFLD  POS=(16,38),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Insp code',                                            +        
               POS=(16,46),LTH=9,                                      +        
               ATTR=(PROT)                                                      
KDKONTR  DFLD  POS=(16,60),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'RR w goods',                                           +        
               POS=(17,23),LTH=10,                                     +        
               ATTR=(PROT)                                                      
FLAR     DFLD  POS=(17,43),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Sup part',                                             +        
               POS=(18,23),LTH=8,                                      +        
               ATTR=(PROT)                                                      
BELEV1   DFLD  POS=(18,33),LTH=33,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Printer',                                              +        
               POS=(18,67),LTH=7,                                      +        
               ATTR=(ALPHA,PROT)                                                
PRINTER  DFLD  POS=(18,76),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  ' ',                                                    +        
               POS=(19,1),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
BELEV2   DFLD  POS=(19,33),LTH=33,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  ' ',                                                    +        
               POS=(19,67),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
         DFLD  '13 Adm trolley  14 Move cases   15 Repl label   16 Reg +        
               pick VOR 17 Def steering',                              +        
               POS=(21,2),LTH=79,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 Def location 19 Inq location 20 Inq pre-t ad 21 RR -+        
                info    10 Whelp',                                     +        
               POS=(22,2),LTH=72,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W6O109N2 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6N109,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I109N1,                                           +        
               FILL=PT                                                          
MOD2     LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDLEVNRI,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CASEIN,                                                 +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SEQUENIN,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDDCIN,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRINTER,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=61                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W6O109N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6N109,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I109N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDLEVNRI,                                               +        
               LTH=5                                                            
         MFLD  CASEIN,                                                 +        
               LTH=9                                                            
         MFLD  SEQUENIN,                                               +        
               LTH=9                                                            
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  IDLEVNRU,                                               +        
               LTH=5                                                            
         MFLD  CASEUT,                                                 +        
               LTH=9                                                            
         MFLD  SEQUENUT,                                               +        
               LTH=9                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  IDARTNR,                                                +        
               LTH=8                                                            
         MFLD  KVAVIS,                                                 +        
               LTH=6                                                            
         MFLD  BEART,                                                  +        
               LTH=25                                                           
         MFLD  KVAINL,                                                 +        
               LTH=2                                                            
         MFLD  IDFS,                                                   +        
               LTH=8                                                            
         MFLD  TIAVIDAT,                                               +        
               LTH=6                                                            
         MFLD  IDLBBET,                                                +        
               LTH=12                                                           
         MFLD  KDRT,                                                   +        
               LTH=2                                                            
         MFLD  AKONTR,                                                 +        
               LTH=1                                                            
         MFLD  IDLEVNR,                                                +        
               LTH=5                                                            
         MFLD  TIINLMOT,                                               +        
               LTH=6                                                            
         MFLD  POSSADD1,                                               +        
               LTH=4                                                            
         MFLD  POSSADD2,                                               +        
               LTH=4                                                            
         MFLD  POSSADD3,                                               +        
               LTH=4                                                            
         MFLD  POSSADD4,                                               +        
               LTH=4                                                            
         MFLD  POSSADD5,                                               +        
               LTH=4                                                            
         MFLD  POSSADD6,                                               +        
               LTH=4                                                            
         MFLD  KVANT,                                                  +        
               LTH=6                                                            
         MFLD  VIKTSORT,                                               +        
               LTH=2                                                            
         MFLD  VKART,                                                  +        
               LTH=7                                                            
         MFLD  LO,                                                     +        
               LTH=2                                                            
         MFLD  GANG,                                                   +        
               LTH=2                                                            
         MFLD  PLATS,                                                  +        
               LTH=5                                                            
         MFLD  KVPRIO,                                                 +        
               LTH=6                                                            
         MFLD  VOLSORT,                                                +        
               LTH=6                                                            
         MFLD  VLARTNTO,                                               +        
               LTH=10                                                           
         MFLD  LOBUFF,                                                 +        
               LTH=2                                                            
         MFLD  GANGBUFF,                                               +        
               LTH=2                                                            
         MFLD  PLATSBUF,                                               +        
               LTH=5                                                            
         MFLD  KVPRIM,                                                 +        
               LTH=6                                                            
         MFLD  KDLAGEMB,                                               +        
               LTH=4                                                            
         MFLD  KDARTUR,                                                +        
               LTH=2                                                            
         MFLD  KVKVASEK,                                               +        
               LTH=6                                                            
         MFLD  BEFT,                                                   +        
               LTH=2                                                            
         MFLD  IDANSK,                                                 +        
               LTH=3                                                            
         MFLD  ADTRDEST,                                               +        
               LTH=3                                                            
         MFLD  KVSATS,                                                 +        
               LTH=6                                                            
         MFLD  KDSORT,                                                 +        
               LTH=2                                                            
         MFLD  KDFARLIG,                                               +        
               LTH=15                                                           
         MFLD  KVQ3,                                                   +        
               LTH=6                                                            
         MFLD  KDKONTR,                                                +        
               LTH=5                                                            
         MFLD  FLAR,                                                   +        
               LTH=1                                                            
         MFLD  BELEV1,                                                 +        
               LTH=33                                                           
         MFLD  BELEV2,                                                 +        
               LTH=33                                                           
         MFLD  PRINTER,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=61                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W6I109N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W6N109),                                           +        
               OPT=2,                                                  +        
               NXT=W6O109N1                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F9'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '61092',                                                +        
               LTH=5                                                            
         MFLD  (IDLEVNRI,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  IDLEVNRU,                                               +        
               LTH=5                                                            
         MFLD  (CASEIN,                                                +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  CASEUT,                                                 +        
               LTH=9                                                            
         MFLD  (SEQUENIN,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  SEQUENUT,                                               +        
               LTH=9                                                            
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  (PRINTER,                                               +        
               '++++'),                                                +        
               LTH=4                                                            
         MSGEND                                                                 
         END                                                                    
