***********************************************************************         
* CREATED BY PC63442   ON 98/09/07  AT 14:02                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'REGISTER DELIVERY NOTE W.ACCOUNT'                               
W6N116   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W6T111  ',                                          +        
               14='W6T112  ',                                          +        
               15='W6T113  ',                                          +        
               16='W6T114  ',                                          +        
               17='W6T115  ',                                          +        
               18='W6T116  ',                                          +        
               19='W6T117  ',                                          +        
               20='W6T118  ',                                          +        
               21='W6T119  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W6N116   DPAGE CURSOR=((2,15)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Reg. Advice   Note W. Account',                        +        
               POS=(1,10),LTH=29,                                      +        
               ATTR=(NUM,PROT)                                                  
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Suppl.No.',                                            +        
               POS=(2,2),LTH=9,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDLEVNRI DFLD  POS=(2,15),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'RT',                                                   +        
               POS=(2,22),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KDRTI    DFLD  POS=(2,25),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Adv No',                                               +        
               POS=(2,28),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
IDFSI    DFLD  POS=(2,35),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Del.date',                                             +        
               POS=(2,45),LTH=8,                                       +        
               ATTR=(PROT)                                                      
AVIDATIN DFLD  POS=(2,54),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Printer',                                              +        
               POS=(2,62),LTH=7,                                       +        
               ATTR=(PROT)                                                      
INLPRTIN DFLD  POS=(2,70),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'DC',                                                   +        
               POS=(2,75),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
IDDCIN   DFLD  POS=(2,78),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
IDLEVNRU DFLD  POS=(3,15),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
KDRTU    DFLD  POS=(3,25),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
IDFSU    DFLD  POS=(3,35),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
AVIDATUT DFLD  POS=(3,54),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
INLPRTUT DFLD  POS=(3,70),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDCUT   DFLD  POS=(3,78),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Carr.',                                                +        
               POS=(4,2),LTH=5,                                        +        
               ATTR=(PROT)                                                      
IDLBBETI DFLD  POS=(4,8),LTH=12,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Comp.',                                                +        
               POS=(4,21),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
IDFTGI   DFLD  POS=(4,27),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Acc.',                                                 +        
               POS=(4,30),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
KTOIN    DFLD  POS=(4,35),LTH=10,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Analys',                                               +        
               POS=(4,46),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
ANALYSIN DFLD  POS=(4,53),LTH=12,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Cc',                                                   +        
               POS=(4,66),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
KSTIN    DFLD  POS=(4,69),LTH=10,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Appr(y/n)',                                            +        
               POS=(6,66),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
GDKIN    DFLD  POS=(6,76),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDLBBETU DFLD  POS=(5,8),LTH=12,                                       +        
               ATTR=(PROT,MOD)                                                  
IDFTGU   DFLD  POS=(5,27),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
KTOUT    DFLD  POS=(5,35),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
ANALYSUT DFLD  POS=(5,53),LTH=12,                                      +        
               ATTR=(PROT,MOD)                                                  
KSTUT    DFLD  POS=(5,69),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
GDKUT    DFLD  POS=(6,78),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Part No.  Qty',                                        +        
               POS=(7,2),LTH=13,                                       +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Part No.  Qty',                                        +        
               POS=(7,25),LTH=13,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Part No.  Qty',                                        +        
               POS=(7,48),LTH=13,                                      +        
               ATTR=(PROT)                                                      
ARTNR1   DFLD  POS=(8,2),LTH=8,                                        +        
               ATTR=(NUM,NOPROT)                                                
ANTAL1   DFLD  POS=(8,12),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
ARTNR2   DFLD  POS=(8,25),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
ANTAL2   DFLD  POS=(8,35),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
ARTNR3   DFLD  POS=(8,48),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
ANTAL3   DFLD  POS=(8,58),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
ARTNR4   DFLD  POS=(9,2),LTH=8,                                        +        
               ATTR=(NUM,NOPROT)                                                
ANTAL4   DFLD  POS=(9,12),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
ARTNR5   DFLD  POS=(9,25),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
ANTAL5   DFLD  POS=(9,35),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
ARTNR6   DFLD  POS=(9,48),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
ANTAL6   DFLD  POS=(9,58),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
ARTNR7   DFLD  POS=(10,2),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
ANTAL7   DFLD  POS=(10,12),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR8   DFLD  POS=(10,25),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
ANTAL8   DFLD  POS=(10,35),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR9   DFLD  POS=(10,48),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
ANTAL9   DFLD  POS=(10,58),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR10  DFLD  POS=(11,2),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
ANTA10   DFLD  POS=(11,12),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR11  DFLD  POS=(11,25),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
ANTA11   DFLD  POS=(11,35),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR12  DFLD  POS=(11,48),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
ANTA12   DFLD  POS=(11,58),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR13  DFLD  POS=(12,2),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
ANTA13   DFLD  POS=(12,12),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR14  DFLD  POS=(12,25),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
ANTA14   DFLD  POS=(12,35),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR15  DFLD  POS=(12,48),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
ANTA15   DFLD  POS=(12,58),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR16  DFLD  POS=(13,2),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
ANTA16   DFLD  POS=(13,12),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR17  DFLD  POS=(13,25),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
ANTA17   DFLD  POS=(13,35),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR18  DFLD  POS=(13,48),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
ANTA18   DFLD  POS=(13,58),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR19  DFLD  POS=(14,2),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
ANTA19   DFLD  POS=(14,12),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR20  DFLD  POS=(14,25),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
ANTA20   DFLD  POS=(14,35),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR21  DFLD  POS=(14,48),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
ANTA21   DFLD  POS=(14,58),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR22  DFLD  POS=(15,2),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
ANTA22   DFLD  POS=(15,12),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR23  DFLD  POS=(15,25),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
ANTA23   DFLD  POS=(15,35),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR24  DFLD  POS=(15,48),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
ANTA24   DFLD  POS=(15,58),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR25  DFLD  POS=(16,2),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
ANTA25   DFLD  POS=(16,12),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR26  DFLD  POS=(16,25),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
ANTA26   DFLD  POS=(16,35),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR27  DFLD  POS=(16,48),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
ANTA27   DFLD  POS=(16,58),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR28  DFLD  POS=(17,2),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
ANTA28   DFLD  POS=(17,12),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR29  DFLD  POS=(17,25),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
ANTA29   DFLD  POS=(17,35),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR30  DFLD  POS=(17,48),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
ANTA30   DFLD  POS=(17,58),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR31  DFLD  POS=(18,2),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
ANTA31   DFLD  POS=(18,12),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR32  DFLD  POS=(18,25),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
ANTA32   DFLD  POS=(18,35),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR33  DFLD  POS=(18,48),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
ANTA33   DFLD  POS=(18,58),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR34  DFLD  POS=(19,2),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
ANTA34   DFLD  POS=(19,12),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR35  DFLD  POS=(19,25),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
ANTA35   DFLD  POS=(19,35),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR36  DFLD  POS=(19,48),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
ANTA36   DFLD  POS=(19,58),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
STOPPTKN DFLD  POS=(19,65),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
TRAP     DFLD  POS=(19,67),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KLIVISIN DFLD  POS=(20,2),LTH=1,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
KLIVISUT DFLD  POS=(20,4),LTH=1,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
LOPNRMIN DFLD  POS=(20,8),LTH=8,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
LOPNRMUT DFLD  POS=(20,17),LTH=8,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         DFLD  '13 Reg Adv info 14 Reg 1 suppl  15 Reg sev suppl16 Corr+        
               ect Adv  17 Act.adv.note',                              +        
               POS=(21,2),LTH=79,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 Reg Adv acc  19 Reg R34-tran 20 Back out...  21 Canc+        
               el Batch 10 WHELP',                                     +        
               POS=(22,2),LTH=72,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W6O116N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6N116,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I116N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W6N116                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDLEVNRI,                                               +        
               LTH=5                                                            
         MFLD  KDRTI,                                                  +        
               LTH=2                                                            
         MFLD  IDFSI,                                                  +        
               LTH=8                                                            
         MFLD  AVIDATIN,                                               +        
               LTH=6                                                            
         MFLD  INLPRTIN,                                               +        
               LTH=4                                                            
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  IDLEVNRU,                                               +        
               LTH=5                                                            
         MFLD  KDRTU,                                                  +        
               LTH=2                                                            
         MFLD  IDFSU,                                                  +        
               LTH=8                                                            
         MFLD  AVIDATUT,                                               +        
               LTH=6                                                            
         MFLD  INLPRTUT,                                               +        
               LTH=4                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  IDLBBETI,                                               +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDFTGI,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KTOIN,                                                  +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ANALYSIN,                                               +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KSTIN,                                                  +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  GDKIN,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDLBBETU,                                               +        
               LTH=12                                                           
         MFLD  IDFTGU,                                                 +        
               LTH=2                                                            
         MFLD  KTOUT,                                                  +        
               LTH=10                                                           
         MFLD  ANALYSUT,                                               +        
               LTH=12                                                           
         MFLD  KSTUT,                                                  +        
               LTH=10                                                           
         MFLD  GDKUT,                                                  +        
               LTH=1                                                            
         MFLD  ARTNR1,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR2,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR3,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR4,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR5,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR6,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR7,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR8,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR9,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR10,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR11,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR12,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR13,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR14,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR15,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR16,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR17,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR18,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR19,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR20,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR21,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR22,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR23,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR24,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR25,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR26,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR27,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR28,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR29,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR30,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR31,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR32,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR33,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR34,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR35,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR36,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ANTAL1,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTAL2,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTAL3,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTAL4,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTAL5,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTAL6,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTAL7,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTAL8,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTAL9,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA10,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA11,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA12,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA13,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA14,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA15,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA16,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA17,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA18,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA19,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA20,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA21,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA22,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA23,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA24,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA25,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA26,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA27,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA28,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA29,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA30,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA31,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA32,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA33,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA34,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA35,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA36,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KLIVISIN,                                               +        
               LTH=1                                                            
         MFLD  KLIVISUT,                                               +        
               LTH=1                                                            
         MFLD  LOPNRMIN,                                               +        
               LTH=8                                                            
         MFLD  LOPNRMUT,                                               +        
               LTH=8                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=61                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W6I116N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W6N116),                                           +        
               OPT=2,                                                  +        
               NXT=W6O116N1                                                     
MID      LPAGE SOR=(W6N116)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '61162',                                                +        
               LTH=5                                                            
         MFLD  (IDLEVNRI,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  IDLEVNRU,                                               +        
               LTH=5                                                            
         MFLD  (IDFSI,                                                 +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  IDFSU,                                                  +        
               LTH=8                                                            
         MFLD  (AVIDATIN,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  AVIDATUT,                                               +        
               LTH=6                                                            
         MFLD  (INLPRTIN,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  INLPRTUT,                                               +        
               LTH=4                                                            
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  (KDRTI,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KDRTU,                                                  +        
               LTH=2                                                            
         MFLD  (IDLBBETI,                                              +        
               '++++++++++++'),                                        +        
               LTH=12                                                           
         MFLD  IDLBBETU,                                               +        
               LTH=12                                                           
         MFLD  (KLIVISIN,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  KLIVISUT,                                               +        
               LTH=1                                                            
         MFLD  (LOPNRMIN,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  LOPNRMUT,                                               +        
               LTH=8                                                            
         MFLD  (IDFTGI,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KTOIN,                                                 +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANALYSIN,                                              +        
               '++++++++++++'),                                        +        
               LTH=12,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KSTIN,                                                 +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (GDKIN,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  IDFTGU,                                                 +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KTOUT,                                                  +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  ANALYSUT,                                               +        
               LTH=12,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KSTUT,                                                  +        
               LTH=10,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  GDKUT,                                                  +        
               LTH=1                                                            
         MFLD  (ARTNR1,                                                +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR2,                                                +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR3,                                                +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR4,                                                +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR5,                                                +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR6,                                                +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR7,                                                +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR8,                                                +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR9,                                                +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR10,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR11,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR12,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR13,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR14,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR15,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR16,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR17,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR18,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR19,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR20,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR21,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR22,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR23,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR24,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR25,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR26,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR27,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR28,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR29,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR30,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR31,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR32,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR33,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR34,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR35,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR36,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTAL1,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTAL2,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTAL3,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTAL4,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTAL5,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTAL6,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTAL7,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTAL8,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTAL9,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA10,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA11,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA12,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA13,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA14,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA15,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA16,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA17,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA18,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA19,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA20,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA21,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA22,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA23,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA24,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA25,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA26,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA27,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA28,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA29,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA30,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA31,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA32,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA33,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA34,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA35,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA36,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
