****** ****************************************************************         
* CREATED BY PC22543   ON 94/12/29  AT 16:41                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'REG/SCAN KOLLI PÅ VAGN/PLAC     '                               
W6N124   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W6T124U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W6T121  ',                                          +        
               14='W6T122  ',                                          +        
               15='W6T123  ',                                          +        
               16='W6T124  ',                                          +        
               17='W6T125  ',                                          +        
               18='W6T126  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W6N124   DPAGE CURSOR=((2,10))                                                  
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'REG/SCAN CASE ON TROLLEY',                             +        
               POS=(1,10),LTH=24,                                      +        
               ATTR=(NUM,PROT)                                                  
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Trolley',                                              +        
               POS=(2,2),LTH=7,                                        +        
               ATTR=(ALPHA,PROT)                                                
DGIA0007 DFLD  POS=(2,10),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Loc',                                                  +        
               POS=(2,15),LTH=3,                                       +        
               ATTR=(PROT)                                                      
DGIA0002 DFLD  POS=(2,19),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Address',                                              +        
               POS=(2,25),LTH=7,                                       +        
               ATTR=(PROT)                                                      
DGIA0000 DFLD  POS=(2,33),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'DC',                                                   +        
               POS=(2,39),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDDCIN   DFLD  POS=(2,43),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0008 DFLD  POS=(3,10),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0003 DFLD  POS=(3,19),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0001 DFLD  POS=(3,33),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDCUT   DFLD  POS=(3,43),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0006 DFLD  POS=(4,10),LTH=3,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0005 DFLD  POS=(4,19),LTH=4,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0004 DFLD  POS=(4,33),LTH=4,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Prio (y/n)',                                           +        
               POS=(5,2),LTH=10,                                       +        
               ATTR=(PROT)                                                      
PRIO     DFLD  POS=(5,13),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'To kit (y/n)',                                         +        
               POS=(5,22),LTH=12,                                      +        
               ATTR=(PROT)                                                      
SATS     DFLD  POS=(5,35),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Part No.',                                             +        
               POS=(7,4),LTH=8,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Qty  Suppl No. Case No.   Info',                       +        
               POS=(7,18),LTH=30,                                      +        
               ATTR=(PROT)                                                      
ARTNR1   DFLD  POS=(8,3),LTH=9,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(8,13),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
ANT1     DFLD  POS=(8,15),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(8,22),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
LEVNR1   DFLD  POS=(8,24),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  ' ',                                                    +        
               POS=(8,30),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
KOLLI1   DFLD  POS=(8,32),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(8,42),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
INFO1    DFLD  POS=(8,44),LTH=20,                                      +        
               ATTR=(PROT,MOD)                                                  
ARTNR2   DFLD  POS=(9,3),LTH=9,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(9,13),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
ANT2     DFLD  POS=(9,15),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(9,22),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
LEVNR2   DFLD  POS=(9,24),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  ' ',                                                    +        
               POS=(9,30),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
KOLLI2   DFLD  POS=(9,32),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(9,42),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
INFO2    DFLD  POS=(9,44),LTH=20,                                      +        
               ATTR=(PROT,MOD)                                                  
ARTNR3   DFLD  POS=(10,3),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(10,13),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
ANT3     DFLD  POS=(10,15),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(10,22),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
LEVNR3   DFLD  POS=(10,24),LTH=5,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  ' ',                                                    +        
               POS=(10,30),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
KOLLI3   DFLD  POS=(10,32),LTH=9,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(10,42),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
INFO3    DFLD  POS=(10,44),LTH=20,                                     +        
               ATTR=(PROT,MOD)                                                  
ARTNR4   DFLD  POS=(11,3),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(11,13),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
ANT4     DFLD  POS=(11,15),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(11,22),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
LEVNR4   DFLD  POS=(11,24),LTH=5,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  ' ',                                                    +        
               POS=(11,30),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
KOLLI4   DFLD  POS=(11,32),LTH=9,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(11,42),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
INFO4    DFLD  POS=(11,44),LTH=20,                                     +        
               ATTR=(PROT,MOD)                                                  
ARTNR5   DFLD  POS=(12,3),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(12,13),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
ANT5     DFLD  POS=(12,15),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(12,22),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
LEVNR5   DFLD  POS=(12,24),LTH=5,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  ' ',                                                    +        
               POS=(12,30),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
KOLLI5   DFLD  POS=(12,32),LTH=9,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(12,42),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
INFO5    DFLD  POS=(12,44),LTH=20,                                     +        
               ATTR=(PROT,MOD)                                                  
ARTNR6   DFLD  POS=(13,3),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(13,13),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
ANT6     DFLD  POS=(13,15),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(13,22),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
LEVNR6   DFLD  POS=(13,24),LTH=5,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  ' ',                                                    +        
               POS=(13,30),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
KOLLI6   DFLD  POS=(13,32),LTH=9,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(13,42),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
INFO6    DFLD  POS=(13,44),LTH=20,                                     +        
               ATTR=(PROT,MOD)                                                  
ARTNR7   DFLD  POS=(14,3),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(14,13),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
ANT7     DFLD  POS=(14,15),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(14,22),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
LEVNR7   DFLD  POS=(14,24),LTH=5,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  ' ',                                                    +        
               POS=(14,30),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
KOLLI7   DFLD  POS=(14,32),LTH=9,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(14,42),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
INFO7    DFLD  POS=(14,44),LTH=20,                                     +        
               ATTR=(PROT,MOD)                                                  
ARTNR8   DFLD  POS=(15,3),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(15,13),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
ANT8     DFLD  POS=(15,15),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(15,22),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
LEVNR8   DFLD  POS=(15,24),LTH=5,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  ' ',                                                    +        
               POS=(15,30),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
KOLLI8   DFLD  POS=(15,32),LTH=9,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(15,42),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
INFO8    DFLD  POS=(15,44),LTH=20,                                     +        
               ATTR=(PROT,MOD)                                                  
ARTNR9   DFLD  POS=(16,3),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(16,13),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
ANT9     DFLD  POS=(16,15),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(16,22),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
LEVNR9   DFLD  POS=(16,24),LTH=5,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  ' ',                                                    +        
               POS=(16,30),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
KOLLI9   DFLD  POS=(16,32),LTH=9,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(16,42),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
INFO9    DFLD  POS=(16,44),LTH=20,                                     +        
               ATTR=(PROT,MOD)                                                  
ARTNR10  DFLD  POS=(17,3),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(17,13),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
ANT10    DFLD  POS=(17,15),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(17,22),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
LEVNR10  DFLD  POS=(17,24),LTH=5,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  ' ',                                                    +        
               POS=(17,30),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
KOLLI10  DFLD  POS=(17,32),LTH=9,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(17,42),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
INFO10   DFLD  POS=(17,44),LTH=20,                                     +        
               ATTR=(PROT,MOD)                                                  
ARTNR11  DFLD  POS=(18,3),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(18,13),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
ANT11    DFLD  POS=(18,15),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(18,22),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
LEVNR11  DFLD  POS=(18,24),LTH=5,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  ' ',                                                    +        
               POS=(18,30),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
KOLLI11  DFLD  POS=(18,32),LTH=9,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(18,42),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
INFO11   DFLD  POS=(18,44),LTH=20,                                     +        
               ATTR=(PROT,MOD)                                                  
ARTNR12  DFLD  POS=(19,3),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(19,13),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
ANT12    DFLD  POS=(19,15),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(19,22),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
LEVNR12  DFLD  POS=(19,24),LTH=5,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  ' ',                                                    +        
               POS=(19,30),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
KOLLI12  DFLD  POS=(19,32),LTH=9,                                      +        
               ATTR=(NUM,NOPROT)                                                
FILLER1  DFLD  POS=(19,42),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
INFO12   DFLD  POS=(19,44),LTH=20,                                     +        
               ATTR=(PROT,MOD)                                                  
FILLER2  DFLD  POS=(19,65),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
FILLER3  DFLD  POS=(19,67),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
FILLER4  DFLD  POS=(19,69),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(19,71),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
         DFLD  '13 Unload info  14 Labels    15 Case/batch   16 Reg cas+        
               e/troll 17 Reg batch',                                  +        
               POS=(21,2),LTH=75,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 Loc hist',                                          +        
               POS=(22,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,31),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,47),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,65),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W6I124N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W6N124),                                           +        
               OPT=2,                                                  +        
               NXT=W6O124N1                                                     
MID      LPAGE SOR=(W6N124)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  ' ',                                                    +        
               LTH=2                                                            
         MFLD  '61242',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0007,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0002,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (DGIA0000,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0008,                                               +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0003,                                               +        
               LTH=4                                                            
         MFLD  DGIA0001,                                               +        
               LTH=4                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  DGIA0006,                                               +        
               LTH=3                                                            
         MFLD  DGIA0005,                                               +        
               LTH=4                                                            
         MFLD  DGIA0004,                                               +        
               LTH=4                                                            
         MFLD  (PRIO,                                                  +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (SATS,                                                  +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (ARTNR1,                                                +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANT1,                                                  +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LEVNR1,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KOLLI1,                                                +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR2,                                                +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANT2,                                                  +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LEVNR2,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KOLLI2,                                                +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR3,                                                +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANT3,                                                  +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LEVNR3,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KOLLI3,                                                +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR4,                                                +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANT4,                                                  +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LEVNR4,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KOLLI4,                                                +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR5,                                                +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANT5,                                                  +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LEVNR5,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KOLLI5,                                                +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR6,                                                +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANT6,                                                  +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LEVNR6,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KOLLI6,                                                +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR7,                                                +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANT7,                                                  +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LEVNR7,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KOLLI7,                                                +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR8,                                                +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANT8,                                                  +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LEVNR8,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KOLLI8,                                                +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR9,                                                +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANT9,                                                  +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LEVNR9,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KOLLI9,                                                +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR10,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANT10,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LEVNR10,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KOLLI10,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR11,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANT11,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LEVNR11,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KOLLI11,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR12,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANT12,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LEVNR12,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KOLLI12,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
W6O124N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6N124,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I124N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W6N124                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DGIA0007,                                               +        
               LTH=3                                                            
         MFLD  DGIA0002,                                               +        
               LTH=4                                                            
         MFLD  DGIA0000,                                               +        
               LTH=4                                                            
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  DGIA0008,                                               +        
               LTH=3                                                            
         MFLD  DGIA0003,                                               +        
               LTH=4                                                            
         MFLD  DGIA0001,                                               +        
               LTH=4                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  DGIA0006,                                               +        
               LTH=3                                                            
         MFLD  DGIA0005,                                               +        
               LTH=4                                                            
         MFLD  DGIA0004,                                               +        
               LTH=4                                                            
         MFLD  PRIO,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SATS,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTNR1,                                                 +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ANT1,                                                   +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVNR1,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLI1,                                                 +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  INFO1,                                                  +        
               LTH=20                                                           
         MFLD  ARTNR2,                                                 +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ANT2,                                                   +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVNR2,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLI2,                                                 +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  INFO2,                                                  +        
               LTH=20                                                           
         MFLD  ARTNR3,                                                 +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ANT3,                                                   +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVNR3,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLI3,                                                 +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  INFO3,                                                  +        
               LTH=20                                                           
         MFLD  ARTNR4,                                                 +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ANT4,                                                   +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVNR4,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLI4,                                                 +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  INFO4,                                                  +        
               LTH=20                                                           
         MFLD  ARTNR5,                                                 +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ANT5,                                                   +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVNR5,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLI5,                                                 +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  INFO5,                                                  +        
               LTH=20                                                           
         MFLD  ARTNR6,                                                 +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ANT6,                                                   +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVNR6,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLI6,                                                 +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  INFO6,                                                  +        
               LTH=20                                                           
         MFLD  ARTNR7,                                                 +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ANT7,                                                   +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVNR7,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLI7,                                                 +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  INFO7,                                                  +        
               LTH=20                                                           
         MFLD  ARTNR8,                                                 +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ANT8,                                                   +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVNR8,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLI8,                                                 +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  INFO8,                                                  +        
               LTH=20                                                           
         MFLD  ARTNR9,                                                 +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ANT9,                                                   +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVNR9,                                                 +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLI9,                                                 +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  INFO9,                                                  +        
               LTH=20                                                           
         MFLD  ARTNR10,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ANT10,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVNR10,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLI10,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  INFO10,                                                 +        
               LTH=20                                                           
         MFLD  ARTNR11,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ANT11,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVNR11,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLI11,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  INFO11,                                                 +        
               LTH=20                                                           
         MFLD  ARTNR12,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ANT12,                                                  +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVNR12,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLI12,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  INFO12,                                                 +        
               LTH=20                                                           
         MFLD  TEMFSINF,                                               +        
               LTH=61                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  FSYSMSG,                                                +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
