***********************************************************************         
* CREATED BY PC22543   ON 94/12/29  AT 16:38                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'REPORT BINNED GOODS             '                               
W6N144   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W6T144 7',                                           +        
               8='W6T144 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W6T144U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W6T141  ',                                          +        
               14='W6T142  ',                                          +        
               15='W6T143  ',                                          +        
               16='W6T144  ',                                          +        
               17='W6T145  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W6T144V ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,10)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Report binned goods',                                  +        
               POS=(1,11),LTH=19,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Seq No',                                               +        
               POS=(2,2),LTH=6,                                        +        
               ATTR=(ALPHA,PROT)                                                
PARTIIN  DFLD  POS=(2,10),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Suppl',                                                +        
               POS=(2,22),LTH=5,                                       +        
               ATTR=(PROT)                                                      
IDLEVNRI DFLD  POS=(2,28),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Case No',                                              +        
               POS=(2,34),LTH=7,                                       +        
               ATTR=(ALPHA,PROT)                                                
KOLLIIN  DFLD  POS=(2,42),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,52),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DCIN     DFLD  POS=(2,55),LTH=2,                                       +        
               ATTR=(ALPHA,NOPROT)                                              
PARTIUT  DFLD  POS=(3,10),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
IDLEVNRU DFLD  POS=(3,28),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
KOLLIUT  DFLD  POS=(3,42),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
DCUT     DFLD  POS=(3,55),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Part',                                                 +        
               POS=(5,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
IDARTNR  DFLD  POS=(5,8),LTH=8,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Qty adv',                                              +        
               POS=(5,24),LTH=7,                                       +        
               ATTR=(PROT)                                                      
KVAVIS   DFLD  POS=(5,33),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Descript',                                             +        
               POS=(5,41),LTH=8,                                       +        
               ATTR=(PROT)                                                      
BEART    DFLD  POS=(5,51),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Unit',                                                 +        
               POS=(6,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
KDSORT   DFLD  POS=(6,8),LTH=2,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'PT',                                                   +        
               POS=(6,12),LTH=2,                                       +        
               ATTR=(PROT)                                                      
BEFT     DFLD  POS=(6,15),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Qty rep',                                              +        
               POS=(6,24),LTH=7,                                       +        
               ATTR=(PROT)                                                      
KVRAPP   DFLD  POS=(6,33),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Dang goods',                                           +        
               POS=(6,41),LTH=10,                                      +        
               ATTR=(PROT)                                                      
BEFARLIG DFLD  POS=(6,54),LTH=10,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'PTaddr',                                               +        
               POS=(6,65),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0089 DFLD  POS=(6,72),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Stor area',                                            +        
               POS=(7,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
ADLAGOMR DFLD  POS=(7,13),LTH=2,                                       +        
               ATTR=(PROT)                                                      
ADGANG   DFLD  POS=(7,16),LTH=2,                                       +        
               ATTR=(PROT)                                                      
ADPLATS  DFLD  POS=(7,19),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Buff area',                                            +        
               POS=(7,41),LTH=9,                                       +        
               ATTR=(PROT)                                                      
DGIA0083 DFLD  POS=(7,54),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0080 DFLD  POS=(7,57),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0086 DFLD  POS=(7,60),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DGIA0084 DFLD  POS=(8,54),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0081 DFLD  POS=(8,57),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0087 DFLD  POS=(8,60),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Empl',                                                 +        
               POS=(9,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
IDANSTNR DFLD  POS=(9,9),LTH=5,                                        +        
               ATTR=(NUM,NOPROT)                                                
DGIA0085 DFLD  POS=(9,54),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0082 DFLD  POS=(9,57),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0088 DFLD  POS=(9,60),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Cmd BinQty Addr',                                      +        
               POS=(11,2),LTH=15,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Line',                                                 +        
               POS=(11,22),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Qty  Loc   Info   Suppl    Case No',                   +        
               POS=(11,31),LTH=34,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'VOR',                                                  +        
               POS=(11,70),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0040 DFLD  POS=(12,2),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0064 DFLD  POS=(12,6),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0008 DFLD  POS=(12,13),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0032 DFLD  POS=(12,23),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0056 DFLD  POS=(12,28),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0000 DFLD  POS=(12,36),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0048 DFLD  POS=(12,43),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0016 DFLD  POS=(12,49),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0024 DFLD  POS=(12,56),LTH=9,                                      +        
               ATTR=(PROT)                                                      
DGIA0072 DFLD  POS=(12,67),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0041 DFLD  POS=(13,2),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0065 DFLD  POS=(13,6),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0009 DFLD  POS=(13,13),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0033 DFLD  POS=(13,23),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0057 DFLD  POS=(13,28),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0001 DFLD  POS=(13,36),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0049 DFLD  POS=(13,43),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0017 DFLD  POS=(13,49),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0025 DFLD  POS=(13,56),LTH=9,                                      +        
               ATTR=(PROT)                                                      
DGIA0073 DFLD  POS=(13,67),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0042 DFLD  POS=(14,2),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0066 DFLD  POS=(14,6),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0010 DFLD  POS=(14,13),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0034 DFLD  POS=(14,23),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0058 DFLD  POS=(14,28),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0002 DFLD  POS=(14,36),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0050 DFLD  POS=(14,43),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0018 DFLD  POS=(14,49),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0026 DFLD  POS=(14,56),LTH=9,                                      +        
               ATTR=(PROT)                                                      
DGIA0074 DFLD  POS=(14,67),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0043 DFLD  POS=(15,2),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0067 DFLD  POS=(15,6),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0011 DFLD  POS=(15,13),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0035 DFLD  POS=(15,23),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0059 DFLD  POS=(15,28),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0003 DFLD  POS=(15,36),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0051 DFLD  POS=(15,43),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0019 DFLD  POS=(15,49),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0027 DFLD  POS=(15,56),LTH=9,                                      +        
               ATTR=(PROT)                                                      
DGIA0075 DFLD  POS=(15,67),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0044 DFLD  POS=(16,2),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0068 DFLD  POS=(16,6),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0012 DFLD  POS=(16,13),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0036 DFLD  POS=(16,23),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0060 DFLD  POS=(16,28),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0004 DFLD  POS=(16,36),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0052 DFLD  POS=(16,43),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0020 DFLD  POS=(16,49),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0028 DFLD  POS=(16,56),LTH=9,                                      +        
               ATTR=(PROT)                                                      
DGIA0076 DFLD  POS=(16,67),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0045 DFLD  POS=(17,2),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0069 DFLD  POS=(17,6),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0013 DFLD  POS=(17,13),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0037 DFLD  POS=(17,23),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0061 DFLD  POS=(17,28),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0005 DFLD  POS=(17,36),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0053 DFLD  POS=(17,43),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0021 DFLD  POS=(17,49),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0029 DFLD  POS=(17,56),LTH=9,                                      +        
               ATTR=(PROT)                                                      
DGIA0077 DFLD  POS=(17,67),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0046 DFLD  POS=(18,2),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0070 DFLD  POS=(18,6),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0014 DFLD  POS=(18,13),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0038 DFLD  POS=(18,23),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0062 DFLD  POS=(18,28),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0006 DFLD  POS=(18,36),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0054 DFLD  POS=(18,43),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0022 DFLD  POS=(18,49),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0030 DFLD  POS=(18,56),LTH=9,                                      +        
               ATTR=(PROT)                                                      
DGIA0078 DFLD  POS=(18,67),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0047 DFLD  POS=(19,2),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0071 DFLD  POS=(19,6),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0015 DFLD  POS=(19,13),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0039 DFLD  POS=(19,23),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0063 DFLD  POS=(19,28),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0007 DFLD  POS=(19,36),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0055 DFLD  POS=(19,43),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0023 DFLD  POS=(19,49),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0031 DFLD  POS=(19,56),LTH=9,                                      +        
               ATTR=(PROT)                                                      
DGIA0079 DFLD  POS=(19,67),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '13 Cr bin list  14 Rep bin list 15 Rep case',          +        
               POS=(21,2),LTH=43,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16 Rep batch    17 Rep mixed',                         +        
               POS=(21,50),LTH=28,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W6O144N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6N144,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I144N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDLEVNRI,                                               +        
               LTH=5                                                            
         MFLD  IDLEVNRU,                                               +        
               LTH=5                                                            
         MFLD  KOLLIIN,                                                +        
               LTH=9                                                            
         MFLD  KOLLIUT,                                                +        
               LTH=9                                                            
         MFLD  PARTIIN,                                                +        
               LTH=9                                                            
         MFLD  PARTIUT,                                                +        
               LTH=9                                                            
         MFLD  DCIN,                                                   +        
               LTH=2                                                            
         MFLD  DCUT,                                                   +        
               LTH=2                                                            
         MFLD  IDARTNR,                                                +        
               LTH=8                                                            
         MFLD  KVAVIS,                                                 +        
               LTH=6                                                            
         MFLD  BEART,                                                  +        
               LTH=25                                                           
         MFLD  KDSORT,                                                 +        
               LTH=2                                                            
         MFLD  BEFT,                                                   +        
               LTH=2                                                            
         MFLD  KVRAPP,                                                 +        
               LTH=6                                                            
         MFLD  BEFARLIG,                                               +        
               LTH=10                                                           
         MFLD  DGIA0089,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADLAGOMR,                                               +        
               LTH=2                                                            
         MFLD  ADGANG,                                                 +        
               LTH=2                                                            
         MFLD  ADPLATS,                                                +        
               LTH=5                                                            
         MFLD  DGIA0083,                                               +        
               LTH=2                                                            
         MFLD  DGIA0080,                                               +        
               LTH=2                                                            
         MFLD  DGIA0086,                                               +        
               LTH=5                                                            
         MFLD  DGIA0084,                                               +        
               LTH=2                                                            
         MFLD  DGIA0081,                                               +        
               LTH=2                                                            
         MFLD  DGIA0087,                                               +        
               LTH=5                                                            
         MFLD  DGIA0085,                                               +        
               LTH=2                                                            
         MFLD  DGIA0082,                                               +        
               LTH=2                                                            
         MFLD  DGIA0088,                                               +        
               LTH=5                                                            
         MFLD  IDANSTNR,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0040,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0041,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0042,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0043,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0044,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0045,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0046,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0047,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0064,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0065,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0066,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0067,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0068,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0069,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0070,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0071,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0008,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0009,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0010,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0011,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0012,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0013,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0014,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0015,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0032,                                               +        
               LTH=3                                                            
         MFLD  DGIA0033,                                               +        
               LTH=3                                                            
         MFLD  DGIA0034,                                               +        
               LTH=3                                                            
         MFLD  DGIA0035,                                               +        
               LTH=3                                                            
         MFLD  DGIA0036,                                               +        
               LTH=3                                                            
         MFLD  DGIA0037,                                               +        
               LTH=3                                                            
         MFLD  DGIA0038,                                               +        
               LTH=3                                                            
         MFLD  DGIA0039,                                               +        
               LTH=3                                                            
         MFLD  DGIA0056,                                               +        
               LTH=6                                                            
         MFLD  DGIA0057,                                               +        
               LTH=6                                                            
         MFLD  DGIA0058,                                               +        
               LTH=6                                                            
         MFLD  DGIA0059,                                               +        
               LTH=6                                                            
         MFLD  DGIA0060,                                               +        
               LTH=6                                                            
         MFLD  DGIA0061,                                               +        
               LTH=6                                                            
         MFLD  DGIA0062,                                               +        
               LTH=6                                                            
         MFLD  DGIA0063,                                               +        
               LTH=6                                                            
         MFLD  DGIA0000,                                               +        
               LTH=4                                                            
         MFLD  DGIA0001,                                               +        
               LTH=4                                                            
         MFLD  DGIA0002,                                               +        
               LTH=4                                                            
         MFLD  DGIA0003,                                               +        
               LTH=4                                                            
         MFLD  DGIA0004,                                               +        
               LTH=4                                                            
         MFLD  DGIA0005,                                               +        
               LTH=4                                                            
         MFLD  DGIA0006,                                               +        
               LTH=4                                                            
         MFLD  DGIA0007,                                               +        
               LTH=4                                                            
         MFLD  DGIA0048,                                               +        
               LTH=3                                                            
         MFLD  DGIA0049,                                               +        
               LTH=3                                                            
         MFLD  DGIA0050,                                               +        
               LTH=3                                                            
         MFLD  DGIA0051,                                               +        
               LTH=3                                                            
         MFLD  DGIA0052,                                               +        
               LTH=3                                                            
         MFLD  DGIA0053,                                               +        
               LTH=3                                                            
         MFLD  DGIA0054,                                               +        
               LTH=3                                                            
         MFLD  DGIA0055,                                               +        
               LTH=3                                                            
         MFLD  DGIA0016,                                               +        
               LTH=5                                                            
         MFLD  DGIA0017,                                               +        
               LTH=5                                                            
         MFLD  DGIA0018,                                               +        
               LTH=5                                                            
         MFLD  DGIA0019,                                               +        
               LTH=5                                                            
         MFLD  DGIA0020,                                               +        
               LTH=5                                                            
         MFLD  DGIA0021,                                               +        
               LTH=5                                                            
         MFLD  DGIA0022,                                               +        
               LTH=5                                                            
         MFLD  DGIA0023,                                               +        
               LTH=5                                                            
         MFLD  DGIA0024,                                               +        
               LTH=9                                                            
         MFLD  DGIA0025,                                               +        
               LTH=9                                                            
         MFLD  DGIA0026,                                               +        
               LTH=9                                                            
         MFLD  DGIA0027,                                               +        
               LTH=9                                                            
         MFLD  DGIA0028,                                               +        
               LTH=9                                                            
         MFLD  DGIA0029,                                               +        
               LTH=9                                                            
         MFLD  DGIA0030,                                               +        
               LTH=9                                                            
         MFLD  DGIA0031,                                               +        
               LTH=9                                                            
         MFLD  DGIA0072,                                               +        
               LTH=6                                                            
         MFLD  DGIA0073,                                               +        
               LTH=6                                                            
         MFLD  DGIA0074,                                               +        
               LTH=6                                                            
         MFLD  DGIA0075,                                               +        
               LTH=6                                                            
         MFLD  DGIA0076,                                               +        
               LTH=6                                                            
         MFLD  DGIA0077,                                               +        
               LTH=6                                                            
         MFLD  DGIA0078,                                               +        
               LTH=6                                                            
         MFLD  DGIA0079,                                               +        
               LTH=6                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=61                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W6I144N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W6N144),                                           +        
               OPT=2,                                                  +        
               NXT=W6O144N1                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '61442',                                                +        
               LTH=5                                                            
         MFLD  (IDLEVNRI,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KOLLIIN,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PARTIIN,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DCIN,                                                  +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  (IDANSTNR,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0040,                                              +        
               '+++'),                                                 +        
               LTH=3                                                            
         MFLD  (DGIA0041,                                              +        
               '+++'),                                                 +        
               LTH=3                                                            
         MFLD  (DGIA0042,                                              +        
               '+++'),                                                 +        
               LTH=3                                                            
         MFLD  (DGIA0043,                                              +        
               '+++'),                                                 +        
               LTH=3                                                            
         MFLD  (DGIA0044,                                              +        
               '+++'),                                                 +        
               LTH=3                                                            
         MFLD  (DGIA0045,                                              +        
               '+++'),                                                 +        
               LTH=3                                                            
         MFLD  (DGIA0046,                                              +        
               '+++'),                                                 +        
               LTH=3                                                            
         MFLD  (DGIA0047,                                              +        
               '+++'),                                                 +        
               LTH=3                                                            
         MFLD  (DGIA0064,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0065,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0066,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0067,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0068,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0069,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0070,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0071,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0008,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (DGIA0009,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (DGIA0010,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (DGIA0011,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (DGIA0012,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (DGIA0013,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (DGIA0014,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (DGIA0015,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  DGIA0032,                                               +        
               LTH=3                                                            
         MFLD  DGIA0033,                                               +        
               LTH=3                                                            
         MFLD  DGIA0034,                                               +        
               LTH=3                                                            
         MFLD  DGIA0035,                                               +        
               LTH=3                                                            
         MFLD  DGIA0036,                                               +        
               LTH=3                                                            
         MFLD  DGIA0037,                                               +        
               LTH=3                                                            
         MFLD  DGIA0038,                                               +        
               LTH=3                                                            
         MFLD  DGIA0039,                                               +        
               LTH=3                                                            
         MSGEND                                                                 
         END                                                                    
