***********************************************************************         
* CREATED BY V063442   ON 02/10/01  AT 09:15                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'REGISTRERING LAGERDATA          '                               
W6N163   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W6T163 4',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W6T163U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W6T161  ',                                          +        
               14='W6T162  ',                                          +        
               15='W6T163  ',                                          +        
               16='W6T164  ',                                          +        
               17='W6T165  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W6T163V ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'STOCK REGISTRATION',                                   +        
               POS=(1,12),LTH=18,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Part No.',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(ALPHA,PROT)                                                
ARTIN    DFLD  POS=(2,12),LTH=9,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
ARTUT    DFLD  POS=(3,12),LTH=11,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Address',                                              +        
               POS=(5,2),LTH=7,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'CDC',                                                  +        
               POS=(5,14),LTH=3,                                       +        
               ATTR=(PROT)                                                      
OMRUT    DFLD  POS=(5,19),LTH=2,                                       +        
               ATTR=(PROT)                                                      
GANGUT   DFLD  POS=(5,22),LTH=2,                                       +        
               ATTR=(PROT)                                                      
PLAUT    DFLD  POS=(5,25),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Max Qty PP',                                           +        
               POS=(5,35),LTH=10,                                      +        
               ATTR=(PROT)                                                      
MAXSLDUT DFLD  POS=(5,46),LTH=6,                                       +        
               ATTR=(PROT)                                                      
MAXSLDIN DFLD  POS=(6,46),LTH=6,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Q3',                                                   +        
               POS=(5,55),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KVQPACK3 DFLD  POS=(5,58),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Point',                                                +        
               POS=(5,65),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KVREFPKT DFLD  POS=(5,71),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
OMRIN    DFLD  POS=(6,19),LTH=2,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
GANGIN   DFLD  POS=(6,22),LTH=2,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
PLAIN    DFLD  POS=(6,25),LTH=5,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'CD',                                                   +        
               POS=(7,14),LTH=2,                                       +        
               ATTR=(PROT)                                                      
OMRCD1U  DFLD  POS=(7,19),LTH=2,                                       +        
               ATTR=(PROT)                                                      
GANGCD1U DFLD  POS=(7,22),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
PLACD1U  DFLD  POS=(7,25),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
OMRCD2U  DFLD  POS=(7,36),LTH=2,                                       +        
               ATTR=(PROT)                                                      
GANGCD2U DFLD  POS=(7,39),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
PLACD2U  DFLD  POS=(7,42),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
OMRCD3U  DFLD  POS=(7,53),LTH=2,                                       +        
               ATTR=(PROT)                                                      
GANGCD3U DFLD  POS=(7,56),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
PLACD3U  DFLD  POS=(7,59),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
OMRCD4U  DFLD  POS=(7,70),LTH=2,                                       +        
               ATTR=(PROT)                                                      
GANGCD4U DFLD  POS=(7,73),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
PLACD4U  DFLD  POS=(7,76),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
GANGCD1I DFLD  POS=(8,22),LTH=2,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
PLACD1I  DFLD  POS=(8,25),LTH=5,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
GANGCD2I DFLD  POS=(8,39),LTH=2,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
PLACD2I  DFLD  POS=(8,42),LTH=5,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
GANGCD3I DFLD  POS=(8,56),LTH=2,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
PLACD3I  DFLD  POS=(8,59),LTH=5,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
GANGCD4I DFLD  POS=(8,73),LTH=2,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
PLACD4I  DFLD  POS=(8,76),LTH=5,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Weight gr',                                            +        
               POS=(9,2),LTH=9,                                        +        
               ATTR=(NUM,PROT)                                                  
VIKTU    DFLD  POS=(9,23),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Volume CM3',                                           +        
               POS=(9,35),LTH=10,                                      +        
               ATTR=(PROT)                                                      
VOLU     DFLD  POS=(9,52),LTH=10,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'VSOP code',                                            +        
               POS=(11,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
VSOPU    DFLD  POS=(11,27),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Spec. pack. code',                                     +        
               POS=(11,35),LTH=16,                                     +        
               ATTR=(PROT)                                                      
SPECEMBU DFLD  POS=(11,61),LTH=1,                                      +        
               ATTR=(PROT)                                                      
SPECEMBI DFLD  POS=(12,61),LTH=1,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Pack. part No. Q3',                                    +        
               POS=(14,2),LTH=17,                                      +        
               ATTR=(PROT)                                                      
Q3U      DFLD  POS=(14,21),LTH=9,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Pack. part No. Q4',                                    +        
               POS=(14,35),LTH=17,                                     +        
               ATTR=(PROT)                                                      
Q4U      DFLD  POS=(14,53),LTH=9,                                      +        
               ATTR=(PROT)                                                      
Q3I      DFLD  POS=(15,21),LTH=9,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
Q4I      DFLD  POS=(15,53),LTH=9,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Buffer address',                                       +        
               POS=(17,2),LTH=14,                                      +        
               ATTR=(PROT)                                                      
BOMR1    DFLD  POS=(17,19),LTH=2,                                      +        
               ATTR=(PROT)                                                      
BGANG1   DFLD  POS=(17,22),LTH=2,                                      +        
               ATTR=(PROT)                                                      
BPLA1    DFLD  POS=(17,25),LTH=5,                                      +        
               ATTR=(PROT)                                                      
BOMR2    DFLD  POS=(17,35),LTH=2,                                      +        
               ATTR=(PROT)                                                      
BGANG2   DFLD  POS=(17,38),LTH=2,                                      +        
               ATTR=(PROT)                                                      
BPLA2    DFLD  POS=(17,41),LTH=5,                                      +        
               ATTR=(PROT)                                                      
BOMR3    DFLD  POS=(17,51),LTH=2,                                      +        
               ATTR=(PROT)                                                      
BGANG3   DFLD  POS=(17,54),LTH=2,                                      +        
               ATTR=(PROT)                                                      
BPLA3    DFLD  POS=(17,57),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'No buff',                                              +        
               POS=(19,2),LTH=7,                                       +        
               ATTR=(PROT)                                                      
BORTSTYR DFLD  POS=(19,10),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLIN     DFLD  POS=(19,12),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'ALT. BUFFER AREA',                                     +        
               POS=(19,14),LTH=16,                                     +        
               ATTR=(PROT)                                                      
ALTBUFFP DFLD  POS=(19,31),LTH=4,                                      +        
               ATTR=(PROT)                                                      
ALTBUFFI DFLD  POS=(19,36),LTH=4,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Printer',                                              +        
               POS=(19,64),LTH=7,                                      +        
               ATTR=(PROT)                                                      
PRT      DFLD  POS=(19,72),LTH=4,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  '13 Handl. cd reg 14 Buffer info 15 Stock reg',         +        
               POS=(21,2),LTH=44,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16 Packing reg 17 Reciev. info',                       +        
               POS=(21,51),LTH=30,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,19),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,51),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NOPROT,MOD)                                                
         FMTEND                                                                 
W6O163N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6N163,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I163N1,                                           +        
               FILL=PT                                                          
DGI1     LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  ARTIN,                                                  +        
               LTH=9                                                            
         MFLD  ARTUT,                                                  +        
               LTH=11                                                           
         MFLD  OMRUT,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  GANGUT,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PLAUT,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  MAXSLDUT,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVQPACK3,                                               +        
               LTH=6                                                            
         MFLD  KVREFPKT,                                               +        
               LTH=7                                                            
         MFLD  OMRCD1U,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  GANGCD1U,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PLACD1U,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OMRCD2U,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  GANGCD2U,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PLACD2U,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OMRCD3U,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  GANGCD3U,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PLACD3U,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OMRCD4U,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  GANGCD4U,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PLACD4U,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VIKTU,                                                  +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VOLU,                                                   +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  VSOPU,                                                  +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SPECEMBU,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  Q3U,                                                    +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  Q4U,                                                    +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  BORTSTYR,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ALTBUFFP,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BOMR1,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BGANG1,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BPLA1,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BOMR2,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BGANG2,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BPLA2,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BOMR3,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BGANG3,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BPLA3,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OMRIN,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  GANGIN,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PLAIN,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  GANGCD1I,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PLACD1I,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  GANGCD2I,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PLACD2I,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  GANGCD3I,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PLACD3I,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  GANGCD4I,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PLACD4I,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SPECEMBI,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  Q3I,                                                    +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  Q4I,                                                    +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLIN,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ALTBUFFI,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  MAXSLDIN,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRT,                                                    +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=79                                                           
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W6I163N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W6N163),                                           +        
               OPT=2,                                                  +        
               NXT=W6O163N1                                                     
DGI2     LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '61632',                                                +        
               LTH=5                                                            
         MFLD  (ARTIN,                                                 +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  ARTUT,                                                  +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (OMRIN,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (GANGIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PLAIN,                                                 +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (MAXSLDIN,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (GANGCD1I,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PLACD1I,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (GANGCD2I,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PLACD2I,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (GANGCD3I,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PLACD3I,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (GANGCD4I,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PLACD4I,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (SPECEMBI,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (Q3I,                                                   +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (Q4I,                                                   +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLIN,                                                  +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (ALTBUFFI,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (PRT,                                                   +        
               '++++'),                                                +        
               LTH=4                                                            
         MSGEND                                                                 
         END                                                                    
