***********************************************************************         
* CREATED BY V063442   ON 02/04/16  AT 16:23                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'REGISTRERA FÖLJESEDELINFO       '                               
W6N136   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W6T136U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W6T131  ',                                          +        
               14='W6T132  ',                                          +        
               15='W6T133  ',                                          +        
               16='W0T501  ',                                          +        
               17='W6T135  ',                                          +        
               18='W6T136  ',                                          +        
               19='W6T137  ',                                          +        
               20='W0T501  ',                                          +        
               21='W6T139  ',                                          +        
               22='WHELP   ',                                          +        
               23='W6T136V ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,10)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'CREATE CASES - PRE-TREATMENT',                         +        
               POS=(1,11),LTH=28,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Seq No.',                                              +        
               POS=(2,2),LTH=7,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDLOPNIN DFLD  POS=(2,10),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,21),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDDCIN   DFLD  POS=(2,24),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
IDLOPNUT DFLD  POS=(3,10),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDCUT   DFLD  POS=(3,24),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Part No.',                                             +        
               POS=(5,2),LTH=8,                                        +        
               ATTR=(PROT)                                                      
IDARTNR  DFLD  POS=(5,11),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Qty adv.',                                             +        
               POS=(5,20),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
KVAVIS   DFLD  POS=(5,29),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Description',                                          +        
               POS=(5,38),LTH=11,                                      +        
               ATTR=(PROT)                                                      
BEART    DFLD  POS=(5,51),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Unit',                                                 +        
               POS=(6,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
KDSORT   DFLD  POS=(6,8),LTH=2,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'PT',                                                   +        
               POS=(6,12),LTH=2,                                       +        
               ATTR=(PROT)                                                      
BEFT     DFLD  POS=(6,15),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Dang. goods',                                          +        
               POS=(6,38),LTH=11,                                      +        
               ATTR=(PROT)                                                      
BEFARLIG DFLD  POS=(6,51),LTH=10,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'QTY',                                                  +        
               POS=(7,5),LTH=3,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'To pack    Prio T-pack    Area',                       +        
               POS=(7,13),LTH=30,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Qty c.',                                               +        
               POS=(7,48),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'To kit',                                               +        
               POS=(7,59),LTH=6,                                       +        
               ATTR=(PROT)                                                      
KVAVKVAR DFLD  POS=(8,2),LTH=6,                                        +        
               ATTR=(PROT)                                                      
KVAVFPK  DFLD  POS=(8,14),LTH=6,                                       +        
               ATTR=(PROT)                                                      
KVAVPRIO DFLD  POS=(8,22),LTH=6,                                       +        
               ATTR=(PROT)                                                      
KDLAGEMB DFLD  POS=(8,30),LTH=4,                                       +        
               ATTR=(PROT)                                                      
ADLAGOMR DFLD  POS=(8,35),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
ADGANG   DFLD  POS=(8,39),LTH=2,                                       +        
               ATTR=(PROT)                                                      
ADPLATS  DFLD  POS=(8,43),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLKVATOT DFLD  POS=(8,51),LTH=1,                                       +        
               ATTR=(PROT)                                                      
KVKITKVA DFLD  POS=(8,59),LTH=6,                                       +        
               ATTR=(PROT)                                                      
DEST     DFLD  POS=(8,66),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Qty BO',                                               +        
               POS=(10,3),LTH=6,                                       +        
               ATTR=(PROT)                                                      
KVROS    DFLD  POS=(10,10),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Pre-packing report  (Y/N)',                            +        
               POS=(10,35),LTH=25,                                     +        
               ATTR=(PROT)                                                      
FLPREPRA DFLD  POS=(10,61),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'LAbel/MLabel   Qty LA/ML Qty parts   Prio',            +        
               POS=(11,3),LTH=41,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Kit',                                                  +        
               POS=(11,49),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Packed',                                               +        
               POS=(11,59),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KDFLETI1 DFLD  POS=(12,7),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
KVFLETI1 DFLD  POS=(12,22),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
KVINLA1  DFLD  POS=(12,31),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
KDKLIPR1 DFLD  POS=(12,42),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
FLSATS1  DFLD  POS=(12,50),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
FLPREP1  DFLD  POS=(12,61),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
KDFLETI2 DFLD  POS=(13,7),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
KVFLETI2 DFLD  POS=(13,22),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
KVINLA2  DFLD  POS=(13,31),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
KDKLIPR2 DFLD  POS=(13,42),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
FLSATS2  DFLD  POS=(13,50),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
FLPREP2  DFLD  POS=(13,61),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
KDFLETI3 DFLD  POS=(14,7),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
KVFLETI3 DFLD  POS=(14,22),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
KVINLA3  DFLD  POS=(14,31),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
KDKLIPR3 DFLD  POS=(14,42),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
FLSATS3  DFLD  POS=(14,50),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
FLPREP3  DFLD  POS=(14,61),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
KDFLETI4 DFLD  POS=(15,7),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
KVFLETI4 DFLD  POS=(15,22),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
KVINLA4  DFLD  POS=(15,31),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
KDKLIPR4 DFLD  POS=(15,42),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
FLSATS4  DFLD  POS=(15,50),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
FLPREP4  DFLD  POS=(15,61),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
KDFLETI5 DFLD  POS=(16,7),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
KVFLETI5 DFLD  POS=(16,22),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
KVINLA5  DFLD  POS=(16,31),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
KDKLIPR5 DFLD  POS=(16,42),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
FLSATS5  DFLD  POS=(16,50),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
FLPREP5  DFLD  POS=(16,61),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
KDFLETI6 DFLD  POS=(17,7),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
KVFLETI6 DFLD  POS=(17,22),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
KVINLA6  DFLD  POS=(17,31),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
KDKLIPR6 DFLD  POS=(17,42),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
FLSATS6  DFLD  POS=(17,50),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
FLPREP6  DFLD  POS=(17,61),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'When deviation    Recieved qty',                       +        
               POS=(19,2),LTH=30,                                      +        
               ATTR=(PROT)                                                      
KVAVMOT  DFLD  POS=(19,33),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Empl. Id',                                             +        
               POS=(19,41),LTH=8,                                      +        
               ATTR=(PROT)                                                      
IDANSTNR DFLD  POS=(19,50),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Printer',                                              +        
               POS=(19,59),LTH=7,                                      +        
               ATTR=(PROT)                                                      
ADINLOMP DFLD  POS=(19,67),LTH=4,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'SVS',                                                  +        
               POS=(19,76),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLSVS    DFLD  POS=(19,80),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
IDVGNIN  DFLD  POS=(20,2),LTH=3,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
IDVGNUT  DFLD  POS=(20,6),LTH=3,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
ADINLOIN DFLD  POS=(20,10),LTH=4,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
ADINLOUT DFLD  POS=(20,15),LTH=4,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
ADINLNIN DFLD  POS=(20,20),LTH=4,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
ADINLNUT DFLD  POS=(20,25),LTH=4,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KDINLQIN DFLD  POS=(20,30),LTH=1,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KDINLQUT DFLD  POS=(20,32),LTH=1,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KBEFTFIN DFLD  POS=(20,34),LTH=2,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KBEFTFUT DFLD  POS=(20,37),LTH=2,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLINLFBI DFLD  POS=(20,40),LTH=1,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLINLFBU DFLD  POS=(20,42),LTH=1,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
LEVKOLIN DFLD  POS=(20,44),LTH=5,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
LEVKOLUT DFLD  POS=(20,50),LTH=5,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
KOLLIIN  DFLD  POS=(20,56),LTH=9,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KOLLIUT  DFLD  POS=(20,66),LTH=9,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KBEFTTIN DFLD  POS=(20,76),LTH=2,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KBEFTTUT DFLD  POS=(20,79),LTH=2,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         DFLD  '13 Case trolley 14 Case quequ   15 Act batch    16',   +        
               POS=(21,2),LTH=50,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  '17 Delete case',                                       +        
               POS=(21,66),LTH=14,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '18 Create case  19 Mixed case   20',                   +        
               POS=(22,2),LTH=34,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21 Receiving c  10 WHELP',                             +        
               POS=(22,50),LTH=24,                                     +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W6O136N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6N136,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I136N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT,                                             +        
               NXT=W6I136N1                                                     
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDLOPNIN,                                               +        
               LTH=9                                                            
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  IDLOPNUT,                                               +        
               LTH=9                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  IDARTNR,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVAVIS,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BEART,                                                  +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDSORT,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BEFT,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BEFARLIG,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KVAVKVAR,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVAVFPK,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVAVPRIO,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDLAGEMB,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADLAGOMR,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADGANG,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADPLATS,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLKVATOT,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVKITKVA,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DEST,                                                   +        
               LTH=3                                                            
         MFLD  KVROS,                                                  +        
               LTH=6                                                            
         MFLD  FLPREPRA,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDFLETI1,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVFLETI1,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVINLA1,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDKLIPR1,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLSATS1,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLPREP1,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDFLETI2,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVFLETI2,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVINLA2,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDKLIPR2,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLSATS2,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLPREP2,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDFLETI3,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVFLETI3,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVINLA3,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDKLIPR3,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLSATS3,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLPREP3,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDFLETI4,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVFLETI4,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVINLA4,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDKLIPR4,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLSATS4,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLPREP4,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDFLETI5,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVFLETI5,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVINLA5,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDKLIPR5,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLSATS5,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLPREP5,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDFLETI6,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVFLETI6,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVINLA6,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDKLIPR6,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLSATS6,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLPREP6,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVAVMOT,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDANSTNR,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADINLOMP,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLSVS,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDVGNIN,                                                +        
               LTH=3                                                            
         MFLD  IDVGNUT,                                                +        
               LTH=3                                                            
         MFLD  ADINLOIN,                                               +        
               LTH=4                                                            
         MFLD  ADINLOUT,                                               +        
               LTH=4                                                            
         MFLD  ADINLNIN,                                               +        
               LTH=4                                                            
         MFLD  ADINLNUT,                                               +        
               LTH=4                                                            
         MFLD  KDINLQIN,                                               +        
               LTH=1                                                            
         MFLD  KDINLQUT,                                               +        
               LTH=1                                                            
         MFLD  KBEFTFIN,                                               +        
               LTH=2                                                            
         MFLD  KBEFTFUT,                                               +        
               LTH=2                                                            
         MFLD  KBEFTTIN,                                               +        
               LTH=2                                                            
         MFLD  KBEFTTUT,                                               +        
               LTH=2                                                            
         MFLD  FLINLFBI,                                               +        
               LTH=1                                                            
         MFLD  FLINLFBU,                                               +        
               LTH=1                                                            
         MFLD  LEVKOLIN,                                               +        
               LTH=5                                                            
         MFLD  LEVKOLUT,                                               +        
               LTH=5                                                            
         MFLD  KOLLIIN,                                                +        
               LTH=9                                                            
         MFLD  KOLLIUT,                                                +        
               LTH=9                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=61                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W6I136N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W6N136),                                           +        
               OPT=2,                                                  +        
               NXT=W6O136N1                                                     
MID      LPAGE SOR=(FORMAT),                                           +        
               NXT=W6O136N1                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '61362',                                                +        
               LTH=5                                                            
         MFLD  (ADINLOMP,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (IDVGNIN,                                               +        
               '+++'),                                                 +        
               LTH=3                                                            
         MFLD  (IDVGNUT,                                               +        
               '   '),                                                 +        
               LTH=3                                                            
         MFLD  (ADINLOIN,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (ADINLOUT,                                              +        
               '    '),                                                +        
               LTH=4                                                            
         MFLD  (ADINLNIN,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (ADINLNUT,                                              +        
               '    '),                                                +        
               LTH=4                                                            
         MFLD  (KDINLQIN,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (KDINLQUT,                                              +        
               ' '),                                                   +        
               LTH=1                                                            
         MFLD  (KBEFTFIN,                                              +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  (KBEFTFUT,                                              +        
               '  '),                                                  +        
               LTH=2                                                            
         MFLD  (KBEFTTIN,                                              +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  (KBEFTTUT,                                              +        
               '  '),                                                  +        
               LTH=2                                                            
         MFLD  (FLINLFBI,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (FLINLFBU,                                              +        
               ' '),                                                   +        
               LTH=1                                                            
         MFLD  (LEVKOLIN,                                              +        
               '+++++'),                                               +        
               LTH=5                                                            
         MFLD  (LEVKOLUT,                                              +        
               '     '),                                               +        
               LTH=5                                                            
         MFLD  (KOLLIIN,                                               +        
               '+++++++++'),                                           +        
               LTH=9                                                            
         MFLD  (KOLLIUT,                                               +        
               '         '),                                           +        
               LTH=9                                                            
         MFLD  (IDLOPNIN,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLOPNUT,                                              +        
               '         '),                                           +        
               LTH=9                                                            
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDCUT,                                                 +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLPREPRA,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (KDFLETI1,                                              +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  (KVFLETI1,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVINLA1,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDKLIPR1,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (FLSATS1,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (FLPREP1,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (KDFLETI2,                                              +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  (KVFLETI2,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVINLA2,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDKLIPR2,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (FLSATS2,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (FLPREP2,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (KDFLETI3,                                              +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  (KVFLETI3,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVINLA3,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDKLIPR3,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (FLSATS3,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (FLPREP3,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (KDFLETI4,                                              +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  (KVFLETI4,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVINLA4,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDKLIPR4,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (FLSATS4,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (FLPREP4,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (KDFLETI5,                                              +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  (KVFLETI5,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVINLA5,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDKLIPR5,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (FLSATS5,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (FLPREP5,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (KDFLETI6,                                              +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  (KVFLETI6,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVINLA6,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDKLIPR6,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (FLSATS6,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (FLPREP6,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (KVAVMOT,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDANSTNR,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLSVS,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
