****** ****************************************************************         
* CREATED BY PC22543   ON 95/01/04  AT 16:03                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'BACK OUT OF R32 REPORTING       '                               
W6N118   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W6T118 7',                                           +        
               8='W6T118 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W6T118U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W6T111  ',                                          +        
               14='W6T112  ',                                          +        
               15='W6T113  ',                                          +        
               16='W6T114  ',                                          +        
               17='W6T115  ',                                          +        
               18='W6T116  ',                                          +        
               19='W6T117  ',                                          +        
               20='W6T118  ',                                          +        
               21='W6T119  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W6N118   DPAGE CURSOR=((2,13)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Back out of R32 Reporting',                            +        
               POS=(1,11),LTH=25,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Seq number',                                           +        
               POS=(2,2),LTH=10,                                       +        
               ATTR=(ALPHA,PROT)                                                
IDLOPNRI DFLD  POS=(2,13),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,22),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
IDDCIN   DFLD  POS=(2,25),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
IDLEVIN  DFLD  POS=(2,30),LTH=5,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
IDFSIN   DFLD  POS=(2,36),LTH=8,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
AVIDATIN DFLD  POS=(2,45),LTH=6,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
INLPRTIN DFLD  POS=(2,52),LTH=4,                                       +        
               ATTR=(ALPHA,PROT,NODISP,MOD)                                     
KDRTIN   DFLD  POS=(2,57),LTH=2,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDLBBETI DFLD  POS=(2,60),LTH=12,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KLIVISIN DFLD  POS=(2,73),LTH=1,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDLOPNRU DFLD  POS=(3,13),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDCUT   DFLD  POS=(3,25),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
IDLEVUT  DFLD  POS=(3,30),LTH=5,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
IDFSUT   DFLD  POS=(3,36),LTH=8,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
AVIDATUT DFLD  POS=(3,45),LTH=6,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
INLPRTUT DFLD  POS=(3,52),LTH=4,                                       +        
               ATTR=(ALPHA,PROT,NODISP,MOD)                                     
KDRTUT   DFLD  POS=(3,57),LTH=2,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDLBBETU DFLD  POS=(3,60),LTH=12,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KLIVISUT DFLD  POS=(3,73),LTH=1,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
IDRADENT DFLD  POS=(4,2),LTH=4,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
IDRADNEX DFLD  POS=(4,7),LTH=4,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Part No.',                                             +        
               POS=(5,2),LTH=8,                                        +        
               ATTR=(PROT)                                                      
IDART    DFLD  POS=(5,11),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Qty Adviced',                                          +        
               POS=(5,22),LTH=11,                                      +        
               ATTR=(PROT)                                                      
KVAVIS   DFLD  POS=(5,34),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Description',                                          +        
               POS=(5,43),LTH=11,                                      +        
               ATTR=(PROT)                                                      
BEART    DFLD  POS=(5,55),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Unit',                                                 +        
               POS=(6,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
KDSORT   DFLD  POS=(6,7),LTH=2,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Packaging type',                                       +        
               POS=(6,12),LTH=14,                                      +        
               ATTR=(PROT)                                                      
BEFT     DFLD  POS=(6,27),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Qty partial rep.',                                     +        
               POS=(6,31),LTH=16,                                      +        
               ATTR=(PROT)                                                      
KVRAPP   DFLD  POS=(6,48),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Dang. goods',                                          +        
               POS=(6,55),LTH=11,                                      +        
               ATTR=(NUM,PROT)                                                  
BEFARL   DFLD  POS=(6,67),LTH=14,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Loc  Line',                                            +        
               POS=(8,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Qty  Loc   Info Suppl. Case No.',                      +        
               POS=(8,17),LTH=31,                                      +        
               ATTR=(PROT)                                                      
OMRUP1   DFLD  POS=(9,2),LTH=4,                                        +        
               ATTR=(NOPROT)                                                    
RAD1     DFLD  POS=(9,7),LTH=4,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
KVINL1   DFLD  POS=(9,13),LTH=7,                                       +        
               ATTR=(PROT)                                                      
OMR1     DFLD  POS=(9,22),LTH=4,                                       +        
               ATTR=(PROT)                                                      
ST1      DFLD  POS=(9,28),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
LEVK1    DFLD  POS=(9,33),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KOLLI1   DFLD  POS=(9,40),LTH=9,                                       +        
               ATTR=(PROT)                                                      
STATXT1  DFLD  POS=(9,51),LTH=25,                                      +        
               ATTR=(PROT)                                                      
OMRUP2   DFLD  POS=(10,2),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
RAD2     DFLD  POS=(10,7),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KVINL2   DFLD  POS=(10,13),LTH=7,                                      +        
               ATTR=(PROT)                                                      
OMR2     DFLD  POS=(10,22),LTH=4,                                      +        
               ATTR=(PROT)                                                      
ST2      DFLD  POS=(10,28),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVK2    DFLD  POS=(10,33),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KOLLI2   DFLD  POS=(10,40),LTH=9,                                      +        
               ATTR=(PROT)                                                      
STATXT2  DFLD  POS=(10,51),LTH=25,                                     +        
               ATTR=(PROT)                                                      
OMRUP3   DFLD  POS=(11,2),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
RAD3     DFLD  POS=(11,7),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KVINL3   DFLD  POS=(11,13),LTH=7,                                      +        
               ATTR=(PROT)                                                      
OMR3     DFLD  POS=(11,22),LTH=4,                                      +        
               ATTR=(PROT)                                                      
ST3      DFLD  POS=(11,28),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVK3    DFLD  POS=(11,33),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KOLLI3   DFLD  POS=(11,40),LTH=9,                                      +        
               ATTR=(PROT)                                                      
STATXT3  DFLD  POS=(11,51),LTH=25,                                     +        
               ATTR=(PROT)                                                      
OMRUP4   DFLD  POS=(12,2),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
RAD4     DFLD  POS=(12,7),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KVINL4   DFLD  POS=(12,13),LTH=7,                                      +        
               ATTR=(PROT)                                                      
OMR4     DFLD  POS=(12,22),LTH=4,                                      +        
               ATTR=(PROT)                                                      
ST4      DFLD  POS=(12,28),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVK4    DFLD  POS=(12,33),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KOLLI4   DFLD  POS=(12,40),LTH=9,                                      +        
               ATTR=(PROT)                                                      
STATXT4  DFLD  POS=(12,51),LTH=25,                                     +        
               ATTR=(PROT)                                                      
OMRUP5   DFLD  POS=(13,2),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
RAD5     DFLD  POS=(13,7),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KVINL5   DFLD  POS=(13,13),LTH=7,                                      +        
               ATTR=(PROT)                                                      
OMR5     DFLD  POS=(13,22),LTH=4,                                      +        
               ATTR=(PROT)                                                      
ST5      DFLD  POS=(13,28),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVK5    DFLD  POS=(13,33),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KOLLI5   DFLD  POS=(13,40),LTH=9,                                      +        
               ATTR=(PROT)                                                      
STATXT5  DFLD  POS=(13,51),LTH=25,                                     +        
               ATTR=(PROT)                                                      
OMRUP6   DFLD  POS=(14,2),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
RAD6     DFLD  POS=(14,7),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KVINL6   DFLD  POS=(14,13),LTH=7,                                      +        
               ATTR=(PROT)                                                      
OMR6     DFLD  POS=(14,22),LTH=4,                                      +        
               ATTR=(PROT)                                                      
ST6      DFLD  POS=(14,28),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVK6    DFLD  POS=(14,33),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KOLLI6   DFLD  POS=(14,40),LTH=9,                                      +        
               ATTR=(PROT)                                                      
STATXT6  DFLD  POS=(14,51),LTH=25,                                     +        
               ATTR=(PROT)                                                      
OMRUP7   DFLD  POS=(15,2),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
RAD7     DFLD  POS=(15,7),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KVINL7   DFLD  POS=(15,13),LTH=7,                                      +        
               ATTR=(PROT)                                                      
OMR7     DFLD  POS=(15,22),LTH=4,                                      +        
               ATTR=(PROT)                                                      
ST7      DFLD  POS=(15,28),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVK7    DFLD  POS=(15,33),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KOLLI7   DFLD  POS=(15,40),LTH=9,                                      +        
               ATTR=(PROT)                                                      
STATXT7  DFLD  POS=(15,51),LTH=25,                                     +        
               ATTR=(PROT)                                                      
OMRUP8   DFLD  POS=(16,2),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
RAD8     DFLD  POS=(16,7),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KVINL8   DFLD  POS=(16,13),LTH=7,                                      +        
               ATTR=(PROT)                                                      
OMR8     DFLD  POS=(16,22),LTH=4,                                      +        
               ATTR=(PROT)                                                      
ST8      DFLD  POS=(16,28),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVK8    DFLD  POS=(16,33),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KOLLI8   DFLD  POS=(16,40),LTH=9,                                      +        
               ATTR=(PROT)                                                      
STATXT8  DFLD  POS=(16,51),LTH=25,                                     +        
               ATTR=(PROT)                                                      
OMRUP9   DFLD  POS=(17,2),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
RAD9     DFLD  POS=(17,7),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KVINL9   DFLD  POS=(17,13),LTH=7,                                      +        
               ATTR=(PROT)                                                      
OMR9     DFLD  POS=(17,22),LTH=4,                                      +        
               ATTR=(PROT)                                                      
ST9      DFLD  POS=(17,28),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVK9    DFLD  POS=(17,33),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KOLLI9   DFLD  POS=(17,40),LTH=9,                                      +        
               ATTR=(PROT)                                                      
STATXT9  DFLD  POS=(17,51),LTH=25,                                     +        
               ATTR=(PROT)                                                      
OMRUP10  DFLD  POS=(18,2),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
RAD10    DFLD  POS=(18,7),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KVINL10  DFLD  POS=(18,13),LTH=7,                                      +        
               ATTR=(PROT)                                                      
OMR10    DFLD  POS=(18,22),LTH=4,                                      +        
               ATTR=(PROT)                                                      
ST10     DFLD  POS=(18,28),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVK10   DFLD  POS=(18,33),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KOLLI10  DFLD  POS=(18,40),LTH=9,                                      +        
               ATTR=(PROT)                                                      
STATXT10 DFLD  POS=(18,51),LTH=25,                                     +        
               ATTR=(PROT)                                                      
OMRUP11  DFLD  POS=(19,2),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
RAD11    DFLD  POS=(19,7),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KVINL11  DFLD  POS=(19,13),LTH=7,                                      +        
               ATTR=(PROT)                                                      
OMR11    DFLD  POS=(19,22),LTH=4,                                      +        
               ATTR=(PROT)                                                      
ST11     DFLD  POS=(19,28),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVK11   DFLD  POS=(19,33),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KOLLI11  DFLD  POS=(19,40),LTH=9,                                      +        
               ATTR=(PROT)                                                      
STATXT11 DFLD  POS=(19,51),LTH=25,                                     +        
               ATTR=(PROT)                                                      
OMRUP12  DFLD  POS=(20,2),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
RAD12    DFLD  POS=(20,7),LTH=4,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KVINL12  DFLD  POS=(20,13),LTH=7,                                      +        
               ATTR=(PROT)                                                      
OMR12    DFLD  POS=(20,22),LTH=4,                                      +        
               ATTR=(PROT)                                                      
ST12     DFLD  POS=(20,28),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
LEVK12   DFLD  POS=(20,33),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KOLLI12  DFLD  POS=(20,40),LTH=9,                                      +        
               ATTR=(PROT)                                                      
STATXT12 DFLD  POS=(20,51),LTH=25,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '13 Reg adv info 14 Reg 1 suppl  15 Reg sev suppl16 Corr+        
               ect Adv  17 Act.Adv.note',                              +        
               POS=(21,2),LTH=79,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 Reg adv acc  19 Reg R34-tran',                      +        
               POS=(22,2),LTH=31,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20 Back out...  21 Cancel Batch 10 WHELP',             +        
               POS=(22,34),LTH=40,                                     +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W6O118N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6N118,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I118N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W6N118                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDLOPNRI,                                               +        
               LTH=8                                                            
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  IDLOPNRU,                                               +        
               LTH=8                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  IDRADENT,                                               +        
               LTH=4                                                            
         MFLD  IDRADNEX,                                               +        
               LTH=4                                                            
         MFLD  IDART,                                                  +        
               LTH=8                                                            
         MFLD  KVAVIS,                                                 +        
               LTH=6                                                            
         MFLD  BEART,                                                  +        
               LTH=25                                                           
         MFLD  KDSORT,                                                 +        
               LTH=2                                                            
         MFLD  BEFT,                                                   +        
               LTH=2                                                            
         MFLD  KVRAPP,                                                 +        
               LTH=6                                                            
         MFLD  BEFARL,                                                 +        
               LTH=14                                                           
         MFLD  OMRUP1,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OMRUP2,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OMRUP3,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OMRUP4,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OMRUP5,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OMRUP6,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OMRUP7,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OMRUP8,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OMRUP9,                                                 +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OMRUP10,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OMRUP11,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  OMRUP12,                                                +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RAD1,                                                   +        
               LTH=4                                                            
         MFLD  RAD2,                                                   +        
               LTH=4                                                            
         MFLD  RAD3,                                                   +        
               LTH=4                                                            
         MFLD  RAD4,                                                   +        
               LTH=4                                                            
         MFLD  RAD5,                                                   +        
               LTH=4                                                            
         MFLD  RAD6,                                                   +        
               LTH=4                                                            
         MFLD  RAD7,                                                   +        
               LTH=4                                                            
         MFLD  RAD8,                                                   +        
               LTH=4                                                            
         MFLD  RAD9,                                                   +        
               LTH=4                                                            
         MFLD  RAD10,                                                  +        
               LTH=4                                                            
         MFLD  RAD11,                                                  +        
               LTH=4                                                            
         MFLD  RAD12,                                                  +        
               LTH=4                                                            
         MFLD  KVINL1,                                                 +        
               LTH=7                                                            
         MFLD  KVINL2,                                                 +        
               LTH=7                                                            
         MFLD  KVINL3,                                                 +        
               LTH=7                                                            
         MFLD  KVINL4,                                                 +        
               LTH=7                                                            
         MFLD  KVINL5,                                                 +        
               LTH=7                                                            
         MFLD  KVINL6,                                                 +        
               LTH=7                                                            
         MFLD  KVINL7,                                                 +        
               LTH=7                                                            
         MFLD  KVINL8,                                                 +        
               LTH=7                                                            
         MFLD  KVINL9,                                                 +        
               LTH=7                                                            
         MFLD  KVINL10,                                                +        
               LTH=7                                                            
         MFLD  KVINL11,                                                +        
               LTH=7                                                            
         MFLD  KVINL12,                                                +        
               LTH=7                                                            
         MFLD  OMR1,                                                   +        
               LTH=4                                                            
         MFLD  OMR2,                                                   +        
               LTH=4                                                            
         MFLD  OMR3,                                                   +        
               LTH=4                                                            
         MFLD  OMR4,                                                   +        
               LTH=4                                                            
         MFLD  OMR5,                                                   +        
               LTH=4                                                            
         MFLD  OMR6,                                                   +        
               LTH=4                                                            
         MFLD  OMR7,                                                   +        
               LTH=4                                                            
         MFLD  OMR8,                                                   +        
               LTH=4                                                            
         MFLD  OMR9,                                                   +        
               LTH=4                                                            
         MFLD  OMR10,                                                  +        
               LTH=4                                                            
         MFLD  OMR11,                                                  +        
               LTH=4                                                            
         MFLD  OMR12,                                                  +        
               LTH=4                                                            
         MFLD  ST1,                                                    +        
               LTH=3                                                            
         MFLD  ST2,                                                    +        
               LTH=3                                                            
         MFLD  ST3,                                                    +        
               LTH=3                                                            
         MFLD  ST4,                                                    +        
               LTH=3                                                            
         MFLD  ST5,                                                    +        
               LTH=3                                                            
         MFLD  ST6,                                                    +        
               LTH=3                                                            
         MFLD  ST7,                                                    +        
               LTH=3                                                            
         MFLD  ST8,                                                    +        
               LTH=3                                                            
         MFLD  ST9,                                                    +        
               LTH=3                                                            
         MFLD  ST10,                                                   +        
               LTH=3                                                            
         MFLD  ST11,                                                   +        
               LTH=3                                                            
         MFLD  ST12,                                                   +        
               LTH=3                                                            
         MFLD  LEVK1,                                                  +        
               LTH=5                                                            
         MFLD  LEVK2,                                                  +        
               LTH=5                                                            
         MFLD  LEVK3,                                                  +        
               LTH=5                                                            
         MFLD  LEVK4,                                                  +        
               LTH=5                                                            
         MFLD  LEVK5,                                                  +        
               LTH=5                                                            
         MFLD  LEVK6,                                                  +        
               LTH=5                                                            
         MFLD  LEVK7,                                                  +        
               LTH=5                                                            
         MFLD  LEVK8,                                                  +        
               LTH=5                                                            
         MFLD  LEVK9,                                                  +        
               LTH=5                                                            
         MFLD  LEVK10,                                                 +        
               LTH=5                                                            
         MFLD  LEVK11,                                                 +        
               LTH=5                                                            
         MFLD  LEVK12,                                                 +        
               LTH=5                                                            
         MFLD  KOLLI1,                                                 +        
               LTH=9                                                            
         MFLD  KOLLI2,                                                 +        
               LTH=9                                                            
         MFLD  KOLLI3,                                                 +        
               LTH=9                                                            
         MFLD  KOLLI4,                                                 +        
               LTH=9                                                            
         MFLD  KOLLI5,                                                 +        
               LTH=9                                                            
         MFLD  KOLLI6,                                                 +        
               LTH=9                                                            
         MFLD  KOLLI7,                                                 +        
               LTH=9                                                            
         MFLD  KOLLI8,                                                 +        
               LTH=9                                                            
         MFLD  KOLLI9,                                                 +        
               LTH=9                                                            
         MFLD  KOLLI10,                                                +        
               LTH=9                                                            
         MFLD  KOLLI11,                                                +        
               LTH=9                                                            
         MFLD  KOLLI12,                                                +        
               LTH=9                                                            
         MFLD  STATXT1,                                                +        
               LTH=25                                                           
         MFLD  STATXT2,                                                +        
               LTH=25                                                           
         MFLD  STATXT3,                                                +        
               LTH=25                                                           
         MFLD  STATXT4,                                                +        
               LTH=25                                                           
         MFLD  STATXT5,                                                +        
               LTH=25                                                           
         MFLD  STATXT6,                                                +        
               LTH=25                                                           
         MFLD  STATXT7,                                                +        
               LTH=25                                                           
         MFLD  STATXT8,                                                +        
               LTH=25                                                           
         MFLD  STATXT9,                                                +        
               LTH=25                                                           
         MFLD  STATXT10,                                               +        
               LTH=25                                                           
         MFLD  STATXT11,                                               +        
               LTH=25                                                           
         MFLD  STATXT12,                                               +        
               LTH=25                                                           
         MFLD  IDLEVIN,                                                +        
               LTH=5                                                            
         MFLD  IDLEVUT,                                                +        
               LTH=5                                                            
         MFLD  IDFSIN,                                                 +        
               LTH=8                                                            
         MFLD  IDFSUT,                                                 +        
               LTH=8                                                            
         MFLD  AVIDATIN,                                               +        
               LTH=6                                                            
         MFLD  AVIDATUT,                                               +        
               LTH=6                                                            
         MFLD  INLPRTIN,                                               +        
               LTH=4                                                            
         MFLD  INLPRTUT,                                               +        
               LTH=4                                                            
         MFLD  KDRTIN,                                                 +        
               LTH=2                                                            
         MFLD  KDRTUT,                                                 +        
               LTH=2                                                            
         MFLD  IDLBBETI,                                               +        
               LTH=12                                                           
         MFLD  IDLBBETU,                                               +        
               LTH=12                                                           
         MFLD  KLIVISIN,                                               +        
               LTH=1                                                            
         MFLD  KLIVISUT,                                               +        
               LTH=1                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=61                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W6I118N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W6N118),                                           +        
               OPT=2,                                                  +        
               NXT=W6O118N1                                                     
MID      LPAGE SOR=(W6N118)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F8'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '61182',                                                +        
               LTH=5                                                            
         MFLD  (IDLEVIN,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  IDLEVUT,                                                +        
               LTH=5                                                            
         MFLD  (IDFSIN,                                                +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  IDFSUT,                                                 +        
               LTH=8                                                            
         MFLD  (AVIDATIN,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  AVIDATUT,                                               +        
               LTH=6                                                            
         MFLD  (INLPRTIN,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  INLPRTUT,                                               +        
               LTH=4                                                            
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  (KDRTIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KDRTUT,                                                 +        
               LTH=2                                                            
         MFLD  (IDLBBETI,                                              +        
               '++++++++++++'),                                        +        
               LTH=12                                                           
         MFLD  IDLBBETU,                                               +        
               LTH=12                                                           
         MFLD  (KLIVISIN,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  KLIVISUT,                                               +        
               LTH=1                                                            
         MFLD  (IDLOPNRI,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDLOPNRU,                                               +        
               LTH=8                                                            
         MFLD  IDRADENT,                                               +        
               LTH=4                                                            
         MFLD  IDRADNEX,                                               +        
               LTH=4                                                            
         MFLD  (OMRUP1,                                                +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (OMRUP2,                                                +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (OMRUP3,                                                +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (OMRUP4,                                                +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (OMRUP5,                                                +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (OMRUP6,                                                +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (OMRUP7,                                                +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (OMRUP8,                                                +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (OMRUP9,                                                +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (OMRUP10,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (OMRUP11,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (OMRUP12,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  RAD1,                                                   +        
               LTH=4                                                            
         MFLD  RAD2,                                                   +        
               LTH=4                                                            
         MFLD  RAD3,                                                   +        
               LTH=4                                                            
         MFLD  RAD4,                                                   +        
               LTH=4                                                            
         MFLD  RAD5,                                                   +        
               LTH=4                                                            
         MFLD  RAD6,                                                   +        
               LTH=4                                                            
         MFLD  RAD7,                                                   +        
               LTH=4                                                            
         MFLD  RAD8,                                                   +        
               LTH=4                                                            
         MFLD  RAD9,                                                   +        
               LTH=4                                                            
         MFLD  RAD10,                                                  +        
               LTH=4                                                            
         MFLD  RAD11,                                                  +        
               LTH=4                                                            
         MFLD  RAD12,                                                  +        
               LTH=4                                                            
         MFLD  ST1,                                                    +        
               LTH=3                                                            
         MFLD  ST2,                                                    +        
               LTH=3                                                            
         MFLD  ST3,                                                    +        
               LTH=3                                                            
         MFLD  ST4,                                                    +        
               LTH=3                                                            
         MFLD  ST5,                                                    +        
               LTH=3                                                            
         MFLD  ST6,                                                    +        
               LTH=3                                                            
         MFLD  ST7,                                                    +        
               LTH=3                                                            
         MFLD  ST8,                                                    +        
               LTH=3                                                            
         MFLD  ST9,                                                    +        
               LTH=3                                                            
         MFLD  ST10,                                                   +        
               LTH=3                                                            
         MFLD  ST11,                                                   +        
               LTH=3                                                            
         MFLD  ST12,                                                   +        
               LTH=3                                                            
         MSGEND                                                                 
         END                                                                    
