***********************************************************************         
* CREATED BY PCC6483   ON 00/10/17  AT 14:56                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'Goods for dir.del. via DC11     '                               
W6N174   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W6T174 7',                                           +        
               8='W6T174 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W6T174U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,11)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'GOODS FOR DIRECT DEL VIA CDC',                         +        
               POS=(1,11),LTH=28,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Supplier',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(NUM,PROT)                                                  
LEVNRIN  DFLD  POS=(2,11),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Supplier date',                                        +        
               POS=(2,17),LTH=13,                                      +        
               ATTR=(NUM,PROT)                                                  
LEVDATIN DFLD  POS=(2,31),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Supplier reference',                                   +        
               POS=(2,38),LTH=18,                                      +        
               ATTR=(NUM,PROT)                                                  
LEVREFIN DFLD  POS=(2,57),LTH=10,                                      +        
               ATTR=(NOPROT)                                                    
LEVNRUT  DFLD  POS=(3,11),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
LEVDATUT DFLD  POS=(3,31),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
LEVREFUT DFLD  POS=(3,57),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'C Supdat time  Suppl ref  Cases',                      +        
               POS=(5,2),LTH=31,                                       +        
               ATTR=(PROT)                                                      
CMD1     DFLD  POS=(6,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
LEVDAT1  DFLD  POS=(6,4),LTH=6,                                        +        
               ATTR=(NUM,PROT)                                                  
LEVTID1  DFLD  POS=(6,11),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
LEVREF1  DFLD  POS=(6,17),LTH=10,                                      +        
               ATTR=(NUM,PROT)                                                  
ANTAL1   DFLD  POS=(6,28),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
CMD2     DFLD  POS=(7,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
LEVDAT2  DFLD  POS=(7,4),LTH=6,                                        +        
               ATTR=(NUM,PROT)                                                  
LEVTID2  DFLD  POS=(7,11),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
LEVREF2  DFLD  POS=(7,17),LTH=10,                                      +        
               ATTR=(NUM,PROT)                                                  
ANTAL2   DFLD  POS=(7,28),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
CMD3     DFLD  POS=(8,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
LEVDAT3  DFLD  POS=(8,4),LTH=6,                                        +        
               ATTR=(NUM,PROT)                                                  
LEVTID3  DFLD  POS=(8,11),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
LEVREF3  DFLD  POS=(8,17),LTH=10,                                      +        
               ATTR=(NUM,PROT)                                                  
ANTAL3   DFLD  POS=(8,28),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
CMD4     DFLD  POS=(9,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
LEVDAT4  DFLD  POS=(9,4),LTH=6,                                        +        
               ATTR=(NUM,PROT)                                                  
LEVTID4  DFLD  POS=(9,11),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
LEVREF4  DFLD  POS=(9,17),LTH=10,                                      +        
               ATTR=(NUM,PROT)                                                  
ANTAL4   DFLD  POS=(9,28),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
CMD5     DFLD  POS=(10,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
LEVDAT5  DFLD  POS=(10,4),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
LEVTID5  DFLD  POS=(10,11),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
LEVREF5  DFLD  POS=(10,17),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
ANTAL5   DFLD  POS=(10,28),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
CMD6     DFLD  POS=(11,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
LEVDAT6  DFLD  POS=(11,4),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
LEVTID6  DFLD  POS=(11,11),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
LEVREF6  DFLD  POS=(11,17),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
ANTAL6   DFLD  POS=(11,28),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
CMD7     DFLD  POS=(12,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
LEVDAT7  DFLD  POS=(12,4),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
LEVTID7  DFLD  POS=(12,11),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
LEVREF7  DFLD  POS=(12,17),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
ANTAL7   DFLD  POS=(12,28),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
CMD8     DFLD  POS=(13,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
LEVDAT8  DFLD  POS=(13,4),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
LEVTID8  DFLD  POS=(13,11),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
LEVREF8  DFLD  POS=(13,17),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
ANTAL8   DFLD  POS=(13,28),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
CMD9     DFLD  POS=(14,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
LEVDAT9  DFLD  POS=(14,4),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
LEVTID9  DFLD  POS=(14,11),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
LEVREF9  DFLD  POS=(14,17),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
ANTAL9   DFLD  POS=(14,28),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
CMD10    DFLD  POS=(15,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
LEVDAT10 DFLD  POS=(15,4),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
LEVTID10 DFLD  POS=(15,11),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
LEVREF10 DFLD  POS=(15,17),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
ANTAL10  DFLD  POS=(15,28),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
CMD11    DFLD  POS=(16,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
LEVDAT11 DFLD  POS=(16,4),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
LEVTID11 DFLD  POS=(16,11),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
LEVREF11 DFLD  POS=(16,17),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
ANTAL11  DFLD  POS=(16,28),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
CMD12    DFLD  POS=(17,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
LEVDAT12 DFLD  POS=(17,4),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
LEVTID12 DFLD  POS=(17,11),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
LEVREF12 DFLD  POS=(17,17),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
ANTAL12  DFLD  POS=(17,28),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
CMD13    DFLD  POS=(18,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
LEVDAT13 DFLD  POS=(18,4),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
LEVTID13 DFLD  POS=(18,11),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
LEVREF13 DFLD  POS=(18,17),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
ANTAL13  DFLD  POS=(18,28),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
CMD14    DFLD  POS=(19,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
LEVDAT14 DFLD  POS=(19,4),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
LEVTID14 DFLD  POS=(19,11),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
LEVREF14 DFLD  POS=(19,17),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
ANTAL14  DFLD  POS=(19,28),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
CMD15    DFLD  POS=(20,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
LEVDAT15 DFLD  POS=(20,4),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
LEVTID15 DFLD  POS=(20,11),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
LEVREF15 DFLD  POS=(20,17),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
ANTAL15  DFLD  POS=(20,28),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'F10=WHELP  F11=Update',                                +        
               POS=(22,2),LTH=21,                                      +        
               ATTR=(PROT)                                                      
FLD2306  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,63),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W6O174N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6N174,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I174N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  LEVNRIN,                                                +        
               LTH=2                                                            
         MFLD  LEVNRUT,                                                +        
               LTH=5                                                            
         MFLD  LEVDATIN,                                               +        
               LTH=2                                                            
         MFLD  LEVDATUT,                                               +        
               LTH=6                                                            
         MFLD  LEVREFIN,                                               +        
               LTH=2                                                            
         MFLD  LEVREFUT,                                               +        
               LTH=10                                                           
         MFLD  CMD1,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVDAT1,                                                +        
               LTH=6                                                            
         MFLD  LEVTID1,                                                +        
               LTH=5                                                            
         MFLD  LEVREF1,                                                +        
               LTH=10                                                           
         MFLD  ANTAL1,                                                 +        
               LTH=5                                                            
         MFLD  CMD2,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVDAT2,                                                +        
               LTH=6                                                            
         MFLD  LEVTID2,                                                +        
               LTH=5                                                            
         MFLD  LEVREF2,                                                +        
               LTH=10                                                           
         MFLD  ANTAL2,                                                 +        
               LTH=5                                                            
         MFLD  CMD3,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVDAT3,                                                +        
               LTH=6                                                            
         MFLD  LEVTID3,                                                +        
               LTH=5                                                            
         MFLD  LEVREF3,                                                +        
               LTH=10                                                           
         MFLD  ANTAL3,                                                 +        
               LTH=5                                                            
         MFLD  CMD4,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVDAT4,                                                +        
               LTH=6                                                            
         MFLD  LEVTID4,                                                +        
               LTH=5                                                            
         MFLD  LEVREF4,                                                +        
               LTH=10                                                           
         MFLD  ANTAL4,                                                 +        
               LTH=5                                                            
         MFLD  CMD5,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVDAT5,                                                +        
               LTH=6                                                            
         MFLD  LEVTID5,                                                +        
               LTH=5                                                            
         MFLD  LEVREF5,                                                +        
               LTH=10                                                           
         MFLD  ANTAL5,                                                 +        
               LTH=5                                                            
         MFLD  CMD6,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVDAT6,                                                +        
               LTH=6                                                            
         MFLD  LEVTID6,                                                +        
               LTH=5                                                            
         MFLD  LEVREF6,                                                +        
               LTH=10                                                           
         MFLD  ANTAL6,                                                 +        
               LTH=5                                                            
         MFLD  CMD7,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVDAT7,                                                +        
               LTH=6                                                            
         MFLD  LEVTID7,                                                +        
               LTH=5                                                            
         MFLD  LEVREF7,                                                +        
               LTH=10                                                           
         MFLD  ANTAL7,                                                 +        
               LTH=5                                                            
         MFLD  CMD8,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVDAT8,                                                +        
               LTH=6                                                            
         MFLD  LEVTID8,                                                +        
               LTH=5                                                            
         MFLD  LEVREF8,                                                +        
               LTH=10                                                           
         MFLD  ANTAL8,                                                 +        
               LTH=5                                                            
         MFLD  CMD9,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVDAT9,                                                +        
               LTH=6                                                            
         MFLD  LEVTID9,                                                +        
               LTH=5                                                            
         MFLD  LEVREF9,                                                +        
               LTH=10                                                           
         MFLD  ANTAL9,                                                 +        
               LTH=5                                                            
         MFLD  CMD10,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVDAT10,                                               +        
               LTH=6                                                            
         MFLD  LEVTID10,                                               +        
               LTH=5                                                            
         MFLD  LEVREF10,                                               +        
               LTH=10                                                           
         MFLD  ANTAL10,                                                +        
               LTH=5                                                            
         MFLD  CMD11,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVDAT11,                                               +        
               LTH=6                                                            
         MFLD  LEVTID11,                                               +        
               LTH=5                                                            
         MFLD  LEVREF11,                                               +        
               LTH=10                                                           
         MFLD  ANTAL11,                                                +        
               LTH=5                                                            
         MFLD  CMD12,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVDAT12,                                               +        
               LTH=6                                                            
         MFLD  LEVTID12,                                               +        
               LTH=5                                                            
         MFLD  LEVREF12,                                               +        
               LTH=10                                                           
         MFLD  ANTAL12,                                                +        
               LTH=5                                                            
         MFLD  CMD13,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVDAT13,                                               +        
               LTH=6                                                            
         MFLD  LEVTID13,                                               +        
               LTH=5                                                            
         MFLD  LEVREF13,                                               +        
               LTH=10                                                           
         MFLD  ANTAL13,                                                +        
               LTH=5                                                            
         MFLD  CMD14,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVDAT14,                                               +        
               LTH=6                                                            
         MFLD  LEVTID14,                                               +        
               LTH=5                                                            
         MFLD  LEVREF14,                                               +        
               LTH=10                                                           
         MFLD  ANTAL14,                                                +        
               LTH=5                                                            
         MFLD  CMD15,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVDAT15,                                               +        
               LTH=6                                                            
         MFLD  LEVTID15,                                               +        
               LTH=5                                                            
         MFLD  LEVREF15,                                               +        
               LTH=10                                                           
         MFLD  ANTAL15,                                                +        
               LTH=5                                                            
         MFLD  FLD2306,                                                +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  FSYSMSG,                                                +        
               LTH=79                                                           
         MSGEND                                                                 
W6I174N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W6N174),                                           +        
               OPT=2,                                                  +        
               NXT=W6O174N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '61742',                                                +        
               LTH=5                                                            
         MFLD  (LEVNRIN,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (LEVNRUT,                                               +        
               '     '),                                               +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (LEVDATIN,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R                                                           
         MFLD  (LEVDATUT,                                              +        
               '      '),                                              +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (LEVREFIN,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L                                                           
         MFLD  (LEVREFUT,                                              +        
               '          '),                                          +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MFLD  (CMD1,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD2,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD3,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD4,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD5,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD6,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD7,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD8,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD9,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD10,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD11,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD12,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD13,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD14,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD15,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
