****** ****************************************************************         
* CREATED BY PC22543   ON 95/01/03  AT 15:49                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'REGISTER ONE SUPPLIER           '                               
W6N112   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W6T111  ',                                          +        
               14='W6T112  ',                                          +        
               15='W6T113  ',                                          +        
               16='W6T114  ',                                          +        
               17='W6T115  ',                                          +        
               18='W6T116  ',                                          +        
               19='W6T117  ',                                          +        
               20='W6T118  ',                                          +        
               21='W6T119  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W6N112   DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Register 1 Supplier',                                  +        
               POS=(1,11),LTH=19,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Suppl.No.',                                            +        
               POS=(2,2),LTH=9,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDLEVNRI DFLD  POS=(2,12),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'RT',                                                   +        
               POS=(2,19),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KDRTI    DFLD  POS=(2,22),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Del.date',                                             +        
               POS=(2,26),LTH=8,                                       +        
               ATTR=(PROT)                                                      
AVIDATIN DFLD  POS=(2,35),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDFSI    DFLD  POS=(2,42),LTH=8,                                       +        
               ATTR=(NUM,PROT,NODISP)                                           
         DFLD  'Printer',                                              +        
               POS=(2,51),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
INLPRTIN DFLD  POS=(2,59),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'DC',                                                   +        
               POS=(2,65),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDDCIN   DFLD  POS=(2,68),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
IDLEVNRU DFLD  POS=(3,12),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
KDRTU    DFLD  POS=(3,22),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
AVIDATUT DFLD  POS=(3,35),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
IDFSU    DFLD  POS=(3,42),LTH=8,                                       +        
               ATTR=(NUM,PROT,NODISP)                                           
INLPRTUT DFLD  POS=(3,59),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDCUT   DFLD  POS=(3,68),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Carrier',                                              +        
               POS=(5,2),LTH=7,                                        +        
               ATTR=(PROT)                                                      
IDLBBETI DFLD  POS=(5,10),LTH=12,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Approved (y/n)',                                       +        
               POS=(5,34),LTH=14,                                      +        
               ATTR=(PROT)                                                      
FLGODKI  DFLD  POS=(5,49),LTH=1,                                       +        
               ATTR=(PROT)                                                      
IDLBBETU DFLD  POS=(6,10),LTH=12,                                      +        
               ATTR=(PROT,MOD)                                                  
FLGODKU  DFLD  POS=(6,49),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Part No.  Qty   Adv No.',                              +        
               POS=(7,2),LTH=23,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Part No.  Qty   Adv No.',                              +        
               POS=(7,34),LTH=23,                                      +        
               ATTR=(PROT)                                                      
ARTNR1   DFLD  POS=(8,2),LTH=8,                                        +        
               ATTR=(NUM,NOPROT)                                                
ANTAL1   DFLD  POS=(8,11),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
FS1      DFLD  POS=(8,18),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
ARTNR2   DFLD  POS=(8,34),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
ANTAL2   DFLD  POS=(8,43),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
FS2      DFLD  POS=(8,50),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
ARTNR3   DFLD  POS=(9,2),LTH=8,                                        +        
               ATTR=(NUM,NOPROT)                                                
ANTAL3   DFLD  POS=(9,11),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
FS3      DFLD  POS=(9,18),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
ARTNR4   DFLD  POS=(9,34),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
ANTAL4   DFLD  POS=(9,43),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
FS4      DFLD  POS=(9,50),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
ARTNR5   DFLD  POS=(10,2),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
ANTAL5   DFLD  POS=(10,11),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
FS5      DFLD  POS=(10,18),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR6   DFLD  POS=(10,34),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
ANTAL6   DFLD  POS=(10,43),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
FS6      DFLD  POS=(10,50),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR7   DFLD  POS=(11,2),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
ANTAL7   DFLD  POS=(11,11),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
FS7      DFLD  POS=(11,18),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR8   DFLD  POS=(11,34),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
ANTAL8   DFLD  POS=(11,43),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
FS8      DFLD  POS=(11,50),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR9   DFLD  POS=(12,2),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
ANTAL9   DFLD  POS=(12,11),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
FS9      DFLD  POS=(12,18),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR10  DFLD  POS=(12,34),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
ANTA10   DFLD  POS=(12,43),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
FS10     DFLD  POS=(12,50),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR11  DFLD  POS=(13,2),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
ANTA11   DFLD  POS=(13,11),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
FS11     DFLD  POS=(13,18),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR12  DFLD  POS=(13,34),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
ANTA12   DFLD  POS=(13,43),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
FS12     DFLD  POS=(13,50),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR13  DFLD  POS=(14,2),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
ANTA13   DFLD  POS=(14,11),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
FS13     DFLD  POS=(14,18),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR14  DFLD  POS=(14,34),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
ANTA14   DFLD  POS=(14,43),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
FS14     DFLD  POS=(14,50),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR15  DFLD  POS=(15,2),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
ANTA15   DFLD  POS=(15,11),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
FS15     DFLD  POS=(15,18),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR16  DFLD  POS=(15,34),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
ANTA16   DFLD  POS=(15,43),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
FS16     DFLD  POS=(15,50),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR17  DFLD  POS=(16,2),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
ANTA17   DFLD  POS=(16,11),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
FS17     DFLD  POS=(16,18),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR18  DFLD  POS=(16,34),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
ANTA18   DFLD  POS=(16,43),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
FS18     DFLD  POS=(16,50),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR19  DFLD  POS=(17,2),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
ANTA19   DFLD  POS=(17,11),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
FS19     DFLD  POS=(17,18),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR20  DFLD  POS=(17,34),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
ANTA20   DFLD  POS=(17,43),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
FS20     DFLD  POS=(17,50),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR21  DFLD  POS=(18,2),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
ANTA21   DFLD  POS=(18,11),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
FS21     DFLD  POS=(18,18),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR22  DFLD  POS=(18,34),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
ANTA22   DFLD  POS=(18,43),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
FS22     DFLD  POS=(18,50),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR23  DFLD  POS=(19,2),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
ANTA23   DFLD  POS=(19,11),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
FS23     DFLD  POS=(19,18),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
ARTNR24  DFLD  POS=(19,34),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
ANTA24   DFLD  POS=(19,43),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
FS24     DFLD  POS=(19,50),LTH=8,                                      +        
               ATTR=(NUM,NOPROT)                                                
STOPPTKN DFLD  POS=(19,59),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
TRAP     DFLD  POS=(19,61),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KLIVISIN DFLD  POS=(20,2),LTH=1,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
KLIVISUT DFLD  POS=(20,5),LTH=1,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
LOPNRIN  DFLD  POS=(20,7),LTH=8,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
LOPNRUT  DFLD  POS=(20,20),LTH=8,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  '13 Reg Adv info 14 Reg 1 suppl  15 Reg sev suppl16 Corr+        
               ect Adv  17 Act adv note',                              +        
               POS=(21,2),LTH=79,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 Reg Adv Acco 19 Reg R34-tran',                      +        
               POS=(22,2),LTH=31,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20 Back out...  21 Cancel Batch 10 WHELP',             +        
               POS=(22,34),LTH=40,                                     +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W6O112N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6N112,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I112N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W6N112                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDLEVNRI,                                               +        
               LTH=5                                                            
         MFLD  KDRTI,                                                  +        
               LTH=2                                                            
         MFLD  AVIDATIN,                                               +        
               LTH=6                                                            
         MFLD  IDFSI,                                                  +        
               LTH=8                                                            
         MFLD  INLPRTIN,                                               +        
               LTH=4                                                            
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  IDLEVNRU,                                               +        
               LTH=5                                                            
         MFLD  KDRTU,                                                  +        
               LTH=2                                                            
         MFLD  AVIDATUT,                                               +        
               LTH=6                                                            
         MFLD  IDFSU,                                                  +        
               LTH=8                                                            
         MFLD  INLPRTUT,                                               +        
               LTH=4                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  IDLBBETI,                                               +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLGODKI,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDLBBETU,                                               +        
               LTH=12                                                           
         MFLD  FLGODKU,                                                +        
               LTH=1                                                            
         MFLD  ARTNR1,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR2,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR3,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR4,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR5,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR6,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR7,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR8,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR9,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR10,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR11,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR12,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR13,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR14,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR15,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR16,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR17,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR18,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR19,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR20,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR21,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR22,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR23,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNR24,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ANTAL1,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTAL2,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTAL3,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTAL4,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTAL5,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTAL6,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTAL7,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTAL8,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTAL9,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA10,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA11,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA12,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA13,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA14,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA15,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA16,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA17,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA18,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA19,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA20,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA21,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA22,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA23,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ANTA24,                                                 +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FS1,                                                    +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FS2,                                                    +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FS3,                                                    +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FS4,                                                    +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FS5,                                                    +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FS6,                                                    +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FS7,                                                    +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FS8,                                                    +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FS9,                                                    +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FS10,                                                   +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FS11,                                                   +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FS12,                                                   +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FS13,                                                   +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FS14,                                                   +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FS15,                                                   +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FS16,                                                   +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FS17,                                                   +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FS18,                                                   +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FS19,                                                   +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FS20,                                                   +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FS21,                                                   +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FS22,                                                   +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FS23,                                                   +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FS24,                                                   +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KLIVISIN,                                               +        
               LTH=1                                                            
         MFLD  KLIVISUT,                                               +        
               LTH=1                                                            
         MFLD  LOPNRIN,                                                +        
               LTH=8                                                            
         MFLD  LOPNRUT,                                                +        
               LTH=8                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=61                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W6I112N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W6N112),                                           +        
               OPT=2,                                                  +        
               NXT=W6O112N1                                                     
MID      LPAGE SOR=(W6N112)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '61122',                                                +        
               LTH=5                                                            
         MFLD  (IDLEVNRI,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  IDLEVNRU,                                               +        
               LTH=5                                                            
         MFLD  (IDFSI,                                                 +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  IDFSU,                                                  +        
               LTH=8                                                            
         MFLD  (AVIDATIN,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  AVIDATUT,                                               +        
               LTH=6                                                            
         MFLD  (INLPRTIN,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  INLPRTUT,                                               +        
               LTH=4                                                            
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  (KDRTI,                                                 +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KDRTU,                                                  +        
               LTH=2                                                            
         MFLD  (IDLBBETI,                                              +        
               '++++++++++++'),                                        +        
               LTH=12                                                           
         MFLD  IDLBBETU,                                               +        
               LTH=12                                                           
         MFLD  (KLIVISIN,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  KLIVISUT,                                               +        
               LTH=1                                                            
         MFLD  (LOPNRIN,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  LOPNRUT,                                                +        
               LTH=8                                                            
         MFLD  (FLGODKI,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  FLGODKU,                                                +        
               LTH=1                                                            
         MFLD  (ARTNR1,                                                +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR2,                                                +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR3,                                                +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR4,                                                +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR5,                                                +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR6,                                                +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR7,                                                +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR8,                                                +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR9,                                                +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR10,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR11,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR12,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR13,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR14,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR15,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR16,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR17,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR18,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR19,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR20,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR21,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR22,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR23,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNR24,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTAL1,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTAL2,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTAL3,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTAL4,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTAL5,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTAL6,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTAL7,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTAL8,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTAL9,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA10,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA11,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA12,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA13,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA14,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA15,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA16,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA17,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA18,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA19,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA20,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA21,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA22,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA23,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTA24,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FS1,                                                   +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (FS2,                                                   +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (FS3,                                                   +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (FS4,                                                   +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (FS5,                                                   +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (FS6,                                                   +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (FS7,                                                   +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (FS8,                                                   +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (FS9,                                                   +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (FS10,                                                  +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (FS11,                                                  +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (FS12,                                                  +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (FS13,                                                  +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (FS14,                                                  +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (FS15,                                                  +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (FS16,                                                  +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (FS17,                                                  +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (FS18,                                                  +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (FS19,                                                  +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (FS20,                                                  +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (FS21,                                                  +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (FS22,                                                  +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (FS23,                                                  +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (FS24,                                                  +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MSGEND                                                                 
         END                                                                    
