***********************************************************************         
* CREATED BY PC63442   ON 99/02/04  AT 11:22                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'TRANSPORTANMÄRKNINGAR           '                               
W6N148   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W6T148 7',                                           +        
               8='W6T148 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W6T148U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W6T141  ',                                          +        
               14='W6T142  ',                                          +        
               15='W6T143  ',                                          +        
               16='W6T144  ',                                          +        
               17='W6T145  ',                                          +        
               18='W6T146  ',                                          +        
               19='W6T147  ',                                          +        
               20='W6T148  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W6N148   DPAGE CURSOR=((2,10)),                                        +        
               FILL=NONE                                                        
TRANS1   DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
TRANS2   DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
TRANS3   DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
TRANS4   DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'TRANSPORT REMARKS',                                    +        
               POS=(1,11),LTH=17,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Seq ',                                                 +        
               POS=(2,2),LTH=4,                                        +        
               ATTR=(ALPHA,PROT,HI)                                             
         DFLD  'No',                                                   +        
               POS=(2,7),LTH=2,                                        +        
               ATTR=(PROT)                                                      
IDLOPIN  DFLD  POS=(2,10),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Supp No',                                              +        
               POS=(2,19),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
IDLEVIN  DFLD  POS=(2,27),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Case No',                                              +        
               POS=(2,35),LTH=7,                                       +        
               ATTR=(PROT)                                                      
IDKOLIN  DFLD  POS=(2,43),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,53),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
IDDCIN   DFLD  POS=(2,56),LTH=2,                                       +        
               ATTR=(ALPHA,NOPROT)                                              
IDLOPUT  DFLD  POS=(3,10),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
IDLEVUT  DFLD  POS=(3,27),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
IDKOLUT  DFLD  POS=(3,43),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDCUT   DFLD  POS=(3,56),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
IDRADE   DFLD  POS=(4,2),LTH=4,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
IDRADN   DFLD  POS=(4,7),LTH=4,                                        +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         DFLD  'Part',                                                 +        
               POS=(5,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
IDART    DFLD  POS=(5,9),LTH=8,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Quantity',                                             +        
               POS=(5,20),LTH=8,                                       +        
               ATTR=(PROT)                                                      
KVAVIS   DFLD  POS=(5,29),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Description',                                          +        
               POS=(5,38),LTH=11,                                      +        
               ATTR=(PROT)                                                      
BEART    DFLD  POS=(5,51),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Act  Line  Suppl    Case No    Quant  Plac Prio  Info',+        
               POS=(7,2),LTH=53,                                       +        
               ATTR=(PROT)                                                      
CMD1     DFLD  POS=(8,2),LTH=3,                                        +        
               ATTR=(NOPROT)                                                    
RAD1     DFLD  POS=(8,7),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
LEVNR1   DFLD  POS=(8,13),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KOLLI1   DFLD  POS=(8,20),LTH=9,                                       +        
               ATTR=(PROT)                                                      
ANT1     DFLD  POS=(8,32),LTH=6,                                       +        
               ATTR=(PROT)                                                      
PLAC1    DFLD  POS=(8,40),LTH=4,                                       +        
               ATTR=(PROT)                                                      
PRI1     DFLD  POS=(8,47),LTH=1,                                       +        
               ATTR=(PROT)                                                      
INFO1    DFLD  POS=(8,51),LTH=3,                                       +        
               ATTR=(PROT)                                                      
CMD2     DFLD  POS=(9,2),LTH=3,                                        +        
               ATTR=(NOPROT)                                                    
RAD2     DFLD  POS=(9,7),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
LEVNR2   DFLD  POS=(9,13),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KOLLI2   DFLD  POS=(9,20),LTH=9,                                       +        
               ATTR=(PROT)                                                      
ANT2     DFLD  POS=(9,32),LTH=6,                                       +        
               ATTR=(PROT)                                                      
PLAC2    DFLD  POS=(9,40),LTH=4,                                       +        
               ATTR=(PROT)                                                      
PRI2     DFLD  POS=(9,47),LTH=1,                                       +        
               ATTR=(PROT)                                                      
INFO2    DFLD  POS=(9,51),LTH=3,                                       +        
               ATTR=(PROT)                                                      
CMD3     DFLD  POS=(10,2),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
RAD3     DFLD  POS=(10,7),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
LEVNR3   DFLD  POS=(10,13),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KOLLI3   DFLD  POS=(10,20),LTH=9,                                      +        
               ATTR=(PROT)                                                      
ANT3     DFLD  POS=(10,32),LTH=6,                                      +        
               ATTR=(PROT)                                                      
PLAC3    DFLD  POS=(10,40),LTH=4,                                      +        
               ATTR=(PROT)                                                      
PRI3     DFLD  POS=(10,47),LTH=1,                                      +        
               ATTR=(PROT)                                                      
INFO3    DFLD  POS=(10,51),LTH=3,                                      +        
               ATTR=(PROT)                                                      
CMD4     DFLD  POS=(11,2),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
RAD4     DFLD  POS=(11,7),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
LEVNR4   DFLD  POS=(11,13),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KOLLI4   DFLD  POS=(11,20),LTH=9,                                      +        
               ATTR=(PROT)                                                      
ANT4     DFLD  POS=(11,32),LTH=6,                                      +        
               ATTR=(PROT)                                                      
PLAC4    DFLD  POS=(11,40),LTH=4,                                      +        
               ATTR=(PROT)                                                      
PRI4     DFLD  POS=(11,47),LTH=1,                                      +        
               ATTR=(PROT)                                                      
INFO4    DFLD  POS=(11,51),LTH=3,                                      +        
               ATTR=(PROT)                                                      
CMD5     DFLD  POS=(12,2),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
RAD5     DFLD  POS=(12,7),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
LEVNR5   DFLD  POS=(12,13),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KOLLI5   DFLD  POS=(12,20),LTH=9,                                      +        
               ATTR=(PROT)                                                      
ANT5     DFLD  POS=(12,32),LTH=6,                                      +        
               ATTR=(PROT)                                                      
PLAC5    DFLD  POS=(12,40),LTH=4,                                      +        
               ATTR=(PROT)                                                      
PRI5     DFLD  POS=(12,47),LTH=1,                                      +        
               ATTR=(PROT)                                                      
INFO5    DFLD  POS=(12,51),LTH=3,                                      +        
               ATTR=(PROT)                                                      
CMD6     DFLD  POS=(13,2),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
RAD6     DFLD  POS=(13,7),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
LEVNR6   DFLD  POS=(13,13),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KOLLI6   DFLD  POS=(13,20),LTH=9,                                      +        
               ATTR=(PROT)                                                      
ANT6     DFLD  POS=(13,32),LTH=6,                                      +        
               ATTR=(PROT)                                                      
PLAC6    DFLD  POS=(13,40),LTH=4,                                      +        
               ATTR=(PROT)                                                      
PRI6     DFLD  POS=(13,47),LTH=1,                                      +        
               ATTR=(PROT)                                                      
INFO6    DFLD  POS=(13,51),LTH=3,                                      +        
               ATTR=(PROT)                                                      
CMD7     DFLD  POS=(14,2),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
RAD7     DFLD  POS=(14,7),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
LEVNR7   DFLD  POS=(14,13),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KOLLI7   DFLD  POS=(14,20),LTH=9,                                      +        
               ATTR=(PROT)                                                      
ANT7     DFLD  POS=(14,32),LTH=6,                                      +        
               ATTR=(PROT)                                                      
PLA7     DFLD  POS=(14,40),LTH=4,                                      +        
               ATTR=(PROT)                                                      
PRI7     DFLD  POS=(14,47),LTH=1,                                      +        
               ATTR=(PROT)                                                      
INFO7    DFLD  POS=(14,51),LTH=3,                                      +        
               ATTR=(PROT)                                                      
CMD8     DFLD  POS=(15,2),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
RAD8     DFLD  POS=(15,7),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
LEVNR8   DFLD  POS=(15,13),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KOLLI8   DFLD  POS=(15,20),LTH=9,                                      +        
               ATTR=(PROT)                                                      
ANT8     DFLD  POS=(15,32),LTH=6,                                      +        
               ATTR=(PROT)                                                      
PLAC8    DFLD  POS=(15,40),LTH=4,                                      +        
               ATTR=(PROT)                                                      
PRI8     DFLD  POS=(15,47),LTH=1,                                      +        
               ATTR=(PROT)                                                      
INFO8    DFLD  POS=(15,51),LTH=3,                                      +        
               ATTR=(PROT)                                                      
CMD9     DFLD  POS=(16,2),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
RAD9     DFLD  POS=(16,7),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
LEVNR9   DFLD  POS=(16,13),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KOLLI9   DFLD  POS=(16,20),LTH=9,                                      +        
               ATTR=(PROT)                                                      
ANT9     DFLD  POS=(16,32),LTH=6,                                      +        
               ATTR=(PROT)                                                      
PLAC9    DFLD  POS=(16,40),LTH=4,                                      +        
               ATTR=(PROT)                                                      
PRI9     DFLD  POS=(16,47),LTH=1,                                      +        
               ATTR=(PROT)                                                      
INFO9    DFLD  POS=(16,51),LTH=3,                                      +        
               ATTR=(PROT)                                                      
CMD10    DFLD  POS=(17,2),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
RAD10    DFLD  POS=(17,7),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
LEVNR10  DFLD  POS=(17,13),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KOLLI10  DFLD  POS=(17,20),LTH=9,                                      +        
               ATTR=(PROT)                                                      
ANT10    DFLD  POS=(17,32),LTH=6,                                      +        
               ATTR=(PROT)                                                      
PLAC10   DFLD  POS=(17,40),LTH=4,                                      +        
               ATTR=(PROT)                                                      
PRI10    DFLD  POS=(17,47),LTH=1,                                      +        
               ATTR=(PROT)                                                      
INFO10   DFLD  POS=(17,51),LTH=3,                                      +        
               ATTR=(PROT)                                                      
CMD11    DFLD  POS=(18,2),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
RAD11    DFLD  POS=(18,7),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
LEVNR11  DFLD  POS=(18,13),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KOLLI11  DFLD  POS=(18,20),LTH=9,                                      +        
               ATTR=(PROT)                                                      
ANT11    DFLD  POS=(18,32),LTH=6,                                      +        
               ATTR=(PROT)                                                      
PLAC11   DFLD  POS=(18,40),LTH=4,                                      +        
               ATTR=(PROT)                                                      
PRI11    DFLD  POS=(18,47),LTH=1,                                      +        
               ATTR=(PROT)                                                      
INFO11   DFLD  POS=(18,51),LTH=3,                                      +        
               ATTR=(PROT)                                                      
CMD12    DFLD  POS=(19,2),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
RAD12    DFLD  POS=(19,7),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
LEVNR12  DFLD  POS=(19,13),LTH=5,                                      +        
               ATTR=(PROT)                                                      
KOLLI12  DFLD  POS=(19,20),LTH=9,                                      +        
               ATTR=(PROT)                                                      
ANT12    DFLD  POS=(19,32),LTH=6,                                      +        
               ATTR=(PROT)                                                      
PLAC12   DFLD  POS=(19,40),LTH=4,                                      +        
               ATTR=(PROT)                                                      
PRI12    DFLD  POS=(19,47),LTH=1,                                      +        
               ATTR=(PROT)                                                      
INFO12   DFLD  POS=(19,51),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'F7=First F8=Forward F10=WHELP F11=Update F12=Logoff',  +        
               POS=(22,2),LTH=51,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W6O148N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6N148,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I148N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W6N148                                                       
         SEG                                                                    
         MFLD  TRANS1,                                                 +        
               LTH=1                                                            
         MFLD  TRANS2,                                                 +        
               LTH=1                                                            
         MFLD  TRANS3,                                                 +        
               LTH=1                                                            
         MFLD  TRANS4,                                                 +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDLOPIN,                                                +        
               LTH=8                                                            
         MFLD  IDLOPUT,                                                +        
               LTH=8                                                            
         MFLD  IDLEVIN,                                                +        
               LTH=5                                                            
         MFLD  IDLEVUT,                                                +        
               LTH=5                                                            
         MFLD  IDKOLIN,                                                +        
               LTH=9                                                            
         MFLD  IDKOLUT,                                                +        
               LTH=9                                                            
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  IDRADE,                                                 +        
               LTH=4                                                            
         MFLD  IDRADN,                                                 +        
               LTH=4                                                            
         MFLD  IDART,                                                  +        
               LTH=8                                                            
         MFLD  KVAVIS,                                                 +        
               LTH=6                                                            
         MFLD  BEART,                                                  +        
               LTH=25                                                           
         MFLD  CMD1,                                                   +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RAD1,                                                   +        
               LTH=4                                                            
         MFLD  LEVNR1,                                                 +        
               LTH=5                                                            
         MFLD  KOLLI1,                                                 +        
               LTH=9                                                            
         MFLD  ANT1,                                                   +        
               LTH=6                                                            
         MFLD  PLAC1,                                                  +        
               LTH=4                                                            
         MFLD  PRI1,                                                   +        
               LTH=1                                                            
         MFLD  INFO1,                                                  +        
               LTH=3                                                            
         MFLD  CMD2,                                                   +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RAD2,                                                   +        
               LTH=4                                                            
         MFLD  LEVNR2,                                                 +        
               LTH=5                                                            
         MFLD  KOLLI2,                                                 +        
               LTH=9                                                            
         MFLD  ANT2,                                                   +        
               LTH=6                                                            
         MFLD  PLAC2,                                                  +        
               LTH=4                                                            
         MFLD  PRI2,                                                   +        
               LTH=1                                                            
         MFLD  INFO2,                                                  +        
               LTH=3                                                            
         MFLD  CMD3,                                                   +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RAD3,                                                   +        
               LTH=4                                                            
         MFLD  LEVNR3,                                                 +        
               LTH=5                                                            
         MFLD  KOLLI3,                                                 +        
               LTH=9                                                            
         MFLD  ANT3,                                                   +        
               LTH=6                                                            
         MFLD  PLAC3,                                                  +        
               LTH=4                                                            
         MFLD  PRI3,                                                   +        
               LTH=1                                                            
         MFLD  INFO3,                                                  +        
               LTH=3                                                            
         MFLD  CMD4,                                                   +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RAD4,                                                   +        
               LTH=4                                                            
         MFLD  LEVNR4,                                                 +        
               LTH=5                                                            
         MFLD  KOLLI4,                                                 +        
               LTH=9                                                            
         MFLD  ANT4,                                                   +        
               LTH=6                                                            
         MFLD  PLAC4,                                                  +        
               LTH=4                                                            
         MFLD  PRI4,                                                   +        
               LTH=1                                                            
         MFLD  INFO4,                                                  +        
               LTH=3                                                            
         MFLD  CMD5,                                                   +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RAD5,                                                   +        
               LTH=4                                                            
         MFLD  LEVNR5,                                                 +        
               LTH=5                                                            
         MFLD  KOLLI5,                                                 +        
               LTH=9                                                            
         MFLD  ANT5,                                                   +        
               LTH=6                                                            
         MFLD  PLAC5,                                                  +        
               LTH=4                                                            
         MFLD  PRI5,                                                   +        
               LTH=1                                                            
         MFLD  INFO5,                                                  +        
               LTH=3                                                            
         MFLD  CMD6,                                                   +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RAD6,                                                   +        
               LTH=4                                                            
         MFLD  LEVNR6,                                                 +        
               LTH=5                                                            
         MFLD  KOLLI6,                                                 +        
               LTH=9                                                            
         MFLD  ANT6,                                                   +        
               LTH=6                                                            
         MFLD  PLAC6,                                                  +        
               LTH=4                                                            
         MFLD  PRI6,                                                   +        
               LTH=1                                                            
         MFLD  INFO6,                                                  +        
               LTH=3                                                            
         MFLD  CMD7,                                                   +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RAD7,                                                   +        
               LTH=4                                                            
         MFLD  LEVNR7,                                                 +        
               LTH=5                                                            
         MFLD  KOLLI7,                                                 +        
               LTH=9                                                            
         MFLD  ANT7,                                                   +        
               LTH=6                                                            
         MFLD  PLA7,                                                   +        
               LTH=4                                                            
         MFLD  PRI7,                                                   +        
               LTH=1                                                            
         MFLD  INFO7,                                                  +        
               LTH=3                                                            
         MFLD  CMD8,                                                   +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RAD8,                                                   +        
               LTH=4                                                            
         MFLD  LEVNR8,                                                 +        
               LTH=5                                                            
         MFLD  KOLLI8,                                                 +        
               LTH=9                                                            
         MFLD  ANT8,                                                   +        
               LTH=6                                                            
         MFLD  PLAC8,                                                  +        
               LTH=4                                                            
         MFLD  PRI8,                                                   +        
               LTH=1                                                            
         MFLD  INFO8,                                                  +        
               LTH=3                                                            
         MFLD  CMD9,                                                   +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RAD9,                                                   +        
               LTH=4                                                            
         MFLD  LEVNR9,                                                 +        
               LTH=5                                                            
         MFLD  KOLLI9,                                                 +        
               LTH=9                                                            
         MFLD  ANT9,                                                   +        
               LTH=6                                                            
         MFLD  PLAC9,                                                  +        
               LTH=4                                                            
         MFLD  PRI9,                                                   +        
               LTH=1                                                            
         MFLD  INFO9,                                                  +        
               LTH=3                                                            
         MFLD  CMD10,                                                  +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RAD10,                                                  +        
               LTH=4                                                            
         MFLD  LEVNR10,                                                +        
               LTH=5                                                            
         MFLD  KOLLI10,                                                +        
               LTH=9                                                            
         MFLD  ANT10,                                                  +        
               LTH=6                                                            
         MFLD  PLAC10,                                                 +        
               LTH=4                                                            
         MFLD  PRI10,                                                  +        
               LTH=1                                                            
         MFLD  INFO10,                                                 +        
               LTH=3                                                            
         MFLD  CMD11,                                                  +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RAD11,                                                  +        
               LTH=4                                                            
         MFLD  LEVNR11,                                                +        
               LTH=5                                                            
         MFLD  KOLLI11,                                                +        
               LTH=9                                                            
         MFLD  ANT11,                                                  +        
               LTH=6                                                            
         MFLD  PLAC11,                                                 +        
               LTH=4                                                            
         MFLD  PRI11,                                                  +        
               LTH=1                                                            
         MFLD  INFO11,                                                 +        
               LTH=3                                                            
         MFLD  CMD12,                                                  +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RAD12,                                                  +        
               LTH=4                                                            
         MFLD  LEVNR12,                                                +        
               LTH=5                                                            
         MFLD  KOLLI12,                                                +        
               LTH=9                                                            
         MFLD  ANT12,                                                  +        
               LTH=6                                                            
         MFLD  PLAC12,                                                 +        
               LTH=4                                                            
         MFLD  PRI12,                                                  +        
               LTH=1                                                            
         MFLD  INFO12,                                                 +        
               LTH=3                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=61                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W6I148N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W6N148),                                           +        
               OPT=2,                                                  +        
               NXT=W6O148N1                                                     
MID      LPAGE SOR=(W6N148)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  TRANS1,                                                 +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  TRANS2,                                                 +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  TRANS3,                                                 +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  TRANS4,                                                 +        
               LTH=1,                                                  +        
               FILL=X'F8'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '61481',                                                +        
               LTH=5                                                            
         MFLD  (IDLOPIN,                                               +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDLOPUT,                                                +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLEVIN,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  IDLEVUT,                                                +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDKOLIN,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDKOLUT,                                                +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  IDRADE,                                                 +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDRADN,                                                 +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (CMD1,                                                  +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (CMD2,                                                  +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (CMD3,                                                  +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (CMD4,                                                  +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (CMD5,                                                  +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (CMD6,                                                  +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (CMD7,                                                  +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (CMD8,                                                  +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (CMD9,                                                  +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (CMD10,                                                 +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (CMD11,                                                 +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (CMD12,                                                 +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  RAD1,                                                   +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  RAD2,                                                   +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  RAD3,                                                   +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  RAD4,                                                   +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  RAD5,                                                   +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  RAD6,                                                   +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  RAD7,                                                   +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  RAD8,                                                   +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  RAD9,                                                   +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  RAD10,                                                  +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  RAD11,                                                  +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  RAD12,                                                  +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
