***********************************************************************         
* CREATED BY V028439   ON 08/03/19  AT 10:08                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'DEFINIERA PLACERINGAR           '                               
W6N106   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W6T106U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W6T101  ',                                          +        
               14='W6T102  ',                                          +        
               15='W6T103  ',                                          +        
               16='W6T104  ',                                          +        
               17='W6T105  ',                                          +        
               18='W6T106  ',                                          +        
               19='W6T107  ',                                          +        
               20='W6T108  ',                                          +        
               21='W6T109  ',                                          +        
               22='WHELP   ',                                          +        
               23='W6T106V ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W6N106   DPAGE CURSOR=((2,7))                                                   
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'DEFINE LOCATION',                                      +        
               POS=(1,12),LTH=15,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,36),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Loc',                                                  +        
               POS=(2,2),LTH=3,                                        +        
               ATTR=(PROT)                                                      
DGIA0003 DFLD  POS=(2,7),LTH=4,                                        +        
               ATTR=(NOPROT)                                                    
         DFLD  'Type',                                                 +        
               POS=(2,13),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0015 DFLD  POS=(2,18),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'DC',                                                   +        
               POS=(2,24),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDDCIN   DFLD  POS=(2,28),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0004 DFLD  POS=(3,7),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0016 DFLD  POS=(3,18),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDCUT   DFLD  POS=(3,28),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Group',                                                +        
               POS=(5,2),LTH=5,                                        +        
               ATTR=(PROT)                                                      
DGIA0005 DFLD  POS=(5,15),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0006 DFLD  POS=(5,21),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Status',                                               +        
               POS=(5,40),LTH=6,                                       +        
               ATTR=(PROT)                                                      
DGIA0022 DFLD  POS=(5,47),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0023 DFLD  POS=(5,52),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Buffer loc',                                           +        
               POS=(7,2),LTH=10,                                       +        
               ATTR=(PROT)                                                      
DGIA0024 DFLD  POS=(7,15),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0025 DFLD  POS=(7,21),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Unloading loc',                                        +        
               POS=(7,40),LTH=13,                                      +        
               ATTR=(PROT)                                                      
DGIA0026 DFLD  POS=(7,55),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0027 DFLD  POS=(7,60),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'R32-treatment',                                        +        
               POS=(8,2),LTH=13,                                       +        
               ATTR=(PROT)                                                      
DGIA0017 DFLD  POS=(8,18),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0031 DFLD  POS=(8,21),LTH=17,                                      +        
               ATTR=(PROT)                                                      
DGIA0018 DFLD  POS=(8,45),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0032 DFLD  POS=(8,48),LTH=17,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Loc from to',                                          +        
               POS=(9,2),LTH=11,                                       +        
               ATTR=(PROT)                                                      
DGIA0021 DFLD  POS=(9,16),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DGIA0029 DFLD  POS=(9,22),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0028 DFLD  POS=(9,28),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0030 DFLD  POS=(9,34),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Aisle from to',                                        +        
               POS=(9,40),LTH=13,                                      +        
               ATTR=(ALPHA,PROT)                                                
DGIA0011 DFLD  POS=(9,54),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0013 DFLD  POS=(9,57),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0012 DFLD  POS=(9,60),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0014 DFLD  POS=(9,63),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Unloading report (y/n)',                               +        
               POS=(10,2),LTH=22,                                      +        
               ATTR=(PROT)                                                      
DGIA0007 DFLD  POS=(10,25),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0008 DFLD  POS=(10,27),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'CD-area (y/n)',                                        +        
               POS=(10,40),LTH=13,                                     +        
               ATTR=(PROT)                                                      
FLCDOMRI DFLD  POS=(10,54),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLCDOMRU DFLD  POS=(10,56),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Lead Time:',                                           +        
               POS=(11,2),LTH=10,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Norm',                                                 +        
               POS=(11,17),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0043 DFLD  POS=(11,22),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0046 DFLD  POS=(11,27),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  '(hhmm)',                                               +        
               POS=(11,32),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Prio',                                                 +        
               POS=(11,44),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0047 DFLD  POS=(11,49),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0050 DFLD  POS=(11,54),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  '(hhmm)',                                               +        
               POS=(11,59),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Lead Time: Norm-Tot',                                  +        
               POS=(12,2),LTH=19,                                      +        
               ATTR=(PROT)                                                      
DGIA0044 DFLD  POS=(12,22),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0045 DFLD  POS=(12,27),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  '(hhmm)  Prio-Tot',                                     +        
               POS=(12,32),LTH=16,                                     +        
               ATTR=(NUM,PROT)                                                  
DGIA0048 DFLD  POS=(12,49),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0049 DFLD  POS=(12,54),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  '(hhmm)',                                               +        
               POS=(12,59),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Lead Time: Norm-Tot-CDC',                              +        
               POS=(13,2),LTH=23,                                      +        
               ATTR=(PROT)                                                      
DGIA0051 DFLD  POS=(13,26),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0052 DFLD  POS=(13,31),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  '(hhmm)  Prio-Tot-CDC',                                 +        
               POS=(13,36),LTH=20,                                     +        
               ATTR=(NUM,PROT)                                                  
DGIA0053 DFLD  POS=(13,57),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0054 DFLD  POS=(13,62),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  '(hhmm)',                                               +        
               POS=(13,67),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Lead Time: Norm-Tot-SVS',                              +        
               POS=(14,2),LTH=23,                                      +        
               ATTR=(PROT)                                                      
DGIA0055 DFLD  POS=(14,26),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0056 DFLD  POS=(14,31),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  '(hhmm)  Prio-Tot-SVS',                                 +        
               POS=(14,36),LTH=20,                                     +        
               ATTR=(NUM,PROT)                                                  
DGIA0057 DFLD  POS=(14,57),LTH=4,                                      +        
               ATTR=(NOPROT)                                                    
DGIA0058 DFLD  POS=(14,62),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  '(hhmm)',                                               +        
               POS=(14,67),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Resp',                                                 +        
               POS=(15,2),LTH=04,                                      +        
               ATTR=(PROT)                                                      
DGIA0000 DFLD  POS=(15,12),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0002 DFLD  POS=(15,16),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0001 DFLD  POS=(15,21),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Supplier',                                             +        
               POS=(15,40),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DGIA0039 DFLD  POS=(15,51),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0040 DFLD  POS=(15,57),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Pack engg',                                            +        
               POS=(16,2),LTH=09,                                      +        
               ATTR=(PROT)                                                      
DGIA0033 DFLD  POS=(16,12),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0035 DFLD  POS=(16,16),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0034 DFLD  POS=(16,21),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Printer',                                              +        
               POS=(16,40),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0041 DFLD  POS=(16,51),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0042 DFLD  POS=(16,57),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Qual engg',                                            +        
               POS=(17,2),LTH=09,                                      +        
               ATTR=(PROT)                                                      
DGIA0036 DFLD  POS=(17,12),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0038 DFLD  POS=(17,16),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0037 DFLD  POS=(17,21),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Dep-Day',                                              +        
               POS=(17,27),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
AVDDAGIN DFLD  POS=(17,35),LTH=5,                                      +        
               ATTR=(NOPROT)                                                    
AVDGRDIN DFLD  POS=(17,41),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
AVDDAGUT DFLD  POS=(17,44),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
AVDGRDUT DFLD  POS=(17,50),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Dep-Night',                                            +        
               POS=(17,53),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
AVDKVAIN DFLD  POS=(17,63),LTH=5,                                      +        
               ATTR=(NOPROT)                                                    
AVDGRKIN DFLD  POS=(17,69),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
AVDKVAUT DFLD  POS=(17,72),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
AVDGRKUT DFLD  POS=(17,78),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Approve primary/special control (y/n)',                +        
               POS=(18,2),LTH=37,                                      +        
               ATTR=(PROT)                                                      
FLKNTRGK DFLD  POS=(18,42),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLKNTRG1 DFLD  POS=(18,44),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Exception',                                            +        
               POS=(18,48),LTH=9,                                      +        
               ATTR=(PROT)                                                      
FLEXCP   DFLD  POS=(18,58),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLEXCP1  DFLD  POS=(18,60),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Reduced control    (y/n)',                             +        
               POS=(19,2),LTH=24,                                      +        
               ATTR=(PROT)                                                      
DGIA0019 DFLD  POS=(19,27),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0020 DFLD  POS=(19,29),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Delete  (y)',                                          +        
               POS=(19,48),LTH=11,                                     +        
               ATTR=(PROT)                                                      
DGIA0009 DFLD  POS=(19,60),LTH=1,                                      +        
               ATTR=(PROT)                                                      
DGIA0010 DFLD  POS=(19,62),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  '13 Adm trolley  14 Move cases   15 Repl label   16 Reg +        
               pick VOR 17 Def styr',                                  +        
               POS=(21,2),LTH=75,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 Def location 19 Inq location 20 Inq pre-t ad 21 RR i+        
               nfo',                                                   +        
               POS=(22,2),LTH=58,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W6I106N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W6N106),                                           +        
               OPT=2,                                                  +        
               NXT=W6O106N1                                                     
MID      LPAGE SOR=(W6N106)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS1,                                              +        
               '6'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS2,                                              +        
               '1'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  (IDTRANS3,                                              +        
               '0'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (IDTRANS4,                                              +        
               '6'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  ' ',                                                    +        
               LTH=2                                                            
         MFLD  '61062',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0003,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (DGIA0004,                                              +        
               '    '),                                                +        
               LTH=4                                                            
         MFLD  (DGIA0015,                                              +        
               '+++'),                                                 +        
               LTH=3                                                            
         MFLD  (DGIA0016,                                              +        
               '   '),                                                 +        
               LTH=3                                                            
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDCUT,                                                 +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0005,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (DGIA0022,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (DGIA0024,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (DGIA0026,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (DGIA0017,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (DGIA0031,                                              +        
               '+++++++++++++++++'),                                   +        
               LTH=17                                                           
         MFLD  (DGIA0021,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0029,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0011,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0013,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0007,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (FLCDOMRI,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (DGIA0000,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0039,                                              +        
               '+++++'),                                               +        
               LTH=5                                                            
         MFLD  (DGIA0033,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0041,                                              +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (DGIA0036,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (AVDDAGIN,                                              +        
               '+++++'),                                               +        
               LTH=5                                                            
         MFLD  (AVDGRDIN,                                              +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  (AVDKVAIN,                                              +        
               '+++++'),                                               +        
               LTH=5                                                            
         MFLD  (AVDGRKIN,                                              +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  (DGIA0019,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (FLKNTRGK,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (FLEXCP,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (DGIA0043,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0044,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0047,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0048,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0051,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0053,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0055,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0057,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0009,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W6O106N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6N106,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I106N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W6N106                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DGIA0003,                                               +        
               LTH=4                                                            
         MFLD  DGIA0004,                                               +        
               LTH=4                                                            
         MFLD  DGIA0015,                                               +        
               LTH=3                                                            
         MFLD  DGIA0016,                                               +        
               LTH=3                                                            
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  DGIA0005,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0006,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0022,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0023,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0024,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0025,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0026,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0027,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0017,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0031,                                               +        
               LTH=19,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0018,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0032,                                               +        
               LTH=19,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0021,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0029,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0028,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0030,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0011,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0013,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0012,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0014,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0007,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0008,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLCDOMRI,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLCDOMRU,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0000,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0002,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0001,                                               +        
               LTH=5                                                            
         MFLD  DGIA0039,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0040,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0033,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0035,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0034,                                               +        
               LTH=5                                                            
         MFLD  DGIA0041,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0042,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0036,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0038,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0037,                                               +        
               LTH=5                                                            
         MFLD  AVDDAGIN,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVDGRDIN,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVDDAGUT,                                               +        
               LTH=5                                                            
         MFLD  AVDGRDUT,                                               +        
               LTH=2                                                            
         MFLD  AVDKVAIN,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVDGRKIN,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  AVDKVAUT,                                               +        
               LTH=5                                                            
         MFLD  AVDGRKUT,                                               +        
               LTH=2                                                            
         MFLD  DGIA0019,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0020,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLKNTRGK,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLKNTRG1,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0009,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0010,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLEXCP,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLEXCP1,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0043,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0046,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0044,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0045,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0047,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0050,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0048,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0049,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0051,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0052,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0053,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0054,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0055,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0056,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0057,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0058,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=61                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  FSYSMSG,                                                +        
               LTH=79                                                           
         MSGEND                                                                 
         END                                                                    
