***********************************************************************         
* CREATED BY VX70375   ON 10/02/05  AT 15:53                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'Goods for dir.del. via DC11     '                               
W6N175   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W6T175 7',                                           +        
               8='W6T175 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W6T175U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,11)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'GOODS FOR DIRECT DEL VIA CDC',                         +        
               POS=(1,11),LTH=28,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Supplier',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(ALPHA,PROT)                                                
LEVNRIN  DFLD  POS=(2,11),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Supplier date',                                        +        
               POS=(2,17),LTH=13,                                      +        
               ATTR=(NUM,PROT)                                                  
LEVDATIN DFLD  POS=(2,31),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Supplier reference',                                   +        
               POS=(2,38),LTH=18,                                      +        
               ATTR=(NUM,PROT)                                                  
LEVREFIN DFLD  POS=(2,57),LTH=10,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Distr',                                                +        
               POS=(2,68),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
DISTIN   DFLD  POS=(2,74),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
LEVNRUT  DFLD  POS=(3,11),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
LEVDATUT DFLD  POS=(3,31),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
LEVREFUT DFLD  POS=(3,57),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
DISTUT   DFLD  POS=(3,74),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'C Suppl time   Suppl ref  Receive time Dist Cust   Ordn+        
               o Case  Weight   Volume',                               +        
               POS=(5,2),LTH=78,                                       +        
               ATTR=(PROT)                                                      
CMD1     DFLD  POS=(6,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
LEVDAT1  DFLD  POS=(6,4),LTH=6,                                        +        
               ATTR=(NUM,PROT)                                                  
LEVTID1  DFLD  POS=(6,11),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
LEVREF1  DFLD  POS=(6,17),LTH=10,                                      +        
               ATTR=(NUM,PROT)                                                  
MOTDAT1  DFLD  POS=(6,28),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
MOTTID1  DFLD  POS=(6,35),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
DIST1    DFLD  POS=(6,41),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KUND1    DFLD  POS=(6,46),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
ORDNR1   DFLD  POS=(6,53),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
KOLLI1   DFLD  POS=(6,59),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
VIKT1    DFLD  POS=(6,65),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
VOL1     DFLD  POS=(6,74),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
CMD2     DFLD  POS=(7,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
LEVDAT2  DFLD  POS=(7,4),LTH=6,                                        +        
               ATTR=(NUM,PROT)                                                  
LEVTID2  DFLD  POS=(7,11),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
LEVREF2  DFLD  POS=(7,17),LTH=10,                                      +        
               ATTR=(NUM,PROT)                                                  
MOTDAT2  DFLD  POS=(7,28),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
MOTTID2  DFLD  POS=(7,35),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
DIST2    DFLD  POS=(7,41),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KUND2    DFLD  POS=(7,46),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
ORDNR2   DFLD  POS=(7,53),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
KOLLI2   DFLD  POS=(7,59),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
VIKT2    DFLD  POS=(7,65),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
VOL2     DFLD  POS=(7,74),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
CMD3     DFLD  POS=(8,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
LEVDAT3  DFLD  POS=(8,4),LTH=6,                                        +        
               ATTR=(NUM,PROT)                                                  
LEVTID3  DFLD  POS=(8,11),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
LEVREF3  DFLD  POS=(8,17),LTH=10,                                      +        
               ATTR=(NUM,PROT)                                                  
MOTDAT3  DFLD  POS=(8,28),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
MOTTID3  DFLD  POS=(8,35),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
DIST3    DFLD  POS=(8,41),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KUND3    DFLD  POS=(8,46),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
ORDNR3   DFLD  POS=(8,53),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
KOLLI3   DFLD  POS=(8,59),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
VIKT3    DFLD  POS=(8,65),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
VOL3     DFLD  POS=(8,74),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
CMD4     DFLD  POS=(9,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
LEVDAT4  DFLD  POS=(9,4),LTH=6,                                        +        
               ATTR=(NUM,PROT)                                                  
LEVTID4  DFLD  POS=(9,11),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
LEVREF4  DFLD  POS=(9,17),LTH=10,                                      +        
               ATTR=(NUM,PROT)                                                  
MOTDAT4  DFLD  POS=(9,28),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
MOTTID4  DFLD  POS=(9,35),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
DIST4    DFLD  POS=(9,41),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KUND4    DFLD  POS=(9,46),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
ORDNR4   DFLD  POS=(9,53),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
KOLLI4   DFLD  POS=(9,59),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
VIKT4    DFLD  POS=(9,65),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
VOL4     DFLD  POS=(9,74),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
CMD5     DFLD  POS=(10,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
LEVDAT5  DFLD  POS=(10,4),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
LEVTID5  DFLD  POS=(10,11),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
LEVREF5  DFLD  POS=(10,17),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
MOTDAT5  DFLD  POS=(10,28),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
MOTTID5  DFLD  POS=(10,35),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DIST5    DFLD  POS=(10,41),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KUND5    DFLD  POS=(10,46),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
ORDNR5   DFLD  POS=(10,53),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOLLI5   DFLD  POS=(10,59),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
VIKT5    DFLD  POS=(10,65),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
VOL5     DFLD  POS=(10,74),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
CMD6     DFLD  POS=(11,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
LEVDAT6  DFLD  POS=(11,4),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
LEVTID6  DFLD  POS=(11,11),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
LEVREF6  DFLD  POS=(11,17),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
MOTDAT6  DFLD  POS=(11,28),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
MOTTID6  DFLD  POS=(11,35),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DIST6    DFLD  POS=(11,41),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KUND6    DFLD  POS=(11,46),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
ORDNR6   DFLD  POS=(11,53),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOLLI6   DFLD  POS=(11,59),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
VIKT6    DFLD  POS=(11,65),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
VOL6     DFLD  POS=(11,74),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
CMD7     DFLD  POS=(12,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
LEVDAT7  DFLD  POS=(12,4),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
LEVTID7  DFLD  POS=(12,11),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
LEVREF7  DFLD  POS=(12,17),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
MOTDAT7  DFLD  POS=(12,28),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
MOTTID7  DFLD  POS=(12,35),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DIST7    DFLD  POS=(12,41),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KUND7    DFLD  POS=(12,46),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
ORDNR7   DFLD  POS=(12,53),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOLLI7   DFLD  POS=(12,59),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
VIKT7    DFLD  POS=(12,65),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
VOL7     DFLD  POS=(12,74),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
CMD8     DFLD  POS=(13,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
LEVDAT8  DFLD  POS=(13,4),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
LEVTID8  DFLD  POS=(13,11),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
LEVREF8  DFLD  POS=(13,17),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
MOTDAT8  DFLD  POS=(13,28),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
MOTTID8  DFLD  POS=(13,35),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DIST8    DFLD  POS=(13,41),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KUND8    DFLD  POS=(13,46),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
ORDNR8   DFLD  POS=(13,53),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOLLI8   DFLD  POS=(13,59),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
VIKT8    DFLD  POS=(13,65),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
VOL8     DFLD  POS=(13,74),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
CMD9     DFLD  POS=(14,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
LEVDAT9  DFLD  POS=(14,4),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
LEVTID9  DFLD  POS=(14,11),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
LEVREF9  DFLD  POS=(14,17),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
MOTDAT9  DFLD  POS=(14,28),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
MOTTID9  DFLD  POS=(14,35),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DIST9    DFLD  POS=(14,41),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KUND9    DFLD  POS=(14,46),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
ORDNR9   DFLD  POS=(14,53),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOLLI9   DFLD  POS=(14,59),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
VIKT9    DFLD  POS=(14,65),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
VOL9     DFLD  POS=(14,74),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
CMD10    DFLD  POS=(15,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
LEVDAT10 DFLD  POS=(15,4),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
LEVTID10 DFLD  POS=(15,11),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
LEVREF10 DFLD  POS=(15,17),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
MOTDAT10 DFLD  POS=(15,28),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
MOTTID10 DFLD  POS=(15,35),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DIST10   DFLD  POS=(15,41),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KUND10   DFLD  POS=(15,46),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
ORDNR10  DFLD  POS=(15,53),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOLLI10  DFLD  POS=(15,59),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
VIKT10   DFLD  POS=(15,65),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
VOL10    DFLD  POS=(15,74),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
CMD11    DFLD  POS=(16,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
LEVDAT11 DFLD  POS=(16,4),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
LEVTID11 DFLD  POS=(16,11),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
LEVREF11 DFLD  POS=(16,17),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
MOTDAT11 DFLD  POS=(16,28),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
MOTTID11 DFLD  POS=(16,35),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DIST11   DFLD  POS=(16,41),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KUND11   DFLD  POS=(16,46),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
ORDNR11  DFLD  POS=(16,53),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOLLI11  DFLD  POS=(16,59),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
VIKT11   DFLD  POS=(16,65),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
VOL11    DFLD  POS=(16,74),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
CMD12    DFLD  POS=(17,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
LEVDAT12 DFLD  POS=(17,4),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
LEVTID12 DFLD  POS=(17,11),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
LEVREF12 DFLD  POS=(17,17),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
MOTDAT12 DFLD  POS=(17,28),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
MOTTID12 DFLD  POS=(17,35),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DIST12   DFLD  POS=(17,41),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KUND12   DFLD  POS=(17,46),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
ORDNR12  DFLD  POS=(17,53),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOLLI12  DFLD  POS=(17,59),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
VIKT12   DFLD  POS=(17,65),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
VOL12    DFLD  POS=(17,74),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
CMD13    DFLD  POS=(18,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
LEVDAT13 DFLD  POS=(18,4),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
LEVTID13 DFLD  POS=(18,11),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
LEVREF13 DFLD  POS=(18,17),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
MOTDAT13 DFLD  POS=(18,28),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
MOTTID13 DFLD  POS=(18,35),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DIST13   DFLD  POS=(18,41),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KUND13   DFLD  POS=(18,46),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
ORDNR13  DFLD  POS=(18,53),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOLLI13  DFLD  POS=(18,59),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
VIKT13   DFLD  POS=(18,65),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
VOL13    DFLD  POS=(18,74),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
CMD14    DFLD  POS=(19,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
LEVDAT14 DFLD  POS=(19,4),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
LEVTID14 DFLD  POS=(19,11),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
LEVREF14 DFLD  POS=(19,17),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
MOTDAT14 DFLD  POS=(19,28),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
MOTTID14 DFLD  POS=(19,35),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DIST14   DFLD  POS=(19,41),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KUND14   DFLD  POS=(19,46),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
ORDNR14  DFLD  POS=(19,53),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOLLI14  DFLD  POS=(19,59),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
VIKT14   DFLD  POS=(19,65),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
VOL14    DFLD  POS=(19,74),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
CMD15    DFLD  POS=(20,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
LEVDAT15 DFLD  POS=(20,4),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
LEVTID15 DFLD  POS=(20,11),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
LEVREF15 DFLD  POS=(20,17),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
MOTDAT15 DFLD  POS=(20,28),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
MOTTID15 DFLD  POS=(20,35),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
DIST15   DFLD  POS=(20,41),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KUND15   DFLD  POS=(20,46),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
ORDNR15  DFLD  POS=(20,53),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
KOLLI15  DFLD  POS=(20,59),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
VIKT15   DFLD  POS=(20,65),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
VOL15    DFLD  POS=(20,74),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'F7=First  F8=Next  F10=WHELP  F11=Update',             +        
               POS=(22,2),LTH=40,                                      +        
               ATTR=(PROT)                                                      
FLD2306  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,58),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
DATE     DFLD  POS=(23,63),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W6O175N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6N175,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I175N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  LEVNRIN,                                                +        
               LTH=2                                                            
         MFLD  LEVNRUT,                                                +        
               LTH=5                                                            
         MFLD  LEVDATIN,                                               +        
               LTH=2                                                            
         MFLD  LEVDATUT,                                               +        
               LTH=6                                                            
         MFLD  LEVREFIN,                                               +        
               LTH=2                                                            
         MFLD  LEVREFUT,                                               +        
               LTH=10                                                           
         MFLD  DISTIN,                                                 +        
               LTH=2                                                            
         MFLD  DISTUT,                                                 +        
               LTH=4                                                            
         MFLD  CMD1,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVDAT1,                                                +        
               LTH=6                                                            
         MFLD  LEVTID1,                                                +        
               LTH=5                                                            
         MFLD  LEVREF1,                                                +        
               LTH=10                                                           
         MFLD  MOTDAT1,                                                +        
               LTH=6                                                            
         MFLD  MOTTID1,                                                +        
               LTH=5                                                            
         MFLD  DIST1,                                                  +        
               LTH=4                                                            
         MFLD  KUND1,                                                  +        
               LTH=6                                                            
         MFLD  ORDNR1,                                                 +        
               LTH=5                                                            
         MFLD  KOLLI1,                                                 +        
               LTH=5                                                            
         MFLD  VIKT1,                                                  +        
               LTH=8                                                            
         MFLD  VOL1,                                                   +        
               LTH=7                                                            
         MFLD  CMD2,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVDAT2,                                                +        
               LTH=6                                                            
         MFLD  LEVTID2,                                                +        
               LTH=5                                                            
         MFLD  LEVREF2,                                                +        
               LTH=10                                                           
         MFLD  MOTDAT2,                                                +        
               LTH=6                                                            
         MFLD  MOTTID2,                                                +        
               LTH=5                                                            
         MFLD  DIST2,                                                  +        
               LTH=4                                                            
         MFLD  KUND2,                                                  +        
               LTH=6                                                            
         MFLD  ORDNR2,                                                 +        
               LTH=5                                                            
         MFLD  KOLLI2,                                                 +        
               LTH=5                                                            
         MFLD  VIKT2,                                                  +        
               LTH=8                                                            
         MFLD  VOL2,                                                   +        
               LTH=7                                                            
         MFLD  CMD3,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVDAT3,                                                +        
               LTH=6                                                            
         MFLD  LEVTID3,                                                +        
               LTH=5                                                            
         MFLD  LEVREF3,                                                +        
               LTH=10                                                           
         MFLD  MOTDAT3,                                                +        
               LTH=6                                                            
         MFLD  MOTTID3,                                                +        
               LTH=5                                                            
         MFLD  DIST3,                                                  +        
               LTH=4                                                            
         MFLD  KUND3,                                                  +        
               LTH=6                                                            
         MFLD  ORDNR3,                                                 +        
               LTH=5                                                            
         MFLD  KOLLI3,                                                 +        
               LTH=5                                                            
         MFLD  VIKT3,                                                  +        
               LTH=8                                                            
         MFLD  VOL3,                                                   +        
               LTH=7                                                            
         MFLD  CMD4,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVDAT4,                                                +        
               LTH=6                                                            
         MFLD  LEVTID4,                                                +        
               LTH=5                                                            
         MFLD  LEVREF4,                                                +        
               LTH=10                                                           
         MFLD  MOTDAT4,                                                +        
               LTH=6                                                            
         MFLD  MOTTID4,                                                +        
               LTH=5                                                            
         MFLD  DIST4,                                                  +        
               LTH=4                                                            
         MFLD  KUND4,                                                  +        
               LTH=6                                                            
         MFLD  ORDNR4,                                                 +        
               LTH=5                                                            
         MFLD  KOLLI4,                                                 +        
               LTH=5                                                            
         MFLD  VIKT4,                                                  +        
               LTH=8                                                            
         MFLD  VOL4,                                                   +        
               LTH=7                                                            
         MFLD  CMD5,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVDAT5,                                                +        
               LTH=6                                                            
         MFLD  LEVTID5,                                                +        
               LTH=5                                                            
         MFLD  LEVREF5,                                                +        
               LTH=10                                                           
         MFLD  MOTDAT5,                                                +        
               LTH=6                                                            
         MFLD  MOTTID5,                                                +        
               LTH=5                                                            
         MFLD  DIST5,                                                  +        
               LTH=4                                                            
         MFLD  KUND5,                                                  +        
               LTH=6                                                            
         MFLD  ORDNR5,                                                 +        
               LTH=5                                                            
         MFLD  KOLLI5,                                                 +        
               LTH=5                                                            
         MFLD  VIKT5,                                                  +        
               LTH=8                                                            
         MFLD  VOL5,                                                   +        
               LTH=7                                                            
         MFLD  CMD6,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVDAT6,                                                +        
               LTH=6                                                            
         MFLD  LEVTID6,                                                +        
               LTH=5                                                            
         MFLD  LEVREF6,                                                +        
               LTH=10                                                           
         MFLD  MOTDAT6,                                                +        
               LTH=6                                                            
         MFLD  MOTTID6,                                                +        
               LTH=5                                                            
         MFLD  DIST6,                                                  +        
               LTH=4                                                            
         MFLD  KUND6,                                                  +        
               LTH=6                                                            
         MFLD  ORDNR6,                                                 +        
               LTH=5                                                            
         MFLD  KOLLI6,                                                 +        
               LTH=5                                                            
         MFLD  VIKT6,                                                  +        
               LTH=8                                                            
         MFLD  VOL6,                                                   +        
               LTH=7                                                            
         MFLD  CMD7,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVDAT7,                                                +        
               LTH=6                                                            
         MFLD  LEVTID7,                                                +        
               LTH=5                                                            
         MFLD  LEVREF7,                                                +        
               LTH=10                                                           
         MFLD  MOTDAT7,                                                +        
               LTH=6                                                            
         MFLD  MOTTID7,                                                +        
               LTH=5                                                            
         MFLD  DIST7,                                                  +        
               LTH=4                                                            
         MFLD  KUND7,                                                  +        
               LTH=6                                                            
         MFLD  ORDNR7,                                                 +        
               LTH=5                                                            
         MFLD  KOLLI7,                                                 +        
               LTH=5                                                            
         MFLD  VIKT7,                                                  +        
               LTH=8                                                            
         MFLD  VOL7,                                                   +        
               LTH=7                                                            
         MFLD  CMD8,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVDAT8,                                                +        
               LTH=6                                                            
         MFLD  LEVTID8,                                                +        
               LTH=5                                                            
         MFLD  LEVREF8,                                                +        
               LTH=10                                                           
         MFLD  MOTDAT8,                                                +        
               LTH=6                                                            
         MFLD  MOTTID8,                                                +        
               LTH=5                                                            
         MFLD  DIST8,                                                  +        
               LTH=4                                                            
         MFLD  KUND8,                                                  +        
               LTH=6                                                            
         MFLD  ORDNR8,                                                 +        
               LTH=5                                                            
         MFLD  KOLLI8,                                                 +        
               LTH=5                                                            
         MFLD  VIKT8,                                                  +        
               LTH=8                                                            
         MFLD  VOL8,                                                   +        
               LTH=7                                                            
         MFLD  CMD9,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVDAT9,                                                +        
               LTH=6                                                            
         MFLD  LEVTID9,                                                +        
               LTH=5                                                            
         MFLD  LEVREF9,                                                +        
               LTH=10                                                           
         MFLD  MOTDAT9,                                                +        
               LTH=6                                                            
         MFLD  MOTTID9,                                                +        
               LTH=5                                                            
         MFLD  DIST9,                                                  +        
               LTH=4                                                            
         MFLD  KUND9,                                                  +        
               LTH=6                                                            
         MFLD  ORDNR9,                                                 +        
               LTH=5                                                            
         MFLD  KOLLI9,                                                 +        
               LTH=5                                                            
         MFLD  VIKT9,                                                  +        
               LTH=8                                                            
         MFLD  VOL9,                                                   +        
               LTH=7                                                            
         MFLD  CMD10,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVDAT10,                                               +        
               LTH=6                                                            
         MFLD  LEVTID10,                                               +        
               LTH=5                                                            
         MFLD  LEVREF10,                                               +        
               LTH=10                                                           
         MFLD  MOTDAT10,                                               +        
               LTH=6                                                            
         MFLD  MOTTID10,                                               +        
               LTH=5                                                            
         MFLD  DIST10,                                                 +        
               LTH=4                                                            
         MFLD  KUND10,                                                 +        
               LTH=6                                                            
         MFLD  ORDNR10,                                                +        
               LTH=5                                                            
         MFLD  KOLLI10,                                                +        
               LTH=5                                                            
         MFLD  VIKT10,                                                 +        
               LTH=8                                                            
         MFLD  VOL10,                                                  +        
               LTH=7                                                            
         MFLD  CMD11,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVDAT11,                                               +        
               LTH=6                                                            
         MFLD  LEVTID11,                                               +        
               LTH=5                                                            
         MFLD  LEVREF11,                                               +        
               LTH=10                                                           
         MFLD  MOTDAT11,                                               +        
               LTH=6                                                            
         MFLD  MOTTID11,                                               +        
               LTH=5                                                            
         MFLD  DIST11,                                                 +        
               LTH=4                                                            
         MFLD  KUND11,                                                 +        
               LTH=6                                                            
         MFLD  ORDNR11,                                                +        
               LTH=5                                                            
         MFLD  KOLLI11,                                                +        
               LTH=5                                                            
         MFLD  VIKT11,                                                 +        
               LTH=8                                                            
         MFLD  VOL11,                                                  +        
               LTH=7                                                            
         MFLD  CMD12,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVDAT12,                                               +        
               LTH=6                                                            
         MFLD  LEVTID12,                                               +        
               LTH=5                                                            
         MFLD  LEVREF12,                                               +        
               LTH=10                                                           
         MFLD  MOTDAT12,                                               +        
               LTH=6                                                            
         MFLD  MOTTID12,                                               +        
               LTH=5                                                            
         MFLD  DIST12,                                                 +        
               LTH=4                                                            
         MFLD  KUND12,                                                 +        
               LTH=6                                                            
         MFLD  ORDNR12,                                                +        
               LTH=5                                                            
         MFLD  KOLLI12,                                                +        
               LTH=5                                                            
         MFLD  VIKT12,                                                 +        
               LTH=8                                                            
         MFLD  VOL12,                                                  +        
               LTH=7                                                            
         MFLD  CMD13,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVDAT13,                                               +        
               LTH=6                                                            
         MFLD  LEVTID13,                                               +        
               LTH=5                                                            
         MFLD  LEVREF13,                                               +        
               LTH=10                                                           
         MFLD  MOTDAT13,                                               +        
               LTH=6                                                            
         MFLD  MOTTID13,                                               +        
               LTH=5                                                            
         MFLD  DIST13,                                                 +        
               LTH=4                                                            
         MFLD  KUND13,                                                 +        
               LTH=6                                                            
         MFLD  ORDNR13,                                                +        
               LTH=5                                                            
         MFLD  KOLLI13,                                                +        
               LTH=5                                                            
         MFLD  VIKT13,                                                 +        
               LTH=8                                                            
         MFLD  VOL13,                                                  +        
               LTH=7                                                            
         MFLD  CMD14,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVDAT14,                                               +        
               LTH=6                                                            
         MFLD  LEVTID14,                                               +        
               LTH=5                                                            
         MFLD  LEVREF14,                                               +        
               LTH=10                                                           
         MFLD  MOTDAT14,                                               +        
               LTH=6                                                            
         MFLD  MOTTID14,                                               +        
               LTH=5                                                            
         MFLD  DIST14,                                                 +        
               LTH=4                                                            
         MFLD  KUND14,                                                 +        
               LTH=6                                                            
         MFLD  ORDNR14,                                                +        
               LTH=5                                                            
         MFLD  KOLLI14,                                                +        
               LTH=5                                                            
         MFLD  VIKT14,                                                 +        
               LTH=8                                                            
         MFLD  VOL14,                                                  +        
               LTH=7                                                            
         MFLD  CMD15,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVDAT15,                                               +        
               LTH=6                                                            
         MFLD  LEVTID15,                                               +        
               LTH=5                                                            
         MFLD  LEVREF15,                                               +        
               LTH=10                                                           
         MFLD  MOTDAT15,                                               +        
               LTH=6                                                            
         MFLD  MOTTID15,                                               +        
               LTH=5                                                            
         MFLD  DIST15,                                                 +        
               LTH=4                                                            
         MFLD  KUND15,                                                 +        
               LTH=6                                                            
         MFLD  ORDNR15,                                                +        
               LTH=5                                                            
         MFLD  KOLLI15,                                                +        
               LTH=5                                                            
         MFLD  VIKT15,                                                 +        
               LTH=8                                                            
         MFLD  VOL15,                                                  +        
               LTH=7                                                            
         MFLD  FLD2306,                                                +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  FSYSMSG,                                                +        
               LTH=79                                                           
         MSGEND                                                                 
W6I175N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W6N175),                                           +        
               OPT=2,                                                  +        
               NXT=W6O175N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '61752',                                                +        
               LTH=5                                                            
         MFLD  (LEVNRIN,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L                                                           
         MFLD  (LEVNRUT,                                               +        
               '     '),                                               +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (LEVDATIN,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R                                                           
         MFLD  (LEVDATUT,                                              +        
               '      '),                                              +        
               LTH=6,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (LEVREFIN,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L                                                           
         MFLD  (LEVREFUT,                                              +        
               '          '),                                          +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DISTIN,                                                +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R                                                           
         MFLD  (DISTUT,                                                +        
               '    '),                                                +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (CMD1,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD2,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD3,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD4,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD5,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD6,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD7,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD8,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD9,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD10,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD11,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD12,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD13,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD14,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD15,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
