***********************************************************************         
* CREATED BY V036147   ON 11/03/04  AT 16:56                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'Goods scan direct del via CDC   '                               
W6N176   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0t501  ',                                           +        
               3='W0t501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0t501  ',                                           +        
               8='W0t501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W6T176U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W6N176   DPAGE CURSOR=((2,11)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Goods scan direct del via CDC',                        +        
               POS=(1,11),LTH=29,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Supplier',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(NUM,PROT)                                                  
DGIA0080 DFLD  POS=(2,11),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Supplier date',                                        +        
               POS=(2,17),LTH=13,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0138 DFLD  POS=(2,31),LTH=6,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Supplier Ref.',                                        +        
               POS=(2,38),LTH=13,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0108 DFLD  POS=(2,52),LTH=10,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Dist',                                                 +        
               POS=(2,63),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0000 DFLD  POS=(2,68),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0081 DFLD  POS=(3,11),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0139 DFLD  POS=(3,31),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0109 DFLD  POS=(3,52),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
DGIA0027 DFLD  POS=(3,68),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Number of NOT received cases:',                        +        
               POS=(5,2),LTH=29,                                       +        
               ATTR=(PROT)                                                      
DGIA0110 DFLD  POS=(5,32),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Already selected cases',                               +        
               POS=(6,2),LTH=22,                                       +        
               ATTR=(PROT)                                                      
         DFLD  ':',                                                    +        
               POS=(6,30),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0111 DFLD  POS=(6,32),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Dist  Cust.   Order    Case   Code    Dist  Cust.   Ord+        
               er    Case   Code',                                     +        
               POS=(8,2),LTH=72,                                       +        
               ATTR=(PROT)                                                      
DGIA0001 DFLD  POS=(9,2),LTH=4,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0054 DFLD  POS=(9,8),LTH=6,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0082 DFLD  POS=(9,16),LTH=7,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0028 DFLD  POS=(9,25),LTH=5,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0112 DFLD  POS=(9,32),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0002 DFLD  POS=(9,40),LTH=4,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0055 DFLD  POS=(9,46),LTH=6,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0083 DFLD  POS=(9,54),LTH=7,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0029 DFLD  POS=(9,63),LTH=5,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0113 DFLD  POS=(9,70),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0003 DFLD  POS=(10,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0056 DFLD  POS=(10,8),LTH=6,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0084 DFLD  POS=(10,16),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0030 DFLD  POS=(10,25),LTH=5,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0114 DFLD  POS=(10,32),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0004 DFLD  POS=(10,40),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0057 DFLD  POS=(10,46),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0085 DFLD  POS=(10,54),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0031 DFLD  POS=(10,63),LTH=5,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0115 DFLD  POS=(10,70),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0005 DFLD  POS=(11,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0058 DFLD  POS=(11,8),LTH=6,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0086 DFLD  POS=(11,16),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0032 DFLD  POS=(11,25),LTH=5,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0116 DFLD  POS=(11,32),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0006 DFLD  POS=(11,40),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0059 DFLD  POS=(11,46),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0087 DFLD  POS=(11,54),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0033 DFLD  POS=(11,63),LTH=5,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0117 DFLD  POS=(11,70),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0007 DFLD  POS=(12,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0060 DFLD  POS=(12,8),LTH=6,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0088 DFLD  POS=(12,16),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0034 DFLD  POS=(12,25),LTH=5,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0118 DFLD  POS=(12,32),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0008 DFLD  POS=(12,40),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0061 DFLD  POS=(12,46),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0089 DFLD  POS=(12,54),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0035 DFLD  POS=(12,63),LTH=5,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0119 DFLD  POS=(12,70),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0009 DFLD  POS=(13,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0062 DFLD  POS=(13,8),LTH=6,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0090 DFLD  POS=(13,16),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0036 DFLD  POS=(13,25),LTH=5,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0120 DFLD  POS=(13,32),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0010 DFLD  POS=(13,40),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0063 DFLD  POS=(13,46),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0091 DFLD  POS=(13,54),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0037 DFLD  POS=(13,63),LTH=5,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0121 DFLD  POS=(13,70),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0011 DFLD  POS=(14,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0064 DFLD  POS=(14,8),LTH=6,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0092 DFLD  POS=(14,16),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0038 DFLD  POS=(14,25),LTH=5,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0122 DFLD  POS=(14,32),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0012 DFLD  POS=(14,40),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0065 DFLD  POS=(14,46),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0093 DFLD  POS=(14,54),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0039 DFLD  POS=(14,63),LTH=5,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0123 DFLD  POS=(14,70),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0013 DFLD  POS=(15,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0066 DFLD  POS=(15,8),LTH=6,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0094 DFLD  POS=(15,16),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0040 DFLD  POS=(15,25),LTH=5,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0124 DFLD  POS=(15,32),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0014 DFLD  POS=(15,40),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0067 DFLD  POS=(15,46),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0095 DFLD  POS=(15,54),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0041 DFLD  POS=(15,63),LTH=5,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0125 DFLD  POS=(15,70),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0015 DFLD  POS=(16,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0068 DFLD  POS=(16,8),LTH=6,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0096 DFLD  POS=(16,16),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0042 DFLD  POS=(16,25),LTH=5,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0126 DFLD  POS=(16,32),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0016 DFLD  POS=(16,40),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0069 DFLD  POS=(16,46),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0097 DFLD  POS=(16,54),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0043 DFLD  POS=(16,63),LTH=5,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0127 DFLD  POS=(16,70),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0017 DFLD  POS=(17,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0070 DFLD  POS=(17,8),LTH=6,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0098 DFLD  POS=(17,16),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0044 DFLD  POS=(17,25),LTH=5,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0128 DFLD  POS=(17,32),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0018 DFLD  POS=(17,40),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0071 DFLD  POS=(17,46),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0099 DFLD  POS=(17,54),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0045 DFLD  POS=(17,63),LTH=5,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0129 DFLD  POS=(17,70),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0019 DFLD  POS=(18,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0072 DFLD  POS=(18,8),LTH=6,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0100 DFLD  POS=(18,16),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0046 DFLD  POS=(18,25),LTH=5,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0130 DFLD  POS=(18,32),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0020 DFLD  POS=(18,40),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0073 DFLD  POS=(18,46),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0101 DFLD  POS=(18,54),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0047 DFLD  POS=(18,63),LTH=5,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0131 DFLD  POS=(18,70),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0021 DFLD  POS=(19,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0074 DFLD  POS=(19,8),LTH=6,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0102 DFLD  POS=(19,16),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0048 DFLD  POS=(19,25),LTH=5,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0132 DFLD  POS=(19,32),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0022 DFLD  POS=(19,40),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0075 DFLD  POS=(19,46),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0103 DFLD  POS=(19,54),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0049 DFLD  POS=(19,63),LTH=5,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0133 DFLD  POS=(19,70),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0023 DFLD  POS=(20,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0076 DFLD  POS=(20,8),LTH=6,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0104 DFLD  POS=(20,16),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0050 DFLD  POS=(20,25),LTH=5,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0134 DFLD  POS=(20,32),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0024 DFLD  POS=(20,40),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0077 DFLD  POS=(20,46),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0105 DFLD  POS=(20,54),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0051 DFLD  POS=(20,63),LTH=5,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0135 DFLD  POS=(20,70),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0025 DFLD  POS=(21,2),LTH=4,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0078 DFLD  POS=(21,8),LTH=6,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0106 DFLD  POS=(21,16),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0052 DFLD  POS=(21,25),LTH=5,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0136 DFLD  POS=(21,32),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0026 DFLD  POS=(21,40),LTH=4,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0079 DFLD  POS=(21,46),LTH=6,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0107 DFLD  POS=(21,54),LTH=7,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0053 DFLD  POS=(21,63),LTH=5,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(21,69),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
DGIA0137 DFLD  POS=(21,71),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'F10=WHELP  F11=Update  F12=Logoff',                    +        
               POS=(22,2),LTH=33,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W6O176N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6N176,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I176N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W6N176,                                             +        
               NXT=W6I176N1                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  DGIA0080,                                               +        
               LTH=2                                                            
         MFLD  DGIA0081,                                               +        
               LTH=5                                                            
         MFLD  DGIA0138,                                               +        
               LTH=2                                                            
         MFLD  DGIA0139,                                               +        
               LTH=6                                                            
         MFLD  DGIA0108,                                               +        
               LTH=2                                                            
         MFLD  DGIA0109,                                               +        
               LTH=10                                                           
         MFLD  DGIA0000,                                               +        
               LTH=2                                                            
         MFLD  DGIA0027,                                               +        
               LTH=4                                                            
         MFLD  DGIA0110,                                               +        
               LTH=4                                                            
         MFLD  DGIA0111,                                               +        
               LTH=4                                                            
         MFLD  DGIA0001,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0054,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0082,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0028,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0112,                                               +        
               LTH=4                                                            
         MFLD  DGIA0002,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0055,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0083,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0029,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0113,                                               +        
               LTH=4                                                            
         MFLD  DGIA0003,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0056,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0084,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0030,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0114,                                               +        
               LTH=4                                                            
         MFLD  DGIA0004,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0057,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0085,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0031,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0115,                                               +        
               LTH=4                                                            
         MFLD  DGIA0005,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0058,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0086,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0032,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0116,                                               +        
               LTH=4                                                            
         MFLD  DGIA0006,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0059,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0087,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0033,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0117,                                               +        
               LTH=4                                                            
         MFLD  DGIA0007,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0060,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0088,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0034,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0118,                                               +        
               LTH=4                                                            
         MFLD  DGIA0008,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0061,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0089,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0035,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0119,                                               +        
               LTH=4                                                            
         MFLD  DGIA0009,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0062,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0090,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0036,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0120,                                               +        
               LTH=4                                                            
         MFLD  DGIA0010,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0063,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0091,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0037,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0121,                                               +        
               LTH=4                                                            
         MFLD  DGIA0011,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0064,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0092,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0038,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0122,                                               +        
               LTH=4                                                            
         MFLD  DGIA0012,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0065,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0093,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0039,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0123,                                               +        
               LTH=4                                                            
         MFLD  DGIA0013,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0066,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0094,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0040,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0124,                                               +        
               LTH=4                                                            
         MFLD  DGIA0014,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0067,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0095,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0041,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0125,                                               +        
               LTH=4                                                            
         MFLD  DGIA0015,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0068,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0096,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0042,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0126,                                               +        
               LTH=4                                                            
         MFLD  DGIA0016,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0069,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0097,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0043,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0127,                                               +        
               LTH=4                                                            
         MFLD  DGIA0017,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0070,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0098,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0044,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0128,                                               +        
               LTH=4                                                            
         MFLD  DGIA0018,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0071,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0099,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0045,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0129,                                               +        
               LTH=4                                                            
         MFLD  DGIA0019,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0072,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0100,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0046,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0130,                                               +        
               LTH=4                                                            
         MFLD  DGIA0020,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0073,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0101,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0047,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0131,                                               +        
               LTH=4                                                            
         MFLD  DGIA0021,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0074,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0102,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0048,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0132,                                               +        
               LTH=4                                                            
         MFLD  DGIA0022,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0075,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0103,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0049,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0133,                                               +        
               LTH=4                                                            
         MFLD  DGIA0023,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0076,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0104,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0050,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0134,                                               +        
               LTH=4                                                            
         MFLD  DGIA0024,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0077,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0105,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0051,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0135,                                               +        
               LTH=4                                                            
         MFLD  DGIA0025,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0078,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0106,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0052,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0136,                                               +        
               LTH=4                                                            
         MFLD  DGIA0026,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0079,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0107,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0053,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0137,                                               +        
               LTH=4                                                            
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W6I176N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W6N176),                                           +        
               OPT=2,                                                  +        
               NXT=W6O176N1                                                     
MID      LPAGE SOR=(W6N176)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '61762',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0080,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L                                                           
         MFLD  (DGIA0138,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0108,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=L                                                           
         MFLD  (DGIA0000,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0001,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0054,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0082,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0028,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0002,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0055,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0083,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0029,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0003,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0056,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0084,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0030,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0004,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0057,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0085,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0031,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0005,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0058,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0086,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0032,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0006,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0059,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0087,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0033,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0007,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0060,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0088,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0034,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0008,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0061,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0089,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0035,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0009,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0062,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0090,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0036,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0010,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0063,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0091,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0037,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0011,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0064,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0092,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0038,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0012,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0065,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0093,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0039,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0013,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0066,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0094,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0040,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0014,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0067,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0095,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0041,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0015,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0068,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0096,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0042,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0016,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0069,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0097,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0043,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0017,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0070,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0098,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0044,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0018,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0071,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0099,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0045,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0019,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0072,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0100,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0046,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0020,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0073,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0101,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0047,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0021,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0074,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0102,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0048,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0022,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0075,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0103,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0049,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0023,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0076,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0104,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0050,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0024,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0077,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0105,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0051,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0025,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0078,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0106,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0052,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0026,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0079,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0107,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0053,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
