***********************************************************************         
* CREATED BY PC54132   ON 02/08/21  AT 09:15                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'PREFERENTIAL COUNTRY OF ORIGIN  '                               
W6N186   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W6T186  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W6T186 7',                                           +        
               8='W6T186 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W6T186U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'PREF COUNTRY OF ORIGIN',                               +        
               POS=(1,12),LTH=22,                                      +        
               ATTR=(PROT)                                                      
MFSFEL   DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Part No.',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(ALPHA,PROT)                                                
ARTIN    DFLD  POS=(2,12),LTH=9,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
ARTUT    DFLD  POS=(3,12),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
ARTBEN   DFLD  POS=(3,25),LTH=25,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'COO',                                                  +        
               POS=(5,2),LTH=3,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'PCOO',                                                 +        
               POS=(5,7),LTH=4,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'PCOO Stock',                                           +        
               POS=(5,13),LTH=10,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Supplier',                                             +        
               POS=(5,29),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Updated  Date',                                        +        
               POS=(5,39),LTH=13,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Valid Pref status',                                    +        
               POS=(5,55),LTH=17,                                      +        
               ATTR=(PROT)                                                      
COO      DFLD  POS=(6,2),LTH=2,                                        +        
               ATTR=(PROT)                                                      
PCOO     DFLD  POS=(6,7),LTH=1,                                        +        
               ATTR=(PROT)                                                      
PCOOSTK  DFLD  POS=(6,13),LTH=7,                                       +        
               ATTR=(PROT)                                                      
LEVNR    DFLD  POS=(6,29),LTH=5,                                       +        
               ATTR=(PROT)                                                      
UPUSR    DFLD  POS=(6,39),LTH=8,                                       +        
               ATTR=(PROT)                                                      
UPDAT    DFLD  POS=(6,48),LTH=6,                                       +        
               ATTR=(PROT)                                                      
VFDAT    DFLD  POS=(6,55),LTH=6,                                       +        
               ATTR=(PROT)                                                      
VTDAT    DFLD  POS=(6,62),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'PREFERENTIAL STATUS TRADE GROUP',                      +        
               POS=(8,2),LTH=31,                                       +        
               ATTR=(PROT)                                                      
TG1      DFLD  POS=(9,2),LTH=1,                                        +        
               ATTR=(PROT)                                                      
TG2      DFLD  POS=(9,4),LTH=1,                                        +        
               ATTR=(PROT)                                                      
TG3      DFLD  POS=(9,6),LTH=1,                                        +        
               ATTR=(PROT)                                                      
TG4      DFLD  POS=(9,8),LTH=1,                                        +        
               ATTR=(PROT)                                                      
TG5      DFLD  POS=(9,10),LTH=1,                                       +        
               ATTR=(PROT)                                                      
TG6      DFLD  POS=(9,12),LTH=1,                                       +        
               ATTR=(PROT)                                                      
TG7      DFLD  POS=(9,14),LTH=1,                                       +        
               ATTR=(PROT)                                                      
TG8      DFLD  POS=(9,16),LTH=1,                                       +        
               ATTR=(PROT)                                                      
TG9      DFLD  POS=(9,18),LTH=1,                                       +        
               ATTR=(PROT)                                                      
TG10     DFLD  POS=(9,20),LTH=1,                                       +        
               ATTR=(PROT)                                                      
TG11     DFLD  POS=(9,22),LTH=1,                                       +        
               ATTR=(PROT)                                                      
TG12     DFLD  POS=(9,24),LTH=1,                                       +        
               ATTR=(PROT)                                                      
TG13     DFLD  POS=(9,26),LTH=1,                                       +        
               ATTR=(PROT)                                                      
TG14     DFLD  POS=(9,28),LTH=1,                                       +        
               ATTR=(PROT)                                                      
TG15     DFLD  POS=(9,30),LTH=1,                                       +        
               ATTR=(PROT)                                                      
TG16     DFLD  POS=(9,32),LTH=1,                                       +        
               ATTR=(PROT)                                                      
TG17     DFLD  POS=(9,34),LTH=1,                                       +        
               ATTR=(PROT)                                                      
TG18     DFLD  POS=(9,36),LTH=1,                                       +        
               ATTR=(PROT)                                                      
TGA      DFLD  POS=(10,2),LTH=1,                                       +        
               ATTR=(PROT)                                                      
TGB      DFLD  POS=(10,4),LTH=1,                                       +        
               ATTR=(PROT)                                                      
TGC      DFLD  POS=(10,6),LTH=1,                                       +        
               ATTR=(PROT)                                                      
TGD      DFLD  POS=(10,8),LTH=1,                                       +        
               ATTR=(PROT)                                                      
TGE      DFLD  POS=(10,10),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TGF      DFLD  POS=(10,12),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TGG      DFLD  POS=(10,14),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TGH      DFLD  POS=(10,16),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TGI      DFLD  POS=(10,18),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TGJ      DFLD  POS=(10,20),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TGK      DFLD  POS=(10,22),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TGL      DFLD  POS=(10,24),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TGM      DFLD  POS=(10,26),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TGN      DFLD  POS=(10,28),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TGO      DFLD  POS=(10,30),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TGP      DFLD  POS=(10,32),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TGQ      DFLD  POS=(10,34),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TGR      DFLD  POS=(10,36),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TGS      DFLD  POS=(10,38),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TGT      DFLD  POS=(10,40),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TGU      DFLD  POS=(10,42),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TGV      DFLD  POS=(10,44),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TGW      DFLD  POS=(10,46),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TGX      DFLD  POS=(10,48),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TGY      DFLD  POS=(10,50),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TGZ      DFLD  POS=(10,52),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'History',                                              +        
               POS=(12,2),LTH=7,                                       +        
               ATTR=(PROT)                                                      
COO1     DFLD  POS=(13,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
USR1     DFLD  POS=(13,6),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DAT1     DFLD  POS=(13,16),LTH=6,                                      +        
               ATTR=(PROT)                                                      
LEV1     DFLD  POS=(13,23),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COO2     DFLD  POS=(14,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
USR2     DFLD  POS=(14,6),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DAT2     DFLD  POS=(14,16),LTH=6,                                      +        
               ATTR=(PROT)                                                      
LEV2     DFLD  POS=(14,23),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COO3     DFLD  POS=(15,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
USR3     DFLD  POS=(15,6),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DAT3     DFLD  POS=(15,16),LTH=6,                                      +        
               ATTR=(PROT)                                                      
LEV3     DFLD  POS=(15,23),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COO4     DFLD  POS=(16,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
USR4     DFLD  POS=(16,6),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DAT4     DFLD  POS=(16,16),LTH=6,                                      +        
               ATTR=(PROT)                                                      
LEV4     DFLD  POS=(16,23),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COO5     DFLD  POS=(13,29),LTH=2,                                      +        
               ATTR=(PROT)                                                      
USR5     DFLD  POS=(13,32),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DAT5     DFLD  POS=(13,41),LTH=6,                                      +        
               ATTR=(PROT)                                                      
LEV5     DFLD  POS=(13,48),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COO6     DFLD  POS=(14,29),LTH=2,                                      +        
               ATTR=(PROT)                                                      
USR6     DFLD  POS=(14,32),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DAT6     DFLD  POS=(14,41),LTH=6,                                      +        
               ATTR=(PROT)                                                      
LEV6     DFLD  POS=(14,48),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COO7     DFLD  POS=(15,29),LTH=2,                                      +        
               ATTR=(PROT)                                                      
USR7     DFLD  POS=(15,32),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DAT7     DFLD  POS=(15,41),LTH=6,                                      +        
               ATTR=(PROT)                                                      
LEV7     DFLD  POS=(15,48),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COO8     DFLD  POS=(16,29),LTH=2,                                      +        
               ATTR=(PROT)                                                      
USR8     DFLD  POS=(16,32),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DAT8     DFLD  POS=(16,41),LTH=6,                                      +        
               ATTR=(PROT)                                                      
LEV8     DFLD  POS=(16,48),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COO9     DFLD  POS=(13,55),LTH=2,                                      +        
               ATTR=(PROT)                                                      
USR9     DFLD  POS=(13,58),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DAT9     DFLD  POS=(13,67),LTH=6,                                      +        
               ATTR=(PROT)                                                      
LEV9     DFLD  POS=(13,75),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COO10    DFLD  POS=(14,55),LTH=2,                                      +        
               ATTR=(PROT)                                                      
USR10    DFLD  POS=(14,58),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DAT10    DFLD  POS=(14,67),LTH=6,                                      +        
               ATTR=(PROT)                                                      
LEV10    DFLD  POS=(14,75),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COO11    DFLD  POS=(15,55),LTH=2,                                      +        
               ATTR=(PROT)                                                      
USR11    DFLD  POS=(15,58),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DAT11    DFLD  POS=(15,67),LTH=6,                                      +        
               ATTR=(PROT)                                                      
LEV11    DFLD  POS=(15,75),LTH=5,                                      +        
               ATTR=(PROT)                                                      
COO12    DFLD  POS=(16,55),LTH=2,                                      +        
               ATTR=(PROT)                                                      
USR12    DFLD  POS=(16,58),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DAT12    DFLD  POS=(16,67),LTH=6,                                      +        
               ATTR=(PROT)                                                      
LEV12    DFLD  POS=(16,75),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Trade Groups',                                         +        
               POS=(19,2),LTH=12,                                      +        
               ATTR=(PROT)                                                      
TRDF1    DFLD  POS=(19,15),LTH=2,                                      +        
               ATTR=(PROT)                                                      
TRDG1    DFLD  POS=(19,18),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TRDF2    DFLD  POS=(19,25),LTH=2,                                      +        
               ATTR=(PROT)                                                      
TRDG2    DFLD  POS=(19,28),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TRDF3    DFLD  POS=(19,35),LTH=2,                                      +        
               ATTR=(PROT)                                                      
TRDG3    DFLD  POS=(19,38),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TRDF4    DFLD  POS=(19,45),LTH=2,                                      +        
               ATTR=(PROT)                                                      
TRDG4    DFLD  POS=(19,48),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TRDF5    DFLD  POS=(19,55),LTH=2,                                      +        
               ATTR=(PROT)                                                      
TRDG5    DFLD  POS=(19,58),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TRDF6    DFLD  POS=(19,65),LTH=2,                                      +        
               ATTR=(PROT)                                                      
TRDG6    DFLD  POS=(19,68),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TRDF7    DFLD  POS=(20,15),LTH=2,                                      +        
               ATTR=(PROT)                                                      
TRDG7    DFLD  POS=(20,18),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TRDF8    DFLD  POS=(20,25),LTH=2,                                      +        
               ATTR=(PROT)                                                      
TRDG8    DFLD  POS=(20,28),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TRDF9    DFLD  POS=(20,35),LTH=2,                                      +        
               ATTR=(PROT)                                                      
TRDG9    DFLD  POS=(20,38),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TRDF10   DFLD  POS=(20,45),LTH=2,                                      +        
               ATTR=(PROT)                                                      
TRDG10   DFLD  POS=(20,48),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TRDF11   DFLD  POS=(20,55),LTH=2,                                      +        
               ATTR=(PROT)                                                      
TRDG11   DFLD  POS=(20,58),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TRDF12   DFLD  POS=(20,65),LTH=2,                                      +        
               ATTR=(PROT)                                                      
TRDG12   DFLD  POS=(20,68),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TRDF13   DFLD  POS=(21,15),LTH=2,                                      +        
               ATTR=(PROT)                                                      
TRDG13   DFLD  POS=(21,18),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TRDF14   DFLD  POS=(21,25),LTH=2,                                      +        
               ATTR=(PROT)                                                      
TRDG14   DFLD  POS=(21,28),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TRDF15   DFLD  POS=(21,35),LTH=2,                                      +        
               ATTR=(PROT)                                                      
TRDG15   DFLD  POS=(21,38),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TRDF16   DFLD  POS=(21,45),LTH=2,                                      +        
               ATTR=(PROT)                                                      
TRDG16   DFLD  POS=(21,48),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TRDF17   DFLD  POS=(21,55),LTH=2,                                      +        
               ATTR=(PROT)                                                      
TRDG17   DFLD  POS=(21,58),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TRDF18   DFLD  POS=(21,65),LTH=2,                                      +        
               ATTR=(PROT)                                                      
TRDG18   DFLD  POS=(21,68),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'F7 Back   F8 Forward 22 Whelp ',                       +        
               POS=(22,2),LTH=44,                                      +        
               ATTR=(PROT)                                                      
MFSINFO  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NOPROT,MOD)                                                
         FMTEND                                                                 
W6O186N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6N186,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I186N1,                                           +        
               FILL=PT                                                          
DGI1     LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  MFSFEL,                                                 +        
               LTH=40                                                           
         MFLD  ARTIN,                                                  +        
               LTH=9                                                            
         MFLD  ARTUT,                                                  +        
               LTH=9                                                            
         MFLD  ARTBEN,                                                 +        
               LTH=25                                                           
         MFLD  COO,                                                    +        
               LTH=2                                                            
         MFLD  PCOO,                                                   +        
               LTH=1                                                            
         MFLD  PCOOSTK,                                                +        
               LTH=7                                                            
         MFLD  LEVNR,                                                  +        
               LTH=5                                                            
         MFLD  UPUSR,                                                  +        
               LTH=8                                                            
         MFLD  UPDAT,                                                  +        
               LTH=6                                                            
         MFLD  VFDAT,                                                  +        
               LTH=6                                                            
         MFLD  VTDAT,                                                  +        
               LTH=6                                                            
         MFLD  TG1,                                                    +        
               LTH=1                                                            
         MFLD  TG2,                                                    +        
               LTH=1                                                            
         MFLD  TG3,                                                    +        
               LTH=1                                                            
         MFLD  TG4,                                                    +        
               LTH=1                                                            
         MFLD  TG5,                                                    +        
               LTH=1                                                            
         MFLD  TG6,                                                    +        
               LTH=1                                                            
         MFLD  TG7,                                                    +        
               LTH=1                                                            
         MFLD  TG8,                                                    +        
               LTH=1                                                            
         MFLD  TG9,                                                    +        
               LTH=1                                                            
         MFLD  TG10,                                                   +        
               LTH=1                                                            
         MFLD  TG11,                                                   +        
               LTH=1                                                            
         MFLD  TG12,                                                   +        
               LTH=1                                                            
         MFLD  TG13,                                                   +        
               LTH=1                                                            
         MFLD  TG14,                                                   +        
               LTH=1                                                            
         MFLD  TG15,                                                   +        
               LTH=1                                                            
         MFLD  TG16,                                                   +        
               LTH=1                                                            
         MFLD  TG17,                                                   +        
               LTH=1                                                            
         MFLD  TG18,                                                   +        
               LTH=1                                                            
         MFLD  TGA,                                                    +        
               LTH=1                                                            
         MFLD  TGB,                                                    +        
               LTH=1                                                            
         MFLD  TGC,                                                    +        
               LTH=1                                                            
         MFLD  TGD,                                                    +        
               LTH=1                                                            
         MFLD  TGE,                                                    +        
               LTH=1                                                            
         MFLD  TGF,                                                    +        
               LTH=1                                                            
         MFLD  TGG,                                                    +        
               LTH=1                                                            
         MFLD  TGH,                                                    +        
               LTH=1                                                            
         MFLD  TGI,                                                    +        
               LTH=1                                                            
         MFLD  TGJ,                                                    +        
               LTH=1                                                            
         MFLD  TGK,                                                    +        
               LTH=1                                                            
         MFLD  TGL,                                                    +        
               LTH=1                                                            
         MFLD  TGM,                                                    +        
               LTH=1                                                            
         MFLD  TGN,                                                    +        
               LTH=1                                                            
         MFLD  TGO,                                                    +        
               LTH=1                                                            
         MFLD  TGP,                                                    +        
               LTH=1                                                            
         MFLD  TGQ,                                                    +        
               LTH=1                                                            
         MFLD  TGR,                                                    +        
               LTH=1                                                            
         MFLD  TGS,                                                    +        
               LTH=1                                                            
         MFLD  TGT,                                                    +        
               LTH=1                                                            
         MFLD  TGU,                                                    +        
               LTH=1                                                            
         MFLD  TGV,                                                    +        
               LTH=1                                                            
         MFLD  TGW,                                                    +        
               LTH=1                                                            
         MFLD  TGX,                                                    +        
               LTH=1                                                            
         MFLD  TGY,                                                    +        
               LTH=1                                                            
         MFLD  TGZ,                                                    +        
               LTH=1                                                            
         MFLD  COO1,                                                   +        
               LTH=2                                                            
         MFLD  USR1,                                                   +        
               LTH=8                                                            
         MFLD  DAT1,                                                   +        
               LTH=6                                                            
         MFLD  LEV1,                                                   +        
               LTH=5                                                            
         MFLD  COO2,                                                   +        
               LTH=2                                                            
         MFLD  USR2,                                                   +        
               LTH=8                                                            
         MFLD  DAT2,                                                   +        
               LTH=6                                                            
         MFLD  LEV2,                                                   +        
               LTH=5                                                            
         MFLD  COO3,                                                   +        
               LTH=2                                                            
         MFLD  USR3,                                                   +        
               LTH=8                                                            
         MFLD  DAT3,                                                   +        
               LTH=6                                                            
         MFLD  LEV3,                                                   +        
               LTH=5                                                            
         MFLD  COO4,                                                   +        
               LTH=2                                                            
         MFLD  USR4,                                                   +        
               LTH=8                                                            
         MFLD  DAT4,                                                   +        
               LTH=6                                                            
         MFLD  LEV4,                                                   +        
               LTH=5                                                            
         MFLD  COO5,                                                   +        
               LTH=2                                                            
         MFLD  USR5,                                                   +        
               LTH=8                                                            
         MFLD  DAT5,                                                   +        
               LTH=6                                                            
         MFLD  LEV5,                                                   +        
               LTH=5                                                            
         MFLD  COO6,                                                   +        
               LTH=2                                                            
         MFLD  USR6,                                                   +        
               LTH=8                                                            
         MFLD  DAT6,                                                   +        
               LTH=6                                                            
         MFLD  LEV6,                                                   +        
               LTH=5                                                            
         MFLD  COO7,                                                   +        
               LTH=2                                                            
         MFLD  USR7,                                                   +        
               LTH=8                                                            
         MFLD  DAT7,                                                   +        
               LTH=6                                                            
         MFLD  LEV7,                                                   +        
               LTH=5                                                            
         MFLD  COO8,                                                   +        
               LTH=2                                                            
         MFLD  USR8,                                                   +        
               LTH=8                                                            
         MFLD  DAT8,                                                   +        
               LTH=6                                                            
         MFLD  LEV8,                                                   +        
               LTH=5                                                            
         MFLD  COO9,                                                   +        
               LTH=2                                                            
         MFLD  USR9,                                                   +        
               LTH=8                                                            
         MFLD  DAT9,                                                   +        
               LTH=6                                                            
         MFLD  LEV9,                                                   +        
               LTH=5                                                            
         MFLD  COO10,                                                  +        
               LTH=2                                                            
         MFLD  USR10,                                                  +        
               LTH=8                                                            
         MFLD  DAT10,                                                  +        
               LTH=6                                                            
         MFLD  LEV10,                                                  +        
               LTH=5                                                            
         MFLD  COO11,                                                  +        
               LTH=2                                                            
         MFLD  USR11,                                                  +        
               LTH=8                                                            
         MFLD  DAT11,                                                  +        
               LTH=6                                                            
         MFLD  LEV11,                                                  +        
               LTH=5                                                            
         MFLD  COO12,                                                  +        
               LTH=2                                                            
         MFLD  USR12,                                                  +        
               LTH=8                                                            
         MFLD  DAT12,                                                  +        
               LTH=6                                                            
         MFLD  LEV12,                                                  +        
               LTH=5                                                            
         MFLD  TRDF1,                                                  +        
               LTH=2                                                            
         MFLD  TRDG1,                                                  +        
               LTH=6                                                            
         MFLD  TRDF2,                                                  +        
               LTH=2                                                            
         MFLD  TRDG2,                                                  +        
               LTH=6                                                            
         MFLD  TRDF3,                                                  +        
               LTH=2                                                            
         MFLD  TRDG3,                                                  +        
               LTH=6                                                            
         MFLD  TRDF4,                                                  +        
               LTH=2                                                            
         MFLD  TRDG4,                                                  +        
               LTH=6                                                            
         MFLD  TRDF5,                                                  +        
               LTH=2                                                            
         MFLD  TRDG5,                                                  +        
               LTH=6                                                            
         MFLD  TRDF6,                                                  +        
               LTH=2                                                            
         MFLD  TRDG6,                                                  +        
               LTH=6                                                            
         MFLD  TRDF7,                                                  +        
               LTH=2                                                            
         MFLD  TRDG7,                                                  +        
               LTH=6                                                            
         MFLD  TRDF8,                                                  +        
               LTH=2                                                            
         MFLD  TRDG8,                                                  +        
               LTH=6                                                            
         MFLD  TRDF9,                                                  +        
               LTH=2                                                            
         MFLD  TRDG9,                                                  +        
               LTH=6                                                            
         MFLD  TRDF10,                                                 +        
               LTH=2                                                            
         MFLD  TRDG10,                                                 +        
               LTH=6                                                            
         MFLD  TRDF11,                                                 +        
               LTH=2                                                            
         MFLD  TRDG11,                                                 +        
               LTH=6                                                            
         MFLD  TRDF12,                                                 +        
               LTH=2                                                            
         MFLD  TRDG12,                                                 +        
               LTH=6                                                            
         MFLD  TRDF13,                                                 +        
               LTH=2                                                            
         MFLD  TRDG13,                                                 +        
               LTH=6                                                            
         MFLD  TRDF14,                                                 +        
               LTH=2                                                            
         MFLD  TRDG14,                                                 +        
               LTH=6                                                            
         MFLD  TRDF15,                                                 +        
               LTH=2                                                            
         MFLD  TRDG15,                                                 +        
               LTH=6                                                            
         MFLD  TRDF16,                                                 +        
               LTH=2                                                            
         MFLD  TRDG16,                                                 +        
               LTH=6                                                            
         MFLD  TRDF17,                                                 +        
               LTH=2                                                            
         MFLD  TRDG17,                                                 +        
               LTH=6                                                            
         MFLD  TRDF18,                                                 +        
               LTH=2                                                            
         MFLD  TRDG18,                                                 +        
               LTH=6                                                            
         MFLD  MFSINFO,                                                +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W6I186N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W6N186),                                           +        
               OPT=2,                                                  +        
               NXT=W6O186N1                                                     
DGI2     LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F9'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '61862',                                                +        
               LTH=5                                                            
         MFLD  (ARTIN,                                                 +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  ARTUT,                                                  +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
