***********************************************************************         
* CREATED BY V063442   ON 02/05/29  AT 15:36                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'FLYTTA KOLLI                    '                               
W6N102   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W6T102U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W6T101  ',                                          +        
               14='W6T102  ',                                          +        
               15='W6T103  ',                                          +        
               16='W6T104  ',                                          +        
               17='W6T105  ',                                          +        
               18='W6T106  ',                                          +        
               19='W6T107  ',                                          +        
               20='W6T108  ',                                          +        
               21='W6T109  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W6N102   DPAGE CURSOR=((2,11))                                                  
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'MOVE CASES',                                           +        
               POS=(1,12),LTH=10,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Trolley',                                              +        
               POS=(2,2),LTH=7,                                        +        
               ATTR=(ALPHA,PROT)                                                
V1       DFLD  POS=(2,11),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Loc',                                                  +        
               POS=(2,16),LTH=3,                                       +        
               ATTR=(PROT)                                                      
PL1      DFLD  POS=(2,21),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Address',                                              +        
               POS=(2,27),LTH=7,                                       +        
               ATTR=(PROT)                                                      
ADR1     DFLD  POS=(2,36),LTH=4,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'DC',                                                   +        
               POS=(2,42),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDDCIN   DFLD  POS=(2,46),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
V2       DFLD  POS=(3,11),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
PL2      DFLD  POS=(3,21),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
ADR2     DFLD  POS=(3,36),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDCUT   DFLD  POS=(3,46),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
V3       DFLD  POS=(4,11),LTH=3,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
PL3      DFLD  POS=(4,21),LTH=4,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
ADR3     DFLD  POS=(4,36),LTH=4,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Supplier',                                             +        
               POS=(5,3),LTH=8,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Case',                                                 +        
               POS=(5,18),LTH=4,                                       +        
               ATTR=(PROT)                                                      
LEV1     DFLD  POS=(6,3),LTH=5,                                        +        
               ATTR=(NOPROT)                                                    
         DFLD  ' ',                                                    +        
               POS=(6,9),LTH=1,                                        +        
               ATTR=(ALPHA)                                                     
KOLLI1   DFLD  POS=(6,13),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(6,23),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
LEV2     DFLD  POS=(7,3),LTH=5,                                        +        
               ATTR=(NOPROT)                                                    
         DFLD  ' ',                                                    +        
               POS=(7,9),LTH=1,                                        +        
               ATTR=(ALPHA)                                                     
KOLLI2   DFLD  POS=(7,13),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(7,23),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
LEV3     DFLD  POS=(8,3),LTH=5,                                        +        
               ATTR=(NOPROT)                                                    
         DFLD  ' ',                                                    +        
               POS=(8,9),LTH=1,                                        +        
               ATTR=(ALPHA)                                                     
KOLLI3   DFLD  POS=(8,13),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(8,23),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
LEV4     DFLD  POS=(9,3),LTH=5,                                        +        
               ATTR=(NOPROT)                                                    
         DFLD  ' ',                                                    +        
               POS=(9,9),LTH=1,                                        +        
               ATTR=(ALPHA)                                                     
KOLLI4   DFLD  POS=(9,13),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(9,23),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
LEV5     DFLD  POS=(10,3),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  ' ',                                                    +        
               POS=(10,9),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
KOLLI5   DFLD  POS=(10,13),LTH=9,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(10,23),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
LEV6     DFLD  POS=(11,3),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  ' ',                                                    +        
               POS=(11,9),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
KOLLI6   DFLD  POS=(11,13),LTH=9,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(11,23),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
LEV7     DFLD  POS=(12,3),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  ' ',                                                    +        
               POS=(12,9),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
KOLLI7   DFLD  POS=(12,13),LTH=9,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(12,23),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
LEV8     DFLD  POS=(13,3),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  ' ',                                                    +        
               POS=(13,9),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
KOLLI8   DFLD  POS=(13,13),LTH=9,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(13,23),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
LEV9     DFLD  POS=(14,3),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  ' ',                                                    +        
               POS=(14,9),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
KOLLI9   DFLD  POS=(14,13),LTH=9,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(14,23),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
LEV10    DFLD  POS=(15,3),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  ' ',                                                    +        
               POS=(15,9),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
KOLLI10  DFLD  POS=(15,13),LTH=9,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(15,23),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
LEV11    DFLD  POS=(16,3),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  ' ',                                                    +        
               POS=(16,9),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
KOLLI11  DFLD  POS=(16,13),LTH=9,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(16,23),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
LEV12    DFLD  POS=(17,3),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  ' ',                                                    +        
               POS=(17,9),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
KOLLI12  DFLD  POS=(17,13),LTH=9,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(17,23),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
LEV13    DFLD  POS=(18,3),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  ' ',                                                    +        
               POS=(18,9),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
KOLLI13  DFLD  POS=(18,13),LTH=9,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(18,23),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
LEV14    DFLD  POS=(19,3),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  ' ',                                                    +        
               POS=(19,9),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
KOLLI14  DFLD  POS=(19,13),LTH=9,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(19,23),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
         DFLD  '13 Adm trolley  14 Move cases   15 Repl label   16 Reg +        
               pick VOR 17 Def steering',                              +        
               POS=(21,2),LTH=79,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 Def location 19 Inq location 20 Inq pre-t ad 21 RR -+        
                Info    10 WHELP',                                     +        
               POS=(22,2),LTH=72,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W6I102N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W6N102),                                           +        
               OPT=2,                                                  +        
               NXT=W6O102N1                                                     
MID      LPAGE SOR=(W6N102)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  ' ',                                                    +        
               LTH=2                                                            
         MFLD  '61022',                                                +        
               LTH=5                                                            
         MFLD  (V1,                                                    +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PL1,                                                   +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (ADR1,                                                  +        
               '++++'),                                                +        
               LTH=4                                                            
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  V2,                                                     +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  PL2,                                                    +        
               LTH=4                                                            
         MFLD  ADR2,                                                   +        
               LTH=4                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  V3,                                                     +        
               LTH=3                                                            
         MFLD  PL3,                                                    +        
               LTH=4                                                            
         MFLD  ADR3,                                                   +        
               LTH=4                                                            
         MFLD  (LEV1,                                                  +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KOLLI1,                                                +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LEV2,                                                  +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KOLLI2,                                                +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LEV3,                                                  +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KOLLI3,                                                +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LEV4,                                                  +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KOLLI4,                                                +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LEV5,                                                  +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KOLLI5,                                                +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LEV6,                                                  +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KOLLI6,                                                +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LEV7,                                                  +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KOLLI7,                                                +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LEV8,                                                  +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KOLLI8,                                                +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LEV9,                                                  +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KOLLI9,                                                +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LEV10,                                                 +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KOLLI10,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LEV11,                                                 +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KOLLI11,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LEV12,                                                 +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KOLLI12,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LEV13,                                                 +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KOLLI13,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LEV14,                                                 +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KOLLI14,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
W6O102N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6N102,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I102N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W6N102                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  V1,                                                     +        
               LTH=3                                                            
         MFLD  PL1,                                                    +        
               LTH=4                                                            
         MFLD  ADR1,                                                   +        
               LTH=4                                                            
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  V2,                                                     +        
               LTH=3                                                            
         MFLD  PL2,                                                    +        
               LTH=4                                                            
         MFLD  ADR2,                                                   +        
               LTH=4                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  V3,                                                     +        
               LTH=3                                                            
         MFLD  PL3,                                                    +        
               LTH=4                                                            
         MFLD  ADR3,                                                   +        
               LTH=4                                                            
         MFLD  LEV1,                                                   +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLI1,                                                 +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  LEV2,                                                   +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLI2,                                                 +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  LEV3,                                                   +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLI3,                                                 +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  LEV4,                                                   +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLI4,                                                 +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  LEV5,                                                   +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLI5,                                                 +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  LEV6,                                                   +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLI6,                                                 +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  LEV7,                                                   +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLI7,                                                 +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  LEV8,                                                   +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLI8,                                                 +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  LEV9,                                                   +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLI9,                                                 +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  LEV10,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLI10,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  LEV11,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLI11,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  LEV12,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLI12,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  LEV13,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLI13,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  LEV14,                                                  +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KOLLI14,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=61                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  FSYSMSG,                                                +        
               LTH=79                                                           
         MSGEND                                                                 
         END                                                                    
