***********************************************************************         
* CREATED BY PC63442   ON 98/08/11  AT 12:25                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W6N161   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W6T161U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W6T161  ',                                          +        
               14='W6T162  ',                                          +        
               15='W6T163  ',                                          +        
               16='W6T164  ',                                          +        
               17='W6T165  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((7,2)),                                         +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'HANDLING CODE REGISTRATION',                           +        
               POS=(1,12),LTH=26,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Part No.',                                             +        
               POS=(5,2),LTH=8,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Handl.code  Fictitious-Q1    Country of origin',       +        
               POS=(5,24),LTH=46,                                      +        
               ATTR=(PROT)                                                      
ART1     DFLD  POS=(7,2),LTH=8,                                        +        
               ATTR=(NUM,NOPROT)                                                
V1       DFLD  POS=(7,30),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
H1       DFLD  POS=(7,46),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
KDARTUR1 DFLD  POS=(7,62),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
ART2     DFLD  POS=(8,2),LTH=8,                                        +        
               ATTR=(NUM,NOPROT)                                                
V2       DFLD  POS=(8,30),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
H2       DFLD  POS=(8,46),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
KDARTUR2 DFLD  POS=(8,62),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
ART3     DFLD  POS=(9,2),LTH=8,                                        +        
               ATTR=(NUM,NOPROT)                                                
V3       DFLD  POS=(9,30),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
H3       DFLD  POS=(9,46),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
KDARTUR3 DFLD  POS=(9,62),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
ART4     DFLD  POS=(10,2),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
V4       DFLD  POS=(10,30),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
H4       DFLD  POS=(10,46),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
KDARTUR4 DFLD  POS=(10,62),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
ART5     DFLD  POS=(11,2),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
V5       DFLD  POS=(11,30),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
H5       DFLD  POS=(11,46),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
KDARTUR5 DFLD  POS=(11,62),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
ART6     DFLD  POS=(12,2),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
V6       DFLD  POS=(12,30),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
H6       DFLD  POS=(12,46),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
KDARTUR6 DFLD  POS=(12,62),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
ART7     DFLD  POS=(13,2),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
V7       DFLD  POS=(13,30),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
H7       DFLD  POS=(13,46),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
KDARTUR7 DFLD  POS=(13,62),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
ART8     DFLD  POS=(14,2),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
V8       DFLD  POS=(14,30),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
H8       DFLD  POS=(14,46),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
KDARTUR8 DFLD  POS=(14,62),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
ART9     DFLD  POS=(15,2),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
V9       DFLD  POS=(15,30),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
H9       DFLD  POS=(15,46),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
KDARTUR9 DFLD  POS=(15,62),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
ART10    DFLD  POS=(16,2),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
V10      DFLD  POS=(16,30),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
H10      DFLD  POS=(16,46),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
FLD1450  DFLD  POS=(16,50),LTH=1,                                      +        
               ATTR=(NUM,NOPROT,NODISP)                                         
KDARTUR0 DFLD  POS=(16,62),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  '13 Handl.cd reg 14 Buffer info  15 Stock reg',         +        
               POS=(21,1),LTH=44,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16 Packing reg  17 Reciev. info18',                    +        
               POS=(21,50),LTH=33,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,33),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W6O161N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6N161,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I161N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  ART1,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  H1,                                                     +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  V1,                                                     +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDARTUR1,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ART2,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  H2,                                                     +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  V2,                                                     +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDARTUR2,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ART3,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  H3,                                                     +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  V3,                                                     +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDARTUR3,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ART4,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  H4,                                                     +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  V4,                                                     +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDARTUR4,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ART5,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  H5,                                                     +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  V5,                                                     +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDARTUR5,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ART6,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  H6,                                                     +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  V6,                                                     +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDARTUR6,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ART7,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  H7,                                                     +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  V7,                                                     +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDARTUR7,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ART8,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  H8,                                                     +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  V8,                                                     +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDARTUR8,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ART9,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  H9,                                                     +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  V9,                                                     +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDARTUR9,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ART10,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  H10,                                                    +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  V10,                                                    +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDARTUR0,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W6I161N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W6N161),                                           +        
               OPT=2,                                                  +        
               NXT=W6O161N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '61612',                                                +        
               LTH=5                                                            
         MFLD  (ART1,                                                  +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (H1,                                                    +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (V1,                                                    +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDARTUR1,                                              +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  (ART2,                                                  +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (H2,                                                    +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (V2,                                                    +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDARTUR2,                                              +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  (ART3,                                                  +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (H3,                                                    +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (V3,                                                    +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDARTUR3,                                              +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  (ART4,                                                  +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (H4,                                                    +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (V4,                                                    +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDARTUR4,                                              +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  (ART5,                                                  +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (H5,                                                    +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (V5,                                                    +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDARTUR5,                                              +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  (ART6,                                                  +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (H6,                                                    +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (V6,                                                    +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDARTUR6,                                              +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  (ART7,                                                  +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (H7,                                                    +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (V7,                                                    +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDARTUR7,                                              +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  (ART8,                                                  +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (H8,                                                    +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (V8,                                                    +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDARTUR8,                                              +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  (ART9,                                                  +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (H9,                                                    +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (V9,                                                    +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDARTUR9,                                              +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  (ART10,                                                 +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (H10,                                                   +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (V10,                                                   +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDARTUR0,                                              +        
               '++'),                                                  +        
               LTH=2                                                            
         MSGEND                                                                 
         END                                                                    
