***********************************************************************         
* CREATED BY V063442   ON 02/10/01  AT 09:15                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'PART MEASUREMENT                '                               
W6N169   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W6T169  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W6T169U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'PART MEASUREMENTS',                                    +        
               POS=(1,12),LTH=16,                                      +        
               ATTR=(PROT)                                                      
MFSFEL   DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Part No.',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(ALPHA,PROT)                                                
ARTIN    DFLD  POS=(2,12),LTH=9,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
ARTUT    DFLD  POS=(3,12),LTH=11,                                      +        
               ATTR=(PROT,MOD)                                                  
ARTBEN   DFLD  POS=(3,25),LTH=25,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Machine values',                                       +        
               POS=(5,2),LTH=14,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Net weight   g',                                       +        
               POS=(6,2),LTH=14,                                       +        
               ATTR=(PROT)                                                      
VKARTNTO DFLD  POS=(6,21),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Gross weight g',                                       +        
               POS=(7,2),LTH=14,                                       +        
               ATTR=(PROT)                                                      
VKART    DFLD  POS=(7,21),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Gross volume cm3',                                     +        
               POS=(8,2),LTH=16,                                       +        
               ATTR=(PROT)                                                      
VLART    DFLD  POS=(8,19),LTH=10,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Net',                                                  +        
               POS=(10,2),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Length cm',                                            +        
               POS=(11,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
LENGTHN  DFLD  POS=(11,12),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Width  cm',                                            +        
               POS=(12,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
WIDTHN   DFLD  POS=(12,12),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Height cm',                                            +        
               POS=(13,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
HEIGHTN  DFLD  POS=(13,12),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Gross',                                                +        
               POS=(15,2),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Length cm',                                            +        
               POS=(16,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
LENGTHB  DFLD  POS=(16,12),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Width  cm',                                            +        
               POS=(17,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
WIDTHB   DFLD  POS=(17,12),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Height cm',                                            +        
               POS=(18,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
HEIGHTB  DFLD  POS=(18,12),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'VSOP     ',                                            +        
               POS=(19,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
VSOP     DFLD  POS=(19,15),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Net weight   g',                                       +        
               POS=(5,40),LTH=14,                                      +        
               ATTR=(PROT)                                                      
NETWUT   DFLD  POS=(5,59),LTH=8,                                       +        
               ATTR=(PROT)                                                      
NETWIN   DFLD  POS=(6,59),LTH=8,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Gross weight g',                                       +        
               POS=(7,40),LTH=14,                                      +        
               ATTR=(PROT)                                                      
GROSSWUT DFLD  POS=(7,59),LTH=8,                                       +        
               ATTR=(PROT)                                                      
GROSSWIN DFLD  POS=(8,59),LTH=8,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Gross volume cm3',                                     +        
               POS=(9,40),LTH=16,                                      +        
               ATTR=(PROT)                                                      
GROSSVUT DFLD  POS=(9,57),LTH=10,                                      +        
               ATTR=(PROT)                                                      
GROSSVIN DFLD  POS=(10,57),LTH=9,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'VSOP',                                                 +        
               POS=(11,40),LTH=4,                                      +        
               ATTR=(PROT)                                                      
VSOPUT   DFLD  POS=(11,45),LTH=3,                                      +        
               ATTR=(PROT)                                                      
VSOPIN   DFLD  POS=(12,45),LTH=3,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'KDP',                                                  +        
               POS=(13,40),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Net weight g',                                         +        
               POS=(14,40),LTH=12,                                     +        
               ATTR=(PROT)                                                      
VKARTKDP DFLD  POS=(14,53),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Amount pcs',                                           +        
               POS=(15,40),LTH=10,                                     +        
               ATTR=(PROT)                                                      
ANTALKDP DFLD  POS=(15,55),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Last update',                                          +        
               POS=(18,40),LTH=14,                                     +        
               ATTR=(PROT)                                                      
USERID   DFLD  POS=(18,55),LTH=8,                                      +        
               ATTR=(PROT)                                                      
UPDDAT   DFLD  POS=(18,64),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Machine update',                                       +        
               POS=(19,40),LTH=14,                                     +        
               ATTR=(PROT)                                                      
MASKDAT  DFLD  POS=(19,64),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP  11 Update  12 Logoff',                       +        
               POS=(22,2),LTH=44,                                      +        
               ATTR=(PROT)                                                      
MFSINFO  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NOPROT,MOD)                                                
         FMTEND                                                                 
W6O169N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6N169,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I169N1,                                           +        
               FILL=PT                                                          
DGI1     LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  MFSFEL,                                                 +        
               LTH=40                                                           
         MFLD  ARTIN,                                                  +        
               LTH=9                                                            
         MFLD  ARTUT,                                                  +        
               LTH=11                                                           
         MFLD  ARTBEN,                                                 +        
               LTH=25                                                           
         MFLD  VKARTNTO,                                               +        
               LTH=8                                                            
         MFLD  VKART,                                                  +        
               LTH=8                                                            
         MFLD  VLART,                                                  +        
               LTH=10                                                           
         MFLD  LENGTHN,                                                +        
               LTH=6                                                            
         MFLD  WIDTHN,                                                 +        
               LTH=6                                                            
         MFLD  HEIGHTN,                                                +        
               LTH=6                                                            
         MFLD  LENGTHB,                                                +        
               LTH=6                                                            
         MFLD  WIDTHB,                                                 +        
               LTH=6                                                            
         MFLD  HEIGHTB,                                                +        
               LTH=6                                                            
         MFLD  VSOP,                                                   +        
               LTH=3                                                            
         MFLD  NETWUT,                                                 +        
               LTH=8                                                            
         MFLD  NETWIN,                                                 +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  GROSSWUT,                                               +        
               LTH=8                                                            
         MFLD  GROSSWIN,                                               +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  GROSSVUT,                                               +        
               LTH=10                                                           
         MFLD  GROSSVIN,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  VSOPUT,                                                 +        
               LTH=3                                                            
         MFLD  VSOPIN,                                                 +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VKARTKDP,                                               +        
               LTH=8                                                            
         MFLD  ANTALKDP,                                               +        
               LTH=6                                                            
         MFLD  USERID,                                                 +        
               LTH=8                                                            
         MFLD  UPDDAT,                                                 +        
               LTH=6                                                            
         MFLD  MASKDAT,                                                +        
               LTH=6                                                            
         MFLD  MFSINFO,                                                +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W6I169N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W6N169),                                           +        
               OPT=2,                                                  +        
               NXT=W6O169N1                                                     
DGI2     LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F9'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '61692',                                                +        
               LTH=5                                                            
         MFLD  (ARTIN,                                                 +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  ARTUT,                                                  +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (NETWIN,                                                +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (GROSSWIN,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (GROSSVIN,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (VSOPIN,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
