***********************************************************************         
* CREATED BY V063442   ON 02/05/29  AT 17:42                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'TA BORT KOLLIN                  '                               
W6N135   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W6T135U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W6T131  ',                                          +        
               14='W6T132  ',                                          +        
               15='W6T133  ',                                          +        
               16='W0T501  ',                                          +        
               17='W6T135  ',                                          +        
               18='W6T136  ',                                          +        
               19='W6T137  ',                                          +        
               20='W0T501  ',                                          +        
               21='W6T139  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W6N135   DPAGE CURSOR=((2,6)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DELETE CASES',                                         +        
               POS=(1,11),LTH=12,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'DC',                                                   +        
               POS=(2,2),LTH=2,                                        +        
               ATTR=(NUM,PROT)                                                  
IDDCIN   DFLD  POS=(2,6),LTH=2,                                        +        
               ATTR=(NOPROT)                                                    
IDDCUT   DFLD  POS=(3,6),LTH=2,                                        +        
               ATTR=(PROT,MOD)                                                  
IDLOPNRI DFLD  POS=(4,55),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Suppl   Case No.    Suppl   Case No.',                 +        
               POS=(5,2),LTH=36,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Seq No.',                                              +        
               POS=(5,47),LTH=7,                                       +        
               ATTR=(PROT)                                                      
IDLOPNRU DFLD  POS=(5,55),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
IDLEVNR1 DFLD  POS=(6,2),LTH=5,                                        +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(6,8),LTH=1,                                        +        
               ATTR=(ALPHA)                                                     
DGIA0032 DFLD  POS=(6,10),LTH=9,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(6,20),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
IDLEVNR2 DFLD  POS=(6,22),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(6,28),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
DGIA0043 DFLD  POS=(6,30),LTH=9,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(6,40),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
IDLEVNR3 DFLD  POS=(7,2),LTH=5,                                        +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(7,8),LTH=1,                                        +        
               ATTR=(ALPHA)                                                     
DGIA0053 DFLD  POS=(7,10),LTH=9,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(7,20),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
IDLEVNR4 DFLD  POS=(7,22),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(7,28),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
DGIA0054 DFLD  POS=(7,30),LTH=9,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(7,40),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
IDLEVNR5 DFLD  POS=(8,2),LTH=5,                                        +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(8,8),LTH=1,                                        +        
               ATTR=(ALPHA)                                                     
DGIA0055 DFLD  POS=(8,10),LTH=9,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(8,20),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
IDLEVNR6 DFLD  POS=(8,22),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(8,28),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
DGIA0056 DFLD  POS=(8,30),LTH=9,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(8,40),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
IDLEVNR7 DFLD  POS=(9,2),LTH=5,                                        +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(9,8),LTH=1,                                        +        
               ATTR=(ALPHA)                                                     
DGIA0057 DFLD  POS=(9,10),LTH=9,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(9,20),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
IDLEVNR8 DFLD  POS=(9,22),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(9,28),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
DGIA0058 DFLD  POS=(9,30),LTH=9,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(9,40),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
IDLEVNR9 DFLD  POS=(10,2),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(10,8),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
DGIA0059 DFLD  POS=(10,10),LTH=9,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(10,20),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
DGIA0011 DFLD  POS=(10,22),LTH=5,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(10,28),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
DGIA0033 DFLD  POS=(10,30),LTH=9,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(10,40),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
DGIA0012 DFLD  POS=(11,2),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(11,8),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
DGIA0034 DFLD  POS=(11,10),LTH=9,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(11,20),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
DGIA0013 DFLD  POS=(11,22),LTH=5,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(11,28),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
DGIA0035 DFLD  POS=(11,30),LTH=9,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(11,40),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
DGIA0014 DFLD  POS=(12,2),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(12,8),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
DGIA0036 DFLD  POS=(12,10),LTH=9,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(12,20),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
DGIA0015 DFLD  POS=(12,22),LTH=5,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(12,28),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
DGIA0037 DFLD  POS=(12,30),LTH=9,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(12,40),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
DGIA0016 DFLD  POS=(13,2),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(13,8),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
DGIA0038 DFLD  POS=(13,10),LTH=9,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(13,20),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
DGIA0017 DFLD  POS=(13,22),LTH=5,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(13,28),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
DGIA0039 DFLD  POS=(13,30),LTH=9,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(13,40),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
DGIA0018 DFLD  POS=(14,2),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(14,8),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
DGIA0040 DFLD  POS=(14,10),LTH=9,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(14,20),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
DGIA0019 DFLD  POS=(14,22),LTH=5,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(14,28),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
DGIA0041 DFLD  POS=(14,30),LTH=9,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(14,40),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
DGIA0020 DFLD  POS=(15,2),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(15,8),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
DGIA0042 DFLD  POS=(15,10),LTH=9,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(15,20),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
DGIA0021 DFLD  POS=(15,22),LTH=5,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(15,28),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
DGIA0044 DFLD  POS=(15,30),LTH=9,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(15,40),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
DGIA0022 DFLD  POS=(16,2),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(16,8),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
DGIA0045 DFLD  POS=(16,10),LTH=9,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(16,20),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
DGIA0023 DFLD  POS=(16,22),LTH=5,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(16,28),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
DGIA0046 DFLD  POS=(16,30),LTH=9,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(16,40),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
DGIA0024 DFLD  POS=(17,2),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(17,8),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
DGIA0047 DFLD  POS=(17,10),LTH=9,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(17,20),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
DGIA0025 DFLD  POS=(17,22),LTH=5,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(17,28),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
DGIA0048 DFLD  POS=(17,30),LTH=9,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(17,40),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
DGIA0026 DFLD  POS=(18,2),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(18,8),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
DGIA0049 DFLD  POS=(18,10),LTH=9,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(18,20),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
DGIA0027 DFLD  POS=(18,22),LTH=5,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  ' ',                                                    +        
               POS=(18,28),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
DGIA0050 DFLD  POS=(18,30),LTH=9,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  ' ',                                                    +        
               POS=(18,40),LTH=1,                                      +        
               ATTR=(ALPHA)                                                     
DGIA0028 DFLD  POS=(19,2),LTH=5,                                       +        
               ATTR=(NOPROT,MOD)                                                
DGIA0051 DFLD  POS=(19,10),LTH=9,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
DGIA0029 DFLD  POS=(19,22),LTH=5,                                      +        
               ATTR=(NOPROT,MOD)                                                
DGIA0052 DFLD  POS=(19,30),LTH=9,                                      +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Approved (Y/N)',                                       +        
               POS=(19,41),LTH=14,                                     +        
               ATTR=(PROT)                                                      
FLGODK   DFLD  POS=(19,56),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
KBEFTTIN DFLD  POS=(19,61),LTH=2,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
KBEFTTUT DFLD  POS=(19,64),LTH=2,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0003 DFLD  POS=(20,2),LTH=4,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0007 DFLD  POS=(20,7),LTH=3,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0008 DFLD  POS=(20,11),LTH=3,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0000 DFLD  POS=(20,15),LTH=4,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0004 DFLD  POS=(20,20),LTH=4,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0001 DFLD  POS=(20,25),LTH=4,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0002 DFLD  POS=(20,30),LTH=4,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0060 DFLD  POS=(20,35),LTH=1,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0061 DFLD  POS=(20,37),LTH=1,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KBEFTFIN DFLD  POS=(20,39),LTH=2,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
KBEFTFUT DFLD  POS=(20,42),LTH=2,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0005 DFLD  POS=(20,45),LTH=1,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0006 DFLD  POS=(20,47),LTH=1,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0009 DFLD  POS=(20,49),LTH=5,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0010 DFLD  POS=(20,55),LTH=5,                                      +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0030 DFLD  POS=(20,61),LTH=9,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
DGIA0031 DFLD  POS=(20,71),LTH=9,                                      +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         DFLD  '13 Case trolley 14 Case queue   15 Act batch    16',   +        
               POS=(21,2),LTH=50,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17 Delete case',                                       +        
               POS=(21,66),LTH=14,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '18 Create case  19 Mixed case   20',                   +        
               POS=(22,2),LTH=34,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21 Receiving c  10 Whelp',                             +        
               POS=(22,50),LTH=24,                                     +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W6O135N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6N135,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I135N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W6N135,                                             +        
               NXT=W6I135N1                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  IDLOPNRI,                                               +        
               LTH=9                                                            
         MFLD  IDLOPNRU,                                               +        
               LTH=9                                                            
         MFLD  IDLEVNR1,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0032,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVNR2,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0043,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVNR3,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0053,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVNR4,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0054,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVNR5,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0055,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVNR6,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0056,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVNR7,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0057,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVNR8,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0058,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDLEVNR9,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0059,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0011,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0033,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0012,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0034,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0013,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0035,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0014,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0036,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0015,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0037,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0016,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0038,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0017,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0039,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0018,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0040,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0019,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0041,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0020,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0042,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0021,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0044,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0022,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0045,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0023,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0046,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0024,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0047,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0025,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0048,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0026,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0049,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0027,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0050,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0028,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0051,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0029,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0052,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLGODK,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0003,                                               +        
               LTH=4                                                            
         MFLD  DGIA0007,                                               +        
               LTH=3                                                            
         MFLD  DGIA0008,                                               +        
               LTH=3                                                            
         MFLD  DGIA0000,                                               +        
               LTH=4                                                            
         MFLD  DGIA0004,                                               +        
               LTH=4                                                            
         MFLD  DGIA0001,                                               +        
               LTH=4                                                            
         MFLD  DGIA0002,                                               +        
               LTH=4                                                            
         MFLD  DGIA0060,                                               +        
               LTH=1                                                            
         MFLD  DGIA0061,                                               +        
               LTH=1                                                            
         MFLD  KBEFTFIN,                                               +        
               LTH=2                                                            
         MFLD  KBEFTFUT,                                               +        
               LTH=2                                                            
         MFLD  KBEFTTIN,                                               +        
               LTH=2                                                            
         MFLD  KBEFTTUT,                                               +        
               LTH=2                                                            
         MFLD  DGIA0005,                                               +        
               LTH=1                                                            
         MFLD  DGIA0006,                                               +        
               LTH=1                                                            
         MFLD  DGIA0009,                                               +        
               LTH=5                                                            
         MFLD  DGIA0010,                                               +        
               LTH=5                                                            
         MFLD  DGIA0030,                                               +        
               LTH=9                                                            
         MFLD  DGIA0031,                                               +        
               LTH=9                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=61                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W6I135N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W6N135),                                           +        
               OPT=2,                                                  +        
               NXT=W6O135N1                                                     
MID      LPAGE SOR=(W6N135),                                           +        
               NXT=W6I135N1                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '61352',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0003,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0007,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0008,                                               +        
               LTH=3                                                            
         MFLD  (DGIA0000,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0004,                                               +        
               LTH=4                                                            
         MFLD  (DGIA0001,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0002,                                               +        
               LTH=4                                                            
         MFLD  (DGIA0060,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0061,                                               +        
               LTH=1                                                            
         MFLD  (KBEFTFIN,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  KBEFTFUT,                                               +        
               LTH=2                                                            
         MFLD  (KBEFTTIN,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  KBEFTTUT,                                               +        
               LTH=2                                                            
         MFLD  (DGIA0005,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  DGIA0006,                                               +        
               LTH=1                                                            
         MFLD  (DGIA0009,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0010,                                               +        
               LTH=5                                                            
         MFLD  (DGIA0030,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0031,                                               +        
               LTH=9                                                            
         MFLD  (IDLOPNRI,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLOPNRU,                                              +        
               '         '),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDCUT,                                                 +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLEVNR1,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0032,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLEVNR2,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0043,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLEVNR3,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0053,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLEVNR4,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0054,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLEVNR5,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0055,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLEVNR6,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0056,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLEVNR7,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0057,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLEVNR8,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0058,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDLEVNR9,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0059,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0011,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0033,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0012,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0034,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0013,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0035,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0014,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0036,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0015,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0037,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0016,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0038,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0017,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0039,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0018,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0040,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0019,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0041,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0020,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0042,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0021,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0044,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0022,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0045,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0023,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0046,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0024,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0047,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0025,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0048,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0026,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0049,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0027,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0050,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0028,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0051,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0029,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DGIA0052,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLGODK,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
