***********************************************************************         
* CREATED BY V059625   ON 06/02/17  AT 13:45                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'PARTS INFO. QUALITY             '                               
W6N211   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W6T211 7',                                           +        
               8='W6T211 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W6T211U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W6T211  ',                                          +        
               14='W6T212   ',                                         +        
               15='W6T213   ',                                         +        
               16='W6T214   ',                                         +        
               17='W6T215   ',                                         +        
               18='W0T501   ',                                         +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W6T211V ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W6N211   DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Parts info. Quality',                                  +        
               POS=(1,12),LTH=19,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Part no.',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDARTNRI DFLD  POS=(2,12),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(2,22),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
IDLEVNRI DFLD  POS=(2,29),LTH=5,                                       +        
               ATTR=(PROT)                                                      
IDKVAINI DFLD  POS=(2,38),LTH=2,                                       +        
               ATTR=(PROT)                                                      
REGDATI  DFLD  POS=(2,48),LTH=6,                                       +        
               ATTR=(PROT)                                                      
KDKVAINI DFLD  POS=(2,59),LTH=1,                                       +        
               ATTR=(PROT)                                                      
IDARTNRU DFLD  POS=(3,12),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
IDLEVNRU DFLD  POS=(3,29),LTH=5,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
IDKVAINU DFLD  POS=(3,38),LTH=2,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
REGDATU  DFLD  POS=(3,48),LTH=6,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
KDKVAINU DFLD  POS=(3,59),LTH=1,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
FORDENTE DFLD  POS=(4,2),LTH=3,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
FORDNEXT DFLD  POS=(4,6),LTH=3,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
OMBRENTE DFLD  POS=(4,10),LTH=6,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
OMBRNEXT DFLD  POS=(4,20),LTH=6,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Eng desc.',                                            +        
               POS=(5,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
BENENG   DFLD  POS=(5,13),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Stock Bal.',                                           +        
               POS=(5,41),LTH=10,                                      +        
               ATTR=(PROT)                                                      
LS       DFLD  POS=(5,52),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Adv.Bal.CDC',                                          +        
               POS=(5,61),LTH=11,                                      +        
               ATTR=(PROT)                                                      
AKSCDC   DFLD  POS=(5,73),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Swe desc.',                                            +        
               POS=(6,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
BENSWE   DFLD  POS=(6,13),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'A.B.on road',                                          +        
               POS=(6,61),LTH=11,                                      +        
               ATTR=(PROT)                                                      
AKSPAV   DFLD  POS=(6,73),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Supplier',                                             +        
               POS=(7,2),LTH=8,                                        +        
               ATTR=(PROT)                                                      
IDLEVNR  DFLD  POS=(7,17),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Backorder',                                            +        
               POS=(7,41),LTH=9,                                       +        
               ATTR=(PROT)                                                      
RESTORD  DFLD  POS=(7,52),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'A.B.ST Born',                                          +        
               POS=(7,61),LTH=11,                                      +        
               ATTR=(PROT)                                                      
AKSTBORN DFLD  POS=(7,73),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Procurer',                                             +        
               POS=(8,2),LTH=8,                                        +        
               ATTR=(PROT)                                                      
ANSKAFF  DFLD  POS=(8,19),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Func.grp.',                                            +        
               POS=(8,25),LTH=9,                                       +        
               ATTR=(PROT)                                                      
FKNGRP   DFLD  POS=(8,35),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Fc-sep',                                               +        
               POS=(8,41),LTH=6,                                       +        
               ATTR=(PROT)                                                      
KVPBS1   DFLD  POS=(8,48),LTH=10,                                      +        
               ATTR=(PROT)                                                      
KVPBS2   DFLD  POS=(8,59),LTH=10,                                      +        
               ATTR=(PROT)                                                      
KVPBS3   DFLD  POS=(8,70),LTH=10,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Parts planner',                                        +        
               POS=(9,2),LTH=13,                                       +        
               ATTR=(PROT)                                                      
BEREDARE DFLD  POS=(9,19),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Sort code',                                            +        
               POS=(9,25),LTH=9,                                       +        
               ATTR=(PROT)                                                      
SORT     DFLD  POS=(9,37),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Fc-kit',                                               +        
               POS=(9,41),LTH=6,                                       +        
               ATTR=(PROT)                                                      
KVPBSATS DFLD  POS=(9,51),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Comm. part',                                           +        
               POS=(9,61),LTH=10,                                      +        
               ATTR=(PROT)                                                      
FLGEMART DFLD  POS=(9,79),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Std price',                                            +        
               POS=(10,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
STDPRIS  DFLD  POS=(10,12),LTH=10,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Pack type',                                            +        
               POS=(10,25),LTH=9,                                      +        
               ATTR=(PROT)                                                      
FÖRPTYP  DFLD  POS=(10,36),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Address',                                              +        
               POS=(10,41),LTH=7,                                      +        
               ATTR=(PROT)                                                      
CLPLATS  DFLD  POS=(10,51),LTH=11,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Drawing',                                              +        
               POS=(11,2),LTH=7,                                       +        
               ATTR=(PROT)                                                      
RITNNR   DFLD  POS=(11,12),LTH=10,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Supers.code',                                          +        
               POS=(11,41),LTH=11,                                     +        
               ATTR=(PROT)                                                      
ERSKOD   DFLD  POS=(11,57),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Vehicle type',                                         +        
               POS=(12,2),LTH=12,                                      +        
               ATTR=(PROT)                                                      
IDKAT1   DFLD  POS=(12,15),LTH=5,                                      +        
               ATTR=(PROT)                                                      
IDKAT2   DFLD  POS=(12,21),LTH=5,                                      +        
               ATTR=(PROT)                                                      
IDKAT3   DFLD  POS=(12,27),LTH=5,                                      +        
               ATTR=(PROT)                                                      
IDKAT4   DFLD  POS=(12,33),LTH=5,                                      +        
               ATTR=(PROT)                                                      
IDKAT5   DFLD  POS=(12,39),LTH=5,                                      +        
               ATTR=(PROT)                                                      
IDKAT6   DFLD  POS=(12,45),LTH=5,                                      +        
               ATTR=(PROT)                                                      
IDKAT7   DFLD  POS=(12,51),LTH=5,                                      +        
               ATTR=(PROT)                                                      
IDKAT8   DFLD  POS=(12,57),LTH=5,                                      +        
               ATTR=(PROT)                                                      
IDKAT9   DFLD  POS=(12,63),LTH=5,                                      +        
               ATTR=(PROT)                                                      
IDKAT10  DFLD  POS=(12,69),LTH=5,                                      +        
               ATTR=(PROT)                                                      
IDKAT11  DFLD  POS=(12,75),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Planning notes',                                       +        
               POS=(13,2),LTH=14,                                      +        
               ATTR=(PROT)                                                      
BEREDNOT DFLD  POS=(13,22),LTH=40,                                     +        
               ATTR=(PROT)                                                      
BERNOT7  DFLD  POS=(14,22),LTH=40,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Surf.code',                                            +        
               POS=(15,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
YTBEH1   DFLD  POS=(15,12),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
YTBEH2   DFLD  POS=(15,15),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Dang.code',                                            +        
               POS=(15,18),LTH=9,                                      +        
               ATTR=(ALPHA,PROT)                                                
FARLGOD1 DFLD  POS=(15,28),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
FARLGOD2 DFLD  POS=(15,30),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Samp.inst',                                            +        
               POS=(15,32),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
LIKARE1  DFLD  POS=(15,42),LTH=9,                                      +        
               ATTR=(NOPROT)                                                    
LIKARE2  DFLD  POS=(15,52),LTH=9,                                      +        
               ATTR=(NOPROT)                                                    
LIKARE3  DFLD  POS=(15,62),LTH=9,                                      +        
               ATTR=(NOPROT)                                                    
LIKARE4  DFLD  POS=(15,72),LTH=9,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Block code',                                           +        
               POS=(16,2),LTH=10,                                      +        
               ATTR=(ALPHA,PROT)                                                
SPÄRRKO2 DFLD  POS=(16,13),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Note (date/name)',                                     +        
               POS=(16,19),LTH=16,                                     +        
               ATTR=(PROT)                                                      
SPÄRRNOT DFLD  POS=(16,38),LTH=40,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Inspection type',                                      +        
               POS=(17,2),LTH=15,                                      +        
               ATTR=(PROT)                                                      
KONTTYP  DFLD  POS=(17,20),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
KONTROLL DFLD  POS=(17,22),LTH=30,                                     +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Samp.plan prim.',                                      +        
               POS=(18,2),LTH=15,                                      +        
               ATTR=(PROT)                                                      
PROVPRIM DFLD  POS=(18,20),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Qual.hist.',                                           +        
               POS=(18,43),LTH=10,                                     +        
               ATTR=(PROT)                                                      
KVALHIST DFLD  POS=(18,56),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Type',                                                 +        
               POS=(18,60),LTH=4,                                      +        
               ATTR=(PROT)                                                      
TYP      DFLD  POS=(18,66),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'ISA',                                                  +        
               POS=(18,69),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLUPG    DFLD  POS=(18,73),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TIUPG    DFLD  POS=(18,75),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  '-"-    second.',                                       +        
               POS=(19,3),LTH=14,                                      +        
               ATTR=(PROT)                                                      
PROVSEK  DFLD  POS=(19,20),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Insp.report',                                          +        
               POS=(19,43),LTH=11,                                     +        
               ATTR=(PROT)                                                      
KRAPP    DFLD  POS=(19,56),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'TPD',                                                  +        
               POS=(19,69),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KDTPD    DFLD  POS=(19,73),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TITPD    DFLD  POS=(19,75),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Docum./Loc.',                                          +        
               POS=(20,2),LTH=11,                                      +        
               ATTR=(NUM,PROT)                                                  
ULAG     DFLD  POS=(20,20),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
PLATS    DFLD  POS=(20,22),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
UNDERLAG DFLD  POS=(20,25),LTH=30,                                     +        
               ATTR=(NUM,PROT)                                                  
         DFLD  '13 Parts info.  14 Parts hist.  15 Planning',          +        
               POS=(21,2),LTH=43,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W6O211N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6N211,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I211N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W6N211                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDARTNRI,                                               +        
               LTH=2                                                            
         MFLD  IDARTNRU,                                               +        
               LTH=9                                                            
         MFLD  IDLEVNRI,                                               +        
               LTH=2                                                            
         MFLD  IDLEVNRU,                                               +        
               LTH=5                                                            
         MFLD  IDKVAINI,                                               +        
               LTH=2                                                            
         MFLD  IDKVAINU,                                               +        
               LTH=2                                                            
         MFLD  REGDATI,                                                +        
               LTH=2                                                            
         MFLD  REGDATU,                                                +        
               LTH=6                                                            
         MFLD  KDKVAINI,                                               +        
               LTH=2                                                            
         MFLD  KDKVAINU,                                               +        
               LTH=1                                                            
         MFLD  FORDENTE,                                               +        
               LTH=3                                                            
         MFLD  FORDNEXT,                                               +        
               LTH=3                                                            
         MFLD  OMBRENTE,                                               +        
               LTH=6                                                            
         MFLD  OMBRNEXT,                                               +        
               LTH=6                                                            
         MFLD  BENSWE,                                                 +        
               LTH=25                                                           
         MFLD  LS,                                                     +        
               LTH=7                                                            
         MFLD  BENENG,                                                 +        
               LTH=25                                                           
         MFLD  AKSCDC,                                                 +        
               LTH=7                                                            
         MFLD  AKSPAV,                                                 +        
               LTH=7                                                            
         MFLD  AKSTBORN,                                               +        
               LTH=7                                                            
         MFLD  IDLEVNR,                                                +        
               LTH=5                                                            
         MFLD  RESTORD,                                                +        
               LTH=7                                                            
         MFLD  ANSKAFF,                                                +        
               LTH=3                                                            
         MFLD  FKNGRP,                                                 +        
               LTH=4                                                            
         MFLD  KVPBS1,                                                 +        
               LTH=10                                                           
         MFLD  KVPBS2,                                                 +        
               LTH=10                                                           
         MFLD  KVPBS3,                                                 +        
               LTH=10                                                           
         MFLD  BEREDARE,                                               +        
               LTH=3                                                            
         MFLD  SORT,                                                   +        
               LTH=2                                                            
         MFLD  KVPBSATS,                                               +        
               LTH=8                                                            
         MFLD  FLGEMART,                                               +        
               LTH=1                                                            
         MFLD  STDPRIS,                                                +        
               LTH=10                                                           
         MFLD  FÖRPTYP,                                                +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CLPLATS,                                                +        
               LTH=11                                                           
         MFLD  RITNNR,                                                 +        
               LTH=10                                                           
         MFLD  ERSKOD,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKAT1,                                                 +        
               LTH=5                                                            
         MFLD  IDKAT2,                                                 +        
               LTH=5                                                            
         MFLD  IDKAT3,                                                 +        
               LTH=5                                                            
         MFLD  IDKAT4,                                                 +        
               LTH=5                                                            
         MFLD  IDKAT5,                                                 +        
               LTH=5                                                            
         MFLD  IDKAT6,                                                 +        
               LTH=5                                                            
         MFLD  IDKAT7,                                                 +        
               LTH=5                                                            
         MFLD  IDKAT8,                                                 +        
               LTH=5                                                            
         MFLD  IDKAT9,                                                 +        
               LTH=5                                                            
         MFLD  IDKAT10,                                                +        
               LTH=5                                                            
         MFLD  IDKAT11,                                                +        
               LTH=5                                                            
         MFLD  BEREDNOT,                                               +        
               LTH=40                                                           
         MFLD  BERNOT7,                                                +        
               LTH=40                                                           
         MFLD  YTBEH1,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  YTBEH2,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FARLGOD1,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FARLGOD2,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LIKARE1,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  LIKARE2,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  LIKARE3,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  LIKARE4,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  SPÄRRKO2,                                               +        
               LTH=2                                                            
         MFLD  SPÄRRNOT,                                               +        
               LTH=40                                                           
         MFLD  KONTTYP,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KONTROLL,                                               +        
               LTH=32,                                                 +        
               ATTR=(YES)                                                       
         MFLD  PROVPRIM,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVALHIST,                                               +        
               LTH=1                                                            
         MFLD  TYP,                                                    +        
               LTH=1                                                            
         MFLD  FLUPG,                                                  +        
               LTH=1                                                            
         MFLD  TIUPG,                                                  +        
               LTH=6                                                            
         MFLD  PROVSEK,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KRAPP,                                                  +        
               LTH=1                                                            
         MFLD  KDTPD,                                                  +        
               LTH=1                                                            
         MFLD  TITPD,                                                  +        
               LTH=6                                                            
         MFLD  ULAG,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PLATS,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  UNDERLAG,                                               +        
               LTH=32,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  FSYSMSG,                                                +        
               LTH=79                                                           
         MSGEND                                                                 
W6I211N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W6N211),                                           +        
               OPT=2,                                                  +        
               NXT=W6O211N1                                                     
MID      LPAGE SOR=(W6N211)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS1,                                              +        
               '6'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS2,                                              +        
               '2'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  (IDTRANS3,                                              +        
               '1'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  (IDTRANS4,                                              +        
               '1'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '62112',                                                +        
               LTH=5                                                            
         MFLD  (IDARTNRI,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDARTNRU,                                               +        
               LTH=9,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDLEVNRI,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  IDLEVNRU,                                               +        
               LTH=5,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDKVAINI,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDKVAINU,                                               +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (REGDATI,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  REGDATU,                                                +        
               LTH=6,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDKVAINI,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  KDKVAINU,                                               +        
               LTH=1                                                            
         MFLD  FORDENTE,                                               +        
               LTH=3                                                            
         MFLD  FORDNEXT,                                               +        
               LTH=3                                                            
         MFLD  OMBRENTE,                                               +        
               LTH=6                                                            
         MFLD  OMBRNEXT,                                               +        
               LTH=6                                                            
         MFLD  (YTBEH1,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FARLGOD1,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LIKARE1,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (LIKARE2,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (LIKARE3,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (LIKARE4,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KONTTYP,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PROVPRIM,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PROVSEK,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ULAG,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (PLATS,                                                 +        
               '++'),                                                  +        
               LTH=2                                                            
         MSGEND                                                                 
         END                                                                    
