***********************************************************************         
* CREATED BY V065708   ON 08/01/15  AT 16:31                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'SUMMARY OF STOCK CHECK ANSWERS  '                               
W6N215   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W6T215 7',                                           +        
               8='W6T215 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W6T215U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W6T211  ',                                          +        
               14='W6T212  ',                                          +        
               15='W6T213  ',                                          +        
               16='W6T214  ',                                          +        
               17='W6T215  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W6N215   DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'SUMMARY STOCK CHECK ANSWERS',                          +        
               POS=(1,12),LTH=27,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Part no.',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDARTNRI DFLD  POS=(2,12),LTH=9,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'No.',                                                  +        
               POS=(2,22),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
IDKVAINI DFLD  POS=(2,26),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Reg.date',                                             +        
               POS=(2,29),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
TIREGDAI DFLD  POS=(2,39),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,46),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
IDDCIN   DFLD  POS=(2,49),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Show All',                                             +        
               POS=(2,52),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
SHOWIN   DFLD  POS=(2,61),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDARTNRU DFLD  POS=(3,12),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
IDKVAINU DFLD  POS=(3,26),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
TIREGDAU DFLD  POS=(3,39),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDCUT   DFLD  POS=(3,49),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
SHOWUT   DFLD  POS=(3,61),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
REGDAT9E DFLD  POS=(4,2),LTH=7,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
KLOCK9E  DFLD  POS=(4,10),LTH=9,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
REGDAT9N DFLD  POS=(4,20),LTH=7,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
KLOCK9N  DFLD  POS=(4,28),LTH=9,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
LV2IDDC  DFLD  POS=(4,38),LTH=2,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
LV3IDDC  DFLD  POS=(4,41),LTH=2,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
         DFLD  'DC Start  Finish Tot-Qty DevQty ScrQty RetQty AdjQty Re+        
               s Stock Code   Qty L R T',                              +        
               POS=(5,2),LTH=79,                                       +        
               ATTR=(PROT)                                                      
DC11     DFLD  POS=(6,2),LTH=2,                                        +        
               ATTR=(PROT,MOD)                                                  
START01  DFLD  POS=(6,5),LTH=6,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
STOPP01  DFLD  POS=(6,12),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KVANT01  DFLD  POS=(6,19),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KVAVV01  DFLD  POS=(6,27),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
SKROT01  DFLD  POS=(6,34),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KVRET01  DFLD  POS=(6,41),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KVJUST01 DFLD  POS=(6,48),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
RESP01   DFLD  POS=(6,55),LTH=3,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KVLS01   DFLD  POS=(6,59),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
CODE01   DFLD  POS=(6,66),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
SPARR01  DFLD  POS=(6,69),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
FLLEV01  DFLD  POS=(6,76),LTH=1,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
FLFIN01  DFLD  POS=(6,78),LTH=1,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
INFO01   DFLD  POS=(6,80),LTH=1,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DC02     DFLD  POS=(7,2),LTH=2,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
START02  DFLD  POS=(7,5),LTH=6,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
STOPP02  DFLD  POS=(7,12),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KVANT02  DFLD  POS=(7,19),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KVAVV02  DFLD  POS=(7,27),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
SKROT02  DFLD  POS=(7,34),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KVRET02  DFLD  POS=(7,41),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KVJUST02 DFLD  POS=(7,48),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
RESP02   DFLD  POS=(7,55),LTH=3,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KVLS02   DFLD  POS=(7,59),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
CODE02   DFLD  POS=(7,66),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
SPARR02  DFLD  POS=(7,69),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
FLLEV02  DFLD  POS=(7,76),LTH=1,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
FLFIN02  DFLD  POS=(7,78),LTH=1,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
INFO02   DFLD  POS=(7,80),LTH=1,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DC03     DFLD  POS=(8,2),LTH=2,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
START03  DFLD  POS=(8,5),LTH=6,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
STOPP03  DFLD  POS=(8,12),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KVANT03  DFLD  POS=(8,19),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KVAVV03  DFLD  POS=(8,27),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
SKROT03  DFLD  POS=(8,34),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KVRET03  DFLD  POS=(8,41),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KVJUST03 DFLD  POS=(8,48),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
RESP03   DFLD  POS=(8,55),LTH=3,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KVLS03   DFLD  POS=(8,59),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
CODE03   DFLD  POS=(8,66),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
SPARR03  DFLD  POS=(8,69),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
FLLEV03  DFLD  POS=(8,76),LTH=1,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
FLFIN03  DFLD  POS=(8,78),LTH=1,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
INFO03   DFLD  POS=(8,80),LTH=1,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DC04     DFLD  POS=(9,2),LTH=2,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
START04  DFLD  POS=(9,5),LTH=6,                                        +        
               ATTR=(NUM,PROT,MOD)                                              
STOPP04  DFLD  POS=(9,12),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KVANT04  DFLD  POS=(9,19),LTH=7,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KVAVV04  DFLD  POS=(9,27),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
SKROT04  DFLD  POS=(9,34),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KVRET04  DFLD  POS=(9,41),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KVJUST04 DFLD  POS=(9,48),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
RESP04   DFLD  POS=(9,55),LTH=3,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
KVLS04   DFLD  POS=(9,59),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
CODE04   DFLD  POS=(9,66),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
SPARR04  DFLD  POS=(9,69),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
FLLEV04  DFLD  POS=(9,76),LTH=1,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
FLFIN04  DFLD  POS=(9,78),LTH=1,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
INFO04   DFLD  POS=(9,80),LTH=1,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
DC05     DFLD  POS=(10,2),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
START05  DFLD  POS=(10,5),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
STOPP05  DFLD  POS=(10,12),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KVANT05  DFLD  POS=(10,19),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KVAVV05  DFLD  POS=(10,27),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
SKROT05  DFLD  POS=(10,34),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KVRET05  DFLD  POS=(10,41),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KVJUST05 DFLD  POS=(10,48),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
RESP05   DFLD  POS=(10,55),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KVLS05   DFLD  POS=(10,59),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CODE05   DFLD  POS=(10,66),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
SPARR05  DFLD  POS=(10,69),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FLLEV05  DFLD  POS=(10,76),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FLFIN05  DFLD  POS=(10,78),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
INFO05   DFLD  POS=(10,80),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DC06     DFLD  POS=(11,2),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
START06  DFLD  POS=(11,5),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
STOPP06  DFLD  POS=(11,12),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KVANT06  DFLD  POS=(11,19),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KVAVV06  DFLD  POS=(11,27),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
SKROT06  DFLD  POS=(11,34),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KVRET06  DFLD  POS=(11,41),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KVJUST06 DFLD  POS=(11,48),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
RESP06   DFLD  POS=(11,55),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KVLS06   DFLD  POS=(11,59),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CODE06   DFLD  POS=(11,66),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
SPARR06  DFLD  POS=(11,69),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FLLEV06  DFLD  POS=(11,76),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FLFIN06  DFLD  POS=(11,78),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
INFO06   DFLD  POS=(11,80),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DC07     DFLD  POS=(12,2),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
START07  DFLD  POS=(12,5),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
STOPP07  DFLD  POS=(12,12),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KVANT07  DFLD  POS=(12,19),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KVAVV07  DFLD  POS=(12,27),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
SKROT07  DFLD  POS=(12,34),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KVRET07  DFLD  POS=(12,41),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KVJUST07 DFLD  POS=(12,48),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
RESP07   DFLD  POS=(12,55),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KVLS07   DFLD  POS=(12,59),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CODE07   DFLD  POS=(12,66),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
SPARR07  DFLD  POS=(12,69),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FLLEV07  DFLD  POS=(12,76),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FLFIN07  DFLD  POS=(12,78),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
INFO07   DFLD  POS=(12,80),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DC08     DFLD  POS=(13,2),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
START08  DFLD  POS=(13,5),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
STOPP08  DFLD  POS=(13,12),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KVANT08  DFLD  POS=(13,19),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KVAVV08  DFLD  POS=(13,27),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
SKROT08  DFLD  POS=(13,34),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KVRET08  DFLD  POS=(13,41),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KVJUST08 DFLD  POS=(13,48),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
RESP08   DFLD  POS=(13,55),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KVLS08   DFLD  POS=(13,59),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CODE08   DFLD  POS=(13,66),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
SPARR08  DFLD  POS=(13,69),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FLLEV08  DFLD  POS=(13,76),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FLFIN08  DFLD  POS=(13,78),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
INFO08   DFLD  POS=(13,80),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DC09     DFLD  POS=(14,2),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
START09  DFLD  POS=(14,5),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
STOPP09  DFLD  POS=(14,12),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KVANT09  DFLD  POS=(14,19),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KVAVV09  DFLD  POS=(14,27),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
SKROT09  DFLD  POS=(14,34),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KVRET09  DFLD  POS=(14,41),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KVJUST09 DFLD  POS=(14,48),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
RESP09   DFLD  POS=(14,55),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KVLS09   DFLD  POS=(14,59),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CODE09   DFLD  POS=(14,66),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
SPARR09  DFLD  POS=(14,69),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FLLEV09  DFLD  POS=(14,76),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FLFIN09  DFLD  POS=(14,78),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
INFO09   DFLD  POS=(14,80),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DC10     DFLD  POS=(15,2),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
START10  DFLD  POS=(15,5),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
STOPP10  DFLD  POS=(15,12),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KVANT10  DFLD  POS=(15,19),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KVAVV10  DFLD  POS=(15,27),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
SKROT10  DFLD  POS=(15,34),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KVRET10  DFLD  POS=(15,41),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KVJUST10 DFLD  POS=(15,48),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
RESP10   DFLD  POS=(15,55),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KVLS10   DFLD  POS=(15,59),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CODE10   DFLD  POS=(15,66),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
SPARR10  DFLD  POS=(15,69),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FLLEV10  DFLD  POS=(15,76),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FLFIN10  DFLD  POS=(15,78),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
INFO10   DFLD  POS=(15,80),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DC011    DFLD  POS=(16,2),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
START11  DFLD  POS=(16,5),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
STOPP11  DFLD  POS=(16,12),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KVANT11  DFLD  POS=(16,19),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KVAVV11  DFLD  POS=(16,27),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
SKROT11  DFLD  POS=(16,34),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KVRET11  DFLD  POS=(16,41),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KVJUST11 DFLD  POS=(16,48),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
RESP11   DFLD  POS=(16,55),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KVLS11   DFLD  POS=(16,59),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CODE11   DFLD  POS=(16,66),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
SPARR11  DFLD  POS=(16,69),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FLLEV11  DFLD  POS=(16,76),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FLFIN11  DFLD  POS=(16,78),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
INFO11   DFLD  POS=(16,80),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DC12     DFLD  POS=(17,2),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
START12  DFLD  POS=(17,5),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
STOPP12  DFLD  POS=(17,12),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KVANT12  DFLD  POS=(17,19),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KVAVV12  DFLD  POS=(17,27),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
SKROT12  DFLD  POS=(17,34),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KVRET12  DFLD  POS=(17,41),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KVJUST12 DFLD  POS=(17,48),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
RESP12   DFLD  POS=(17,55),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KVLS12   DFLD  POS=(17,59),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CODE12   DFLD  POS=(17,66),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
SPARR12  DFLD  POS=(17,69),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FLLEV12  DFLD  POS=(17,76),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FLFIN12  DFLD  POS=(17,78),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
INFO12   DFLD  POS=(17,80),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
DC13     DFLD  POS=(18,2),LTH=2,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
START13  DFLD  POS=(18,5),LTH=6,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
STOPP13  DFLD  POS=(18,12),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KVANT13  DFLD  POS=(18,19),LTH=7,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KVAVV13  DFLD  POS=(18,27),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
SKROT13  DFLD  POS=(18,34),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KVRET13  DFLD  POS=(18,41),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KVJUST13 DFLD  POS=(18,48),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
RESP13   DFLD  POS=(18,55),LTH=3,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
KVLS13   DFLD  POS=(18,59),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
CODE13   DFLD  POS=(18,66),LTH=2,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
SPARR13  DFLD  POS=(18,69),LTH=6,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FLLEV13  DFLD  POS=(18,76),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FLFIN13  DFLD  POS=(18,78),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
INFO13   DFLD  POS=(18,80),LTH=1,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  'Updates:',                                             +        
               POS=(19,2),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
DCUP     DFLD  POS=(20,2),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
STARTUP  DFLD  POS=(20,5),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
STOPPUP  DFLD  POS=(20,12),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
KVANTUP  DFLD  POS=(20,19),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
KVAVVUP  DFLD  POS=(20,27),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
SKROTUP  DFLD  POS=(20,34),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
KVRETUP  DFLD  POS=(20,41),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
KVJUSTUP DFLD  POS=(20,48),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
RESPUP   DFLD  POS=(20,55),LTH=3,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'F7 First',                                             +        
               POS=(22,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'F8 Forward',                                           +        
               POS=(22,17),LTH=10,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'F10 WHELP',                                            +        
               POS=(22,34),LTH=9,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'F11 Update',                                           +        
               POS=(22,50),LTH=10,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'F12 Logoff',                                           +        
               POS=(22,67),LTH=10,                                     +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W6I215N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W6N215),                                           +        
               OPT=2,                                                  +        
               NXT=W6O215N1                                                     
MID      LPAGE SOR=(W6N215)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS1,                                              +        
               '6'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS2,                                              +        
               '2'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  (IDTRANS3,                                              +        
               '1'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  (IDTRANS4,                                              +        
               '5'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F5'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '62152',                                                +        
               LTH=5                                                            
         MFLD  (IDARTNRI,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDARTNRU,                                              +        
               '         '),                                           +        
               LTH=9                                                            
         MFLD  (IDKVAINI,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDKVAINU,                                              +        
               '  '),                                                  +        
               LTH=2                                                            
         MFLD  (TIREGDAI,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TIREGDAU,                                              +        
               '      '),                                              +        
               LTH=6                                                            
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  (IDDCUT,                                                +        
               '  '),                                                  +        
               LTH=2                                                            
         MFLD  (SHOWIN,                                                +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (SHOWUT,                                                +        
               ' '),                                                   +        
               LTH=1                                                            
         MFLD  REGDAT9E,                                               +        
               LTH=7                                                            
         MFLD  KLOCK9E,                                                +        
               LTH=9                                                            
         MFLD  REGDAT9N,                                               +        
               LTH=7                                                            
         MFLD  KLOCK9N,                                                +        
               LTH=9                                                            
         MFLD  LV2IDDC,                                                +        
               LTH=2                                                            
         MFLD  LV3IDDC,                                                +        
               LTH=2                                                            
         MFLD  (DCUP,                                                  +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  (STARTUP,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (STOPPUP,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVANTUP,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVAVVUP,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (SKROTUP,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVRETUP,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVJUSTUP,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RESPUP,                                                +        
               '+++'),                                                 +        
               LTH=3                                                            
         MSGEND                                                                 
W6O215N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6N215,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I215N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W6N215                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDARTNRI,                                               +        
               LTH=9                                                            
         MFLD  IDARTNRU,                                               +        
               LTH=9                                                            
         MFLD  IDKVAINI,                                               +        
               LTH=2                                                            
         MFLD  IDKVAINU,                                               +        
               LTH=2                                                            
         MFLD  TIREGDAI,                                               +        
               LTH=6                                                            
         MFLD  TIREGDAU,                                               +        
               LTH=6                                                            
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  SHOWIN,                                                 +        
               LTH=1                                                            
         MFLD  SHOWUT,                                                 +        
               LTH=1                                                            
         MFLD  REGDAT9E,                                               +        
               LTH=7                                                            
         MFLD  KLOCK9E,                                                +        
               LTH=9                                                            
         MFLD  REGDAT9N,                                               +        
               LTH=7                                                            
         MFLD  KLOCK9N,                                                +        
               LTH=9                                                            
         MFLD  LV2IDDC,                                                +        
               LTH=2                                                            
         MFLD  LV3IDDC,                                                +        
               LTH=2                                                            
         MFLD  DC11,                                                   +        
               LTH=2                                                            
         MFLD  START01,                                                +        
               LTH=6                                                            
         MFLD  STOPP01,                                                +        
               LTH=6                                                            
         MFLD  KVANT01,                                                +        
               LTH=7                                                            
         MFLD  KVAVV01,                                                +        
               LTH=6                                                            
         MFLD  SKROT01,                                                +        
               LTH=6                                                            
         MFLD  KVRET01,                                                +        
               LTH=6                                                            
         MFLD  KVJUST01,                                               +        
               LTH=6                                                            
         MFLD  RESP01,                                                 +        
               LTH=3                                                            
         MFLD  KVLS01,                                                 +        
               LTH=6                                                            
         MFLD  CODE01,                                                 +        
               LTH=2                                                            
         MFLD  SPARR01,                                                +        
               LTH=6                                                            
         MFLD  FLLEV01,                                                +        
               LTH=1                                                            
         MFLD  FLFIN01,                                                +        
               LTH=1                                                            
         MFLD  INFO01,                                                 +        
               LTH=1                                                            
         MFLD  DC02,                                                   +        
               LTH=2                                                            
         MFLD  START02,                                                +        
               LTH=6                                                            
         MFLD  STOPP02,                                                +        
               LTH=6                                                            
         MFLD  KVANT02,                                                +        
               LTH=7                                                            
         MFLD  KVAVV02,                                                +        
               LTH=6                                                            
         MFLD  SKROT02,                                                +        
               LTH=6                                                            
         MFLD  KVRET02,                                                +        
               LTH=6                                                            
         MFLD  KVJUST02,                                               +        
               LTH=6                                                            
         MFLD  RESP02,                                                 +        
               LTH=3                                                            
         MFLD  KVLS02,                                                 +        
               LTH=6                                                            
         MFLD  CODE02,                                                 +        
               LTH=2                                                            
         MFLD  SPARR02,                                                +        
               LTH=6                                                            
         MFLD  FLLEV02,                                                +        
               LTH=1                                                            
         MFLD  FLFIN02,                                                +        
               LTH=1                                                            
         MFLD  INFO02,                                                 +        
               LTH=1                                                            
         MFLD  DC03,                                                   +        
               LTH=2                                                            
         MFLD  START03,                                                +        
               LTH=6                                                            
         MFLD  STOPP03,                                                +        
               LTH=6                                                            
         MFLD  KVANT03,                                                +        
               LTH=7                                                            
         MFLD  KVAVV03,                                                +        
               LTH=6                                                            
         MFLD  SKROT03,                                                +        
               LTH=6                                                            
         MFLD  KVRET03,                                                +        
               LTH=6                                                            
         MFLD  KVJUST03,                                               +        
               LTH=6                                                            
         MFLD  RESP03,                                                 +        
               LTH=3                                                            
         MFLD  KVLS03,                                                 +        
               LTH=6                                                            
         MFLD  CODE03,                                                 +        
               LTH=2                                                            
         MFLD  SPARR03,                                                +        
               LTH=6                                                            
         MFLD  FLLEV03,                                                +        
               LTH=1                                                            
         MFLD  FLFIN03,                                                +        
               LTH=1                                                            
         MFLD  INFO03,                                                 +        
               LTH=1                                                            
         MFLD  DC04,                                                   +        
               LTH=2                                                            
         MFLD  START04,                                                +        
               LTH=6                                                            
         MFLD  STOPP04,                                                +        
               LTH=6                                                            
         MFLD  KVANT04,                                                +        
               LTH=7                                                            
         MFLD  KVAVV04,                                                +        
               LTH=6                                                            
         MFLD  SKROT04,                                                +        
               LTH=6                                                            
         MFLD  KVRET04,                                                +        
               LTH=6                                                            
         MFLD  KVJUST04,                                               +        
               LTH=6                                                            
         MFLD  RESP04,                                                 +        
               LTH=3                                                            
         MFLD  KVLS04,                                                 +        
               LTH=6                                                            
         MFLD  CODE04,                                                 +        
               LTH=2                                                            
         MFLD  SPARR04,                                                +        
               LTH=6                                                            
         MFLD  FLLEV04,                                                +        
               LTH=1                                                            
         MFLD  FLFIN04,                                                +        
               LTH=1                                                            
         MFLD  INFO04,                                                 +        
               LTH=1                                                            
         MFLD  DC05,                                                   +        
               LTH=2                                                            
         MFLD  START05,                                                +        
               LTH=6                                                            
         MFLD  STOPP05,                                                +        
               LTH=6                                                            
         MFLD  KVANT05,                                                +        
               LTH=7                                                            
         MFLD  KVAVV05,                                                +        
               LTH=6                                                            
         MFLD  SKROT05,                                                +        
               LTH=6                                                            
         MFLD  KVRET05,                                                +        
               LTH=6                                                            
         MFLD  KVJUST05,                                               +        
               LTH=6                                                            
         MFLD  RESP05,                                                 +        
               LTH=3                                                            
         MFLD  KVLS05,                                                 +        
               LTH=6                                                            
         MFLD  CODE05,                                                 +        
               LTH=2                                                            
         MFLD  SPARR05,                                                +        
               LTH=6                                                            
         MFLD  FLLEV05,                                                +        
               LTH=1                                                            
         MFLD  FLFIN05,                                                +        
               LTH=1                                                            
         MFLD  INFO05,                                                 +        
               LTH=1                                                            
         MFLD  DC06,                                                   +        
               LTH=2                                                            
         MFLD  START06,                                                +        
               LTH=6                                                            
         MFLD  STOPP06,                                                +        
               LTH=6                                                            
         MFLD  KVANT06,                                                +        
               LTH=7                                                            
         MFLD  KVAVV06,                                                +        
               LTH=6                                                            
         MFLD  SKROT06,                                                +        
               LTH=6                                                            
         MFLD  KVRET06,                                                +        
               LTH=6                                                            
         MFLD  KVJUST06,                                               +        
               LTH=6                                                            
         MFLD  RESP06,                                                 +        
               LTH=3                                                            
         MFLD  KVLS06,                                                 +        
               LTH=6                                                            
         MFLD  CODE06,                                                 +        
               LTH=2                                                            
         MFLD  SPARR06,                                                +        
               LTH=6                                                            
         MFLD  FLLEV06,                                                +        
               LTH=1                                                            
         MFLD  FLFIN06,                                                +        
               LTH=1                                                            
         MFLD  INFO06,                                                 +        
               LTH=1                                                            
         MFLD  DC07,                                                   +        
               LTH=2                                                            
         MFLD  START07,                                                +        
               LTH=6                                                            
         MFLD  STOPP07,                                                +        
               LTH=6                                                            
         MFLD  KVANT07,                                                +        
               LTH=7                                                            
         MFLD  KVAVV07,                                                +        
               LTH=6                                                            
         MFLD  SKROT07,                                                +        
               LTH=6                                                            
         MFLD  KVRET07,                                                +        
               LTH=6                                                            
         MFLD  KVJUST07,                                               +        
               LTH=6                                                            
         MFLD  RESP07,                                                 +        
               LTH=3                                                            
         MFLD  KVLS07,                                                 +        
               LTH=6                                                            
         MFLD  CODE07,                                                 +        
               LTH=2                                                            
         MFLD  SPARR07,                                                +        
               LTH=6                                                            
         MFLD  FLLEV07,                                                +        
               LTH=1                                                            
         MFLD  FLFIN07,                                                +        
               LTH=1                                                            
         MFLD  INFO07,                                                 +        
               LTH=1                                                            
         MFLD  DC08,                                                   +        
               LTH=2                                                            
         MFLD  START08,                                                +        
               LTH=6                                                            
         MFLD  STOPP08,                                                +        
               LTH=6                                                            
         MFLD  KVANT08,                                                +        
               LTH=7                                                            
         MFLD  KVAVV08,                                                +        
               LTH=6                                                            
         MFLD  SKROT08,                                                +        
               LTH=6                                                            
         MFLD  KVRET08,                                                +        
               LTH=6                                                            
         MFLD  KVJUST08,                                               +        
               LTH=6                                                            
         MFLD  RESP08,                                                 +        
               LTH=3                                                            
         MFLD  KVLS08,                                                 +        
               LTH=6                                                            
         MFLD  CODE08,                                                 +        
               LTH=2                                                            
         MFLD  SPARR08,                                                +        
               LTH=6                                                            
         MFLD  FLLEV08,                                                +        
               LTH=1                                                            
         MFLD  FLFIN08,                                                +        
               LTH=1                                                            
         MFLD  INFO08,                                                 +        
               LTH=1                                                            
         MFLD  DC09,                                                   +        
               LTH=2                                                            
         MFLD  START09,                                                +        
               LTH=6                                                            
         MFLD  STOPP09,                                                +        
               LTH=6                                                            
         MFLD  KVANT09,                                                +        
               LTH=7                                                            
         MFLD  KVAVV09,                                                +        
               LTH=6                                                            
         MFLD  SKROT09,                                                +        
               LTH=6                                                            
         MFLD  KVRET09,                                                +        
               LTH=6                                                            
         MFLD  KVJUST09,                                               +        
               LTH=6                                                            
         MFLD  RESP09,                                                 +        
               LTH=3                                                            
         MFLD  KVLS09,                                                 +        
               LTH=6                                                            
         MFLD  CODE09,                                                 +        
               LTH=2                                                            
         MFLD  SPARR09,                                                +        
               LTH=6                                                            
         MFLD  FLLEV09,                                                +        
               LTH=1                                                            
         MFLD  FLFIN09,                                                +        
               LTH=1                                                            
         MFLD  INFO09,                                                 +        
               LTH=1                                                            
         MFLD  DC10,                                                   +        
               LTH=2                                                            
         MFLD  START10,                                                +        
               LTH=6                                                            
         MFLD  STOPP10,                                                +        
               LTH=6                                                            
         MFLD  KVANT10,                                                +        
               LTH=7                                                            
         MFLD  KVAVV10,                                                +        
               LTH=6                                                            
         MFLD  SKROT10,                                                +        
               LTH=6                                                            
         MFLD  KVRET10,                                                +        
               LTH=6                                                            
         MFLD  KVJUST10,                                               +        
               LTH=6                                                            
         MFLD  RESP10,                                                 +        
               LTH=3                                                            
         MFLD  KVLS10,                                                 +        
               LTH=6                                                            
         MFLD  CODE10,                                                 +        
               LTH=2                                                            
         MFLD  SPARR10,                                                +        
               LTH=6                                                            
         MFLD  FLLEV10,                                                +        
               LTH=1                                                            
         MFLD  FLFIN10,                                                +        
               LTH=1                                                            
         MFLD  INFO10,                                                 +        
               LTH=1                                                            
         MFLD  DC011,                                                  +        
               LTH=2                                                            
         MFLD  START11,                                                +        
               LTH=6                                                            
         MFLD  STOPP11,                                                +        
               LTH=6                                                            
         MFLD  KVANT11,                                                +        
               LTH=7                                                            
         MFLD  KVAVV11,                                                +        
               LTH=6                                                            
         MFLD  SKROT11,                                                +        
               LTH=6                                                            
         MFLD  KVRET11,                                                +        
               LTH=6                                                            
         MFLD  KVJUST11,                                               +        
               LTH=6                                                            
         MFLD  RESP11,                                                 +        
               LTH=3                                                            
         MFLD  KVLS11,                                                 +        
               LTH=6                                                            
         MFLD  CODE11,                                                 +        
               LTH=2                                                            
         MFLD  SPARR11,                                                +        
               LTH=6                                                            
         MFLD  FLLEV11,                                                +        
               LTH=1                                                            
         MFLD  FLFIN11,                                                +        
               LTH=1                                                            
         MFLD  INFO11,                                                 +        
               LTH=1                                                            
         MFLD  DC12,                                                   +        
               LTH=2                                                            
         MFLD  START12,                                                +        
               LTH=6                                                            
         MFLD  STOPP12,                                                +        
               LTH=6                                                            
         MFLD  KVANT12,                                                +        
               LTH=7                                                            
         MFLD  KVAVV12,                                                +        
               LTH=6                                                            
         MFLD  SKROT12,                                                +        
               LTH=6                                                            
         MFLD  KVRET12,                                                +        
               LTH=6                                                            
         MFLD  KVJUST12,                                               +        
               LTH=6                                                            
         MFLD  RESP12,                                                 +        
               LTH=3                                                            
         MFLD  KVLS12,                                                 +        
               LTH=6                                                            
         MFLD  CODE12,                                                 +        
               LTH=2                                                            
         MFLD  SPARR12,                                                +        
               LTH=6                                                            
         MFLD  FLLEV12,                                                +        
               LTH=1                                                            
         MFLD  FLFIN12,                                                +        
               LTH=1                                                            
         MFLD  INFO12,                                                 +        
               LTH=1                                                            
         MFLD  DC13,                                                   +        
               LTH=2                                                            
         MFLD  START13,                                                +        
               LTH=6                                                            
         MFLD  STOPP13,                                                +        
               LTH=6                                                            
         MFLD  KVANT13,                                                +        
               LTH=7                                                            
         MFLD  KVAVV13,                                                +        
               LTH=6                                                            
         MFLD  SKROT13,                                                +        
               LTH=6                                                            
         MFLD  KVRET13,                                                +        
               LTH=6                                                            
         MFLD  KVJUST13,                                               +        
               LTH=6                                                            
         MFLD  RESP13,                                                 +        
               LTH=3                                                            
         MFLD  KVLS13,                                                 +        
               LTH=6                                                            
         MFLD  CODE13,                                                 +        
               LTH=2                                                            
         MFLD  SPARR13,                                                +        
               LTH=6                                                            
         MFLD  FLLEV13,                                                +        
               LTH=1                                                            
         MFLD  FLFIN13,                                                +        
               LTH=1                                                            
         MFLD  INFO13,                                                 +        
               LTH=1                                                            
         MFLD  DCUP,                                                   +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  STARTUP,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  STOPPUP,                                                +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVANTUP,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVAVVUP,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  SKROTUP,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVRETUP,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVJUSTUP,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RESPUP,                                                 +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=79                                                           
         MSGEND                                                                 
         END                                                                    
