***********************************************************************         
* CREATED BY V063442   ON 00/10/17  AT 07:59                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'IR PACKING                      '                               
W6N204   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W6T204 7',                                           +        
               8='W6T204 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W6T204U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W6T201  ',                                          +        
               14='W6T202  ',                                          +        
               15='W6T203  ',                                          +        
               16='W6T204  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W6T207  ',                                          +        
               20='W6T208  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W6N204   DPAGE CURSOR=((2,8)),                                         +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'IR PACKING',                                           +        
               POS=(1,10),LTH=10,                                      +        
               ATTR=(NUM,PROT)                                                  
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'IR.No',                                                +        
               POS=(2,2),LTH=5,                                        +        
               ATTR=(ALPHA,PROT)                                                
DGIA0029 DFLD  POS=(2,8),LTH=5,                                        +        
               ATTR=(NOPROT)                                                    
         DFLD  'Case No',                                              +        
               POS=(2,18),LTH=7,                                       +        
               ATTR=(PROT)                                                      
DGIA0027 DFLD  POS=(2,26),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0030 DFLD  POS=(3,8),LTH=5,                                        +        
               ATTR=(PROT,MOD)                                                  
DGIA0028 DFLD  POS=(3,26),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0024 DFLD  POS=(4,2),LTH=5,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0026 DFLD  POS=(4,8),LTH=5,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Part.No',                                              +        
               POS=(5,2),LTH=7,                                        +        
               ATTR=(PROT)                                                      
IDARTNR  DFLD  POS=(5,13),LTH=9,                                       +        
               ATTR=(PROT)                                                      
BEART    DFLD  POS=(5,23),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Status',                                               +        
               POS=(5,49),LTH=6,                                       +        
               ATTR=(ALPHA,PROT)                                                
KDKRSTA  DFLD  POS=(5,56),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Reg.dat',                                              +        
               POS=(5,58),LTH=7,                                       +        
               ATTR=(ALPHA,PROT)                                                
TIREGDAT DFLD  POS=(5,66),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Sup',                                                  +        
               POS=(6,2),LTH=3,                                        +        
               ATTR=(PROT)                                                      
IDLEVNR  DFLD  POS=(6,6),LTH=5,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'G.ad',                                                 +        
               POS=(6,12),LTH=4,                                       +        
               ATTR=(ALPHA,PROT)                                                
IDLEVG   DFLD  POS=(6,17),LTH=5,                                       +        
               ATTR=(PROT)                                                      
BELEV    DFLD  POS=(6,23),LTH=35,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Case No  Gr. W    Length  Width   Height',             +        
               POS=(8,2),LTH=40,                                       +        
               ATTR=(PROT)                                                      
IDKOLLI1 DFLD  POS=(9,4),LTH=5,                                        +        
               ATTR=(PROT)                                                      
DGIA0035 DFLD  POS=(9,11),LTH=7,                                       +        
               ATTR=(PROT)                                                      
DGIA0017 DFLD  POS=(9,21),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DGIA0001 DFLD  POS=(9,30),LTH=3,                                       +        
               ATTR=(PROT)                                                      
DGIA0009 DFLD  POS=(9,37),LTH=3,                                       +        
               ATTR=(PROT)                                                      
IDKOLLI2 DFLD  POS=(10,4),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DGIA0036 DFLD  POS=(10,11),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0018 DFLD  POS=(10,21),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0002 DFLD  POS=(10,30),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0010 DFLD  POS=(10,37),LTH=3,                                      +        
               ATTR=(PROT)                                                      
IDKOLLI3 DFLD  POS=(11,4),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DGIA0037 DFLD  POS=(11,11),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0019 DFLD  POS=(11,21),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0003 DFLD  POS=(11,30),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0011 DFLD  POS=(11,37),LTH=3,                                      +        
               ATTR=(PROT)                                                      
IDKOLLI4 DFLD  POS=(12,4),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DGIA0038 DFLD  POS=(12,11),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0020 DFLD  POS=(12,21),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0004 DFLD  POS=(12,30),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0012 DFLD  POS=(12,37),LTH=3,                                      +        
               ATTR=(PROT)                                                      
IDKOLLI5 DFLD  POS=(13,4),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DGIA0039 DFLD  POS=(13,11),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0021 DFLD  POS=(13,21),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0005 DFLD  POS=(13,30),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0013 DFLD  POS=(13,37),LTH=3,                                      +        
               ATTR=(PROT)                                                      
IDKOLLI6 DFLD  POS=(14,4),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DGIA0040 DFLD  POS=(14,11),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0022 DFLD  POS=(14,21),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0006 DFLD  POS=(14,30),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0014 DFLD  POS=(14,37),LTH=3,                                      +        
               ATTR=(PROT)                                                      
IDKOLLI7 DFLD  POS=(15,4),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DGIA0041 DFLD  POS=(15,11),LTH=7,                                      +        
               ATTR=(PROT)                                                      
DGIA0023 DFLD  POS=(15,21),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DGIA0007 DFLD  POS=(15,30),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DGIA0015 DFLD  POS=(15,37),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'New/Change    :',                                      +        
               POS=(16,2),LTH=15,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'C.co',                                                 +        
               POS=(17,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KDKOLLI  DFLD  POS=(17,7),LTH=8,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0025 DFLD  POS=(18,4),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0034 DFLD  POS=(18,11),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0016 DFLD  POS=(18,21),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0000 DFLD  POS=(18,30),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0008 DFLD  POS=(18,37),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Delete',                                               +        
               POS=(18,41),LTH=6,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0031 DFLD  POS=(18,51),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Pers',                                                 +        
               POS=(19,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KDPERSON DFLD  POS=(19,7),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
BEKRPACK DFLD  POS=(19,11),LTH=25,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Used ti',                                              +        
               POS=(19,37),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
DGIA0032 DFLD  POS=(19,45),LTH=4,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0033 DFLD  POS=(19,51),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Pack.date',                                            +        
               POS=(19,56),LTH=9,                                      +        
               ATTR=(ALPHA,PROT)                                                
TIKRPDAT DFLD  POS=(19,66),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'F10=WHELP F11=Update F12=Logoff',                      +        
               POS=(22,2),LTH=31,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W6O204N2 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6N204,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I204N1,                                           +        
               FILL=PT                                                          
MOD2     LPAGE SOR=W6N204                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=79                                                           
         MSGEND                                                                 
W6I204N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W6N204),                                           +        
               OPT=2,                                                  +        
               NXT=W6O204N1                                                     
MID      LPAGE SOR=(W6N204)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '62042',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0029,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0030,                                              +        
               '     '),                                               +        
               LTH=5                                                            
         MFLD  (DGIA0027,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0028,                                              +        
               '     '),                                               +        
               LTH=5                                                            
         MFLD  DGIA0024,                                               +        
               LTH=5                                                            
         MFLD  DGIA0026,                                               +        
               LTH=5                                                            
         MFLD  (KDKOLLI,                                               +        
               '++++++++'),                                            +        
               LTH=8                                                            
         MFLD  (DGIA0025,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0034,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0016,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0000,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0008,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0031,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (KDPERSON,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (BEKRPACK,                                              +        
               '+++++++++++++++++++++++++'),                           +        
               LTH=25                                                           
         MFLD  (DGIA0032,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
W6O204N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6N204,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I204N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W6N204                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  DGIA0029,                                               +        
               LTH=2                                                            
         MFLD  DGIA0030,                                               +        
               LTH=5                                                            
         MFLD  DGIA0027,                                               +        
               LTH=2                                                            
         MFLD  DGIA0028,                                               +        
               LTH=5                                                            
         MFLD  DGIA0024,                                               +        
               LTH=5                                                            
         MFLD  DGIA0026,                                               +        
               LTH=5                                                            
         MFLD  IDARTNR,                                                +        
               LTH=9                                                            
         MFLD  BEART,                                                  +        
               LTH=25                                                           
         MFLD  KDKRSTA,                                                +        
               LTH=1                                                            
         MFLD  TIREGDAT,                                               +        
               LTH=6                                                            
         MFLD  IDLEVNR,                                                +        
               LTH=5                                                            
         MFLD  IDLEVG,                                                 +        
               LTH=5                                                            
         MFLD  BELEV,                                                  +        
               LTH=35                                                           
         MFLD  IDKOLLI1,                                               +        
               LTH=5                                                            
         MFLD  DGIA0035,                                               +        
               LTH=7                                                            
         MFLD  DGIA0017,                                               +        
               LTH=4                                                            
         MFLD  DGIA0001,                                               +        
               LTH=3                                                            
         MFLD  DGIA0009,                                               +        
               LTH=3                                                            
         MFLD  IDKOLLI2,                                               +        
               LTH=5                                                            
         MFLD  DGIA0036,                                               +        
               LTH=7                                                            
         MFLD  DGIA0018,                                               +        
               LTH=4                                                            
         MFLD  DGIA0002,                                               +        
               LTH=3                                                            
         MFLD  DGIA0010,                                               +        
               LTH=3                                                            
         MFLD  IDKOLLI3,                                               +        
               LTH=5                                                            
         MFLD  DGIA0037,                                               +        
               LTH=7                                                            
         MFLD  DGIA0019,                                               +        
               LTH=4                                                            
         MFLD  DGIA0003,                                               +        
               LTH=3                                                            
         MFLD  DGIA0011,                                               +        
               LTH=3                                                            
         MFLD  IDKOLLI4,                                               +        
               LTH=5                                                            
         MFLD  DGIA0038,                                               +        
               LTH=7                                                            
         MFLD  DGIA0020,                                               +        
               LTH=4                                                            
         MFLD  DGIA0004,                                               +        
               LTH=3                                                            
         MFLD  DGIA0012,                                               +        
               LTH=3                                                            
         MFLD  IDKOLLI5,                                               +        
               LTH=5                                                            
         MFLD  DGIA0039,                                               +        
               LTH=7                                                            
         MFLD  DGIA0021,                                               +        
               LTH=4                                                            
         MFLD  DGIA0005,                                               +        
               LTH=3                                                            
         MFLD  DGIA0013,                                               +        
               LTH=3                                                            
         MFLD  IDKOLLI6,                                               +        
               LTH=5                                                            
         MFLD  DGIA0040,                                               +        
               LTH=7                                                            
         MFLD  DGIA0022,                                               +        
               LTH=4                                                            
         MFLD  DGIA0006,                                               +        
               LTH=3                                                            
         MFLD  DGIA0014,                                               +        
               LTH=3                                                            
         MFLD  IDKOLLI7,                                               +        
               LTH=5                                                            
         MFLD  DGIA0041,                                               +        
               LTH=7                                                            
         MFLD  DGIA0023,                                               +        
               LTH=4                                                            
         MFLD  DGIA0007,                                               +        
               LTH=3                                                            
         MFLD  DGIA0015,                                               +        
               LTH=3                                                            
         MFLD  KDKOLLI,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0025,                                               +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0034,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0016,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0000,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0008,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0031,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDPERSON,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  BEKRPACK,                                               +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0032,                                               +        
               LTH=6,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0033,                                               +        
               LTH=4                                                            
         MFLD  TIKRPDAT,                                               +        
               LTH=6                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=79                                                           
         MSGEND                                                                 
         END                                                                    
