***********************************************************************         
* CREATED BY R035978   ON 92/11/20  AT 15:03                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'PLANNING QUALITY                '                               
W6N213   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W6T213 7',                                           +        
               8='W6T213 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W6T213U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W6T211  ',                                          +        
               14='W6T212  ',                                          +        
               15='W6T213  ',                                          +        
               16='W6T214  ',                                          +        
               17='W6T215  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W6N213   DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Planning Quality',                                     +        
               POS=(1,12),LTH=16,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         DFLD  'Part no.',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDARTNRI DFLD  POS=(2,12),LTH=9,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Suppl.',                                               +        
               POS=(2,22),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
IDLEVNRI DFLD  POS=(2,29),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'No',                                                   +        
               POS=(2,35),LTH=2,                                       +        
               ATTR=(ALPHA,PROT)                                                
IDKVAIFI DFLD  POS=(2,38),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(2,41),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
DGIA0026 DFLD  POS=(2,48),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0018 DFLD  POS=(2,59),LTH=1,                                       +        
               ATTR=(PROT)                                                      
IDARTNRU DFLD  POS=(3,12),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
IDLEVNRU DFLD  POS=(3,29),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
IDKVAIFU DFLD  POS=(3,38),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0027 DFLD  POS=(3,48),LTH=6,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0019 DFLD  POS=(3,59),LTH=1,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0003 DFLD  POS=(4,2),LTH=2,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
DGIA0001 DFLD  POS=(4,6),LTH=2,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Name',                                                 +        
               POS=(5,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
BEART    DFLD  POS=(5,10),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Supplier',                                             +        
               POS=(5,36),LTH=8,                                       +        
               ATTR=(ALPHA,PROT)                                                
BELEV    DFLD  POS=(5,45),LTH=35,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Qual.ass.',                                            +        
               POS=(7,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
FLKVASAK DFLD  POS=(7,14),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
TIKVASAK DFLD  POS=(7,16),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'I.S.T.approved',                                       +        
               POS=(7,24),LTH=14,                                      +        
               ATTR=(PROT)                                                      
FLUPG    DFLD  POS=(7,39),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
TIUPG    DFLD  POS=(7,41),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Delete supplier',                                      +        
               POS=(7,53),LTH=15,                                      +        
               ATTR=(PROT)                                                      
DGIA0016 DFLD  POS=(7,70),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Special inspec.:',                                     +        
               POS=(9,2),LTH=16,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'S-plan Amount',                                        +        
               POS=(10,5),LTH=13,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'No  prim  insp.  Responsible',                         +        
               POS=(11,2),LTH=28,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Phone',                                                +        
               POS=(11,45),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DGIA0004 DFLD  POS=(12,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0010 DFLD  POS=(12,7),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0021 DFLD  POS=(12,13),LTH=1,                                      +        
               ATTR=(PROT)                                                      
BEANST1  DFLD  POS=(12,19),LTH=25,                                     +        
               ATTR=(PROT)                                                      
IDTFN1   DFLD  POS=(12,45),LTH=20,                                     +        
               ATTR=(PROT)                                                      
DGIA0005 DFLD  POS=(13,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0011 DFLD  POS=(13,7),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0022 DFLD  POS=(13,13),LTH=1,                                      +        
               ATTR=(PROT)                                                      
BEANST2  DFLD  POS=(13,19),LTH=25,                                     +        
               ATTR=(PROT)                                                      
IDTFN2   DFLD  POS=(13,45),LTH=20,                                     +        
               ATTR=(PROT)                                                      
DGIA0006 DFLD  POS=(14,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0012 DFLD  POS=(14,7),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0023 DFLD  POS=(14,13),LTH=1,                                      +        
               ATTR=(PROT)                                                      
BEANST3  DFLD  POS=(14,19),LTH=25,                                     +        
               ATTR=(PROT)                                                      
IDTFN3   DFLD  POS=(14,45),LTH=20,                                     +        
               ATTR=(PROT)                                                      
DGIA0007 DFLD  POS=(15,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0013 DFLD  POS=(15,7),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0024 DFLD  POS=(15,13),LTH=1,                                      +        
               ATTR=(PROT)                                                      
BEANST4  DFLD  POS=(15,19),LTH=25,                                     +        
               ATTR=(PROT)                                                      
IDTFN4   DFLD  POS=(15,45),LTH=20,                                     +        
               ATTR=(PROT)                                                      
DGIA0008 DFLD  POS=(16,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DGIA0014 DFLD  POS=(16,7),LTH=1,                                       +        
               ATTR=(PROT)                                                      
DGIA0025 DFLD  POS=(16,13),LTH=1,                                      +        
               ATTR=(PROT)                                                      
BEANST5  DFLD  POS=(16,19),LTH=25,                                     +        
               ATTR=(PROT)                                                      
IDTFN5   DFLD  POS=(16,45),LTH=20,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'New registration/Change',                              +        
               POS=(18,2),LTH=23,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Delete',                                               +        
               POS=(18,69),LTH=6,                                      +        
               ATTR=(PROT)                                                      
DGIA0002 DFLD  POS=(19,2),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0009 DFLD  POS=(19,7),LTH=1,                                       +        
               ATTR=(NUM,NOPROT)                                                
DGIA0020 DFLD  POS=(19,13),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0000 DFLD  POS=(19,19),LTH=25,                                     +        
               ATTR=(NOPROT)                                                    
DGIA0015 DFLD  POS=(19,45),LTH=20,                                     +        
               ATTR=(NOPROT)                                                    
DGIA0017 DFLD  POS=(19,71),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  '13 Part info.  14 part hist.   15 Planning',           +        
               POS=(21,2),LTH=42,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '16',                                                   +        
               POS=(21,49),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,17),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,33),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,49),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         DFLD  ' VCP ',POS=(23,58)                                              
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W6I213N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W6N213),                                           +        
               OPT=2,                                                  +        
               NXT=W6O213N1                                                     
MID      LPAGE SOR=(W6N213)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '62132',                                                +        
               LTH=5                                                            
         MFLD  (IDARTNRI,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDARTNRU,                                              +        
               '         '),                                           +        
               LTH=9                                                            
         MFLD  (IDLEVNRI,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (IDLEVNRU,                                              +        
               '     '),                                               +        
               LTH=5                                                            
         MFLD  (IDKVAIFI,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDKVAIFU,                                               +        
               LTH=2                                                            
         MFLD  (DGIA0026,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DGIA0027,                                               +        
               LTH=6                                                            
         MFLD  (DGIA0018,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  DGIA0019,                                               +        
               LTH=1                                                            
         MFLD  (DGIA0003,                                              +        
               '  '),                                                  +        
               LTH=2                                                            
         MFLD  (DGIA0001,                                              +        
               '  '),                                                  +        
               LTH=2                                                            
         MFLD  (FLKVASAK,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (FLUPG,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (DGIA0016,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (DGIA0002,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0009,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0020,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0000,                                              +        
               '+++++++++++++++++++++++++'),                           +        
               LTH=25                                                           
         MFLD  (DGIA0015,                                              +        
               '++++++++++++++++++++'),                                +        
               LTH=20                                                           
         MFLD  (DGIA0017,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W6O213N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6N213,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I213N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W6N213                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDARTNRI,                                               +        
               LTH=2                                                            
         MFLD  IDARTNRU,                                               +        
               LTH=9                                                            
         MFLD  IDLEVNRI,                                               +        
               LTH=2                                                            
         MFLD  IDLEVNRU,                                               +        
               LTH=5                                                            
         MFLD  IDKVAIFI,                                               +        
               LTH=2                                                            
         MFLD  IDKVAIFU,                                               +        
               LTH=2                                                            
         MFLD  DGIA0026,                                               +        
               LTH=2                                                            
         MFLD  DGIA0027,                                               +        
               LTH=6                                                            
         MFLD  DGIA0018,                                               +        
               LTH=2                                                            
         MFLD  DGIA0019,                                               +        
               LTH=1                                                            
         MFLD  DGIA0003,                                               +        
               LTH=2                                                            
         MFLD  DGIA0001,                                               +        
               LTH=2                                                            
         MFLD  BEART,                                                  +        
               LTH=25                                                           
         MFLD  BELEV,                                                  +        
               LTH=35                                                           
         MFLD  FLKVASAK,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TIKVASAK,                                               +        
               LTH=6                                                            
         MFLD  FLUPG,                                                  +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TIUPG,                                                  +        
               LTH=6                                                            
         MFLD  DGIA0016,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0004,                                               +        
               LTH=2                                                            
         MFLD  DGIA0010,                                               +        
               LTH=1                                                            
         MFLD  DGIA0021,                                               +        
               LTH=1                                                            
         MFLD  BEANST1,                                                +        
               LTH=25                                                           
         MFLD  IDTFN1,                                                 +        
               LTH=20                                                           
         MFLD  DGIA0005,                                               +        
               LTH=2                                                            
         MFLD  DGIA0011,                                               +        
               LTH=1                                                            
         MFLD  DGIA0022,                                               +        
               LTH=1                                                            
         MFLD  BEANST2,                                                +        
               LTH=25                                                           
         MFLD  IDTFN2,                                                 +        
               LTH=20                                                           
         MFLD  DGIA0006,                                               +        
               LTH=2                                                            
         MFLD  DGIA0012,                                               +        
               LTH=1                                                            
         MFLD  DGIA0023,                                               +        
               LTH=1                                                            
         MFLD  BEANST3,                                                +        
               LTH=25                                                           
         MFLD  IDTFN3,                                                 +        
               LTH=20                                                           
         MFLD  DGIA0007,                                               +        
               LTH=2                                                            
         MFLD  DGIA0013,                                               +        
               LTH=1                                                            
         MFLD  DGIA0024,                                               +        
               LTH=1                                                            
         MFLD  BEANST4,                                                +        
               LTH=25                                                           
         MFLD  IDTFN4,                                                 +        
               LTH=20                                                           
         MFLD  DGIA0008,                                               +        
               LTH=2                                                            
         MFLD  DGIA0014,                                               +        
               LTH=1                                                            
         MFLD  DGIA0025,                                               +        
               LTH=1                                                            
         MFLD  BEANST5,                                                +        
               LTH=25                                                           
         MFLD  IDTFN5,                                                 +        
               LTH=20                                                           
         MFLD  DGIA0002,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0009,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0020,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DGIA0000,                                               +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0015,                                               +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0017,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=61                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=79                                                           
         MSGEND                                                                 
         END                                                                    
