***********************************************************************         
* CREATED BY V063442   ON 99/12/22  AT 13:54                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'PARTS HISTORY QUALITY           '                               
W6N212   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W6T212 7',                                           +        
               8='W6T212 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W6T212U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W6T211  ',                                          +        
               14='W6T212  ',                                          +        
               15='W6T213  ',                                          +        
               16='W6T214  ',                                          +        
               17='W6T215  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W6N212   DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'PARTS HISTORY QUALITY',                                +        
               POS=(1,12),LTH=21,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Part no.',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDARTNRI DFLD  POS=(2,12),LTH=9,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'No.',                                                  +        
               POS=(2,22),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
IDKVAINI DFLD  POS=(2,26),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Reg.date',                                             +        
               POS=(2,29),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
TIREGDAI DFLD  POS=(2,39),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDLEVIN  DFLD  POS=(2,46),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'New No.',                                              +        
               POS=(2,52),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
NEW      DFLD  POS=(2,60),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDARTNRU DFLD  POS=(3,12),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
IDKVAINU DFLD  POS=(3,26),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
TIREGDAU DFLD  POS=(3,39),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
IDLEVUT  DFLD  POS=(3,46),LTH=5,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
REGDAT9E DFLD  POS=(4,2),LTH=7,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
KLOCK9E  DFLD  POS=(4,10),LTH=9,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
REGDAT9N DFLD  POS=(4,20),LTH=7,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
KLOCK9N  DFLD  POS=(4,28),LTH=9,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Int No',                                               +        
               POS=(5,2),LTH=6,                                        +        
               ATTR=(PROT)                                                      
NOTNR    DFLD  POS=(5,9),LTH=2,                                        +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Date:',                                                +        
               POS=(5,12),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
TIREGDAT DFLD  POS=(5,18),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Resp',                                                 +        
               POS=(5,25),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
RESPIN   DFLD  POS=(5,30),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
RESPUT   DFLD  POS=(5,34),LTH=3,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  'Input',                                                +        
               POS=(5,38),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
TEKVAINP DFLD  POS=(5,44),LTH=20,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Ready',                                                +        
               POS=(5,65),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
TIKLARQU DFLD  POS=(5,71),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'D',                                                    +        
               POS=(5,78),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
FLDELETE DFLD  POS=(5,80),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Problem/action:',                                      +        
               POS=(6,2),LTH=15,                                       +        
               ATTR=(NUM,PROT)                                                  
TEKVAI01 DFLD  POS=(6,18),LTH=63,                                      +        
               ATTR=(NOPROT)                                                    
TEKVAI02 DFLD  POS=(7,2),LTH=79,                                       +        
               ATTR=(NOPROT)                                                    
TEKVAI03 DFLD  POS=(8,2),LTH=79,                                       +        
               ATTR=(NOPROT)                                                    
TEKVAI04 DFLD  POS=(9,2),LTH=79,                                       +        
               ATTR=(NOPROT)                                                    
TEKVAI05 DFLD  POS=(10,2),LTH=79,                                      +        
               ATTR=(NOPROT)                                                    
TEKVAI06 DFLD  POS=(11,2),LTH=79,                                      +        
               ATTR=(NOPROT)                                                    
TEKVAI07 DFLD  POS=(12,2),LTH=79,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'External:  Typ',                                       +        
               POS=(13,2),LTH=14,                                      +        
               ATTR=(NUM,PROT)                                                  
KDKVAINF DFLD  POS=(13,17),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Finish',                                               +        
               POS=(13,20),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TIKLARLE DFLD  POS=(13,27),LTH=6,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Stock check',                                          +        
               POS=(13,37),LTH=11,                                     +        
               ATTR=(PROT)                                                      
FLSTOCH  DFLD  POS=(13,49),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'SI',                                                   +        
               POS=(13,51),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
IDLEVNR  DFLD  POS=(13,54),LTH=5,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'QPA',                                                  +        
               POS=(13,60),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
FLQPA    DFLD  POS=(13,64),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Problem/action:',                                      +        
               POS=(14,2),LTH=15,                                      +        
               ATTR=(PROT)                                                      
TEKVAI11 DFLD  POS=(14,18),LTH=63,                                     +        
               ATTR=(NOPROT)                                                    
TEKVAI12 DFLD  POS=(15,2),LTH=79,                                      +        
               ATTR=(NOPROT)                                                    
TEKVAI13 DFLD  POS=(16,2),LTH=79,                                      +        
               ATTR=(NOPROT)                                                    
TEKVAI14 DFLD  POS=(17,2),LTH=79,                                      +        
               ATTR=(NOPROT)                                                    
TEKVAI15 DFLD  POS=(18,2),LTH=79,                                      +        
               ATTR=(NOPROT)                                                    
TEKVAI16 DFLD  POS=(19,2),LTH=79,                                      +        
               ATTR=(NOPROT)                                                    
TEKVAI17 DFLD  POS=(20,2),LTH=79,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'F7 First',                                             +        
               POS=(22,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'F8 Forward',                                           +        
               POS=(22,17),LTH=10,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'F10 WHELP',                                            +        
               POS=(22,34),LTH=9,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'F11 Update',                                           +        
               POS=(22,50),LTH=10,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'F12 Logoff',                                           +        
               POS=(22,67),LTH=10,                                     +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W6I212N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W6N212),                                           +        
               OPT=2,                                                  +        
               NXT=W6O212N1                                                     
MID      LPAGE SOR=(W6N212)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS1,                                              +        
               '6'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS2,                                              +        
               '2'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  (IDTRANS3,                                              +        
               '1'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  (IDTRANS4,                                              +        
               '2'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '62122',                                                +        
               LTH=5                                                            
         MFLD  (IDARTNRI,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDARTNRU,                                              +        
               '         '),                                           +        
               LTH=9                                                            
         MFLD  IDLEVIN,                                                +        
               LTH=5                                                            
         MFLD  IDLEVUT,                                                +        
               LTH=5                                                            
         MFLD  (IDKVAINI,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDKVAINU,                                              +        
               '  '),                                                  +        
               LTH=2                                                            
         MFLD  (TIREGDAI,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TIREGDAU,                                              +        
               '      '),                                              +        
               LTH=6                                                            
         MFLD  (NEW,                                                   +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  REGDAT9E,                                               +        
               LTH=7                                                            
         MFLD  KLOCK9E,                                                +        
               LTH=9                                                            
         MFLD  REGDAT9N,                                               +        
               LTH=7                                                            
         MFLD  KLOCK9N,                                                +        
               LTH=9                                                            
         MFLD  (RESPIN,                                                +        
               '+++'),                                                 +        
               LTH=3                                                            
         MFLD  (TEKVAINP,                                              +        
               '++++++++++++++++++++'),                                +        
               LTH=20                                                           
         MFLD  (TIKLARQU,                                              +        
               '+++++++'),                                             +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLDELETE,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (TEKVAI01,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               ++++++++'),                                             +        
               LTH=63                                                           
         MFLD  (TEKVAI02,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               ++++++++++++++++++++++++'),                             +        
               LTH=79                                                           
         MFLD  (TEKVAI03,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               ++++++++++++++++++++++++'),                             +        
               LTH=79                                                           
         MFLD  (TEKVAI04,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               ++++++++++++++++++++++++'),                             +        
               LTH=79                                                           
         MFLD  (TEKVAI05,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               ++++++++++++++++++++++++'),                             +        
               LTH=79                                                           
         MFLD  (TEKVAI06,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               ++++++++++++++++++++++++'),                             +        
               LTH=79                                                           
         MFLD  (TEKVAI07,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               ++++++++++++++++++++++++'),                             +        
               LTH=79                                                           
         MFLD  (KDKVAINF,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (TIKLARLE,                                              +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLSTOCH,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (FLQPA,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (TEKVAI11,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               ++++++++'),                                             +        
               LTH=63                                                           
         MFLD  (TEKVAI12,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               ++++++++++++++++++++++++'),                             +        
               LTH=79                                                           
         MFLD  (TEKVAI13,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               ++++++++++++++++++++++++'),                             +        
               LTH=79                                                           
         MFLD  (TEKVAI14,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               ++++++++++++++++++++++++'),                             +        
               LTH=79                                                           
         MFLD  (TEKVAI15,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               ++++++++++++++++++++++++'),                             +        
               LTH=79                                                           
         MFLD  (TEKVAI16,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               ++++++++++++++++++++++++'),                             +        
               LTH=79                                                           
         MFLD  (TEKVAI17,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               ++++++++++++++++++++++++'),                             +        
               LTH=79                                                           
         MSGEND                                                                 
W6O212N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6N212,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I212N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W6N212                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDARTNRI,                                               +        
               LTH=9                                                            
         MFLD  IDARTNRU,                                               +        
               LTH=9                                                            
         MFLD  IDLEVIN,                                                +        
               LTH=5                                                            
         MFLD  IDLEVUT,                                                +        
               LTH=5                                                            
         MFLD  IDKVAINI,                                               +        
               LTH=2                                                            
         MFLD  IDKVAINU,                                               +        
               LTH=2                                                            
         MFLD  TIREGDAI,                                               +        
               LTH=6                                                            
         MFLD  TIREGDAU,                                               +        
               LTH=6                                                            
         MFLD  NEW,                                                    +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  REGDAT9E,                                               +        
               LTH=7                                                            
         MFLD  KLOCK9E,                                                +        
               LTH=9                                                            
         MFLD  REGDAT9N,                                               +        
               LTH=7                                                            
         MFLD  KLOCK9N,                                                +        
               LTH=9                                                            
         MFLD  NOTNR,                                                  +        
               LTH=2                                                            
         MFLD  TIREGDAT,                                               +        
               LTH=6                                                            
         MFLD  RESPIN,                                                 +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RESPUT,                                                 +        
               LTH=3                                                            
         MFLD  TEKVAINP,                                               +        
               LTH=22,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TIKLARQU,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLDELETE,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEKVAI01,                                               +        
               LTH=65,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEKVAI02,                                               +        
               LTH=81,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEKVAI03,                                               +        
               LTH=81,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEKVAI04,                                               +        
               LTH=81,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEKVAI05,                                               +        
               LTH=81,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEKVAI06,                                               +        
               LTH=81,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEKVAI07,                                               +        
               LTH=81,                                                 +        
               ATTR=(YES)                                                       
         MFLD  KDKVAINF,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TIKLARLE,                                               +        
               LTH=8,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLSTOCH,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDLEVNR,                                                +        
               LTH=5                                                            
         MFLD  FLQPA,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEKVAI11,                                               +        
               LTH=65,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEKVAI12,                                               +        
               LTH=81,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEKVAI13,                                               +        
               LTH=81,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEKVAI14,                                               +        
               LTH=81,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEKVAI15,                                               +        
               LTH=81,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEKVAI16,                                               +        
               LTH=81,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEKVAI17,                                               +        
               LTH=81,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=61                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=79                                                           
         MSGEND                                                                 
         END                                                                    
