***********************************************************************         
* CREATED BY V063442   ON 06/03/07  AT 14:14                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'MANUEL CREDIT OF IR             '                               
W6N208   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W6T208 7',                                           +        
               8='W6T208 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W6T208U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W6T201  ',                                          +        
               14='W6T202  ',                                          +        
               15='W6T203  ',                                          +        
               16='W6T204  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W6T207  ',                                          +        
               20='W6T208  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,8)),                                         +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'MANUEL CREDIT OF IR',                                  +        
               POS=(1,12),LTH=19,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Ir-no',                                                +        
               POS=(2,2),LTH=5,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDKRIN   DFLD  POS=(2,8),LTH=5,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  ' ',                                                    +        
               POS=(2,14),LTH=1,                                       +        
               ATTR=(ALPHA)                                                     
IDKRUT   DFLD  POS=(3,8),LTH=5,                                        +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Invoice no.',                                          +        
               POS=(5,2),LTH=11,                                       +        
               ATTR=(PROT)                                                      
FAKTNR   DFLD  POS=(5,14),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Inv.date',                                             +        
               POS=(5,25),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FAKTDAT  DFLD  POS=(5,34),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Creditnoteno',                                         +        
               POS=(5,41),LTH=12,                                      +        
               ATTR=(NUM,PROT)                                                  
KREDNR   DFLD  POS=(5,54),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Date',                                                 +        
               POS=(5,65),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KREDDAT  DFLD  POS=(5,70),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Cred',                                                 +        
               POS=(5,77),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Partno.',                                              +        
               POS=(6,2),LTH=7,                                        +        
               ATTR=(PROT)                                                      
ARTNR    DFLD  POS=(6,10),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Suppl.',                                               +        
               POS=(6,20),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
LEVNR    DFLD  POS=(6,27),LTH=5,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Pers.',                                                +        
               POS=(6,41),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KDPERS   DFLD  POS=(6,47),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
PERSON   DFLD  POS=(6,51),LTH=25,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
         DFLD  'all',                                                  +        
               POS=(6,78),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Partcost',                                             +        
               POS=(7,2),LTH=8,                                        +        
               ATTR=(PROT)                                                      
FPRART   DFLD  POS=(7,24),LTH=12,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Credit partcost',                                      +        
               POS=(7,41),LTH=15,                                      +        
               ATTR=(PROT)                                                      
KPRART   DFLD  POS=(7,67),LTH=12,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Work-cost int.',                                       +        
               POS=(8,2),LTH=14,                                       +        
               ATTR=(PROT)                                                      
FKOSTINT DFLD  POS=(8,25),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Credit work-cost int.',                                +        
               POS=(8,41),LTH=21,                                      +        
               ATTR=(PROT)                                                      
KKOSTINT DFLD  POS=(8,68),LTH=10,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0001 DFLD  POS=(8,80),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Transport cost',                                       +        
               POS=(9,2),LTH=14,                                       +        
               ATTR=(NUM,PROT)                                                  
FKOSTEXT DFLD  POS=(9,25),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Credit transport cost',                                +        
               POS=(9,41),LTH=21,                                      +        
               ATTR=(PROT)                                                      
KKOSTEXT DFLD  POS=(9,68),LTH=10,                                      +        
               ATTR=(NUM,NOPROT)                                                
DGIA0000 DFLD  POS=(9,80),LTH=1,                                       +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Materialcost',                                         +        
               POS=(10,2),LTH=12,                                      +        
               ATTR=(NUM,PROT)                                                  
FSUMAT   DFLD  POS=(10,25),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Credit materialcost',                                  +        
               POS=(10,41),LTH=19,                                     +        
               ATTR=(PROT)                                                      
KSUMAT   DFLD  POS=(10,68),LTH=10,                                     +        
               ATTR=(NUM,NOPROT)                                                
DGIA0002 DFLD  POS=(10,80),LTH=1,                                      +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Amount bef. tax',                                      +        
               POS=(11,2),LTH=15,                                      +        
               ATTR=(NUM,PROT)                                                  
FBEUMOMS DFLD  POS=(11,23),LTH=12,                                     +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Credit amount bef. tax',                               +        
               POS=(11,41),LTH=22,                                     +        
               ATTR=(PROT)                                                      
KBEUMOMS DFLD  POS=(11,66),LTH=12,                                     +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Tax',                                                  +        
               POS=(12,2),LTH=3,                                       +        
               ATTR=(PROT)                                                      
FPRMOMS  DFLD  POS=(12,25),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Credit tax',                                           +        
               POS=(12,41),LTH=10,                                     +        
               ATTR=(PROT)                                                      
KPRMOMS  DFLD  POS=(12,68),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Amount',                                               +        
               POS=(14,2),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FBEMMOMS DFLD  POS=(14,23),LTH=12,                                     +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Credit amount',                                        +        
               POS=(14,41),LTH=13,                                     +        
               ATTR=(PROT)                                                      
KBEMMOMS DFLD  POS=(14,66),LTH=12,                                     +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Curren',                                               +        
               POS=(16,2),LTH=6,                                       +        
               ATTR=(PROT)                                                      
KDVALISO DFLD  POS=(16,9),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Cred type',                                            +        
               POS=(16,41),LTH=9,                                      +        
               ATTR=(PROT)                                                      
IDPTYP   DFLD  POS=(16,51),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Note int',                                             +        
               POS=(18,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
TEXTINT  DFLD  POS=(18,11),LTH=70,                                     +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'ext',                                                  +        
               POS=(19,7),LTH=3,                                       +        
               ATTR=(PROT)                                                      
TEXTEXT  DFLD  POS=(19,11),LTH=70,                                     +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'Comment',                                              +        
               POS=(20,2),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
FAKTTEXT DFLD  POS=(20,11),LTH=70,                                     +        
               ATTR=(NOPROT,MOD)                                                
         DFLD  'F10=WHELP  F7=First  F8=Forward  F11=Update F12=Logoff'+        
               ,POS=(22,2),LTH=54,                                     +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W6I208N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W6N208),                                           +        
               OPT=2,                                                  +        
               NXT=W6O208N1                                                     
MID      LPAGE SOR=(FORMAT),                                           +        
               NXT=W6O208N1                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F8'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '62082',                                                +        
               LTH=5                                                            
         MFLD  (IDKRIN,                                                +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDKRUT,                                                +        
               '     '),                                               +        
               LTH=5                                                            
         MFLD  (KDPERS,                                                +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KKOSTINT,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0001,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (KKOSTEXT,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0000,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (KSUMAT,                                                +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0002,                                              +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (TEXTINT,                                               +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++++++++++++'),                                      +        
               LTH=70,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (TEXTEXT,                                               +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++++++++++++'),                                      +        
               LTH=70,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (FAKTTEXT,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++++++++++++'),                                      +        
               LTH=70,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MSGEND                                                                 
W6O208N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6N208,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I208N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT,                                             +        
               NXT=W6I208N1                                                     
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDKRIN,                                                 +        
               LTH=2                                                            
         MFLD  IDKRUT,                                                 +        
               LTH=5                                                            
         MFLD  FAKTNR,                                                 +        
               LTH=8                                                            
         MFLD  FAKTDAT,                                                +        
               LTH=6                                                            
         MFLD  KREDNR,                                                 +        
               LTH=9                                                            
         MFLD  KREDDAT,                                                +        
               LTH=6                                                            
         MFLD  ARTNR,                                                  +        
               LTH=9                                                            
         MFLD  LEVNR,                                                  +        
               LTH=5                                                            
         MFLD  KDPERS,                                                 +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PERSON,                                                 +        
               LTH=25                                                           
         MFLD  FPRART,                                                 +        
               LTH=12                                                           
         MFLD  KPRART,                                                 +        
               LTH=12                                                           
         MFLD  FKOSTINT,                                               +        
               LTH=10                                                           
         MFLD  KKOSTINT,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0001,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FKOSTEXT,                                               +        
               LTH=10                                                           
         MFLD  KKOSTEXT,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0000,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FSUMAT,                                                 +        
               LTH=10                                                           
         MFLD  KSUMAT,                                                 +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DGIA0002,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FBEUMOMS,                                               +        
               LTH=12                                                           
         MFLD  KBEUMOMS,                                               +        
               LTH=12                                                           
         MFLD  FPRMOMS,                                                +        
               LTH=10                                                           
         MFLD  KPRMOMS,                                                +        
               LTH=10                                                           
         MFLD  FBEMMOMS,                                               +        
               LTH=12                                                           
         MFLD  KBEMMOMS,                                               +        
               LTH=12                                                           
         MFLD  KDVALISO,                                               +        
               LTH=3                                                            
         MFLD  IDPTYP,                                                 +        
               LTH=3                                                            
         MFLD  TEXTINT,                                                +        
               LTH=72,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEXTEXT,                                                +        
               LTH=72,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FAKTTEXT,                                               +        
               LTH=72,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=79                                                           
         MSGEND                                                                 
         END                                                                    
