***********************************************************************         
* CREATED BY V059625   ON 04/06/28  AT 14:27                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'DELIVERY BLOCKING               '                               
W6N308   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W6T308 7',                                           +        
               8='W6T308 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W6T308U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W6T301  ',                                          +        
               14='W6T302  ',                                          +        
               15='W6T303  ',                                          +        
               16='W6T304  ',                                          +        
               17='W6T305  ',                                          +        
               18='W6T306  ',                                          +        
               19='W6T307  ',                                          +        
               20='W6T308  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W6T308V ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W6N308   DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DELIVERY BLOCKING',                                    +        
               POS=(1,12),LTH=17,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Part No.',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(NUM,PROT)                                                  
INARTNR  DFLD  POS=(2,12),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Lang.',                                                +        
               POS=(2,25),LTH=5,                                       +        
               ATTR=(PROT)                                                      
INSKYLT  DFLD  POS=(2,31),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'DC',                                                   +        
               POS=(2,36),LTH=2,                                       +        
               ATTR=(PROT)                                                      
INIDDC   DFLD  POS=(2,39),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'SHOW ALL',                                             +        
               POS=(2,43),LTH=8,                                       +        
               ATTR=(PROT)                                                      
INSHOW   DFLD  POS=(2,52),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'TYPE',                                                 +        
               POS=(2,55),LTH=4,                                       +        
               ATTR=(PROT)                                                      
INTYPE   DFLD  POS=(2,60),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
UTARTNR  DFLD  POS=(3,12),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
UTSKYLT  DFLD  POS=(3,31),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
UTIDDC   DFLD  POS=(3,39),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
UTSHOW   DFLD  POS=(3,52),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
UTTYPE   DFLD  POS=(3,60),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Description',                                          +        
               POS=(5,2),LTH=11,                                       +        
               ATTR=(PROT)                                                      
BEART    DFLD  POS=(5,15),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Mail',                                                 +        
               POS=(5,51),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLMAIL   DFLD  POS=(5,56),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Date',                                                 +        
               POS=(5,62),LTH=4,                                       +        
               ATTR=(PROT)                                                      
TIAAMMDD DFLD  POS=(5,68),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'CDC Part Note GLOBAL',                                 +        
               POS=(6,2),LTH=20,                                       +        
               ATTR=(PROT)                                                      
UTGLOB   DFLD  POS=(6,23),LTH=2,                                       +        
               ATTR=(PROT)                                                      
INGLOB   DFLD  POS=(6,26),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Note',                                                 +        
               POS=(6,30),LTH=4,                                       +        
               ATTR=(PROT)                                                      
ARTNOTGL DFLD  POS=(6,35),LTH=25,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Text exist',                                           +        
               POS=(6,62),LTH=10,                                      +        
               ATTR=(PROT)                                                      
FLTEXT   DFLD  POS=(6,73),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'DC',                                                   +        
               POS=(7,2),LTH=2,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Code   Quant.Blocked    SDC/NDC Note   Date    Ref',   +        
               POS=(7,9),LTH=50,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Stock L B',                                            +        
               POS=(7,69),LTH=9,                                       +        
               ATTR=(PROT)                                                      
IDDC1    DFLD  POS=(8,2),LTH=2,                                        +        
               ATTR=(PROT)                                                      
LEVSP1   DFLD  POS=(8,9),LTH=2,                                        +        
               ATTR=(PROT)                                                      
LEVSP1U  DFLD  POS=(8,12),LTH=2,                                       +        
               ATTR=(PROT)                                                      
KVSP1    DFLD  POS=(8,16),LTH=7,                                       +        
               ATTR=(PROT)                                                      
KVSP1U   DFLD  POS=(8,24),LTH=7,                                       +        
               ATTR=(PROT)                                                      
DATUM1   DFLD  POS=(8,48),LTH=6,                                       +        
               ATTR=(PROT)                                                      
USER1    DFLD  POS=(8,56),LTH=8,                                       +        
               ATTR=(PROT)                                                      
KVLS1    DFLD  POS=(8,66),LTH=8,                                       +        
               ATTR=(PROT)                                                      
IDDC2    DFLD  POS=(9,2),LTH=2,                                        +        
               ATTR=(PROT)                                                      
LEVSP2   DFLD  POS=(9,9),LTH=2,                                        +        
               ATTR=(PROT)                                                      
LEVSP2U  DFLD  POS=(9,12),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
KVSP2    DFLD  POS=(9,16),LTH=7,                                       +        
               ATTR=(PROT)                                                      
KVSP2U   DFLD  POS=(9,24),LTH=7,                                       +        
               ATTR=(NOPROT)                                                    
TEKVAL2  DFLD  POS=(9,33),LTH=10,                                      +        
               ATTR=(NOPROT)                                                    
DATUM2   DFLD  POS=(9,48),LTH=6,                                       +        
               ATTR=(PROT)                                                      
USER2    DFLD  POS=(9,56),LTH=8,                                       +        
               ATTR=(PROT)                                                      
KVLS2    DFLD  POS=(9,66),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLLVL2   DFLD  POS=(9,75),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLSPARR2 DFLD  POS=(9,77),LTH=1,                                       +        
               ATTR=(PROT)                                                      
IDDC3    DFLD  POS=(10,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
LEVSP3   DFLD  POS=(10,9),LTH=2,                                       +        
               ATTR=(PROT)                                                      
LEVSP3U  DFLD  POS=(10,12),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
KVSP3    DFLD  POS=(10,16),LTH=7,                                      +        
               ATTR=(PROT)                                                      
KVSP3U   DFLD  POS=(10,24),LTH=7,                                      +        
               ATTR=(NOPROT)                                                    
TEKVAL3  DFLD  POS=(10,33),LTH=10,                                     +        
               ATTR=(NOPROT)                                                    
DATUM3   DFLD  POS=(10,48),LTH=6,                                      +        
               ATTR=(PROT)                                                      
USER3    DFLD  POS=(10,56),LTH=8,                                      +        
               ATTR=(PROT)                                                      
KVLS3    DFLD  POS=(10,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLLVL3   DFLD  POS=(10,75),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLSPARR3 DFLD  POS=(10,77),LTH=1,                                      +        
               ATTR=(PROT)                                                      
IDDC4    DFLD  POS=(11,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
LEVSP4   DFLD  POS=(11,9),LTH=2,                                       +        
               ATTR=(PROT)                                                      
LEVSP4U  DFLD  POS=(11,12),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
KVSP4    DFLD  POS=(11,16),LTH=7,                                      +        
               ATTR=(PROT)                                                      
KVSP4U   DFLD  POS=(11,24),LTH=7,                                      +        
               ATTR=(NOPROT)                                                    
TEKVAL4  DFLD  POS=(11,33),LTH=10,                                     +        
               ATTR=(NOPROT)                                                    
DATUM4   DFLD  POS=(11,48),LTH=6,                                      +        
               ATTR=(PROT)                                                      
USER4    DFLD  POS=(11,56),LTH=8,                                      +        
               ATTR=(PROT)                                                      
KVLS4    DFLD  POS=(11,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLLVL4   DFLD  POS=(11,75),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLSPARR4 DFLD  POS=(11,77),LTH=1,                                      +        
               ATTR=(PROT)                                                      
IDDC5    DFLD  POS=(12,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
LEVSP5   DFLD  POS=(12,9),LTH=2,                                       +        
               ATTR=(PROT)                                                      
LEVSP5U  DFLD  POS=(12,12),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
KVSP5    DFLD  POS=(12,16),LTH=7,                                      +        
               ATTR=(PROT)                                                      
KVSP5U   DFLD  POS=(12,24),LTH=7,                                      +        
               ATTR=(NOPROT)                                                    
TEKVAL5  DFLD  POS=(12,33),LTH=10,                                     +        
               ATTR=(NOPROT)                                                    
DATUM5   DFLD  POS=(12,48),LTH=6,                                      +        
               ATTR=(PROT)                                                      
USER5    DFLD  POS=(12,56),LTH=8,                                      +        
               ATTR=(PROT)                                                      
KVLS5    DFLD  POS=(12,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLLVL5   DFLD  POS=(12,75),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLSPARR5 DFLD  POS=(12,77),LTH=1,                                      +        
               ATTR=(PROT)                                                      
IDDC6    DFLD  POS=(13,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
LEVSP6   DFLD  POS=(13,9),LTH=2,                                       +        
               ATTR=(PROT)                                                      
LEVSP6U  DFLD  POS=(13,12),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
KVSP6    DFLD  POS=(13,16),LTH=7,                                      +        
               ATTR=(PROT)                                                      
KVSP6U   DFLD  POS=(13,24),LTH=7,                                      +        
               ATTR=(NOPROT)                                                    
TEKVAL6  DFLD  POS=(13,33),LTH=10,                                     +        
               ATTR=(NOPROT)                                                    
DATUM6   DFLD  POS=(13,48),LTH=6,                                      +        
               ATTR=(PROT)                                                      
USER6    DFLD  POS=(13,56),LTH=8,                                      +        
               ATTR=(PROT)                                                      
KVLS6    DFLD  POS=(13,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLLVL6   DFLD  POS=(13,75),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLSPARR6 DFLD  POS=(13,77),LTH=1,                                      +        
               ATTR=(PROT)                                                      
IDDC7    DFLD  POS=(14,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
LEVSP7   DFLD  POS=(14,9),LTH=2,                                       +        
               ATTR=(PROT)                                                      
LEVSP7U  DFLD  POS=(14,12),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
KVSP7    DFLD  POS=(14,16),LTH=7,                                      +        
               ATTR=(PROT)                                                      
KVSP7U   DFLD  POS=(14,24),LTH=7,                                      +        
               ATTR=(NOPROT)                                                    
TEKVAL7  DFLD  POS=(14,33),LTH=10,                                     +        
               ATTR=(NOPROT)                                                    
DATUM7   DFLD  POS=(14,48),LTH=6,                                      +        
               ATTR=(PROT)                                                      
USER7    DFLD  POS=(14,56),LTH=8,                                      +        
               ATTR=(PROT)                                                      
KVLS7    DFLD  POS=(14,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLLVL7   DFLD  POS=(14,75),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLSPARR7 DFLD  POS=(14,77),LTH=1,                                      +        
               ATTR=(PROT)                                                      
IDDC8    DFLD  POS=(15,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
LEVSP8   DFLD  POS=(15,9),LTH=2,                                       +        
               ATTR=(PROT)                                                      
LEVSP8U  DFLD  POS=(15,12),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
KVSP8    DFLD  POS=(15,16),LTH=7,                                      +        
               ATTR=(PROT)                                                      
KVSP8U   DFLD  POS=(15,24),LTH=7,                                      +        
               ATTR=(NOPROT)                                                    
TEKVAL8  DFLD  POS=(15,33),LTH=10,                                     +        
               ATTR=(NOPROT)                                                    
DATUM8   DFLD  POS=(15,48),LTH=6,                                      +        
               ATTR=(PROT)                                                      
USER8    DFLD  POS=(15,56),LTH=8,                                      +        
               ATTR=(PROT)                                                      
KVLS8    DFLD  POS=(15,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLLVL8   DFLD  POS=(15,75),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLSPARR8 DFLD  POS=(15,77),LTH=1,                                      +        
               ATTR=(PROT)                                                      
IDDC9    DFLD  POS=(16,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
LEVSP9   DFLD  POS=(16,9),LTH=2,                                       +        
               ATTR=(PROT)                                                      
LEVSP9U  DFLD  POS=(16,12),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
KVSP9    DFLD  POS=(16,16),LTH=7,                                      +        
               ATTR=(PROT)                                                      
KVSP9U   DFLD  POS=(16,24),LTH=7,                                      +        
               ATTR=(NOPROT)                                                    
TEKVAL9  DFLD  POS=(16,33),LTH=10,                                     +        
               ATTR=(NOPROT)                                                    
DATUM9   DFLD  POS=(16,48),LTH=6,                                      +        
               ATTR=(PROT)                                                      
USER9    DFLD  POS=(16,56),LTH=8,                                      +        
               ATTR=(PROT)                                                      
KVLS9    DFLD  POS=(16,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLLVL9   DFLD  POS=(16,75),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLSPARR9 DFLD  POS=(16,77),LTH=1,                                      +        
               ATTR=(PROT)                                                      
IDDC10   DFLD  POS=(17,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
LEVSP10  DFLD  POS=(17,9),LTH=2,                                       +        
               ATTR=(PROT)                                                      
LEVSP10U DFLD  POS=(17,12),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
KVSP10   DFLD  POS=(17,16),LTH=7,                                      +        
               ATTR=(PROT)                                                      
KVSP10U  DFLD  POS=(17,24),LTH=7,                                      +        
               ATTR=(NOPROT)                                                    
TEKVAL10 DFLD  POS=(17,33),LTH=10,                                     +        
               ATTR=(NOPROT)                                                    
DATUM10  DFLD  POS=(17,48),LTH=6,                                      +        
               ATTR=(PROT)                                                      
USER10   DFLD  POS=(17,56),LTH=8,                                      +        
               ATTR=(PROT)                                                      
KVLS10   DFLD  POS=(17,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLLVL10  DFLD  POS=(17,75),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLSPAR10 DFLD  POS=(17,77),LTH=1,                                      +        
               ATTR=(PROT)                                                      
IDDC11   DFLD  POS=(18,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
LEVSP11  DFLD  POS=(18,9),LTH=2,                                       +        
               ATTR=(PROT)                                                      
LEVSP11U DFLD  POS=(18,12),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
KVSP11   DFLD  POS=(18,16),LTH=7,                                      +        
               ATTR=(PROT)                                                      
KVSP11U  DFLD  POS=(18,24),LTH=7,                                      +        
               ATTR=(NOPROT)                                                    
TEKVAL11 DFLD  POS=(18,33),LTH=10,                                     +        
               ATTR=(NOPROT)                                                    
DATUM11  DFLD  POS=(18,48),LTH=6,                                      +        
               ATTR=(PROT)                                                      
USER11   DFLD  POS=(18,56),LTH=8,                                      +        
               ATTR=(PROT)                                                      
KVLS11   DFLD  POS=(18,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLLVL11  DFLD  POS=(18,75),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLSPAR11 DFLD  POS=(18,77),LTH=1,                                      +        
               ATTR=(PROT)                                                      
IDDC12   DFLD  POS=(19,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
LEVSP12  DFLD  POS=(19,9),LTH=2,                                       +        
               ATTR=(PROT)                                                      
LEVSP12U DFLD  POS=(19,12),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
KVSP12   DFLD  POS=(19,16),LTH=7,                                      +        
               ATTR=(PROT)                                                      
KVSP12U  DFLD  POS=(19,24),LTH=7,                                      +        
               ATTR=(NOPROT)                                                    
TEKVAL12 DFLD  POS=(19,33),LTH=10,                                     +        
               ATTR=(NOPROT)                                                    
DATUM12  DFLD  POS=(19,48),LTH=6,                                      +        
               ATTR=(PROT)                                                      
USER12   DFLD  POS=(19,56),LTH=8,                                      +        
               ATTR=(PROT)                                                      
KVLS12   DFLD  POS=(19,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLLVL12  DFLD  POS=(19,75),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLSPAR12 DFLD  POS=(19,77),LTH=1,                                      +        
               ATTR=(PROT)                                                      
IDDC13   DFLD  POS=(20,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
LEVSP13  DFLD  POS=(20,9),LTH=2,                                       +        
               ATTR=(PROT)                                                      
LEVSP13U DFLD  POS=(20,12),LTH=2,                                      +        
               ATTR=(NOPROT)                                                    
KVSP13   DFLD  POS=(20,16),LTH=7,                                      +        
               ATTR=(PROT)                                                      
KVSP13U  DFLD  POS=(20,24),LTH=7,                                      +        
               ATTR=(NOPROT)                                                    
TEKVAL13 DFLD  POS=(20,33),LTH=10,                                     +        
               ATTR=(NOPROT)                                                    
DATUM13  DFLD  POS=(20,48),LTH=6,                                      +        
               ATTR=(PROT)                                                      
USER13   DFLD  POS=(20,56),LTH=8,                                      +        
               ATTR=(PROT)                                                      
KVLS13   DFLD  POS=(20,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLLVL13  DFLD  POS=(20,75),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLSPAR13 DFLD  POS=(20,77),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '13 Goods Rcv.   14 Unloading',                         +        
               POS=(21,1),LTH=28,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15 Binning',                                           +        
               POS=(21,36),LTH=10,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '16 Stock reg.  17 Buffer Inf.18',                      +        
               POS=(21,52),LTH=31,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Location Inq.19 Goods Rcv Hist. 20 Deliv.Block. 21',   +        
               POS=(22,4),LTH=50,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,67),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMSINF  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT,HI)                                                   
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT,HI)                                               
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W6O308N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6N308,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I308N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W6N308                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  INARTNR,                                                +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  UTARTNR,                                                +        
               LTH=9                                                            
         MFLD  INSKYLT,                                                +        
               LTH=3                                                            
         MFLD  UTSKYLT,                                                +        
               LTH=3                                                            
         MFLD  INIDDC,                                                 +        
               LTH=2                                                            
         MFLD  UTIDDC,                                                 +        
               LTH=2                                                            
         MFLD  INSHOW,                                                 +        
               LTH=1                                                            
         MFLD  UTSHOW,                                                 +        
               LTH=1                                                            
         MFLD  INTYPE,                                                 +        
               LTH=1                                                            
         MFLD  UTTYPE,                                                 +        
               LTH=1                                                            
         MFLD  BEART,                                                  +        
               LTH=25                                                           
         MFLD  FLMAIL,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TIAAMMDD,                                               +        
               LTH=6                                                            
         MFLD  UTGLOB,                                                 +        
               LTH=2                                                            
         MFLD  INGLOB,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTNOTGL,                                               +        
               LTH=27,                                                 +        
               ATTR=(YES)                                                       
         MFLD  FLTEXT,                                                 +        
               LTH=1                                                            
         MFLD  IDDC1,                                                  +        
               LTH=2                                                            
         MFLD  LEVSP1,                                                 +        
               LTH=2                                                            
         MFLD  LEVSP1U,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVSP1,                                                  +        
               LTH=7                                                            
         MFLD  KVSP1U,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DATUM1,                                                 +        
               LTH=6                                                            
         MFLD  USER1,                                                  +        
               LTH=8                                                            
         MFLD  KVLS1,                                                  +        
               LTH=8                                                            
         MFLD  IDDC2,                                                  +        
               LTH=2                                                            
         MFLD  LEVSP2,                                                 +        
               LTH=2                                                            
         MFLD  LEVSP2U,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVSP2,                                                  +        
               LTH=7                                                            
         MFLD  KVSP2U,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEKVAL2,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DATUM2,                                                 +        
               LTH=6                                                            
         MFLD  USER2,                                                  +        
               LTH=8                                                            
         MFLD  KVLS2,                                                  +        
               LTH=8                                                            
         MFLD  FLLVL2,                                                 +        
               LTH=1                                                            
         MFLD  FLSPARR2,                                               +        
               LTH=1                                                            
         MFLD  IDDC3,                                                  +        
               LTH=2                                                            
         MFLD  LEVSP3,                                                 +        
               LTH=2                                                            
         MFLD  LEVSP3U,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVSP3,                                                  +        
               LTH=7                                                            
         MFLD  KVSP3U,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEKVAL3,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DATUM3,                                                 +        
               LTH=6                                                            
         MFLD  USER3,                                                  +        
               LTH=8                                                            
         MFLD  KVLS3,                                                  +        
               LTH=8                                                            
         MFLD  FLLVL3,                                                 +        
               LTH=1                                                            
         MFLD  FLSPARR3,                                               +        
               LTH=1                                                            
         MFLD  IDDC4,                                                  +        
               LTH=2                                                            
         MFLD  LEVSP4,                                                 +        
               LTH=2                                                            
         MFLD  LEVSP4U,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVSP4,                                                  +        
               LTH=7                                                            
         MFLD  KVSP4U,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEKVAL4,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DATUM4,                                                 +        
               LTH=6                                                            
         MFLD  USER4,                                                  +        
               LTH=8                                                            
         MFLD  KVLS4,                                                  +        
               LTH=8                                                            
         MFLD  FLLVL4,                                                 +        
               LTH=1                                                            
         MFLD  FLSPARR4,                                               +        
               LTH=1                                                            
         MFLD  IDDC5,                                                  +        
               LTH=2                                                            
         MFLD  LEVSP5,                                                 +        
               LTH=2                                                            
         MFLD  LEVSP5U,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVSP5,                                                  +        
               LTH=7                                                            
         MFLD  KVSP5U,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEKVAL5,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DATUM5,                                                 +        
               LTH=6                                                            
         MFLD  USER5,                                                  +        
               LTH=8                                                            
         MFLD  KVLS5,                                                  +        
               LTH=8                                                            
         MFLD  FLLVL5,                                                 +        
               LTH=1                                                            
         MFLD  FLSPARR5,                                               +        
               LTH=1                                                            
         MFLD  IDDC6,                                                  +        
               LTH=2                                                            
         MFLD  LEVSP6,                                                 +        
               LTH=2                                                            
         MFLD  LEVSP6U,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVSP6,                                                  +        
               LTH=7                                                            
         MFLD  KVSP6U,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEKVAL6,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DATUM6,                                                 +        
               LTH=6                                                            
         MFLD  USER6,                                                  +        
               LTH=8                                                            
         MFLD  KVLS6,                                                  +        
               LTH=8                                                            
         MFLD  FLLVL6,                                                 +        
               LTH=1                                                            
         MFLD  FLSPARR6,                                               +        
               LTH=1                                                            
         MFLD  IDDC7,                                                  +        
               LTH=2                                                            
         MFLD  LEVSP7,                                                 +        
               LTH=2                                                            
         MFLD  LEVSP7U,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVSP7,                                                  +        
               LTH=7                                                            
         MFLD  KVSP7U,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEKVAL7,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DATUM7,                                                 +        
               LTH=6                                                            
         MFLD  USER7,                                                  +        
               LTH=8                                                            
         MFLD  KVLS7,                                                  +        
               LTH=8                                                            
         MFLD  FLLVL7,                                                 +        
               LTH=1                                                            
         MFLD  FLSPARR7,                                               +        
               LTH=1                                                            
         MFLD  IDDC8,                                                  +        
               LTH=2                                                            
         MFLD  LEVSP8,                                                 +        
               LTH=2                                                            
         MFLD  LEVSP8U,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVSP8,                                                  +        
               LTH=7                                                            
         MFLD  KVSP8U,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEKVAL8,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DATUM8,                                                 +        
               LTH=6                                                            
         MFLD  USER8,                                                  +        
               LTH=8                                                            
         MFLD  KVLS8,                                                  +        
               LTH=8                                                            
         MFLD  FLLVL8,                                                 +        
               LTH=1                                                            
         MFLD  FLSPARR8,                                               +        
               LTH=1                                                            
         MFLD  IDDC9,                                                  +        
               LTH=2                                                            
         MFLD  LEVSP9,                                                 +        
               LTH=2                                                            
         MFLD  LEVSP9U,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVSP9,                                                  +        
               LTH=7                                                            
         MFLD  KVSP9U,                                                 +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEKVAL9,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DATUM9,                                                 +        
               LTH=6                                                            
         MFLD  USER9,                                                  +        
               LTH=8                                                            
         MFLD  KVLS9,                                                  +        
               LTH=8                                                            
         MFLD  FLLVL9,                                                 +        
               LTH=1                                                            
         MFLD  FLSPARR9,                                               +        
               LTH=1                                                            
         MFLD  IDDC10,                                                 +        
               LTH=2                                                            
         MFLD  LEVSP10,                                                +        
               LTH=2                                                            
         MFLD  LEVSP10U,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVSP10,                                                 +        
               LTH=7                                                            
         MFLD  KVSP10U,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEKVAL10,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DATUM10,                                                +        
               LTH=6                                                            
         MFLD  USER10,                                                 +        
               LTH=8                                                            
         MFLD  KVLS10,                                                 +        
               LTH=8                                                            
         MFLD  FLLVL10,                                                +        
               LTH=1                                                            
         MFLD  FLSPAR10,                                               +        
               LTH=1                                                            
         MFLD  IDDC11,                                                 +        
               LTH=2                                                            
         MFLD  LEVSP11,                                                +        
               LTH=2                                                            
         MFLD  LEVSP11U,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVSP11,                                                 +        
               LTH=7                                                            
         MFLD  KVSP11U,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEKVAL11,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DATUM11,                                                +        
               LTH=6                                                            
         MFLD  USER11,                                                 +        
               LTH=8                                                            
         MFLD  KVLS11,                                                 +        
               LTH=8                                                            
         MFLD  FLLVL11,                                                +        
               LTH=1                                                            
         MFLD  FLSPAR11,                                               +        
               LTH=1                                                            
         MFLD  IDDC12,                                                 +        
               LTH=2                                                            
         MFLD  LEVSP12,                                                +        
               LTH=2                                                            
         MFLD  LEVSP12U,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVSP12,                                                 +        
               LTH=7                                                            
         MFLD  KVSP12U,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEKVAL12,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DATUM12,                                                +        
               LTH=6                                                            
         MFLD  USER12,                                                 +        
               LTH=8                                                            
         MFLD  KVLS12,                                                 +        
               LTH=8                                                            
         MFLD  FLLVL12,                                                +        
               LTH=1                                                            
         MFLD  FLSPAR12,                                               +        
               LTH=1                                                            
         MFLD  IDDC13,                                                 +        
               LTH=2                                                            
         MFLD  LEVSP13,                                                +        
               LTH=2                                                            
         MFLD  LEVSP13U,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KVSP13,                                                 +        
               LTH=7                                                            
         MFLD  KVSP13U,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEKVAL13,                                               +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  DATUM13,                                                +        
               LTH=6                                                            
         MFLD  USER13,                                                 +        
               LTH=8                                                            
         MFLD  KVLS13,                                                 +        
               LTH=8                                                            
         MFLD  FLLVL13,                                                +        
               LTH=1                                                            
         MFLD  FLSPAR13,                                               +        
               LTH=1                                                            
         MFLD  TEMSINF,                                                +        
               LTH=55                                                           
         MFLD  DATE,                                                   +        
               LTH=8                                                            
         MFLD  TIME,                                                   +        
               LTH=8                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W6I308N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W6N308),                                           +        
               OPT=2,                                                  +        
               NXT=W6O308N1                                                     
MID      LPAGE SOR=(W6N308)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F8'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '63082',                                                +        
               LTH=5                                                            
         MFLD  (INARTNR,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  UTARTNR,                                                +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (INSKYLT,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  UTSKYLT,                                                +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (INIDDC,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  UTIDDC,                                                 +        
               LTH=2,                                                  +        
               FILL=X'40'                                                       
         MFLD  (INSHOW,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  UTSHOW,                                                 +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (INTYPE,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  UTTYPE,                                                 +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLMAIL,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (INGLOB,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNOTGL,                                              +        
               '+++++++++++++++++++++++++'),                           +        
               LTH=25,                                                 +        
               FILL=X'40'                                                       
         MFLD  (LEVSP1U,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVSP1U,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LEVSP2U,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVSP2U,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TEKVAL2,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MFLD  (LEVSP3U,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVSP3U,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TEKVAL3,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MFLD  (LEVSP4U,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVSP4U,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TEKVAL4,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MFLD  (LEVSP5U,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVSP5U,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TEKVAL5,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MFLD  (LEVSP6U,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVSP6U,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TEKVAL6,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MFLD  (LEVSP7U,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVSP7U,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TEKVAL7,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MFLD  (LEVSP8U,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVSP8U,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TEKVAL8,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MFLD  (LEVSP9U,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVSP9U,                                                +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TEKVAL9,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MFLD  (LEVSP10U,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVSP10U,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TEKVAL10,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MFLD  (LEVSP11U,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVSP11U,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TEKVAL11,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MFLD  (LEVSP12U,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVSP12U,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TEKVAL12,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MFLD  (LEVSP13U,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVSP13U,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TEKVAL13,                                              +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
