***********************************************************************         
* CREATED BY PC63557   ON 97/07/07  AT 12:50                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'storage code info and updating  '                               
W6N312   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W6T312 7',                                           +        
               8='W6T312 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W6T312U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W6T311  ',                                          +        
               14='W6T312  ',                                          +        
               15='W6T313  ',                                          +        
               16='W6T314  ',                                          +        
               17='W6T315  ',                                          +        
               18='W6T316  ',                                          +        
               19='W6T317  ',                                          +        
               20='W6T318  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W6T312U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W6N312   DPAGE CURSOR=((2,22)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'LIST STORAGE CODE AND UPD',                            +        
               POS=(1,12),LTH=25,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Storage code',                                         +        
               POS=(2,8),LTH=12,                                       +        
               ATTR=(PROT)                                                      
IDSTORI  DFLD  POS=(2,22),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'DC',                                                   +        
               POS=(3,2),LTH=2,                                        +        
               ATTR=(PROT)                                                      
IDDC     DFLD  POS=(3,5),LTH=2,                                        +        
               ATTR=(PROT,MOD)                                                  
IDSTORUT DFLD  POS=(3,22),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
IDSTORSP DFLD  POS=(4,2),LTH=3,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Code   Depth  Width  Height   Description',            +        
               POS=(5,2),LTH=41,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'VSOP Codes',                                           +        
               POS=(5,51),LTH=10,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Ch',                                                   +        
               POS=(5,72),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDSTORU  DFLD  POS=(6,3),LTH=3,                                        +        
               ATTR=(NOPROT)                                                    
DISTORDU DFLD  POS=(6,9),LTH=5,                                        +        
               ATTR=(NOPROT)                                                    
DISTORLU DFLD  POS=(6,16),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
DISTORHU DFLD  POS=(6,24),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
TESTORU  DFLD  POS=(6,32),LTH=18,                                      +        
               ATTR=(NOPROT)                                                    
KDVSOP1U DFLD  POS=(6,51),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
KDVSOP2U DFLD  POS=(6,55),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
KDVSOP3U DFLD  POS=(6,59),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
KDVSOP4U DFLD  POS=(6,63),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
KDVSOP5U DFLD  POS=(6,67),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
KDANDR   DFLD  POS=(6,72),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDSTO1   DFLD  POS=(7,3),LTH=3,                                        +        
               ATTR=(PROT)                                                      
DISTOD1  DFLD  POS=(7,9),LTH=5,                                        +        
               ATTR=(PROT)                                                      
DISTOL1  DFLD  POS=(7,16),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DISTOH1  DFLD  POS=(7,24),LTH=5,                                       +        
               ATTR=(PROT)                                                      
TESTO1   DFLD  POS=(7,32),LTH=18,                                      +        
               ATTR=(PROT)                                                      
VSOPA1   DFLD  POS=(7,51),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
VSOPB1   DFLD  POS=(7,55),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
VSOPC1   DFLD  POS=(7,59),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
VSOPD1   DFLD  POS=(7,63),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
VSOPE1   DFLD  POS=(7,67),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
IDSTO2   DFLD  POS=(8,3),LTH=3,                                        +        
               ATTR=(PROT)                                                      
DISTOD2  DFLD  POS=(8,9),LTH=5,                                        +        
               ATTR=(PROT)                                                      
DISTOL2  DFLD  POS=(8,16),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DISTOH2  DFLD  POS=(8,24),LTH=5,                                       +        
               ATTR=(PROT)                                                      
TESTO2   DFLD  POS=(8,32),LTH=18,                                      +        
               ATTR=(PROT)                                                      
VSOPA2   DFLD  POS=(8,51),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
VSOPB2   DFLD  POS=(8,55),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
VSOPC2   DFLD  POS=(8,59),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
VSOPD2   DFLD  POS=(8,63),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
VSOPE2   DFLD  POS=(8,67),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
IDSTO3   DFLD  POS=(9,3),LTH=3,                                        +        
               ATTR=(PROT)                                                      
DISTOD3  DFLD  POS=(9,9),LTH=5,                                        +        
               ATTR=(PROT)                                                      
DISTOL3  DFLD  POS=(9,16),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DISTOH3  DFLD  POS=(9,24),LTH=5,                                       +        
               ATTR=(PROT)                                                      
TESTO3   DFLD  POS=(9,32),LTH=18,                                      +        
               ATTR=(PROT)                                                      
VSOPA3   DFLD  POS=(9,51),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
VSOPB3   DFLD  POS=(9,55),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
VSOPC3   DFLD  POS=(9,59),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
VSOPD3   DFLD  POS=(9,63),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
VSOPE3   DFLD  POS=(9,67),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
IDSTO4   DFLD  POS=(10,3),LTH=3,                                       +        
               ATTR=(PROT)                                                      
DISTOD4  DFLD  POS=(10,9),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DISTOL4  DFLD  POS=(10,16),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DISTOH4  DFLD  POS=(10,24),LTH=5,                                      +        
               ATTR=(PROT)                                                      
TESTO4   DFLD  POS=(10,32),LTH=18,                                     +        
               ATTR=(PROT)                                                      
VSOPA4   DFLD  POS=(10,51),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
VSOPB4   DFLD  POS=(10,55),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
VSOPC4   DFLD  POS=(10,59),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
VSOPD4   DFLD  POS=(10,63),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
VSOPE4   DFLD  POS=(10,67),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
IDSTO5   DFLD  POS=(11,3),LTH=3,                                       +        
               ATTR=(PROT)                                                      
DISTOD5  DFLD  POS=(11,9),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DISTOL5  DFLD  POS=(11,16),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DISTOH5  DFLD  POS=(11,24),LTH=5,                                      +        
               ATTR=(PROT)                                                      
TESTO5   DFLD  POS=(11,32),LTH=18,                                     +        
               ATTR=(PROT)                                                      
VSOPA5   DFLD  POS=(11,51),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
VSOPB5   DFLD  POS=(11,55),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
VSOPC5   DFLD  POS=(11,59),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
VSOPD5   DFLD  POS=(11,63),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
VSOPE5   DFLD  POS=(11,67),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
IDSTO6   DFLD  POS=(12,3),LTH=3,                                       +        
               ATTR=(PROT)                                                      
DISTOD6  DFLD  POS=(12,9),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DISTOL6  DFLD  POS=(12,16),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DISTOH6  DFLD  POS=(12,24),LTH=5,                                      +        
               ATTR=(PROT)                                                      
TESTO6   DFLD  POS=(12,32),LTH=18,                                     +        
               ATTR=(PROT)                                                      
VSOPA6   DFLD  POS=(12,51),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
VSOPB6   DFLD  POS=(12,55),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
VSOPC6   DFLD  POS=(12,59),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
VSOPD6   DFLD  POS=(12,63),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
VSOPE6   DFLD  POS=(12,67),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
IDSTO7   DFLD  POS=(13,3),LTH=3,                                       +        
               ATTR=(PROT)                                                      
DISTOD7  DFLD  POS=(13,9),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DISTOL7  DFLD  POS=(13,16),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DISTOH7  DFLD  POS=(13,24),LTH=5,                                      +        
               ATTR=(PROT)                                                      
TESTO7   DFLD  POS=(13,32),LTH=18,                                     +        
               ATTR=(PROT)                                                      
VSOPA7   DFLD  POS=(13,51),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
VSOPB7   DFLD  POS=(13,55),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
VSOPC7   DFLD  POS=(13,59),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
VSOPD7   DFLD  POS=(13,63),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
VSOPE7   DFLD  POS=(13,67),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
IDSTO8   DFLD  POS=(14,3),LTH=3,                                       +        
               ATTR=(PROT)                                                      
DISTOD8  DFLD  POS=(14,9),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DISTOL8  DFLD  POS=(14,16),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DISTOH8  DFLD  POS=(14,24),LTH=5,                                      +        
               ATTR=(PROT)                                                      
TESTO8   DFLD  POS=(14,32),LTH=18,                                     +        
               ATTR=(PROT)                                                      
VSOPA8   DFLD  POS=(14,51),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
VSOPB8   DFLD  POS=(14,55),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
VSOPC8   DFLD  POS=(14,59),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
VSOPD8   DFLD  POS=(14,63),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
VSOPE8   DFLD  POS=(14,67),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
IDSTO9   DFLD  POS=(15,3),LTH=3,                                       +        
               ATTR=(PROT)                                                      
DISTOD9  DFLD  POS=(15,9),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DISTOL9  DFLD  POS=(15,16),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DISTOH9  DFLD  POS=(15,24),LTH=5,                                      +        
               ATTR=(PROT)                                                      
TESTO9   DFLD  POS=(15,32),LTH=18,                                     +        
               ATTR=(PROT)                                                      
VSOPA9   DFLD  POS=(15,51),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
VSOPB9   DFLD  POS=(15,55),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
VSOPC9   DFLD  POS=(15,59),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
VSOPD9   DFLD  POS=(15,63),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
VSOPE9   DFLD  POS=(15,67),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
IDSTO10  DFLD  POS=(16,3),LTH=3,                                       +        
               ATTR=(PROT)                                                      
DISTOD10 DFLD  POS=(16,9),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DISTOL10 DFLD  POS=(16,16),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DISTOH10 DFLD  POS=(16,24),LTH=5,                                      +        
               ATTR=(PROT)                                                      
TESTO10  DFLD  POS=(16,32),LTH=18,                                     +        
               ATTR=(PROT)                                                      
VSOPA10  DFLD  POS=(16,51),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
VSOPB10  DFLD  POS=(16,55),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
VSOPC10  DFLD  POS=(16,59),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
VSOPD10  DFLD  POS=(16,63),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
VSOPE10  DFLD  POS=(16,67),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
IDSTO11  DFLD  POS=(17,3),LTH=3,                                       +        
               ATTR=(PROT)                                                      
DISTOD11 DFLD  POS=(17,9),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DISTOL11 DFLD  POS=(17,16),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DISTOH11 DFLD  POS=(17,24),LTH=5,                                      +        
               ATTR=(PROT)                                                      
TESTO11  DFLD  POS=(17,32),LTH=18,                                     +        
               ATTR=(PROT)                                                      
VSOPA11  DFLD  POS=(17,51),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
VSOPB11  DFLD  POS=(17,55),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
VSOPC11  DFLD  POS=(17,59),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
VSOPD11  DFLD  POS=(17,63),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
VSOPE11  DFLD  POS=(17,67),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
IDSTO12  DFLD  POS=(18,3),LTH=3,                                       +        
               ATTR=(PROT)                                                      
DISTOD12 DFLD  POS=(18,9),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DISTOL12 DFLD  POS=(18,16),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DISTOH12 DFLD  POS=(18,24),LTH=5,                                      +        
               ATTR=(PROT)                                                      
TESTO12  DFLD  POS=(18,32),LTH=18,                                     +        
               ATTR=(PROT)                                                      
VSOPA12  DFLD  POS=(18,51),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
VSOPB12  DFLD  POS=(18,55),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
VSOPC12  DFLD  POS=(18,59),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
VSOPD12  DFLD  POS=(18,63),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
VSOPE12  DFLD  POS=(18,67),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
IDSTO13  DFLD  POS=(19,3),LTH=3,                                       +        
               ATTR=(PROT)                                                      
DISTOD13 DFLD  POS=(19,9),LTH=5,                                       +        
               ATTR=(PROT)                                                      
DISTOL13 DFLD  POS=(19,16),LTH=5,                                      +        
               ATTR=(PROT)                                                      
DISTOH13 DFLD  POS=(19,24),LTH=5,                                      +        
               ATTR=(PROT)                                                      
TESTO13  DFLD  POS=(19,32),LTH=18,                                     +        
               ATTR=(PROT)                                                      
VSOPA13  DFLD  POS=(19,51),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
VSOPB13  DFLD  POS=(19,55),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
VSOPC13  DFLD  POS=(19,59),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
VSOPD13  DFLD  POS=(19,63),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
VSOPE13  DFLD  POS=(19,67),LTH=3,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  '13 Main.FreqTab 14 ListStor.Cod 15 Maint. Loc   16 Add +        
               Location 17 Change Loc',                                +        
               POS=(21,1),LTH=77,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 List Fr. Loc 19 List Loc',                          +        
               POS=(22,1),LTH=27,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20 Copy Loc',                                          +        
               POS=(22,33),LTH=11,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,49),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10  WHELP',                                            +        
               POS=(22,65),LTH=9,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W6O312N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6N312,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I312N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W6N312                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  IDDC,                                                   +        
               LTH=2                                                            
         MFLD  IDSTORI,                                                +        
               LTH=3                                                            
         MFLD  IDSTORUT,                                               +        
               LTH=3                                                            
         MFLD  IDSTORSP,                                               +        
               LTH=3                                                            
         MFLD  IDSTORU,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISTORDU,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISTORLU,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  DISTORHU,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TESTORU,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDVSOP1U,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDVSOP2U,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDVSOP3U,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDVSOP4U,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDVSOP5U,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDANDR,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDSTO1,                                                 +        
               LTH=3                                                            
         MFLD  DISTOD1,                                                +        
               LTH=5                                                            
         MFLD  DISTOL1,                                                +        
               LTH=5                                                            
         MFLD  DISTOH1,                                                +        
               LTH=5                                                            
         MFLD  TESTO1,                                                 +        
               LTH=18                                                           
         MFLD  VSOPA1,                                                 +        
               LTH=3                                                            
         MFLD  VSOPB1,                                                 +        
               LTH=3                                                            
         MFLD  VSOPC1,                                                 +        
               LTH=3                                                            
         MFLD  VSOPD1,                                                 +        
               LTH=3                                                            
         MFLD  VSOPE1,                                                 +        
               LTH=3                                                            
         MFLD  IDSTO2,                                                 +        
               LTH=3                                                            
         MFLD  DISTOD2,                                                +        
               LTH=5                                                            
         MFLD  DISTOL2,                                                +        
               LTH=5                                                            
         MFLD  DISTOH2,                                                +        
               LTH=5                                                            
         MFLD  TESTO2,                                                 +        
               LTH=18                                                           
         MFLD  VSOPA2,                                                 +        
               LTH=3                                                            
         MFLD  VSOPB2,                                                 +        
               LTH=3                                                            
         MFLD  VSOPC2,                                                 +        
               LTH=3                                                            
         MFLD  VSOPD2,                                                 +        
               LTH=3                                                            
         MFLD  VSOPE2,                                                 +        
               LTH=3                                                            
         MFLD  IDSTO3,                                                 +        
               LTH=3                                                            
         MFLD  DISTOD3,                                                +        
               LTH=5                                                            
         MFLD  DISTOL3,                                                +        
               LTH=5                                                            
         MFLD  DISTOH3,                                                +        
               LTH=5                                                            
         MFLD  TESTO3,                                                 +        
               LTH=18                                                           
         MFLD  VSOPA3,                                                 +        
               LTH=3                                                            
         MFLD  VSOPB3,                                                 +        
               LTH=3                                                            
         MFLD  VSOPC3,                                                 +        
               LTH=3                                                            
         MFLD  VSOPD3,                                                 +        
               LTH=3                                                            
         MFLD  VSOPE3,                                                 +        
               LTH=3                                                            
         MFLD  IDSTO4,                                                 +        
               LTH=3                                                            
         MFLD  DISTOD4,                                                +        
               LTH=5                                                            
         MFLD  DISTOL4,                                                +        
               LTH=5                                                            
         MFLD  DISTOH4,                                                +        
               LTH=5                                                            
         MFLD  TESTO4,                                                 +        
               LTH=18                                                           
         MFLD  VSOPA4,                                                 +        
               LTH=3                                                            
         MFLD  VSOPB4,                                                 +        
               LTH=3                                                            
         MFLD  VSOPC4,                                                 +        
               LTH=3                                                            
         MFLD  VSOPD4,                                                 +        
               LTH=3                                                            
         MFLD  VSOPE4,                                                 +        
               LTH=3                                                            
         MFLD  IDSTO5,                                                 +        
               LTH=3                                                            
         MFLD  DISTOD5,                                                +        
               LTH=5                                                            
         MFLD  DISTOL5,                                                +        
               LTH=5                                                            
         MFLD  DISTOH5,                                                +        
               LTH=5                                                            
         MFLD  TESTO5,                                                 +        
               LTH=18                                                           
         MFLD  VSOPA5,                                                 +        
               LTH=3                                                            
         MFLD  VSOPB5,                                                 +        
               LTH=3                                                            
         MFLD  VSOPC5,                                                 +        
               LTH=3                                                            
         MFLD  VSOPD5,                                                 +        
               LTH=3                                                            
         MFLD  VSOPE5,                                                 +        
               LTH=3                                                            
         MFLD  IDSTO6,                                                 +        
               LTH=3                                                            
         MFLD  DISTOD6,                                                +        
               LTH=5                                                            
         MFLD  DISTOL6,                                                +        
               LTH=5                                                            
         MFLD  DISTOH6,                                                +        
               LTH=5                                                            
         MFLD  TESTO6,                                                 +        
               LTH=18                                                           
         MFLD  VSOPA6,                                                 +        
               LTH=3                                                            
         MFLD  VSOPB6,                                                 +        
               LTH=3                                                            
         MFLD  VSOPC6,                                                 +        
               LTH=3                                                            
         MFLD  VSOPD6,                                                 +        
               LTH=3                                                            
         MFLD  VSOPE6,                                                 +        
               LTH=3                                                            
         MFLD  IDSTO7,                                                 +        
               LTH=3                                                            
         MFLD  DISTOD7,                                                +        
               LTH=5                                                            
         MFLD  DISTOL7,                                                +        
               LTH=5                                                            
         MFLD  DISTOH7,                                                +        
               LTH=5                                                            
         MFLD  TESTO7,                                                 +        
               LTH=18                                                           
         MFLD  VSOPA7,                                                 +        
               LTH=3                                                            
         MFLD  VSOPB7,                                                 +        
               LTH=3                                                            
         MFLD  VSOPC7,                                                 +        
               LTH=3                                                            
         MFLD  VSOPD7,                                                 +        
               LTH=3                                                            
         MFLD  VSOPE7,                                                 +        
               LTH=3                                                            
         MFLD  IDSTO8,                                                 +        
               LTH=3                                                            
         MFLD  DISTOD8,                                                +        
               LTH=5                                                            
         MFLD  DISTOL8,                                                +        
               LTH=5                                                            
         MFLD  DISTOH8,                                                +        
               LTH=5                                                            
         MFLD  TESTO8,                                                 +        
               LTH=18                                                           
         MFLD  VSOPA8,                                                 +        
               LTH=3                                                            
         MFLD  VSOPB8,                                                 +        
               LTH=3                                                            
         MFLD  VSOPC8,                                                 +        
               LTH=3                                                            
         MFLD  VSOPD8,                                                 +        
               LTH=3                                                            
         MFLD  VSOPE8,                                                 +        
               LTH=3                                                            
         MFLD  IDSTO9,                                                 +        
               LTH=3                                                            
         MFLD  DISTOD9,                                                +        
               LTH=5                                                            
         MFLD  DISTOL9,                                                +        
               LTH=5                                                            
         MFLD  DISTOH9,                                                +        
               LTH=5                                                            
         MFLD  TESTO9,                                                 +        
               LTH=18                                                           
         MFLD  VSOPA9,                                                 +        
               LTH=3                                                            
         MFLD  VSOPB9,                                                 +        
               LTH=3                                                            
         MFLD  VSOPC9,                                                 +        
               LTH=3                                                            
         MFLD  VSOPD9,                                                 +        
               LTH=3                                                            
         MFLD  VSOPE9,                                                 +        
               LTH=3                                                            
         MFLD  IDSTO10,                                                +        
               LTH=3                                                            
         MFLD  DISTOD10,                                               +        
               LTH=5                                                            
         MFLD  DISTOL10,                                               +        
               LTH=5                                                            
         MFLD  DISTOH10,                                               +        
               LTH=5                                                            
         MFLD  TESTO10,                                                +        
               LTH=18                                                           
         MFLD  VSOPA10,                                                +        
               LTH=3                                                            
         MFLD  VSOPB10,                                                +        
               LTH=3                                                            
         MFLD  VSOPC10,                                                +        
               LTH=3                                                            
         MFLD  VSOPD10,                                                +        
               LTH=3                                                            
         MFLD  VSOPE10,                                                +        
               LTH=3                                                            
         MFLD  IDSTO11,                                                +        
               LTH=3                                                            
         MFLD  DISTOD11,                                               +        
               LTH=5                                                            
         MFLD  DISTOL11,                                               +        
               LTH=5                                                            
         MFLD  DISTOH11,                                               +        
               LTH=5                                                            
         MFLD  TESTO11,                                                +        
               LTH=18                                                           
         MFLD  VSOPA11,                                                +        
               LTH=3                                                            
         MFLD  VSOPB11,                                                +        
               LTH=3                                                            
         MFLD  VSOPC11,                                                +        
               LTH=3                                                            
         MFLD  VSOPD11,                                                +        
               LTH=3                                                            
         MFLD  VSOPE11,                                                +        
               LTH=3                                                            
         MFLD  IDSTO12,                                                +        
               LTH=3                                                            
         MFLD  DISTOD12,                                               +        
               LTH=5                                                            
         MFLD  DISTOL12,                                               +        
               LTH=5                                                            
         MFLD  DISTOH12,                                               +        
               LTH=5                                                            
         MFLD  TESTO12,                                                +        
               LTH=18                                                           
         MFLD  VSOPA12,                                                +        
               LTH=3                                                            
         MFLD  VSOPB12,                                                +        
               LTH=3                                                            
         MFLD  VSOPC12,                                                +        
               LTH=3                                                            
         MFLD  VSOPD12,                                                +        
               LTH=3                                                            
         MFLD  VSOPE12,                                                +        
               LTH=3                                                            
         MFLD  IDSTO13,                                                +        
               LTH=3                                                            
         MFLD  DISTOD13,                                               +        
               LTH=5                                                            
         MFLD  DISTOL13,                                               +        
               LTH=5                                                            
         MFLD  DISTOH13,                                               +        
               LTH=5                                                            
         MFLD  TESTO13,                                                +        
               LTH=18                                                           
         MFLD  VSOPA13,                                                +        
               LTH=3                                                            
         MFLD  VSOPB13,                                                +        
               LTH=3                                                            
         MFLD  VSOPC13,                                                +        
               LTH=3                                                            
         MFLD  VSOPD13,                                                +        
               LTH=3                                                            
         MFLD  VSOPE13,                                                +        
               LTH=3                                                            
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W6I312N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W6N312),                                           +        
               OPT=2,                                                  +        
               NXT=W6O312N1                                                     
MID      LPAGE SOR=(W6N312)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '63122',                                                +        
               LTH=5                                                            
         MFLD  IDDC,                                                   +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDSTORI,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDSTORUT,                                               +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  IDSTORSP,                                               +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDSTORU,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (DISTORDU,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DISTORLU,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DISTORHU,                                              +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TESTORU,                                               +        
               '++++++++++++++++++'),                                  +        
               LTH=18,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KDVSOP1U,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDVSOP2U,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDVSOP3U,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDVSOP4U,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDVSOP5U,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDANDR,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
