***********************************************************************         
* CREATED BY PC65704   ON 98/03/13  AT 13:41                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'PART LOCATION HISTORY           '                               
W6N319   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W6T319 7',                                           +        
               8='W6T319 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W6T319  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W6T311  ',                                          +        
               14='W6T312  ',                                          +        
               15='W6T313  ',                                          +        
               16='W6T314  ',                                          +        
               17='W6T315  ',                                          +        
               18='W6T316  ',                                          +        
               19='W6T318  ',                                          +        
               20='W6T319  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W6N319   DPAGE CURSOR=((2,12)),                                        +        
               FILL=PT                                                          
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'PART LOCATION HISTORY',                                +        
               POS=(1,10),LTH=21,                                      +        
               ATTR=(NUM,PROT)                                                  
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Part No.',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(NUM,PROT)                                                  
IDARTIN  DFLD  POS=(2,12),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'DC',                                                   +        
               POS=(2,38),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDDCIN   DFLD  POS=(2,41),LTH=2,                                       +        
               ATTR=(ALPHA,NOPROT)                                              
         DFLD  'Type',                                                 +        
               POS=(2,45),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KDLOCIN  DFLD  POS=(2,50),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
IDARTUT  DFLD  POS=(3,12),LTH=11,                                      +        
               ATTR=(PROT,MOD)                                                  
IDDCUT   DFLD  POS=(3,41),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
KDLOCUT  DFLD  POS=(3,50),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Description:',                                         +        
               POS=(5,2),LTH=12,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0514  DFLD  POS=(5,16),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Start    Location',                                    +        
               POS=(6,2),LTH=17,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'End   Type   Start    End',                            +        
               POS=(6,24),LTH=25,                                      +        
               ATTR=(PROT)                                                      
FLD0702  DFLD  POS=(7,2),LTH=6,                                        +        
               ATTR=(PROT)                                                      
FLD0710  DFLD  POS=(7,10),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD0713  DFLD  POS=(7,13),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0716  DFLD  POS=(7,16),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0723  DFLD  POS=(7,23),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0732  DFLD  POS=(7,32),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0737  DFLD  POS=(7,37),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD0746  DFLD  POS=(7,46),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD0802  DFLD  POS=(8,2),LTH=6,                                        +        
               ATTR=(PROT)                                                      
FLD0810  DFLD  POS=(8,10),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD0813  DFLD  POS=(8,13),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0816  DFLD  POS=(8,16),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0823  DFLD  POS=(8,23),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0832  DFLD  POS=(8,32),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0837  DFLD  POS=(8,37),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD0846  DFLD  POS=(8,46),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD0902  DFLD  POS=(9,2),LTH=6,                                        +        
               ATTR=(PROT)                                                      
FLD0910  DFLD  POS=(9,10),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD0913  DFLD  POS=(9,13),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0916  DFLD  POS=(9,16),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD0923  DFLD  POS=(9,23),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD0932  DFLD  POS=(9,32),LTH=1,                                       +        
               ATTR=(PROT)                                                      
FLD0937  DFLD  POS=(9,37),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD0946  DFLD  POS=(9,46),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD1002  DFLD  POS=(10,2),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD1010  DFLD  POS=(10,10),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1013  DFLD  POS=(10,13),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1016  DFLD  POS=(10,16),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1023  DFLD  POS=(10,23),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1032  DFLD  POS=(10,32),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1037  DFLD  POS=(10,37),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1046  DFLD  POS=(10,46),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1102  DFLD  POS=(11,2),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD1110  DFLD  POS=(11,10),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1113  DFLD  POS=(11,13),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1116  DFLD  POS=(11,16),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1123  DFLD  POS=(11,23),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1132  DFLD  POS=(11,32),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1137  DFLD  POS=(11,37),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1146  DFLD  POS=(11,46),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1202  DFLD  POS=(12,2),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD1210  DFLD  POS=(12,10),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1213  DFLD  POS=(12,13),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1216  DFLD  POS=(12,16),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1223  DFLD  POS=(12,23),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1232  DFLD  POS=(12,32),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1237  DFLD  POS=(12,37),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1246  DFLD  POS=(12,46),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1302  DFLD  POS=(13,2),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD1310  DFLD  POS=(13,10),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1313  DFLD  POS=(13,13),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1316  DFLD  POS=(13,16),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1323  DFLD  POS=(13,23),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1332  DFLD  POS=(13,32),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1337  DFLD  POS=(13,37),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1346  DFLD  POS=(13,46),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1402  DFLD  POS=(14,2),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD1410  DFLD  POS=(14,10),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1413  DFLD  POS=(14,13),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1416  DFLD  POS=(14,16),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1423  DFLD  POS=(14,23),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1432  DFLD  POS=(14,32),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1437  DFLD  POS=(14,37),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1446  DFLD  POS=(14,46),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1502  DFLD  POS=(15,2),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD1510  DFLD  POS=(15,10),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1513  DFLD  POS=(15,13),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1516  DFLD  POS=(15,16),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1523  DFLD  POS=(15,23),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1532  DFLD  POS=(15,32),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1537  DFLD  POS=(15,37),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1546  DFLD  POS=(15,46),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1602  DFLD  POS=(16,2),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD1610  DFLD  POS=(16,10),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1613  DFLD  POS=(16,13),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1616  DFLD  POS=(16,16),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1623  DFLD  POS=(16,23),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1632  DFLD  POS=(16,32),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1637  DFLD  POS=(16,37),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1646  DFLD  POS=(16,46),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1702  DFLD  POS=(17,2),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD1710  DFLD  POS=(17,10),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1713  DFLD  POS=(17,13),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1716  DFLD  POS=(17,16),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1723  DFLD  POS=(17,23),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1732  DFLD  POS=(17,32),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1737  DFLD  POS=(17,37),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1746  DFLD  POS=(17,46),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1802  DFLD  POS=(18,2),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD1810  DFLD  POS=(18,10),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1813  DFLD  POS=(18,13),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1816  DFLD  POS=(18,16),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1823  DFLD  POS=(18,23),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1832  DFLD  POS=(18,32),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1837  DFLD  POS=(18,37),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1846  DFLD  POS=(18,46),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1902  DFLD  POS=(19,2),LTH=6,                                       +        
               ATTR=(PROT)                                                      
FLD1910  DFLD  POS=(19,10),LTH=2,                                      +        
               ATTR=(PROT)                                                      
FLD1913  DFLD  POS=(19,13),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1916  DFLD  POS=(19,16),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1923  DFLD  POS=(19,23),LTH=6,                                      +        
               ATTR=(PROT)                                                      
FLD1932  DFLD  POS=(19,32),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLD1937  DFLD  POS=(19,37),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD1946  DFLD  POS=(19,46),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '13 MAIN.FREQTAB 14 LISTSTOR.COD 15 MAINT. LOC   16 ADD +        
               LOCATION  17 CHANGELOC',                                +        
               POS=(21,2),LTH=77,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 LIST FR. LOC 19 LIST LOC',                          +        
               POS=(22,2),LTH=27,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20 COPY LOC',                                          +        
               POS=(22,34),LTH=11,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '21 LOC HISTORY   10 WHELP',                            +        
               POS=(22,50),LTH=25,                                     +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W6I319N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W6N319),                                           +        
               OPT=2,                                                  +        
               NXT=W6O319N1                                                     
MID      LPAGE SOR=(W6N319)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS1,                                              +        
               '6'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS2,                                              +        
               '3'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  (IDTRANS3,                                              +        
               '1'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  (IDTRANS4,                                              +        
               '9'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F9'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '63192',                                                +        
               LTH=5                                                            
         MFLD  (IDARTIN,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDLOCIN,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  IDARTUT,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  KDLOCUT,                                                +        
               LTH=1                                                            
         MSGEND                                                                 
W6O319N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6N319,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I319N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W6N319                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDARTIN,                                                +        
               LTH=9                                                            
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  KDLOCIN,                                                +        
               LTH=1                                                            
         MFLD  IDARTUT,                                                +        
               LTH=11                                                           
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  KDLOCUT,                                                +        
               LTH=1                                                            
         MFLD  FLD0514,                                                +        
               LTH=25                                                           
         MFLD  FLD0702,                                                +        
               LTH=6                                                            
         MFLD  FLD0710,                                                +        
               LTH=2                                                            
         MFLD  FLD0713,                                                +        
               LTH=2                                                            
         MFLD  FLD0716,                                                +        
               LTH=5                                                            
         MFLD  FLD0723,                                                +        
               LTH=6                                                            
         MFLD  FLD0732,                                                +        
               LTH=1                                                            
         MFLD  FLD0737,                                                +        
               LTH=8                                                            
         MFLD  FLD0746,                                                +        
               LTH=8                                                            
         MFLD  FLD0802,                                                +        
               LTH=6                                                            
         MFLD  FLD0810,                                                +        
               LTH=2                                                            
         MFLD  FLD0813,                                                +        
               LTH=2                                                            
         MFLD  FLD0816,                                                +        
               LTH=5                                                            
         MFLD  FLD0823,                                                +        
               LTH=6                                                            
         MFLD  FLD0832,                                                +        
               LTH=1                                                            
         MFLD  FLD0837,                                                +        
               LTH=8                                                            
         MFLD  FLD0846,                                                +        
               LTH=8                                                            
         MFLD  FLD0902,                                                +        
               LTH=6                                                            
         MFLD  FLD0910,                                                +        
               LTH=2                                                            
         MFLD  FLD0913,                                                +        
               LTH=2                                                            
         MFLD  FLD0916,                                                +        
               LTH=5                                                            
         MFLD  FLD0923,                                                +        
               LTH=6                                                            
         MFLD  FLD0932,                                                +        
               LTH=1                                                            
         MFLD  FLD0937,                                                +        
               LTH=8                                                            
         MFLD  FLD0946,                                                +        
               LTH=8                                                            
         MFLD  FLD1002,                                                +        
               LTH=6                                                            
         MFLD  FLD1010,                                                +        
               LTH=2                                                            
         MFLD  FLD1013,                                                +        
               LTH=2                                                            
         MFLD  FLD1016,                                                +        
               LTH=5                                                            
         MFLD  FLD1023,                                                +        
               LTH=6                                                            
         MFLD  FLD1032,                                                +        
               LTH=1                                                            
         MFLD  FLD1037,                                                +        
               LTH=8                                                            
         MFLD  FLD1046,                                                +        
               LTH=8                                                            
         MFLD  FLD1102,                                                +        
               LTH=6                                                            
         MFLD  FLD1110,                                                +        
               LTH=2                                                            
         MFLD  FLD1113,                                                +        
               LTH=2                                                            
         MFLD  FLD1116,                                                +        
               LTH=5                                                            
         MFLD  FLD1123,                                                +        
               LTH=6                                                            
         MFLD  FLD1132,                                                +        
               LTH=1                                                            
         MFLD  FLD1137,                                                +        
               LTH=8                                                            
         MFLD  FLD1146,                                                +        
               LTH=8                                                            
         MFLD  FLD1202,                                                +        
               LTH=6                                                            
         MFLD  FLD1210,                                                +        
               LTH=2                                                            
         MFLD  FLD1213,                                                +        
               LTH=2                                                            
         MFLD  FLD1216,                                                +        
               LTH=5                                                            
         MFLD  FLD1223,                                                +        
               LTH=6                                                            
         MFLD  FLD1232,                                                +        
               LTH=1                                                            
         MFLD  FLD1237,                                                +        
               LTH=8                                                            
         MFLD  FLD1246,                                                +        
               LTH=8                                                            
         MFLD  FLD1302,                                                +        
               LTH=6                                                            
         MFLD  FLD1310,                                                +        
               LTH=2                                                            
         MFLD  FLD1313,                                                +        
               LTH=2                                                            
         MFLD  FLD1316,                                                +        
               LTH=5                                                            
         MFLD  FLD1323,                                                +        
               LTH=6                                                            
         MFLD  FLD1332,                                                +        
               LTH=1                                                            
         MFLD  FLD1337,                                                +        
               LTH=8                                                            
         MFLD  FLD1346,                                                +        
               LTH=8                                                            
         MFLD  FLD1402,                                                +        
               LTH=6                                                            
         MFLD  FLD1410,                                                +        
               LTH=2                                                            
         MFLD  FLD1413,                                                +        
               LTH=2                                                            
         MFLD  FLD1416,                                                +        
               LTH=5                                                            
         MFLD  FLD1423,                                                +        
               LTH=6                                                            
         MFLD  FLD1432,                                                +        
               LTH=1                                                            
         MFLD  FLD1437,                                                +        
               LTH=8                                                            
         MFLD  FLD1446,                                                +        
               LTH=8                                                            
         MFLD  FLD1502,                                                +        
               LTH=6                                                            
         MFLD  FLD1510,                                                +        
               LTH=2                                                            
         MFLD  FLD1513,                                                +        
               LTH=2                                                            
         MFLD  FLD1516,                                                +        
               LTH=5                                                            
         MFLD  FLD1523,                                                +        
               LTH=6                                                            
         MFLD  FLD1532,                                                +        
               LTH=1                                                            
         MFLD  FLD1537,                                                +        
               LTH=8                                                            
         MFLD  FLD1546,                                                +        
               LTH=8                                                            
         MFLD  FLD1602,                                                +        
               LTH=6                                                            
         MFLD  FLD1610,                                                +        
               LTH=2                                                            
         MFLD  FLD1613,                                                +        
               LTH=2                                                            
         MFLD  FLD1616,                                                +        
               LTH=5                                                            
         MFLD  FLD1623,                                                +        
               LTH=6                                                            
         MFLD  FLD1632,                                                +        
               LTH=1                                                            
         MFLD  FLD1637,                                                +        
               LTH=8                                                            
         MFLD  FLD1646,                                                +        
               LTH=8                                                            
         MFLD  FLD1702,                                                +        
               LTH=6                                                            
         MFLD  FLD1710,                                                +        
               LTH=2                                                            
         MFLD  FLD1713,                                                +        
               LTH=2                                                            
         MFLD  FLD1716,                                                +        
               LTH=5                                                            
         MFLD  FLD1723,                                                +        
               LTH=6                                                            
         MFLD  FLD1732,                                                +        
               LTH=1                                                            
         MFLD  FLD1737,                                                +        
               LTH=8                                                            
         MFLD  FLD1746,                                                +        
               LTH=8                                                            
         MFLD  FLD1802,                                                +        
               LTH=6                                                            
         MFLD  FLD1810,                                                +        
               LTH=2                                                            
         MFLD  FLD1813,                                                +        
               LTH=2                                                            
         MFLD  FLD1816,                                                +        
               LTH=5                                                            
         MFLD  FLD1823,                                                +        
               LTH=6                                                            
         MFLD  FLD1832,                                                +        
               LTH=1                                                            
         MFLD  FLD1837,                                                +        
               LTH=8                                                            
         MFLD  FLD1846,                                                +        
               LTH=8                                                            
         MFLD  FLD1902,                                                +        
               LTH=6                                                            
         MFLD  FLD1910,                                                +        
               LTH=2                                                            
         MFLD  FLD1913,                                                +        
               LTH=2                                                            
         MFLD  FLD1916,                                                +        
               LTH=5                                                            
         MFLD  FLD1923,                                                +        
               LTH=6                                                            
         MFLD  FLD1932,                                                +        
               LTH=1                                                            
         MFLD  FLD1937,                                                +        
               LTH=8                                                            
         MFLD  FLD1946,                                                +        
               LTH=8                                                            
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=79                                                           
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MSGEND                                                                 
         END                                                                    
