***********************************************************************         
* CREATED BY PC63442   ON 97/08/06  AT 10:25                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'COPY LOCATIONS                  '                               
W6N348   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W6T348U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W6T341  ',                                          +        
               14='W6T342  ',                                          +        
               15='W6T343  ',                                          +        
               16='W6T344  ',                                          +        
               17='W6T345  ',                                          +        
               18='W6T346  ',                                          +        
               19='W6T347  ',                                          +        
               20='W6T348  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W6T348U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W6N348   DPAGE CURSOR=((6,13)),                                        +        
               FILL=NONE                                                        
TRANSID1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
TRANSID2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
TRANSID3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
TRANSID4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'COPY LOCATIONS',                                       +        
               POS=(1,12),LTH=14,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'DC',                                                   +        
               POS=(3,2),LTH=2,                                        +        
               ATTR=(PROT)                                                      
IDDC     DFLD  POS=(3,5),LTH=2,                                        +        
               ATTR=(PROT)                                                      
         DFLD  'Copy from :',                                          +        
               POS=(5,2),LTH=11,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Area',                                                 +        
               POS=(6,8),LTH=4,                                        +        
               ATTR=(PROT)                                                      
ADAREAIN DFLD  POS=(6,13),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Aisle',                                                +        
               POS=(6,18),LTH=5,                                       +        
               ATTR=(PROT)                                                      
ADAISLIN DFLD  POS=(6,24),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Section',                                              +        
               POS=(6,28),LTH=7,                                       +        
               ATTR=(PROT)                                                      
ADSECTIN DFLD  POS=(6,36),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
ADAREAUT DFLD  POS=(7,13),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
ADAISLUT DFLD  POS=(7,24),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
ADSECTUT DFLD  POS=(7,36),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Copy to   :',                                          +        
               POS=(10,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Area',                                                 +        
               POS=(11,8),LTH=4,                                       +        
               ATTR=(PROT)                                                      
TOAREAIN DFLD  POS=(11,13),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Aisle',                                                +        
               POS=(11,18),LTH=5,                                      +        
               ATTR=(PROT)                                                      
TOAISLIN DFLD  POS=(11,24),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Section from',                                         +        
               POS=(11,28),LTH=12,                                     +        
               ATTR=(PROT)                                                      
TOSECFIN DFLD  POS=(11,41),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Section to',                                           +        
               POS=(11,45),LTH=10,                                     +        
               ATTR=(NUM,PROT)                                                  
TOSECTIN DFLD  POS=(11,56),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'AOE',                                                  +        
               POS=(11,60),LTH=3,                                      +        
               ATTR=(PROT)                                                      
KDAOEIN  DFLD  POS=(11,64),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
TOAREAUT DFLD  POS=(12,13),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
TOAISLUT DFLD  POS=(12,24),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
TOSECFUT DFLD  POS=(12,41),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
TOSECTUT DFLD  POS=(12,55),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
KDAOEUT  DFLD  POS=(12,63),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  '13 Main.FreqTab 14 ListStor.Cod 15 Maint. Loc   16 Add +        
               Location 17 Change Loc',                                +        
               POS=(21,1),LTH=77,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 List Fr. Loc 19 List Loc',                          +        
               POS=(22,1),LTH=27,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20 Copy Loc',                                          +        
               POS=(22,33),LTH=11,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,49),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10  WHELP',                                            +        
               POS=(22,65),LTH=9,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W6O348N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6N348,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I348N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W6N348                                                       
         SEG                                                                    
         MFLD  TRANSID1,                                               +        
               LTH=1                                                            
         MFLD  TRANSID2,                                               +        
               LTH=1                                                            
         MFLD  TRANSID3,                                               +        
               LTH=1                                                            
         MFLD  TRANSID4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDDC,                                                   +        
               LTH=2                                                            
         MFLD  ADAREAIN,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADAREAUT,                                               +        
               LTH=2                                                            
         MFLD  ADAISLIN,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADAISLUT,                                               +        
               LTH=2                                                            
         MFLD  ADSECTIN,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ADSECTUT,                                               +        
               LTH=3                                                            
         MFLD  TOAREAIN,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TOAREAUT,                                               +        
               LTH=2                                                            
         MFLD  TOAISLIN,                                               +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TOAISLUT,                                               +        
               LTH=2                                                            
         MFLD  TOSECFIN,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TOSECFUT,                                               +        
               LTH=3                                                            
         MFLD  TOSECTIN,                                               +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TOSECTUT,                                               +        
               LTH=3                                                            
         MFLD  KDAOEIN,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDAOEUT,                                                +        
               LTH=1                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W6I348N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W6N348,IGNORE),                                    +        
               NXT=W6O348N1                                                     
MID      LPAGE SOR=(W6N348)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  TRANSID1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  TRANSID2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  TRANSID3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  TRANSID4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F8'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '63482',                                                +        
               LTH=5                                                            
         MFLD  (IDDC,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ADAREAIN,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  ADAREAUT,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ADAISLIN,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  ADAISLUT,                                               +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ADSECTIN,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  ADSECTUT,                                               +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TOAREAIN,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TOAISLIN,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TOSECFIN,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (TOSECTIN,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDAOEIN,                                               +        
               '+'),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
         END                                                                    
