***********************************************************************         
* CREATED BY PC40073   ON 99/01/13  AT 10:51                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'Quality Return/Scrap per DC     '                               
W6N321   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0t501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W6T321U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W6T321  ',                                          +        
               14='W6T322   ',                                         +        
               15='W0T501   ',                                         +        
               16='W0T501   ',                                         +        
               17='W0T501   ',                                         +        
               18='W0T501   ',                                         +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W6T321V ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W6N321   DPAGE CURSOR=((2,11)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'QUALITY RETURN/SCRAP PER DC',                          +        
               POS=(1,12),LTH=27,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Part No.',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(ALPHA,PROT)                                                
IDARTNRI DFLD  POS=(2,11),LTH=9,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'DC',                                                   +        
               POS=(2,23),LTH=2,                                       +        
               ATTR=(PROT)                                                      
IDDCIN   DFLD  POS=(2,26),LTH=2,                                       +        
               ATTR=(ALPHA,NOPROT,MOD)                                          
IDARTNRU DFLD  POS=(3,11),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
IDDCUT   DFLD  POS=(3,26),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Description',                                          +        
               POS=(5,2),LTH=11,                                       +        
               ATTR=(PROT)                                                      
ARTBESKR DFLD  POS=(5,15),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Send to',                                              +        
               POS=(6,2),LTH=7,                                        +        
               ATTR=(PROT)                                                      
IDDCTO   DFLD  POS=(6,16),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Stock',                                                +        
               POS=(5,42),LTH=5,                                       +        
               ATTR=(PROT)                                                      
STOCK    DFLD  POS=(5,54),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Supers code',                                          +        
               POS=(7,2),LTH=11,                                       +        
               ATTR=(PROT)                                                      
KDERS    DFLD  POS=(7,20),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'AK in DC',                                             +        
               POS=(6,42),LTH=8,                                       +        
               ATTR=(PROT)                                                      
AKNDC    DFLD  POS=(6,54),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Supplier No.',                                         +        
               POS=(8,2),LTH=12,                                       +        
               ATTR=(PROT)                                                      
IDLEVNR  DFLD  POS=(8,17),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'GIT',                                                  +        
               POS=(7,42),LTH=3,                                       +        
               ATTR=(PROT)                                                      
AKPAV    DFLD  POS=(7,54),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Purch.planner',                                        +        
               POS=(9,2),LTH=13,                                       +        
               ATTR=(PROT)                                                      
IDANSK   DFLD  POS=(9,19),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Ordered qty',                                          +        
               POS=(8,42),LTH=11,                                      +        
               ATTR=(PROT)                                                      
KVBEART  DFLD  POS=(8,54),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Block code',                                           +        
               POS=(9,42),LTH=10,                                      +        
               ATTR=(PROT)                                                      
KDLEVSP  DFLD  POS=(9,59),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Blocked qty',                                          +        
               POS=(10,42),LTH=11,                                     +        
               ATTR=(PROT)                                                      
KVSPARRK DFLD  POS=(10,54),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Last returned',                                        +        
               POS=(11,2),LTH=13,                                      +        
               ATTR=(PROT)                                                      
TIRETBEO DFLD  POS=(11,16),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Return qty',                                           +        
               POS=(12,2),LTH=10,                                      +        
               ATTR=(PROT)                                                      
KVRETBEO DFLD  POS=(12,15),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Fast order',                                           +        
               POS=(12,31),LTH=10,                                     +        
               ATTR=(PROT)                                                      
KDORDKL  DFLD  POS=(12,42),LTH=1,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'Remarks:',                                             +        
               POS=(13,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
RETURTXT DFLD  POS=(13,15),LTH=60,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Last scrapped',                                        +        
               POS=(15,2),LTH=13,                                      +        
               ATTR=(PROT)                                                      
TISKROT  DFLD  POS=(15,16),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Scrap qty',                                            +        
               POS=(16,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
KVSKROT  DFLD  POS=(16,15),LTH=7,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Value',                                                +        
               POS=(16,31),LTH=5,                                      +        
               ATTR=(PROT)                                                      
PRSKROT  DFLD  POS=(16,39),LTH=11,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Remarks:',                                             +        
               POS=(17,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
SKROTTXT DFLD  POS=(17,15),LTH=60,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'QUAL',                                                 +        
               POS=(18,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
QUAL     DFLD  POS=(18,9),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'ESC',                                                  +        
               POS=(18,15),LTH=3,                                      +        
               ATTR=(PROT)                                                      
ESC      DFLD  POS=(18,21),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Account No.',                                          +        
               POS=(19,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
IDKONTO  DFLD  POS=(19,15),LTH=10,                                     +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Analysis No.',                                         +        
               POS=(19,31),LTH=12,                                     +        
               ATTR=(PROT)                                                      
IDANALYS DFLD  POS=(19,44),LTH=12,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Adjust buffer',                                        +        
               POS=(21,2),LTH=13,                                      +        
               ATTR=(PROT)                                                      
ABUFFER  DFLD  POS=(21,17),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT)                                                      
         FMTEND                                                                 
W6O321N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6N321,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I321N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W6N321                                                       
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  IDARTNRI,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDDCIN,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDARTNRU,                                               +        
               LTH=11,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDDCUT,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ARTBESKR,                                               +        
               LTH=25                                                           
         MFLD  IDDCTO,                                                 +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDERS,                                                  +        
               LTH=2                                                            
         MFLD  IDLEVNR,                                                +        
               LTH=5                                                            
         MFLD  IDANSK,                                                 +        
               LTH=3                                                            
         MFLD  STOCK,                                                  +        
               LTH=7                                                            
         MFLD  AKNDC,                                                  +        
               LTH=7                                                            
         MFLD  AKPAV,                                                  +        
               LTH=7                                                            
         MFLD  KVBEART,                                                +        
               LTH=7                                                            
         MFLD  KDLEVSP,                                                +        
               LTH=2                                                            
         MFLD  KVSPARRK,                                               +        
               LTH=7                                                            
         MFLD  TIRETBEO,                                               +        
               LTH=6                                                            
         MFLD  KVRETBEO,                                               +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  KDORDKL,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  RETURTXT,                                               +        
               LTH=62,                                                 +        
               ATTR=(YES)                                                       
         MFLD  TISKROT,                                                +        
               LTH=6                                                            
         MFLD  KVSKROT,                                                +        
               LTH=9,                                                  +        
               ATTR=(YES)                                                       
         MFLD  PRSKROT,                                                +        
               LTH=11                                                           
         MFLD  SKROTTXT,                                               +        
               LTH=62,                                                 +        
               ATTR=(YES)                                                       
         MFLD  QUAL,                                                   +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ESC,                                                    +        
               LTH=5,                                                  +        
               ATTR=(YES)                                                       
         MFLD  IDKONTO,                                                +        
               LTH=12,                                                 +        
               ATTR=(YES)                                                       
         MFLD  IDANALYS,                                               +        
               LTH=14,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ABUFFER,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  FSYSMSG,                                                +        
               LTH=79                                                           
         MSGEND                                                                 
W6I321N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W6N321),                                           +        
               OPT=2,                                                  +        
               NXT=W6O321N1                                                     
MID      LPAGE SOR=(W6N321)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS1,                                              +        
               ' '),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  (IDTRANS2,                                              +        
               ' '),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  (IDTRANS3,                                              +        
               ' '),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  (IDTRANS4,                                              +        
               ' '),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '63212',                                                +        
               LTH=5                                                            
         MFLD  (IDARTNRI,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDARTNRU,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDDCUT,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDDCTO,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KVRETBEO,                                              +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KDORDKL,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (RETURTXT,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++'),                                                +        
               LTH=60,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KVSKROT,                                               +        
               '+++++++'),                                             +        
               LTH=7,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (SKROTTXT,                                              +        
               '++++++++++++++++++++++++++++++++++++++++++++++++++++++++        
               +++++'),                                                +        
               LTH=60,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (QUAL,                                                  +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ESC,                                                   +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDKONTO,                                               +        
               '++++++++++'),                                          +        
               LTH=10,                                                 +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDANALYS,                                              +        
               '++++++++++++'),                                        +        
               LTH=12,                                                 +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (ABUFFER,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
