***********************************************************************         
* CREATED BY PC59625   ON 99/03/09  AT 15:43                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'Release scrap orders            '                               
W6N322   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W6T322 7',                                           +        
               8='W6T322 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W6T322U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W6N322   DPAGE CURSOR=((2,11)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'RELEASE SCRAP ORDERS',                                 +        
               POS=(1,13),LTH=20,                                      +        
               ATTR=(PROT)                                                      
TEMFSFEL DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Job Role',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(NUM,PROT)                                                  
JOBROLIN DFLD  POS=(2,11),LTH=8,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'DC',                                                   +        
               POS=(2,21),LTH=2,                                       +        
               ATTR=(PROT)                                                      
DCIN     DFLD  POS=(2,24),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Resp.from',                                            +        
               POS=(2,28),LTH=9,                                       +        
               ATTR=(PROT)                                                      
RESPFRIN DFLD  POS=(2,38),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'to',                                                   +        
               POS=(2,42),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
RESPTOIN DFLD  POS=(2,45),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Part No.',                                             +        
               POS=(2,49),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
ARTNRIN  DFLD  POS=(2,58),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Date',                                                 +        
               POS=(2,69),LTH=4,                                       +        
               ATTR=(PROT)                                                      
DATIN    DFLD  POS=(2,74),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
JOBROLUT DFLD  POS=(3,11),LTH=8,                                       +        
               ATTR=(PROT,MOD)                                                  
DCUT     DFLD  POS=(3,24),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
RESPFRUT DFLD  POS=(3,38),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
RESOTOUT DFLD  POS=(3,45),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
ARTNRUT  DFLD  POS=(3,58),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
DATUT    DFLD  POS=(3,74),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Scrap all on this page',                               +        
               POS=(5,1),LTH=22,                                       +        
               ATTR=(PROT)                                                      
SCRAPALL DFLD  POS=(5,24),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Cmd   Part No.',                                       +        
               POS=(6,1),LTH=14,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Qty.',                                                 +        
               POS=(6,20),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Value    Date    DC   Resp. Rem.',                     +        
               POS=(6,31),LTH=32,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Ref. Acc. C T',                                        +        
               POS=(6,68),LTH=13,                                      +        
               ATTR=(PROT)                                                      
CMD1     DFLD  POS=(7,3),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
ART1     DFLD  POS=(7,6),LTH=9,                                        +        
               ATTR=(PROT,MOD)                                                  
QTY1     DFLD  POS=(7,17),LTH=7,                                       +        
               ATTR=(PROT)                                                      
VALUE1   DFLD  POS=(7,26),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
DAT1     DFLD  POS=(7,38),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DC1      DFLD  POS=(7,48),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
ANSK1    DFLD  POS=(7,55),LTH=3,                                       +        
               ATTR=(PROT)                                                      
REM1     DFLD  POS=(7,62),LTH=1,                                       +        
               ATTR=(PROT)                                                      
REF1     DFLD  POS=(7,64),LTH=8,                                       +        
               ATTR=(PROT)                                                      
ACC1     DFLD  POS=(7,75),LTH=1,                                       +        
               ATTR=(PROT)                                                      
CLASS1   DFLD  POS=(7,78),LTH=1,                                       +        
               ATTR=(PROT)                                                      
TEXT1    DFLD  POS=(7,80),LTH=1,                                       +        
               ATTR=(PROT)                                                      
CMD2     DFLD  POS=(8,3),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
ART2     DFLD  POS=(8,6),LTH=9,                                        +        
               ATTR=(PROT,MOD)                                                  
QTY2     DFLD  POS=(8,17),LTH=7,                                       +        
               ATTR=(PROT)                                                      
VALUE2   DFLD  POS=(8,26),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
DAT2     DFLD  POS=(8,38),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DC2      DFLD  POS=(8,48),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
ANSK2    DFLD  POS=(8,55),LTH=3,                                       +        
               ATTR=(PROT)                                                      
REM2     DFLD  POS=(8,62),LTH=1,                                       +        
               ATTR=(PROT)                                                      
REF2     DFLD  POS=(8,64),LTH=8,                                       +        
               ATTR=(PROT)                                                      
ACC2     DFLD  POS=(8,75),LTH=1,                                       +        
               ATTR=(PROT)                                                      
CLASS2   DFLD  POS=(8,78),LTH=1,                                       +        
               ATTR=(PROT)                                                      
TEXT2    DFLD  POS=(8,80),LTH=1,                                       +        
               ATTR=(PROT)                                                      
CMD3     DFLD  POS=(9,3),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
ART3     DFLD  POS=(9,6),LTH=9,                                        +        
               ATTR=(PROT,MOD)                                                  
QTY3     DFLD  POS=(9,17),LTH=7,                                       +        
               ATTR=(PROT)                                                      
VALUE3   DFLD  POS=(9,26),LTH=10,                                      +        
               ATTR=(PROT,MOD)                                                  
DAT3     DFLD  POS=(9,38),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
DC3      DFLD  POS=(9,48),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
ANSK3    DFLD  POS=(9,55),LTH=3,                                       +        
               ATTR=(PROT)                                                      
REM3     DFLD  POS=(9,62),LTH=1,                                       +        
               ATTR=(PROT)                                                      
REF3     DFLD  POS=(9,64),LTH=8,                                       +        
               ATTR=(PROT)                                                      
ACC3     DFLD  POS=(9,75),LTH=1,                                       +        
               ATTR=(PROT)                                                      
CLASS3   DFLD  POS=(9,78),LTH=1,                                       +        
               ATTR=(PROT)                                                      
TEXT3    DFLD  POS=(9,80),LTH=1,                                       +        
               ATTR=(PROT)                                                      
CMD4     DFLD  POS=(10,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
ART4     DFLD  POS=(10,6),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
QTY4     DFLD  POS=(10,17),LTH=7,                                      +        
               ATTR=(PROT)                                                      
VALUE4   DFLD  POS=(10,26),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
DAT4     DFLD  POS=(10,38),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DC4      DFLD  POS=(10,48),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
ANSK4    DFLD  POS=(10,55),LTH=3,                                      +        
               ATTR=(PROT)                                                      
REM4     DFLD  POS=(10,62),LTH=1,                                      +        
               ATTR=(PROT)                                                      
REF4     DFLD  POS=(10,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
ACC4     DFLD  POS=(10,75),LTH=1,                                      +        
               ATTR=(PROT)                                                      
CLASS4   DFLD  POS=(10,78),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TEXT4    DFLD  POS=(10,80),LTH=1,                                      +        
               ATTR=(PROT)                                                      
CMD5     DFLD  POS=(11,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
ART5     DFLD  POS=(11,6),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
QTY5     DFLD  POS=(11,17),LTH=7,                                      +        
               ATTR=(PROT)                                                      
VALUE5   DFLD  POS=(11,26),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
DAT5     DFLD  POS=(11,38),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DC5      DFLD  POS=(11,48),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
ANSK5    DFLD  POS=(11,55),LTH=3,                                      +        
               ATTR=(PROT)                                                      
REM5     DFLD  POS=(11,62),LTH=1,                                      +        
               ATTR=(PROT)                                                      
REF5     DFLD  POS=(11,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
ACC5     DFLD  POS=(11,75),LTH=1,                                      +        
               ATTR=(PROT)                                                      
CLASS5   DFLD  POS=(11,78),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TEXT5    DFLD  POS=(11,80),LTH=1,                                      +        
               ATTR=(PROT)                                                      
CMD6     DFLD  POS=(12,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
ART6     DFLD  POS=(12,6),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
QTY6     DFLD  POS=(12,17),LTH=7,                                      +        
               ATTR=(PROT)                                                      
VALUE6   DFLD  POS=(12,26),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
DAT6     DFLD  POS=(12,38),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DC6      DFLD  POS=(12,48),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
ANSK6    DFLD  POS=(12,55),LTH=3,                                      +        
               ATTR=(PROT)                                                      
REM6     DFLD  POS=(12,62),LTH=1,                                      +        
               ATTR=(PROT)                                                      
REF6     DFLD  POS=(12,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
ACC6     DFLD  POS=(12,75),LTH=1,                                      +        
               ATTR=(PROT)                                                      
CLASS6   DFLD  POS=(12,78),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TEXT6    DFLD  POS=(12,80),LTH=1,                                      +        
               ATTR=(PROT)                                                      
CMD7     DFLD  POS=(13,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
ART7     DFLD  POS=(13,6),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
QTY7     DFLD  POS=(13,17),LTH=7,                                      +        
               ATTR=(PROT)                                                      
VALUE7   DFLD  POS=(13,26),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
DAT7     DFLD  POS=(13,38),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DC7      DFLD  POS=(13,48),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
ANSK7    DFLD  POS=(13,55),LTH=3,                                      +        
               ATTR=(PROT)                                                      
REM7     DFLD  POS=(13,62),LTH=1,                                      +        
               ATTR=(PROT)                                                      
REF7     DFLD  POS=(13,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
ACC7     DFLD  POS=(13,75),LTH=1,                                      +        
               ATTR=(PROT)                                                      
CLASS7   DFLD  POS=(13,78),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TEXT7    DFLD  POS=(13,80),LTH=1,                                      +        
               ATTR=(PROT)                                                      
CMD8     DFLD  POS=(14,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
ART8     DFLD  POS=(14,6),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
QTY8     DFLD  POS=(14,17),LTH=7,                                      +        
               ATTR=(PROT)                                                      
VALUE8   DFLD  POS=(14,26),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
DAT8     DFLD  POS=(14,38),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DC8      DFLD  POS=(14,48),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
ANSK8    DFLD  POS=(14,55),LTH=3,                                      +        
               ATTR=(PROT)                                                      
REM8     DFLD  POS=(14,62),LTH=1,                                      +        
               ATTR=(PROT)                                                      
REF8     DFLD  POS=(14,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
ACC8     DFLD  POS=(14,75),LTH=1,                                      +        
               ATTR=(PROT)                                                      
CLASS8   DFLD  POS=(14,78),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TEXT8    DFLD  POS=(14,80),LTH=1,                                      +        
               ATTR=(PROT)                                                      
CMD9     DFLD  POS=(15,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
ART9     DFLD  POS=(15,6),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
QTY9     DFLD  POS=(15,17),LTH=7,                                      +        
               ATTR=(PROT)                                                      
VALUE9   DFLD  POS=(15,26),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
DAT9     DFLD  POS=(15,38),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DC9      DFLD  POS=(15,48),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
ANSK9    DFLD  POS=(15,55),LTH=3,                                      +        
               ATTR=(PROT)                                                      
REM9     DFLD  POS=(15,62),LTH=1,                                      +        
               ATTR=(PROT)                                                      
REF9     DFLD  POS=(15,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
ACC9     DFLD  POS=(15,75),LTH=1,                                      +        
               ATTR=(PROT)                                                      
CLASS9   DFLD  POS=(15,78),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TEXT9    DFLD  POS=(15,80),LTH=1,                                      +        
               ATTR=(PROT)                                                      
CMD10    DFLD  POS=(16,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
ART10    DFLD  POS=(16,6),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
QTY10    DFLD  POS=(16,17),LTH=7,                                      +        
               ATTR=(PROT)                                                      
VALUE10  DFLD  POS=(16,26),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
DAT10    DFLD  POS=(16,38),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DC10     DFLD  POS=(16,48),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
ANSK10   DFLD  POS=(16,55),LTH=3,                                      +        
               ATTR=(PROT)                                                      
REM10    DFLD  POS=(16,62),LTH=1,                                      +        
               ATTR=(PROT)                                                      
REF10    DFLD  POS=(16,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
ACC10    DFLD  POS=(16,75),LTH=1,                                      +        
               ATTR=(PROT)                                                      
CLASS10  DFLD  POS=(16,78),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TEXT10   DFLD  POS=(16,80),LTH=1,                                      +        
               ATTR=(PROT)                                                      
CMD11    DFLD  POS=(17,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
ART11    DFLD  POS=(17,6),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
QTY11    DFLD  POS=(17,17),LTH=7,                                      +        
               ATTR=(PROT)                                                      
VALUE11  DFLD  POS=(17,26),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
DAT11    DFLD  POS=(17,38),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DC11     DFLD  POS=(17,48),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
ANSK11   DFLD  POS=(17,55),LTH=3,                                      +        
               ATTR=(PROT)                                                      
REM11    DFLD  POS=(17,62),LTH=1,                                      +        
               ATTR=(PROT)                                                      
REF11    DFLD  POS=(17,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
ACC11    DFLD  POS=(17,75),LTH=1,                                      +        
               ATTR=(PROT)                                                      
CLASS11  DFLD  POS=(17,78),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TEXT11   DFLD  POS=(17,80),LTH=1,                                      +        
               ATTR=(PROT)                                                      
CMD12    DFLD  POS=(18,3),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
ART12    DFLD  POS=(18,6),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
QTY12    DFLD  POS=(18,17),LTH=7,                                      +        
               ATTR=(PROT)                                                      
VALUE12  DFLD  POS=(18,26),LTH=10,                                     +        
               ATTR=(PROT,MOD)                                                  
DAT12    DFLD  POS=(18,38),LTH=6,                                      +        
               ATTR=(PROT,MOD)                                                  
DC12     DFLD  POS=(18,48),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
ANSK12   DFLD  POS=(18,55),LTH=3,                                      +        
               ATTR=(PROT)                                                      
REM12    DFLD  POS=(18,62),LTH=1,                                      +        
               ATTR=(PROT)                                                      
REF12    DFLD  POS=(18,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
ACC12    DFLD  POS=(18,75),LTH=1,                                      +        
               ATTR=(PROT)                                                      
CLASS12  DFLD  POS=(18,78),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TEXT12   DFLD  POS=(18,80),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'F7 First  F8 Forward  F10 WHELP  F11 Update  F12 Logoff+        
               ',                                                      +        
               POS=(22,1),LTH=55,                                      +        
               ATTR=(PROT)                                                      
TEMFSINF DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT,MOD)                                                  
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W6O322N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6N322,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I322N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W6N322,                                             +        
               NXT=W6I322N1                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  TEMFSFEL,                                               +        
               LTH=40                                                           
         MFLD  JOBROLIN,                                               +        
               LTH=8                                                            
         MFLD  JOBROLUT,                                               +        
               LTH=8                                                            
         MFLD  DCIN,                                                   +        
               LTH=2                                                            
         MFLD  DCUT,                                                   +        
               LTH=2                                                            
         MFLD  RESPFRIN,                                               +        
               LTH=3                                                            
         MFLD  RESPFRUT,                                               +        
               LTH=3                                                            
         MFLD  RESPTOIN,                                               +        
               LTH=3                                                            
         MFLD  RESOTOUT,                                               +        
               LTH=3                                                            
         MFLD  ARTNRIN,                                                +        
               LTH=9                                                            
         MFLD  ARTNRUT,                                                +        
               LTH=9                                                            
         MFLD  DATIN,                                                  +        
               LTH=6                                                            
         MFLD  DATUT,                                                  +        
               LTH=6                                                            
         MFLD  SCRAPALL,                                               +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  CMD1,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ART1,                                                   +        
               LTH=9                                                            
         MFLD  QTY1,                                                   +        
               LTH=7                                                            
         MFLD  VALUE1,                                                 +        
               LTH=10                                                           
         MFLD  DAT1,                                                   +        
               LTH=6                                                            
         MFLD  DC1,                                                    +        
               LTH=2                                                            
         MFLD  ANSK1,                                                  +        
               LTH=3                                                            
         MFLD  REM1,                                                   +        
               LTH=1                                                            
         MFLD  REF1,                                                   +        
               LTH=8                                                            
         MFLD  ACC1,                                                   +        
               LTH=1                                                            
         MFLD  CLASS1,                                                 +        
               LTH=1                                                            
         MFLD  TEXT1,                                                  +        
               LTH=1                                                            
         MFLD  CMD2,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ART2,                                                   +        
               LTH=9                                                            
         MFLD  QTY2,                                                   +        
               LTH=7                                                            
         MFLD  VALUE2,                                                 +        
               LTH=10                                                           
         MFLD  DAT2,                                                   +        
               LTH=6                                                            
         MFLD  DC2,                                                    +        
               LTH=2                                                            
         MFLD  ANSK2,                                                  +        
               LTH=3                                                            
         MFLD  REM2,                                                   +        
               LTH=1                                                            
         MFLD  REF2,                                                   +        
               LTH=8                                                            
         MFLD  ACC2,                                                   +        
               LTH=1                                                            
         MFLD  CLASS2,                                                 +        
               LTH=1                                                            
         MFLD  TEXT2,                                                  +        
               LTH=1                                                            
         MFLD  CMD3,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ART3,                                                   +        
               LTH=9                                                            
         MFLD  QTY3,                                                   +        
               LTH=7                                                            
         MFLD  VALUE3,                                                 +        
               LTH=10                                                           
         MFLD  DAT3,                                                   +        
               LTH=6                                                            
         MFLD  DC3,                                                    +        
               LTH=2                                                            
         MFLD  ANSK3,                                                  +        
               LTH=3                                                            
         MFLD  REM3,                                                   +        
               LTH=1                                                            
         MFLD  REF3,                                                   +        
               LTH=8                                                            
         MFLD  ACC3,                                                   +        
               LTH=1                                                            
         MFLD  CLASS3,                                                 +        
               LTH=1                                                            
         MFLD  TEXT3,                                                  +        
               LTH=1                                                            
         MFLD  CMD4,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ART4,                                                   +        
               LTH=9                                                            
         MFLD  QTY4,                                                   +        
               LTH=7                                                            
         MFLD  VALUE4,                                                 +        
               LTH=10                                                           
         MFLD  DAT4,                                                   +        
               LTH=6                                                            
         MFLD  DC4,                                                    +        
               LTH=2                                                            
         MFLD  ANSK4,                                                  +        
               LTH=3                                                            
         MFLD  REM4,                                                   +        
               LTH=1                                                            
         MFLD  REF4,                                                   +        
               LTH=8                                                            
         MFLD  ACC4,                                                   +        
               LTH=1                                                            
         MFLD  CLASS4,                                                 +        
               LTH=1                                                            
         MFLD  TEXT4,                                                  +        
               LTH=1                                                            
         MFLD  CMD5,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ART5,                                                   +        
               LTH=9                                                            
         MFLD  QTY5,                                                   +        
               LTH=7                                                            
         MFLD  VALUE5,                                                 +        
               LTH=10                                                           
         MFLD  DAT5,                                                   +        
               LTH=6                                                            
         MFLD  DC5,                                                    +        
               LTH=2                                                            
         MFLD  ANSK5,                                                  +        
               LTH=3                                                            
         MFLD  REM5,                                                   +        
               LTH=1                                                            
         MFLD  REF5,                                                   +        
               LTH=8                                                            
         MFLD  ACC5,                                                   +        
               LTH=1                                                            
         MFLD  CLASS5,                                                 +        
               LTH=1                                                            
         MFLD  TEXT5,                                                  +        
               LTH=1                                                            
         MFLD  CMD6,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ART6,                                                   +        
               LTH=9                                                            
         MFLD  QTY6,                                                   +        
               LTH=7                                                            
         MFLD  VALUE6,                                                 +        
               LTH=10                                                           
         MFLD  DAT6,                                                   +        
               LTH=6                                                            
         MFLD  DC6,                                                    +        
               LTH=2                                                            
         MFLD  ANSK6,                                                  +        
               LTH=3                                                            
         MFLD  REM6,                                                   +        
               LTH=1                                                            
         MFLD  REF6,                                                   +        
               LTH=8                                                            
         MFLD  ACC6,                                                   +        
               LTH=1                                                            
         MFLD  CLASS6,                                                 +        
               LTH=1                                                            
         MFLD  TEXT6,                                                  +        
               LTH=1                                                            
         MFLD  CMD7,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ART7,                                                   +        
               LTH=9                                                            
         MFLD  QTY7,                                                   +        
               LTH=7                                                            
         MFLD  VALUE7,                                                 +        
               LTH=10                                                           
         MFLD  DAT7,                                                   +        
               LTH=6                                                            
         MFLD  DC7,                                                    +        
               LTH=2                                                            
         MFLD  ANSK7,                                                  +        
               LTH=3                                                            
         MFLD  REM7,                                                   +        
               LTH=1                                                            
         MFLD  REF7,                                                   +        
               LTH=8                                                            
         MFLD  ACC7,                                                   +        
               LTH=1                                                            
         MFLD  CLASS7,                                                 +        
               LTH=1                                                            
         MFLD  TEXT7,                                                  +        
               LTH=1                                                            
         MFLD  CMD8,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ART8,                                                   +        
               LTH=9                                                            
         MFLD  QTY8,                                                   +        
               LTH=7                                                            
         MFLD  VALUE8,                                                 +        
               LTH=10                                                           
         MFLD  DAT8,                                                   +        
               LTH=6                                                            
         MFLD  DC8,                                                    +        
               LTH=2                                                            
         MFLD  ANSK8,                                                  +        
               LTH=3                                                            
         MFLD  REM8,                                                   +        
               LTH=1                                                            
         MFLD  REF8,                                                   +        
               LTH=8                                                            
         MFLD  ACC8,                                                   +        
               LTH=1                                                            
         MFLD  CLASS8,                                                 +        
               LTH=1                                                            
         MFLD  TEXT8,                                                  +        
               LTH=1                                                            
         MFLD  CMD9,                                                   +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ART9,                                                   +        
               LTH=9                                                            
         MFLD  QTY9,                                                   +        
               LTH=7                                                            
         MFLD  VALUE9,                                                 +        
               LTH=10                                                           
         MFLD  DAT9,                                                   +        
               LTH=6                                                            
         MFLD  DC9,                                                    +        
               LTH=2                                                            
         MFLD  ANSK9,                                                  +        
               LTH=3                                                            
         MFLD  REM9,                                                   +        
               LTH=1                                                            
         MFLD  REF9,                                                   +        
               LTH=8                                                            
         MFLD  ACC9,                                                   +        
               LTH=1                                                            
         MFLD  CLASS9,                                                 +        
               LTH=1                                                            
         MFLD  TEXT9,                                                  +        
               LTH=1                                                            
         MFLD  CMD10,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ART10,                                                  +        
               LTH=9                                                            
         MFLD  QTY10,                                                  +        
               LTH=7                                                            
         MFLD  VALUE10,                                                +        
               LTH=10                                                           
         MFLD  DAT10,                                                  +        
               LTH=6                                                            
         MFLD  DC10,                                                   +        
               LTH=2                                                            
         MFLD  ANSK10,                                                 +        
               LTH=3                                                            
         MFLD  REM10,                                                  +        
               LTH=1                                                            
         MFLD  REF10,                                                  +        
               LTH=8                                                            
         MFLD  ACC10,                                                  +        
               LTH=1                                                            
         MFLD  CLASS10,                                                +        
               LTH=1                                                            
         MFLD  TEXT10,                                                 +        
               LTH=1                                                            
         MFLD  CMD11,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ART11,                                                  +        
               LTH=9                                                            
         MFLD  QTY11,                                                  +        
               LTH=7                                                            
         MFLD  VALUE11,                                                +        
               LTH=10                                                           
         MFLD  DAT11,                                                  +        
               LTH=6                                                            
         MFLD  DC11,                                                   +        
               LTH=2                                                            
         MFLD  ANSK11,                                                 +        
               LTH=3                                                            
         MFLD  REM11,                                                  +        
               LTH=1                                                            
         MFLD  REF11,                                                  +        
               LTH=8                                                            
         MFLD  ACC11,                                                  +        
               LTH=1                                                            
         MFLD  CLASS11,                                                +        
               LTH=1                                                            
         MFLD  TEXT11,                                                 +        
               LTH=1                                                            
         MFLD  CMD12,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  ART12,                                                  +        
               LTH=9                                                            
         MFLD  QTY12,                                                  +        
               LTH=7                                                            
         MFLD  VALUE12,                                                +        
               LTH=10                                                           
         MFLD  DAT12,                                                  +        
               LTH=6                                                            
         MFLD  DC12,                                                   +        
               LTH=2                                                            
         MFLD  ANSK12,                                                 +        
               LTH=3                                                            
         MFLD  REM12,                                                  +        
               LTH=1                                                            
         MFLD  REF12,                                                  +        
               LTH=8                                                            
         MFLD  ACC12,                                                  +        
               LTH=1                                                            
         MFLD  CLASS12,                                                +        
               LTH=1                                                            
         MFLD  TEXT12,                                                 +        
               LTH=1                                                            
         MFLD  TEMFSINF,                                               +        
               LTH=55                                                           
         MFLD  DATE,                                                   +        
               LTH=8                                                            
         MFLD  TIME,                                                   +        
               LTH=8                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W6I322N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W6N322),                                           +        
               OPT=2,                                                  +        
               NXT=W6O322N1                                                     
MID      LPAGE SOR=(W6N322),                                           +        
               NXT=W6O322N1                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '63222',                                                +        
               LTH=5                                                            
         MFLD  (JOBROLIN,                                              +        
               '++++++++'),                                            +        
               LTH=8,                                                  +        
               FILL=X'40'                                                       
         MFLD  (JOBROLUT,                                              +        
               '        '),                                            +        
               LTH=8                                                            
         MFLD  (DCIN,                                                  +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'40'                                                       
         MFLD  (DCUT,                                                  +        
               '++'),                                                  +        
               LTH=2                                                            
         MFLD  (RESPFRIN,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  RESPFRUT,                                               +        
               LTH=3                                                            
         MFLD  (RESPTOIN,                                              +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  RESOTOUT,                                               +        
               LTH=3                                                            
         MFLD  (ARTNRIN,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  ARTNRUT,                                                +        
               LTH=9                                                            
         MFLD  (DATIN,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  DATUT,                                                  +        
               LTH=6                                                            
         MFLD  (SCRAPALL,                                              +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (CMD1,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  ART1,                                                   +        
               LTH=9                                                            
         MFLD  VALUE1,                                                 +        
               LTH=10                                                           
         MFLD  DAT1,                                                   +        
               LTH=6                                                            
         MFLD  DC1,                                                    +        
               LTH=2                                                            
         MFLD  (CMD2,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  ART2,                                                   +        
               LTH=9                                                            
         MFLD  VALUE2,                                                 +        
               LTH=10                                                           
         MFLD  DAT2,                                                   +        
               LTH=6                                                            
         MFLD  DC2,                                                    +        
               LTH=2                                                            
         MFLD  (CMD3,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  ART3,                                                   +        
               LTH=9                                                            
         MFLD  VALUE3,                                                 +        
               LTH=10                                                           
         MFLD  DAT3,                                                   +        
               LTH=6                                                            
         MFLD  DC3,                                                    +        
               LTH=2                                                            
         MFLD  (CMD4,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  ART4,                                                   +        
               LTH=9                                                            
         MFLD  VALUE4,                                                 +        
               LTH=10                                                           
         MFLD  DAT4,                                                   +        
               LTH=6                                                            
         MFLD  DC4,                                                    +        
               LTH=2                                                            
         MFLD  (CMD5,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  ART5,                                                   +        
               LTH=9                                                            
         MFLD  VALUE5,                                                 +        
               LTH=10                                                           
         MFLD  DAT5,                                                   +        
               LTH=6                                                            
         MFLD  DC5,                                                    +        
               LTH=2                                                            
         MFLD  (CMD6,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  ART6,                                                   +        
               LTH=9                                                            
         MFLD  VALUE6,                                                 +        
               LTH=10                                                           
         MFLD  DAT6,                                                   +        
               LTH=6                                                            
         MFLD  DC6,                                                    +        
               LTH=2                                                            
         MFLD  (CMD7,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  ART7,                                                   +        
               LTH=9                                                            
         MFLD  VALUE7,                                                 +        
               LTH=10                                                           
         MFLD  DAT7,                                                   +        
               LTH=6                                                            
         MFLD  DC7,                                                    +        
               LTH=2                                                            
         MFLD  (CMD8,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  ART8,                                                   +        
               LTH=9                                                            
         MFLD  VALUE8,                                                 +        
               LTH=10                                                           
         MFLD  DAT8,                                                   +        
               LTH=6                                                            
         MFLD  DC8,                                                    +        
               LTH=2                                                            
         MFLD  (CMD9,                                                  +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  ART9,                                                   +        
               LTH=9                                                            
         MFLD  VALUE9,                                                 +        
               LTH=10                                                           
         MFLD  DAT9,                                                   +        
               LTH=6                                                            
         MFLD  DC9,                                                    +        
               LTH=2                                                            
         MFLD  (CMD10,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  ART10,                                                  +        
               LTH=9                                                            
         MFLD  VALUE10,                                                +        
               LTH=10                                                           
         MFLD  DAT10,                                                  +        
               LTH=6                                                            
         MFLD  DC10,                                                   +        
               LTH=2                                                            
         MFLD  (CMD11,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  ART11,                                                  +        
               LTH=9                                                            
         MFLD  VALUE11,                                                +        
               LTH=10                                                           
         MFLD  DAT11,                                                  +        
               LTH=6                                                            
         MFLD  DC11,                                                   +        
               LTH=2                                                            
         MFLD  (CMD12,                                                 +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  ART12,                                                  +        
               LTH=9                                                            
         MFLD  VALUE12,                                                +        
               LTH=10                                                           
         MFLD  DAT12,                                                  +        
               LTH=6                                                            
         MFLD  DC12,                                                   +        
               LTH=2                                                            
         MSGEND                                                                 
         END                                                                    
