***********************************************************************         
* CREATED BY Ph54793   ON 96/03/11  AT 11:55                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'LIST FREE LOCATIONS             '                               
W6N346   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W6T346 4',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W6T346 7',                                           +        
               8='W6T346 8',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W6T341  ',                                          +        
               14='W6T342  ',                                          +        
               15='W6T343  ',                                          +        
               16='W6T344  ',                                          +        
               17='W6T345  ',                                          +        
               18='W6T346  ',                                          +        
               19='W6T347  ',                                          +        
               20='W6T348  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W6N346   DPAGE CURSOR=((2,13)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'LIST FREE LOCATIONS',                                  +        
               POS=(1,12),LTH=19,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'DC',                                                   +        
               POS=(03,02),LTH=2,                                      +        
               ATTR=(PROT)                                                      
IDDCIN   DFLD  POS=(02,05),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Area',                                                 +        
               POS=(02,08),LTH=4,                                      +        
               ATTR=(PROT)                                                      
ADLAGOMI DFLD  POS=(02,13),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'AF',                                                   +        
               POS=(02,16),LTH=2,                                      +        
               ATTR=(PROT)                                                      
ADGANGFI DFLD  POS=(02,19),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'AT',                                                   +        
               POS=(02,22),LTH=2,                                      +        
               ATTR=(PROT)                                                      
ADGANGTI DFLD  POS=(02,25),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'SF',                                                   +        
               POS=(02,28),LTH=2,                                      +        
               ATTR=(PROT)                                                      
ADSECFI  DFLD  POS=(02,31),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'ST',                                                   +        
               POS=(02,35),LTH=2,                                      +        
               ATTR=(PROT)                                                      
ADSECTI  DFLD  POS=(02,38),LTH=3,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'LF',                                                   +        
               POS=(02,42),LTH=2,                                      +        
               ATTR=(PROT)                                                      
ADLEVFI  DFLD  POS=(02,45),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'LT',                                                   +        
               POS=(02,47),LTH=2,                                      +        
               ATTR=(PROT)                                                      
ADLEVTI  DFLD  POS=(02,50),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Type',                                                 +        
               POS=(02,52),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KDLOCI   DFLD  POS=(02,57),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
         DFLD  'Freq',                                                 +        
               POS=(02,60),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KDFREQI  DFLD  POS=(02,65),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Size',                                                 +        
               POS=(02,68),LTH=4,                                      +        
               ATTR=(PROT)                                                      
TELOCI   DFLD  POS=(02,73),LTH=1,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
IDDCUT   DFLD  POS=(3,05),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
ADLAGOMU DFLD  POS=(3,13),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
ADGANGFU DFLD  POS=(03,19),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
ADGANGTU DFLD  POS=(03,25),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
ADSECFU  DFLD  POS=(03,31),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
ADSECTU  DFLD  POS=(03,38),LTH=3,                                      +        
               ATTR=(PROT,MOD)                                                  
ADLEVFU  DFLD  POS=(03,45),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
ADLEVTU  DFLD  POS=(03,50),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
KDLOCU   DFLD  POS=(03,57),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
KDFREQU  DFLD  POS=(03,65),LTH=2,                                      +        
               ATTR=(PROT,MOD)                                                  
TELOCU   DFLD  POS=(03,73),LTH=1,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Location',                                             +        
               POS=(5,2),LTH=08,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Type',                                                 +        
               POS=(05,15),LTH=04,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Freq',                                                 +        
               POS=(05,20),LTH=04,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Storage',                                              +        
               POS=(05,26),LTH=07,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Spec. Descript. ',                                     +        
               POS=(05,35),LTH=16,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Print Code',                                           +        
               POS=(05,65),LTH=10,                                     +        
               ATTR=(PROT)                                                      
PRTKD    DFLD  POS=(05,76),LTH=3,                                      +        
               ATTR=(ALPHA,NOPROT)                                              
ADLGOM1  DFLD  POS=(06,02),LTH=02,                                     +        
               ATTR=(NUM,PROT)                                                  
ADGANG1  DFLD  POS=(06,05),LTH=02,                                     +        
               ATTR=(NUM,PROT)                                                  
ADPLAT1  DFLD  POS=(06,08),LTH=05,                                     +        
               ATTR=(NUM,PROT)                                                  
KDLOC1   DFLD  POS=(06,16),LTH=01,                                     +        
               ATTR=(PROT)                                                      
KDFREQ1  DFLD  POS=(06,21),LTH=02,                                     +        
               ATTR=(NUM,PROT)                                                  
KDSTOR1  DFLD  POS=(06,27),LTH=03,                                     +        
               ATTR=(PROT)                                                      
TELOC1   DFLD  POS=(06,35),LTH=15,                                     +        
               ATTR=(PROT)                                                      
ADLGOM2  DFLD  POS=(07,02),LTH=02,                                     +        
               ATTR=(NUM,PROT)                                                  
ADGANG2  DFLD  POS=(07,05),LTH=02,                                     +        
               ATTR=(NUM,PROT)                                                  
ADPLAT2  DFLD  POS=(07,08),LTH=05,                                     +        
               ATTR=(NUM,PROT)                                                  
KDLOC2   DFLD  POS=(07,16),LTH=01,                                     +        
               ATTR=(PROT)                                                      
KDFREQ2  DFLD  POS=(07,21),LTH=02,                                     +        
               ATTR=(NUM,PROT)                                                  
KDSTOR2  DFLD  POS=(07,27),LTH=03,                                     +        
               ATTR=(PROT)                                                      
TELOC2   DFLD  POS=(07,35),LTH=15,                                     +        
               ATTR=(PROT)                                                      
ADLGOM3  DFLD  POS=(08,02),LTH=02,                                     +        
               ATTR=(NUM,PROT)                                                  
ADGANG3  DFLD  POS=(08,05),LTH=02,                                     +        
               ATTR=(NUM,PROT)                                                  
ADPLAT3  DFLD  POS=(08,08),LTH=05,                                     +        
               ATTR=(NUM,PROT)                                                  
KDLOC3   DFLD  POS=(08,16),LTH=01,                                     +        
               ATTR=(PROT)                                                      
KDFREQ3  DFLD  POS=(08,21),LTH=02,                                     +        
               ATTR=(NUM,PROT)                                                  
KDSTOR3  DFLD  POS=(08,27),LTH=03,                                     +        
               ATTR=(PROT)                                                      
TELOC3   DFLD  POS=(08,35),LTH=15,                                     +        
               ATTR=(PROT)                                                      
ADLGOM4  DFLD  POS=(09,02),LTH=02,                                     +        
               ATTR=(NUM,PROT)                                                  
ADGANG4  DFLD  POS=(09,05),LTH=02,                                     +        
               ATTR=(NUM,PROT)                                                  
ADPLAT4  DFLD  POS=(09,08),LTH=05,                                     +        
               ATTR=(NUM,PROT)                                                  
KDLOC4   DFLD  POS=(09,16),LTH=01,                                     +        
               ATTR=(PROT)                                                      
KDFREQ4  DFLD  POS=(09,21),LTH=02,                                     +        
               ATTR=(NUM,PROT)                                                  
KDSTOR4  DFLD  POS=(09,27),LTH=03,                                     +        
               ATTR=(PROT)                                                      
TELOC4   DFLD  POS=(09,35),LTH=15,                                     +        
               ATTR=(PROT)                                                      
ADLGOM5  DFLD  POS=(10,02),LTH=02,                                     +        
               ATTR=(NUM,PROT)                                                  
ADGANG5  DFLD  POS=(10,05),LTH=02,                                     +        
               ATTR=(NUM,PROT)                                                  
ADPLAT5  DFLD  POS=(10,08),LTH=05,                                     +        
               ATTR=(NUM,PROT)                                                  
KDLOC5   DFLD  POS=(10,16),LTH=01,                                     +        
               ATTR=(PROT)                                                      
KDFREQ5  DFLD  POS=(10,21),LTH=02,                                     +        
               ATTR=(NUM,PROT)                                                  
KDSTOR5  DFLD  POS=(10,27),LTH=03,                                     +        
               ATTR=(PROT)                                                      
TELOC5   DFLD  POS=(10,35),LTH=15,                                     +        
               ATTR=(PROT)                                                      
ADLGOM6  DFLD  POS=(11,02),LTH=02,                                     +        
               ATTR=(NUM,PROT)                                                  
ADGANG6  DFLD  POS=(11,05),LTH=02,                                     +        
               ATTR=(NUM,PROT)                                                  
ADPLAT6  DFLD  POS=(11,08),LTH=05,                                     +        
               ATTR=(NUM,PROT)                                                  
KDLOC6   DFLD  POS=(11,16),LTH=01,                                     +        
               ATTR=(PROT)                                                      
KDFREQ6  DFLD  POS=(11,21),LTH=02,                                     +        
               ATTR=(NUM,PROT)                                                  
KDSTOR6  DFLD  POS=(11,27),LTH=03,                                     +        
               ATTR=(PROT)                                                      
TELOC6   DFLD  POS=(11,35),LTH=15,                                     +        
               ATTR=(PROT)                                                      
ADLGOM7  DFLD  POS=(12,02),LTH=02,                                     +        
               ATTR=(NUM,PROT)                                                  
ADGANG7  DFLD  POS=(12,05),LTH=02,                                     +        
               ATTR=(NUM,PROT)                                                  
ADPLAT7  DFLD  POS=(12,08),LTH=05,                                     +        
               ATTR=(NUM,PROT)                                                  
KDLOC7   DFLD  POS=(12,16),LTH=01,                                     +        
               ATTR=(PROT)                                                      
KDFREQ7  DFLD  POS=(12,21),LTH=02,                                     +        
               ATTR=(NUM,PROT)                                                  
KDSTOR7  DFLD  POS=(12,27),LTH=03,                                     +        
               ATTR=(PROT)                                                      
TELOC7   DFLD  POS=(12,35),LTH=15,                                     +        
               ATTR=(PROT)                                                      
ADLGOM8  DFLD  POS=(13,02),LTH=02,                                     +        
               ATTR=(NUM,PROT)                                                  
ADGANG8  DFLD  POS=(13,05),LTH=02,                                     +        
               ATTR=(NUM,PROT)                                                  
ADPLAT8  DFLD  POS=(13,08),LTH=05,                                     +        
               ATTR=(NUM,PROT)                                                  
KDLOC8   DFLD  POS=(13,16),LTH=01,                                     +        
               ATTR=(PROT)                                                      
KDFREQ8  DFLD  POS=(13,21),LTH=02,                                     +        
               ATTR=(NUM,PROT)                                                  
KDSTOR8  DFLD  POS=(13,27),LTH=03,                                     +        
               ATTR=(PROT)                                                      
TELOC8   DFLD  POS=(13,35),LTH=15,                                     +        
               ATTR=(PROT)                                                      
ADLGOM9  DFLD  POS=(14,02),LTH=02,                                     +        
               ATTR=(NUM,PROT)                                                  
ADGANG9  DFLD  POS=(14,05),LTH=02,                                     +        
               ATTR=(NUM,PROT)                                                  
ADPLAT9  DFLD  POS=(14,08),LTH=05,                                     +        
               ATTR=(NUM,PROT)                                                  
KDLOC9   DFLD  POS=(14,16),LTH=01,                                     +        
               ATTR=(PROT)                                                      
KDFREQ9  DFLD  POS=(14,21),LTH=02,                                     +        
               ATTR=(NUM,PROT)                                                  
KDSTOR9  DFLD  POS=(14,27),LTH=03,                                     +        
               ATTR=(PROT)                                                      
TELOC9   DFLD  POS=(14,35),LTH=15,                                     +        
               ATTR=(PROT)                                                      
ADLGOM10 DFLD  POS=(15,02),LTH=02,                                     +        
               ATTR=(NUM,PROT)                                                  
ADGANG10 DFLD  POS=(15,05),LTH=02,                                     +        
               ATTR=(NUM,PROT)                                                  
ADPLAT10 DFLD  POS=(15,08),LTH=05,                                     +        
               ATTR=(NUM,PROT)                                                  
KDLOC10  DFLD  POS=(15,16),LTH=01,                                     +        
               ATTR=(PROT)                                                      
KDFREQ10 DFLD  POS=(15,21),LTH=02,                                     +        
               ATTR=(NUM,PROT)                                                  
KDSTOR10 DFLD  POS=(15,27),LTH=03,                                     +        
               ATTR=(PROT)                                                      
TELOC10  DFLD  POS=(15,35),LTH=15,                                     +        
               ATTR=(PROT)                                                      
ADLGOM11 DFLD  POS=(16,02),LTH=02,                                     +        
               ATTR=(NUM,PROT)                                                  
ADGANG11 DFLD  POS=(16,05),LTH=02,                                     +        
               ATTR=(NUM,PROT)                                                  
ADPLAT11 DFLD  POS=(16,08),LTH=05,                                     +        
               ATTR=(NUM,PROT)                                                  
KDLOC11  DFLD  POS=(16,16),LTH=01,                                     +        
               ATTR=(PROT)                                                      
KDFREQ11 DFLD  POS=(16,21),LTH=02,                                     +        
               ATTR=(NUM,PROT)                                                  
KDSTOR11 DFLD  POS=(16,27),LTH=03,                                     +        
               ATTR=(PROT)                                                      
TELOC11  DFLD  POS=(16,35),LTH=15,                                     +        
               ATTR=(PROT)                                                      
ADLGOM12 DFLD  POS=(17,02),LTH=02,                                     +        
               ATTR=(NUM,PROT)                                                  
ADGANG12 DFLD  POS=(17,05),LTH=02,                                     +        
               ATTR=(NUM,PROT)                                                  
ADPLAT12 DFLD  POS=(17,08),LTH=05,                                     +        
               ATTR=(NUM,PROT)                                                  
KDLOC12  DFLD  POS=(17,16),LTH=01,                                     +        
               ATTR=(PROT)                                                      
KDFREQ12 DFLD  POS=(17,21),LTH=02,                                     +        
               ATTR=(NUM,PROT)                                                  
KDSTOR12 DFLD  POS=(17,27),LTH=03,                                     +        
               ATTR=(PROT)                                                      
TELOC12  DFLD  POS=(17,35),LTH=15,                                     +        
               ATTR=(PROT)                                                      
ADLGOM13 DFLD  POS=(18,02),LTH=02,                                     +        
               ATTR=(NUM,PROT)                                                  
ADGANG13 DFLD  POS=(18,05),LTH=02,                                     +        
               ATTR=(NUM,PROT)                                                  
ADPLAT13 DFLD  POS=(18,08),LTH=05,                                     +        
               ATTR=(NUM,PROT)                                                  
KDLOC13  DFLD  POS=(18,16),LTH=01,                                     +        
               ATTR=(PROT)                                                      
KDFREQ13 DFLD  POS=(18,21),LTH=02,                                     +        
               ATTR=(NUM,PROT)                                                  
KDSTOR13 DFLD  POS=(18,27),LTH=03,                                     +        
               ATTR=(PROT)                                                      
TELOC13  DFLD  POS=(18,35),LTH=15,                                     +        
               ATTR=(PROT)                                                      
ADLGOM14 DFLD  POS=(19,02),LTH=02,                                     +        
               ATTR=(NUM,PROT)                                                  
ADGANG14 DFLD  POS=(19,05),LTH=02,                                     +        
               ATTR=(NUM,PROT)                                                  
ADPLAT14 DFLD  POS=(19,08),LTH=05,                                     +        
               ATTR=(NUM,PROT)                                                  
KDLOC14  DFLD  POS=(19,16),LTH=01,                                     +        
               ATTR=(PROT)                                                      
KDFREQ14 DFLD  POS=(19,21),LTH=02,                                     +        
               ATTR=(NUM,PROT)                                                  
KDSTOR14 DFLD  POS=(19,27),LTH=03,                                     +        
               ATTR=(PROT)                                                      
TELOC14  DFLD  POS=(19,35),LTH=15,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '13 Main.FreqTab 14 ListStor.Cod 15 Maint. Loc   16 Add +        
               Location 17 Change Loc',                                +        
               POS=(21,1),LTH=77,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 List Fr. Loc 19 List Loc',                          +        
               POS=(22,1),LTH=27,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20 Copy Loc',                                          +        
               POS=(22,33),LTH=11,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,49),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10  WHELP',                                            +        
               POS=(22,65),LTH=9,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W6O346N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6N346,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I346N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W6N346                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  ADLAGOMI,                                               +        
               LTH=2                                                            
         MFLD  ADLAGOMU,                                               +        
               LTH=2                                                            
         MFLD  ADGANGFI,                                               +        
               LTH=2                                                            
         MFLD  ADGANGFU,                                               +        
               LTH=2                                                            
         MFLD  ADGANGTI,                                               +        
               LTH=2                                                            
         MFLD  ADGANGTU,                                               +        
               LTH=2                                                            
         MFLD  ADSECFI,                                                +        
               LTH=3                                                            
         MFLD  ADSECFU,                                                +        
               LTH=3                                                            
         MFLD  ADSECTI,                                                +        
               LTH=3                                                            
         MFLD  ADSECTU,                                                +        
               LTH=3                                                            
         MFLD  ADLEVFI,                                                +        
               LTH=1                                                            
         MFLD  ADLEVFU,                                                +        
               LTH=1                                                            
         MFLD  ADLEVTI,                                                +        
               LTH=1                                                            
         MFLD  ADLEVTU,                                                +        
               LTH=1                                                            
         MFLD  KDLOCI,                                                 +        
               LTH=1                                                            
         MFLD  KDLOCU,                                                 +        
               LTH=1                                                            
         MFLD  KDFREQI,                                                +        
               LTH=2                                                            
         MFLD  KDFREQU,                                                +        
               LTH=2                                                            
         MFLD  TELOCI,                                                 +        
               LTH=1                                                            
         MFLD  TELOCU,                                                 +        
               LTH=1                                                            
         MFLD  PRTKD,                                                  +        
               LTH=3                                                            
         MFLD  ADLGOM1,                                                +        
               LTH=02                                                           
         MFLD  ADGANG1,                                                +        
               LTH=02                                                           
         MFLD  ADPLAT1,                                                +        
               LTH=05                                                           
         MFLD  KDLOC1,                                                 +        
               LTH=01                                                           
         MFLD  KDFREQ1,                                                +        
               LTH=02                                                           
         MFLD  KDSTOR1,                                                +        
               LTH=03                                                           
         MFLD  TELOC1,                                                 +        
               LTH=15                                                           
         MFLD  ADLGOM2,                                                +        
               LTH=02                                                           
         MFLD  ADGANG2,                                                +        
               LTH=02                                                           
         MFLD  ADPLAT2,                                                +        
               LTH=05                                                           
         MFLD  KDLOC2,                                                 +        
               LTH=01                                                           
         MFLD  KDFREQ2,                                                +        
               LTH=02                                                           
         MFLD  KDSTOR2,                                                +        
               LTH=03                                                           
         MFLD  TELOC2,                                                 +        
               LTH=15                                                           
         MFLD  ADLGOM3,                                                +        
               LTH=02                                                           
         MFLD  ADGANG3,                                                +        
               LTH=02                                                           
         MFLD  ADPLAT3,                                                +        
               LTH=05                                                           
         MFLD  KDLOC3,                                                 +        
               LTH=01                                                           
         MFLD  KDFREQ3,                                                +        
               LTH=02                                                           
         MFLD  KDSTOR3,                                                +        
               LTH=03                                                           
         MFLD  TELOC3,                                                 +        
               LTH=15                                                           
         MFLD  ADLGOM4,                                                +        
               LTH=02                                                           
         MFLD  ADGANG4,                                                +        
               LTH=02                                                           
         MFLD  ADPLAT4,                                                +        
               LTH=05                                                           
         MFLD  KDLOC4,                                                 +        
               LTH=01                                                           
         MFLD  KDFREQ4,                                                +        
               LTH=02                                                           
         MFLD  KDSTOR4,                                                +        
               LTH=03                                                           
         MFLD  TELOC4,                                                 +        
               LTH=15                                                           
         MFLD  ADLGOM5,                                                +        
               LTH=02                                                           
         MFLD  ADGANG5,                                                +        
               LTH=02                                                           
         MFLD  ADPLAT5,                                                +        
               LTH=05                                                           
         MFLD  KDLOC5,                                                 +        
               LTH=01                                                           
         MFLD  KDFREQ5,                                                +        
               LTH=02                                                           
         MFLD  KDSTOR5,                                                +        
               LTH=03                                                           
         MFLD  TELOC5,                                                 +        
               LTH=15                                                           
         MFLD  ADLGOM6,                                                +        
               LTH=02                                                           
         MFLD  ADGANG6,                                                +        
               LTH=02                                                           
         MFLD  ADPLAT6,                                                +        
               LTH=05                                                           
         MFLD  KDLOC6,                                                 +        
               LTH=01                                                           
         MFLD  KDFREQ6,                                                +        
               LTH=02                                                           
         MFLD  KDSTOR6,                                                +        
               LTH=03                                                           
         MFLD  TELOC6,                                                 +        
               LTH=15                                                           
         MFLD  ADLGOM7,                                                +        
               LTH=02                                                           
         MFLD  ADGANG7,                                                +        
               LTH=02                                                           
         MFLD  ADPLAT7,                                                +        
               LTH=05                                                           
         MFLD  KDLOC7,                                                 +        
               LTH=01                                                           
         MFLD  KDFREQ7,                                                +        
               LTH=02                                                           
         MFLD  KDSTOR7,                                                +        
               LTH=03                                                           
         MFLD  TELOC7,                                                 +        
               LTH=15                                                           
         MFLD  ADLGOM8,                                                +        
               LTH=02                                                           
         MFLD  ADGANG8,                                                +        
               LTH=02                                                           
         MFLD  ADPLAT8,                                                +        
               LTH=05                                                           
         MFLD  KDLOC8,                                                 +        
               LTH=01                                                           
         MFLD  KDFREQ8,                                                +        
               LTH=02                                                           
         MFLD  KDSTOR8,                                                +        
               LTH=03                                                           
         MFLD  TELOC8,                                                 +        
               LTH=15                                                           
         MFLD  ADLGOM9,                                                +        
               LTH=02                                                           
         MFLD  ADGANG9,                                                +        
               LTH=02                                                           
         MFLD  ADPLAT9,                                                +        
               LTH=05                                                           
         MFLD  KDLOC9,                                                 +        
               LTH=01                                                           
         MFLD  KDFREQ9,                                                +        
               LTH=02                                                           
         MFLD  KDSTOR9,                                                +        
               LTH=03                                                           
         MFLD  TELOC9,                                                 +        
               LTH=15                                                           
         MFLD  ADLGOM10,                                               +        
               LTH=02                                                           
         MFLD  ADGANG10,                                               +        
               LTH=02                                                           
         MFLD  ADPLAT10,                                               +        
               LTH=05                                                           
         MFLD  KDLOC10,                                                +        
               LTH=01                                                           
         MFLD  KDFREQ10,                                               +        
               LTH=02                                                           
         MFLD  KDSTOR10,                                               +        
               LTH=03                                                           
         MFLD  TELOC10,                                                +        
               LTH=15                                                           
         MFLD  ADLGOM11,                                               +        
               LTH=02                                                           
         MFLD  ADGANG11,                                               +        
               LTH=02                                                           
         MFLD  ADPLAT11,                                               +        
               LTH=05                                                           
         MFLD  KDLOC11,                                                +        
               LTH=01                                                           
         MFLD  KDFREQ11,                                               +        
               LTH=02                                                           
         MFLD  KDSTOR11,                                               +        
               LTH=03                                                           
         MFLD  TELOC11,                                                +        
               LTH=15                                                           
         MFLD  ADLGOM12,                                               +        
               LTH=02                                                           
         MFLD  ADGANG12,                                               +        
               LTH=02                                                           
         MFLD  ADPLAT12,                                               +        
               LTH=05                                                           
         MFLD  KDLOC12,                                                +        
               LTH=01                                                           
         MFLD  KDFREQ12,                                               +        
               LTH=02                                                           
         MFLD  KDSTOR12,                                               +        
               LTH=03                                                           
         MFLD  TELOC12,                                                +        
               LTH=15                                                           
         MFLD  ADLGOM13,                                               +        
               LTH=02                                                           
         MFLD  ADGANG13,                                               +        
               LTH=02                                                           
         MFLD  ADPLAT13,                                               +        
               LTH=05                                                           
         MFLD  KDLOC13,                                                +        
               LTH=01                                                           
         MFLD  KDFREQ13,                                               +        
               LTH=02                                                           
         MFLD  KDSTOR13,                                               +        
               LTH=03                                                           
         MFLD  TELOC13,                                                +        
               LTH=15                                                           
         MFLD  ADLGOM14,                                               +        
               LTH=02                                                           
         MFLD  ADGANG14,                                               +        
               LTH=02                                                           
         MFLD  ADPLAT14,                                               +        
               LTH=05                                                           
         MFLD  KDLOC14,                                                +        
               LTH=01                                                           
         MFLD  KDFREQ14,                                               +        
               LTH=02                                                           
         MFLD  KDSTOR14,                                               +        
               LTH=03                                                           
         MFLD  TELOC14,                                                +        
               LTH=15                                                           
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W6I346N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W6N346),                                           +        
               OPT=2,                                                  +        
               NXT=W6O346N1                                                     
MID      LPAGE SOR=(W6N346)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '63462',                                                +        
               LTH=5                                                            
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDCUT,                                                 +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ADLAGOMI,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  ADLAGOMU,                                               +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (ADGANGFI,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  ADGANGFU,                                               +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (ADGANGTI,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  ADGANGTU,                                               +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (ADSECFI,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  ADSECFU,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (ADSECTI,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  ADSECTU,                                                +        
               LTH=3,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (ADLEVFI,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  ADLEVFU,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (ADLEVTI,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  ADLEVTU,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (KDLOCI,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  KDLOCU,                                                 +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (KDFREQI,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  KDFREQU,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (TELOCI,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  TELOCU,                                                 +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (PRTKD,                                                 +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
