***********************************************************************         
* CREATED BY Ph54793   ON 96/03/11  AT 11:55                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'MAINTAIN LOCATION               '                               
W6N313   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W6T313U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W6T311  ',                                          +        
               14='W6T312  ',                                          +        
               15='W6T313  ',                                          +        
               16='W6T314  ',                                          +        
               17='W6T315  ',                                          +        
               18='W6T316  ',                                          +        
               19='W6T317  ',                                          +        
               20='W6T318  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W6T313U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W6N313   DPAGE CURSOR=((2,13)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'MAINTAIN LOCATION',                                    +        
               POS=(1,12),LTH=18,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'DC',                                                   +        
               POS=(03,02),LTH=2,                                      +        
               ATTR=(PROT)                                                      
IDDCIN   DFLD  POS=(02,05),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Area',                                                 +        
               POS=(02,08),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
ADLAGOMI DFLD  POS=(02,13),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Aisle',                                                +        
               POS=(02,18),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
ADGANGI  DFLD  POS=(02,24),LTH=2,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Location',                                             +        
               POS=(2,29),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
ADSECI   DFLD  POS=(2,39),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
ADLEVELI DFLD  POS=(2,42),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
ADSEQI   DFLD  POS=(2,45),LTH=1,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Action',                                               +        
               POS=(2,49),LTH=6,                                       +        
               ATTR=(NUM,PROT)                                                  
KDANDRI  DFLD  POS=(2,57),LTH=1,                                       +        
               ATTR=(ALPHA,NOPROT)                                              
IDDCUT   DFLD  POS=(3,05),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
ADLAGOMU DFLD  POS=(3,13),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
ADGANGU  DFLD  POS=(3,24),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
ADSECU   DFLD  POS=(3,39),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
ADLEVELU DFLD  POS=(3,42),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
ADSEQU   DFLD  POS=(3,45),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
KDANDRU  DFLD  POS=(3,57),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Type',                                                 +        
               POS=(5,2),LTH=04,                                       +        
               ATTR=(PROT)                                                      
         DFLD  ':',                                                    +        
               POS=(5,18),LTH=1,                                       +        
               ATTR=(PROT)                                                      
KDLOC    DFLD  POS=(5,21),LTH=01,                                      +        
               ATTR=(PROT)                                                      
KDLOCU   DFLD  POS=(6,21),LTH=01,                                      +        
               ATTR=(NOPROT)                                                    
         DFLD  'P = Prime  R = Reserve (buffer) M = Mixed',            +        
               POS=(6,38),LTH=41,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Frequency Code',                                       +        
               POS=(7,2),LTH=14,                                       +        
               ATTR=(PROT)                                                      
         DFLD  ':',                                                    +        
               POS=(7,18),LTH=1,                                       +        
               ATTR=(PROT)                                                      
IDFREQ   DFLD  POS=(7,21),LTH=02,                                      +        
               ATTR=(PROT)                                                      
IDFREQU  DFLD  POS=(8,21),LTH=02,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Storage Code',                                         +        
               POS=(9,2),LTH=12,                                       +        
               ATTR=(PROT)                                                      
         DFLD  ':',                                                    +        
               POS=(9,18),LTH=1,                                       +        
               ATTR=(PROT)                                                      
IDSTOR   DFLD  POS=(9,21),LTH=03,                                      +        
               ATTR=(PROT)                                                      
IDSTORU  DFLD  POS=(10,21),LTH=03,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Spec. Descript.',                                      +        
               POS=(11,02),LTH=15,                                     +        
               ATTR=(PROT)                                                      
         DFLD  ':',                                                    +        
               POS=(11,18),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TELOC    DFLD  POS=(11,21),LTH=15,                                     +        
               ATTR=(PROT)                                                      
TELOCU   DFLD  POS=(12,21),LTH=15,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Number of Parts',                                      +        
               POS=(13,2),LTH=15,                                      +        
               ATTR=(PROT)                                                      
         DFLD  ':',                                                    +        
               POS=(13,18),LTH=1,                                      +        
               ATTR=(PROT)                                                      
KVMPART  DFLD  POS=(13,21),LTH=02,                                     +        
               ATTR=(PROT)                                                      
KVMPARTU DFLD  POS=(14,21),LTH=02,                                     +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '1 = single part, > 1  = multi part',                   +        
               POS=(14,38),LTH=36,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Delete Location',                                      +        
               POS=(16,2),LTH=15,                                      +        
               ATTR=(PROT)                                                      
         DFLD  ':',                                                    +        
               POS=(16,18),LTH=1,                                      +        
               ATTR=(PROT)                                                      
FLSVAR   DFLD  POS=(16,21),LTH=01,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'Y/N',                                                  +        
               POS=(16,38),LTH=36,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '13 Main.FreqTab 14 ListStor.Cod 15 Maint. Loc   16 Add +        
               Location 17 Change Loc',                                +        
               POS=(21,1),LTH=77,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18 List Fr. Loc 19 List Loc',                          +        
               POS=(22,1),LTH=27,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20 Copy Loc',                                          +        
               POS=(22,33),LTH=11,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,49),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10  WHELP',                                            +        
               POS=(22,65),LTH=9,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
DATE     DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TIME     DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W6O313N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6N313,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I313N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W6N313                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  IDDCIN,                                                 +        
               LTH=2                                                            
         MFLD  IDDCUT,                                                 +        
               LTH=2                                                            
         MFLD  ADLAGOMI,                                               +        
               LTH=2                                                            
         MFLD  ADLAGOMU,                                               +        
               LTH=2                                                            
         MFLD  ADGANGI,                                                +        
               LTH=2                                                            
         MFLD  ADGANGU,                                                +        
               LTH=2                                                            
         MFLD  ADSECI,                                                 +        
               LTH=2                                                            
         MFLD  ADSECU,                                                 +        
               LTH=2                                                            
         MFLD  ADLEVELI,                                               +        
               LTH=2                                                            
         MFLD  ADLEVELU,                                               +        
               LTH=2                                                            
         MFLD  ADSEQI,                                                 +        
               LTH=1                                                            
         MFLD  ADSEQU,                                                 +        
               LTH=1                                                            
         MFLD  KDANDRI,                                                +        
               LTH=1                                                            
         MFLD  KDANDRU,                                                +        
               LTH=1                                                            
         MFLD  KDLOC,                                                  +        
               LTH=1                                                            
         MFLD  KDLOCU,                                                 +        
               LTH=3,ATTR=YES                                                   
         MFLD  IDFREQ,                                                 +        
               LTH=2                                                            
         MFLD  IDFREQU,                                                +        
               LTH=4,ATTR=YES                                                   
         MFLD  IDSTOR,                                                 +        
               LTH=3                                                            
         MFLD  IDSTORU,                                                +        
               LTH=5,ATTR=YES                                                   
         MFLD  TELOC,                                                  +        
               LTH=15                                                           
         MFLD  TELOCU,                                                 +        
               LTH=17,ATTR=YES                                                  
         MFLD  KVMPART,                                                +        
               LTH=2                                                            
         MFLD  KVMPARTU,                                               +        
               LTH=04,ATTR=YES                                                  
         MFLD  FLSVAR,                                                 +        
               LTH=03,ATTR=YES                                                  
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (DATE,                                                  +        
               DATE4)                                                           
         MFLD  (TIME,                                                  +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W6I313N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W6N313),                                           +        
               OPT=2,                                                  +        
               NXT=W6O313N1                                                     
MID      LPAGE SOR=(W6N313)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '63132',                                                +        
               LTH=5                                                            
         MFLD  (IDDCIN,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDCUT,                                                 +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ADLAGOMI,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  ADLAGOMU,                                               +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (ADGANGI,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  ADGANGU,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (ADSECI,                                                +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  ADSECU,                                                 +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (ADLEVELI,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  ADLEVELU,                                               +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (ADSEQI,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  ADSEQU,                                                 +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (KDANDRI,                                               +        
               '+'),                                                   +        
               LTH=01,                                                 +        
               FILL=X'40'                                                       
         MFLD  KDANDRU,                                                +        
               LTH=01,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KDLOCU,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  (IDFREQU,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (IDSTORU,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (TELOCU,                                                +        
               '+++++++++++++++'),                                     +        
               LTH=15,                                                 +        
               FILL=X'40'                                                       
         MFLD  (KVMPARTU,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLSVAR,                                                +        
               '+'),                                                   +        
               LTH=01,                                                 +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
