***********************************************************************         
* CREATED BY V059625   ON 01/06/28  AT 13:44                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'GOODS RECIEVING HISTORY         '                               
W6N307   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W6T307 7',                                           +        
               8='W6T307 8',                                           +        
               9='W6T307 9',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W6T301  ',                                          +        
               14='W6T302  ',                                          +        
               15='W6T303  ',                                          +        
               16='W6T304  ',                                          +        
               17='W6T305  ',                                          +        
               18='W6T306  ',                                          +        
               19='W6T307  ',                                          +        
               20='W6T308  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,11)),                                        +        
               FILL=NONE                                                        
IDTRANS1 DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
IDTRANS2 DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS3 DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
IDTRANS4 DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'GOODS RECEIVING HISTORY',                              +        
               POS=(1,12),LTH=23,                                      +        
               ATTR=(PROT)                                                      
TEMSFEL  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Part No.',                                             +        
               POS=(2,2),LTH=8,                                        +        
               ATTR=(NUM,PROT)                                                  
DGIA0000 DFLD  POS=(2,11),LTH=9,                                       +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'DC',                                                   +        
               POS=(2,21),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
DGIA0002 DFLD  POS=(2,24),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
DGIA0001 DFLD  POS=(3,12),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
DGIA0003 DFLD  POS=(3,25),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Description',                                          +        
               POS=(5,2),LTH=11,                                       +        
               ATTR=(PROT)                                                      
BEART    DFLD  POS=(5,14),LTH=25,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Show more info',                                       +        
               POS=(5,43),LTH=14,                                      +        
               ATTR=(PROT)                                                      
FLMORE   DFLD  POS=(5,58),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'RT  DC  From At  Inv/Seq   Order/Adv Deldate Bindate Ad+        
               v qty  Binned   Scrap C',                               +        
               POS=(6,2),LTH=78,                                       +        
               ATTR=(PROT)                                                      
A1       DFLD  POS=(7,2),LTH=3,                                        +        
               ATTR=(PROT)                                                      
A2       DFLD  POS=(7,6),LTH=2,                                        +        
               ATTR=(PROT)                                                      
A3       DFLD  POS=(7,9),LTH=5,                                        +        
               ATTR=(NUM,PROT)                                                  
A4       DFLD  POS=(7,15),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
A5       DFLD  POS=(7,18),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
A6       DFLD  POS=(7,28),LTH=10,                                      +        
               ATTR=(PROT)                                                      
A7       DFLD  POS=(7,40),LTH=6,                                       +        
               ATTR=(PROT)                                                      
A8       DFLD  POS=(7,48),LTH=6,                                       +        
               ATTR=(PROT)                                                      
A9       DFLD  POS=(7,55),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
A10      DFLD  POS=(7,63),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
A11      DFLD  POS=(7,71),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
A12      DFLD  POS=(7,79),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
B1       DFLD  POS=(8,2),LTH=3,                                        +        
               ATTR=(PROT)                                                      
B2       DFLD  POS=(8,6),LTH=2,                                        +        
               ATTR=(PROT)                                                      
B3       DFLD  POS=(8,9),LTH=5,                                        +        
               ATTR=(NUM,PROT)                                                  
B4       DFLD  POS=(8,15),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
B5       DFLD  POS=(8,18),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
B6       DFLD  POS=(8,28),LTH=10,                                      +        
               ATTR=(PROT)                                                      
B7       DFLD  POS=(8,40),LTH=6,                                       +        
               ATTR=(PROT)                                                      
B8       DFLD  POS=(8,48),LTH=6,                                       +        
               ATTR=(PROT)                                                      
B9       DFLD  POS=(8,55),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
B10      DFLD  POS=(8,63),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
B11      DFLD  POS=(8,71),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
B12      DFLD  POS=(8,79),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
C1       DFLD  POS=(9,2),LTH=3,                                        +        
               ATTR=(PROT)                                                      
C2       DFLD  POS=(9,6),LTH=2,                                        +        
               ATTR=(PROT)                                                      
C3       DFLD  POS=(9,9),LTH=5,                                        +        
               ATTR=(NUM,PROT)                                                  
C4       DFLD  POS=(9,15),LTH=2,                                       +        
               ATTR=(NUM,PROT)                                                  
C5       DFLD  POS=(9,18),LTH=8,                                       +        
               ATTR=(NUM,PROT)                                                  
C6       DFLD  POS=(9,28),LTH=10,                                      +        
               ATTR=(PROT)                                                      
C7       DFLD  POS=(9,40),LTH=6,                                       +        
               ATTR=(PROT)                                                      
C8       DFLD  POS=(9,48),LTH=6,                                       +        
               ATTR=(PROT)                                                      
C9       DFLD  POS=(9,55),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
C10      DFLD  POS=(9,63),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
C11      DFLD  POS=(9,71),LTH=7,                                       +        
               ATTR=(NUM,PROT)                                                  
C12      DFLD  POS=(9,79),LTH=1,                                       +        
               ATTR=(NUM,PROT)                                                  
D1       DFLD  POS=(10,2),LTH=3,                                       +        
               ATTR=(PROT)                                                      
D2       DFLD  POS=(10,6),LTH=2,                                       +        
               ATTR=(PROT)                                                      
D3       DFLD  POS=(10,9),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
D4       DFLD  POS=(10,15),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
D5       DFLD  POS=(10,18),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
D6       DFLD  POS=(10,28),LTH=10,                                     +        
               ATTR=(PROT)                                                      
D7       DFLD  POS=(10,40),LTH=6,                                      +        
               ATTR=(PROT)                                                      
D8       DFLD  POS=(10,48),LTH=6,                                      +        
               ATTR=(PROT)                                                      
D9       DFLD  POS=(10,55),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
D10      DFLD  POS=(10,63),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
D11      DFLD  POS=(10,71),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
D12      DFLD  POS=(10,79),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
E1       DFLD  POS=(11,2),LTH=3,                                       +        
               ATTR=(PROT)                                                      
E2       DFLD  POS=(11,6),LTH=2,                                       +        
               ATTR=(PROT)                                                      
E3       DFLD  POS=(11,9),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
E4       DFLD  POS=(11,15),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
E5       DFLD  POS=(11,18),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
E6       DFLD  POS=(11,28),LTH=10,                                     +        
               ATTR=(PROT)                                                      
E7       DFLD  POS=(11,40),LTH=6,                                      +        
               ATTR=(PROT)                                                      
E8       DFLD  POS=(11,48),LTH=6,                                      +        
               ATTR=(PROT)                                                      
E9       DFLD  POS=(11,55),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
E10      DFLD  POS=(11,63),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
E11      DFLD  POS=(11,71),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
E12      DFLD  POS=(11,79),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
F1       DFLD  POS=(12,2),LTH=3,                                       +        
               ATTR=(PROT)                                                      
F2       DFLD  POS=(12,6),LTH=2,                                       +        
               ATTR=(PROT)                                                      
F3       DFLD  POS=(12,9),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
F4       DFLD  POS=(12,15),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
F5       DFLD  POS=(12,18),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
F6       DFLD  POS=(12,28),LTH=10,                                     +        
               ATTR=(PROT)                                                      
F7       DFLD  POS=(12,40),LTH=6,                                      +        
               ATTR=(PROT)                                                      
F8       DFLD  POS=(12,48),LTH=6,                                      +        
               ATTR=(PROT)                                                      
F9       DFLD  POS=(12,55),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
F10      DFLD  POS=(12,63),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
F11      DFLD  POS=(12,71),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
F12      DFLD  POS=(12,79),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
G1       DFLD  POS=(13,2),LTH=3,                                       +        
               ATTR=(PROT)                                                      
G2       DFLD  POS=(13,6),LTH=2,                                       +        
               ATTR=(PROT)                                                      
G3       DFLD  POS=(13,9),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
G4       DFLD  POS=(13,15),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
G5       DFLD  POS=(13,18),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
G6       DFLD  POS=(13,28),LTH=10,                                     +        
               ATTR=(PROT)                                                      
G7       DFLD  POS=(13,40),LTH=6,                                      +        
               ATTR=(PROT)                                                      
G8       DFLD  POS=(13,48),LTH=6,                                      +        
               ATTR=(PROT)                                                      
G9       DFLD  POS=(13,55),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
G10      DFLD  POS=(13,63),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
G11      DFLD  POS=(13,71),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
G12      DFLD  POS=(13,79),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
H1       DFLD  POS=(14,2),LTH=3,                                       +        
               ATTR=(PROT)                                                      
H2       DFLD  POS=(14,6),LTH=2,                                       +        
               ATTR=(PROT)                                                      
H3       DFLD  POS=(14,9),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
H4       DFLD  POS=(14,15),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
H5       DFLD  POS=(14,18),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
H6       DFLD  POS=(14,28),LTH=10,                                     +        
               ATTR=(PROT)                                                      
H7       DFLD  POS=(14,40),LTH=6,                                      +        
               ATTR=(PROT)                                                      
H8       DFLD  POS=(14,48),LTH=6,                                      +        
               ATTR=(PROT)                                                      
H9       DFLD  POS=(14,55),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
H10      DFLD  POS=(14,63),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
H11      DFLD  POS=(14,71),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
H12      DFLD  POS=(14,79),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
I1       DFLD  POS=(15,2),LTH=3,                                       +        
               ATTR=(PROT)                                                      
I2       DFLD  POS=(15,6),LTH=2,                                       +        
               ATTR=(PROT)                                                      
I3       DFLD  POS=(15,9),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
I4       DFLD  POS=(15,15),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
I5       DFLD  POS=(15,18),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
I6       DFLD  POS=(15,28),LTH=10,                                     +        
               ATTR=(PROT)                                                      
I7       DFLD  POS=(15,40),LTH=6,                                      +        
               ATTR=(PROT)                                                      
I8       DFLD  POS=(15,48),LTH=6,                                      +        
               ATTR=(PROT)                                                      
I9       DFLD  POS=(15,55),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
I10      DFLD  POS=(15,63),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
I11      DFLD  POS=(15,71),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
I12      DFLD  POS=(15,79),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
J1       DFLD  POS=(16,2),LTH=3,                                       +        
               ATTR=(PROT)                                                      
J2       DFLD  POS=(16,6),LTH=2,                                       +        
               ATTR=(PROT)                                                      
J3       DFLD  POS=(16,9),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
J4       DFLD  POS=(16,15),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
J5       DFLD  POS=(16,18),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
J6       DFLD  POS=(16,28),LTH=10,                                     +        
               ATTR=(PROT)                                                      
J7       DFLD  POS=(16,40),LTH=6,                                      +        
               ATTR=(PROT)                                                      
J8       DFLD  POS=(16,48),LTH=6,                                      +        
               ATTR=(PROT)                                                      
J9       DFLD  POS=(16,55),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
J10      DFLD  POS=(16,63),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
J11      DFLD  POS=(16,71),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
J12      DFLD  POS=(16,79),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
K1       DFLD  POS=(17,2),LTH=3,                                       +        
               ATTR=(PROT)                                                      
K2       DFLD  POS=(17,6),LTH=2,                                       +        
               ATTR=(PROT)                                                      
K3       DFLD  POS=(17,9),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
K4       DFLD  POS=(17,15),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
K5       DFLD  POS=(17,18),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
K6       DFLD  POS=(17,28),LTH=10,                                     +        
               ATTR=(PROT)                                                      
K7       DFLD  POS=(17,40),LTH=6,                                      +        
               ATTR=(PROT)                                                      
K8       DFLD  POS=(17,48),LTH=6,                                      +        
               ATTR=(PROT)                                                      
K9       DFLD  POS=(17,55),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
K10      DFLD  POS=(17,63),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
K11      DFLD  POS=(17,71),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
K12      DFLD  POS=(17,79),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
L1       DFLD  POS=(18,2),LTH=3,                                       +        
               ATTR=(PROT)                                                      
L2       DFLD  POS=(18,6),LTH=2,                                       +        
               ATTR=(PROT)                                                      
L3       DFLD  POS=(18,9),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
L4       DFLD  POS=(18,15),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
L5       DFLD  POS=(18,18),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
L6       DFLD  POS=(18,28),LTH=10,                                     +        
               ATTR=(PROT)                                                      
L7       DFLD  POS=(18,40),LTH=6,                                      +        
               ATTR=(PROT)                                                      
L8       DFLD  POS=(18,48),LTH=6,                                      +        
               ATTR=(PROT)                                                      
L9       DFLD  POS=(18,55),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
L10      DFLD  POS=(18,63),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
L11      DFLD  POS=(18,71),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
L12      DFLD  POS=(18,79),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
M1       DFLD  POS=(19,2),LTH=3,                                       +        
               ATTR=(PROT)                                                      
M2       DFLD  POS=(19,6),LTH=2,                                       +        
               ATTR=(PROT)                                                      
M3       DFLD  POS=(19,9),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
M4       DFLD  POS=(19,15),LTH=2,                                      +        
               ATTR=(NUM,PROT)                                                  
M5       DFLD  POS=(19,18),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
M6       DFLD  POS=(19,28),LTH=10,                                     +        
               ATTR=(PROT)                                                      
M7       DFLD  POS=(19,40),LTH=6,                                      +        
               ATTR=(PROT)                                                      
M8       DFLD  POS=(19,48),LTH=6,                                      +        
               ATTR=(PROT)                                                      
M9       DFLD  POS=(19,55),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
M10      DFLD  POS=(19,63),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
M11      DFLD  POS=(19,71),LTH=7,                                      +        
               ATTR=(NUM,PROT)                                                  
M12      DFLD  POS=(19,79),LTH=1,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  '13 Goods Rcv.   14 Unloading',                         +        
               POS=(21,2),LTH=28,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '15 Binning',                                           +        
               POS=(21,37),LTH=10,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '16 Stock reg.  17 Buffe',                              +        
               POS=(21,53),LTH=23,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '18 Location Inq.19 Goods Rcv Hist. 20 Deliv.Block. 21',+        
               POS=(22,2),LTH=53,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,68),LTH=8,                                      +        
               ATTR=(PROT)                                                      
TEMSINF  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W6O307N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W6N307,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W6I307N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  IDTRANS1,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS3,                                               +        
               LTH=1                                                            
         MFLD  IDTRANS4,                                               +        
               LTH=1                                                            
         MFLD  TEMSFEL,                                                +        
               LTH=40                                                           
         MFLD  DGIA0000,                                               +        
               LTH=9                                                            
         MFLD  DGIA0001,                                               +        
               LTH=9                                                            
         MFLD  DGIA0002,                                               +        
               LTH=2                                                            
         MFLD  DGIA0003,                                               +        
               LTH=2                                                            
         MFLD  BEART,                                                  +        
               LTH=25                                                           
         MFLD  FLMORE,                                                 +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  A1,                                                     +        
               LTH=3                                                            
         MFLD  A2,                                                     +        
               LTH=2                                                            
         MFLD  A3,                                                     +        
               LTH=5                                                            
         MFLD  A4,                                                     +        
               LTH=2                                                            
         MFLD  A5,                                                     +        
               LTH=8                                                            
         MFLD  A6,                                                     +        
               LTH=10                                                           
         MFLD  A7,                                                     +        
               LTH=6                                                            
         MFLD  A8,                                                     +        
               LTH=6                                                            
         MFLD  A9,                                                     +        
               LTH=7                                                            
         MFLD  A10,                                                    +        
               LTH=7                                                            
         MFLD  A11,                                                    +        
               LTH=7                                                            
         MFLD  A12,                                                    +        
               LTH=1                                                            
         MFLD  B1,                                                     +        
               LTH=3                                                            
         MFLD  B2,                                                     +        
               LTH=2                                                            
         MFLD  B3,                                                     +        
               LTH=5                                                            
         MFLD  B4,                                                     +        
               LTH=2                                                            
         MFLD  B5,                                                     +        
               LTH=8                                                            
         MFLD  B6,                                                     +        
               LTH=10                                                           
         MFLD  B7,                                                     +        
               LTH=6                                                            
         MFLD  B8,                                                     +        
               LTH=6                                                            
         MFLD  B9,                                                     +        
               LTH=7                                                            
         MFLD  B10,                                                    +        
               LTH=7                                                            
         MFLD  B11,                                                    +        
               LTH=7                                                            
         MFLD  B12,                                                    +        
               LTH=1                                                            
         MFLD  C1,                                                     +        
               LTH=3                                                            
         MFLD  C2,                                                     +        
               LTH=2                                                            
         MFLD  C3,                                                     +        
               LTH=5                                                            
         MFLD  C4,                                                     +        
               LTH=2                                                            
         MFLD  C5,                                                     +        
               LTH=8                                                            
         MFLD  C6,                                                     +        
               LTH=10                                                           
         MFLD  C7,                                                     +        
               LTH=6                                                            
         MFLD  C8,                                                     +        
               LTH=6                                                            
         MFLD  C9,                                                     +        
               LTH=7                                                            
         MFLD  C10,                                                    +        
               LTH=7                                                            
         MFLD  C11,                                                    +        
               LTH=7                                                            
         MFLD  C12,                                                    +        
               LTH=1                                                            
         MFLD  D1,                                                     +        
               LTH=3                                                            
         MFLD  D2,                                                     +        
               LTH=2                                                            
         MFLD  D3,                                                     +        
               LTH=5                                                            
         MFLD  D4,                                                     +        
               LTH=2                                                            
         MFLD  D5,                                                     +        
               LTH=8                                                            
         MFLD  D6,                                                     +        
               LTH=10                                                           
         MFLD  D7,                                                     +        
               LTH=6                                                            
         MFLD  D8,                                                     +        
               LTH=6                                                            
         MFLD  D9,                                                     +        
               LTH=7                                                            
         MFLD  D10,                                                    +        
               LTH=7                                                            
         MFLD  D11,                                                    +        
               LTH=7                                                            
         MFLD  D12,                                                    +        
               LTH=1                                                            
         MFLD  E1,                                                     +        
               LTH=3                                                            
         MFLD  E2,                                                     +        
               LTH=2                                                            
         MFLD  E3,                                                     +        
               LTH=5                                                            
         MFLD  E4,                                                     +        
               LTH=2                                                            
         MFLD  E5,                                                     +        
               LTH=8                                                            
         MFLD  E6,                                                     +        
               LTH=10                                                           
         MFLD  E7,                                                     +        
               LTH=6                                                            
         MFLD  E8,                                                     +        
               LTH=6                                                            
         MFLD  E9,                                                     +        
               LTH=7                                                            
         MFLD  E10,                                                    +        
               LTH=7                                                            
         MFLD  E11,                                                    +        
               LTH=7                                                            
         MFLD  E12,                                                    +        
               LTH=1                                                            
         MFLD  F1,                                                     +        
               LTH=3                                                            
         MFLD  F2,                                                     +        
               LTH=2                                                            
         MFLD  F3,                                                     +        
               LTH=5                                                            
         MFLD  F4,                                                     +        
               LTH=2                                                            
         MFLD  F5,                                                     +        
               LTH=8                                                            
         MFLD  F6,                                                     +        
               LTH=10                                                           
         MFLD  F7,                                                     +        
               LTH=6                                                            
         MFLD  F8,                                                     +        
               LTH=6                                                            
         MFLD  F9,                                                     +        
               LTH=7                                                            
         MFLD  F10,                                                    +        
               LTH=7                                                            
         MFLD  F11,                                                    +        
               LTH=7                                                            
         MFLD  F12,                                                    +        
               LTH=1                                                            
         MFLD  G1,                                                     +        
               LTH=3                                                            
         MFLD  G2,                                                     +        
               LTH=2                                                            
         MFLD  G3,                                                     +        
               LTH=5                                                            
         MFLD  G4,                                                     +        
               LTH=2                                                            
         MFLD  G5,                                                     +        
               LTH=8                                                            
         MFLD  G6,                                                     +        
               LTH=10                                                           
         MFLD  G7,                                                     +        
               LTH=6                                                            
         MFLD  G8,                                                     +        
               LTH=6                                                            
         MFLD  G9,                                                     +        
               LTH=7                                                            
         MFLD  G10,                                                    +        
               LTH=7                                                            
         MFLD  G11,                                                    +        
               LTH=7                                                            
         MFLD  G12,                                                    +        
               LTH=1                                                            
         MFLD  H1,                                                     +        
               LTH=3                                                            
         MFLD  H2,                                                     +        
               LTH=2                                                            
         MFLD  H3,                                                     +        
               LTH=5                                                            
         MFLD  H4,                                                     +        
               LTH=2                                                            
         MFLD  H5,                                                     +        
               LTH=8                                                            
         MFLD  H6,                                                     +        
               LTH=10                                                           
         MFLD  H7,                                                     +        
               LTH=6                                                            
         MFLD  H8,                                                     +        
               LTH=6                                                            
         MFLD  H9,                                                     +        
               LTH=7                                                            
         MFLD  H10,                                                    +        
               LTH=7                                                            
         MFLD  H11,                                                    +        
               LTH=7                                                            
         MFLD  H12,                                                    +        
               LTH=1                                                            
         MFLD  I1,                                                     +        
               LTH=3                                                            
         MFLD  I2,                                                     +        
               LTH=2                                                            
         MFLD  I3,                                                     +        
               LTH=5                                                            
         MFLD  I4,                                                     +        
               LTH=2                                                            
         MFLD  I5,                                                     +        
               LTH=8                                                            
         MFLD  I6,                                                     +        
               LTH=10                                                           
         MFLD  I7,                                                     +        
               LTH=6                                                            
         MFLD  I8,                                                     +        
               LTH=6                                                            
         MFLD  I9,                                                     +        
               LTH=7                                                            
         MFLD  I10,                                                    +        
               LTH=7                                                            
         MFLD  I11,                                                    +        
               LTH=7                                                            
         MFLD  I12,                                                    +        
               LTH=1                                                            
         MFLD  J1,                                                     +        
               LTH=3                                                            
         MFLD  J2,                                                     +        
               LTH=2                                                            
         MFLD  J3,                                                     +        
               LTH=5                                                            
         MFLD  J4,                                                     +        
               LTH=2                                                            
         MFLD  J5,                                                     +        
               LTH=8                                                            
         MFLD  J6,                                                     +        
               LTH=10                                                           
         MFLD  J7,                                                     +        
               LTH=6                                                            
         MFLD  J8,                                                     +        
               LTH=6                                                            
         MFLD  J9,                                                     +        
               LTH=7                                                            
         MFLD  J10,                                                    +        
               LTH=7                                                            
         MFLD  J11,                                                    +        
               LTH=7                                                            
         MFLD  J12,                                                    +        
               LTH=1                                                            
         MFLD  K1,                                                     +        
               LTH=3                                                            
         MFLD  K2,                                                     +        
               LTH=2                                                            
         MFLD  K3,                                                     +        
               LTH=5                                                            
         MFLD  K4,                                                     +        
               LTH=2                                                            
         MFLD  K5,                                                     +        
               LTH=8                                                            
         MFLD  K6,                                                     +        
               LTH=10                                                           
         MFLD  K7,                                                     +        
               LTH=6                                                            
         MFLD  K8,                                                     +        
               LTH=6                                                            
         MFLD  K9,                                                     +        
               LTH=7                                                            
         MFLD  K10,                                                    +        
               LTH=7                                                            
         MFLD  K11,                                                    +        
               LTH=7                                                            
         MFLD  K12,                                                    +        
               LTH=1                                                            
         MFLD  L1,                                                     +        
               LTH=3                                                            
         MFLD  L2,                                                     +        
               LTH=2                                                            
         MFLD  L3,                                                     +        
               LTH=5                                                            
         MFLD  L4,                                                     +        
               LTH=2                                                            
         MFLD  L5,                                                     +        
               LTH=8                                                            
         MFLD  L6,                                                     +        
               LTH=10                                                           
         MFLD  L7,                                                     +        
               LTH=6                                                            
         MFLD  L8,                                                     +        
               LTH=6                                                            
         MFLD  L9,                                                     +        
               LTH=7                                                            
         MFLD  L10,                                                    +        
               LTH=7                                                            
         MFLD  L11,                                                    +        
               LTH=7                                                            
         MFLD  L12,                                                    +        
               LTH=1                                                            
         MFLD  M1,                                                     +        
               LTH=3                                                            
         MFLD  M2,                                                     +        
               LTH=2                                                            
         MFLD  M3,                                                     +        
               LTH=5                                                            
         MFLD  M4,                                                     +        
               LTH=2                                                            
         MFLD  M5,                                                     +        
               LTH=8                                                            
         MFLD  M6,                                                     +        
               LTH=10                                                           
         MFLD  M7,                                                     +        
               LTH=6                                                            
         MFLD  M8,                                                     +        
               LTH=6                                                            
         MFLD  M9,                                                     +        
               LTH=7                                                            
         MFLD  M10,                                                    +        
               LTH=7                                                            
         MFLD  M11,                                                    +        
               LTH=7                                                            
         MFLD  M12,                                                    +        
               LTH=1                                                            
         MFLD  TEMSINF,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W6I307N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W6N307),                                           +        
               OPT=2,                                                  +        
               NXT=W6O307N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS1,                                               +        
               LTH=1,                                                  +        
               FILL=X'F6'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  IDTRANS2,                                               +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  IDTRANS3,                                               +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  IDTRANS4,                                               +        
               LTH=1,                                                  +        
               FILL=X'F7'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '63072',                                                +        
               LTH=5                                                            
         MFLD  (DGIA0000,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0001,                                              +        
               '         '),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0002,                                              +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DGIA0003,                                              +        
               '  '),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (FLMORE,                                                +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
