***********************************************************************         
* CREATED BY PC30186   ON 93/08/31  AT 10:32                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W9F102   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W9T102  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W9T101  ',                                          +        
               14='W9T102  ',                                          +        
               15='W9T103  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W9T102  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'ERSÄTTES AV',                                          +        
               POS=(1,14),LTH=11,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'ARTIKELNR',                                            +        
               POS=(2,2),LTH=9,                                        +        
               ATTR=(NUM,PROT)                                                  
FLD0212  DFLD  POS=(2,12),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD0312  DFLD  POS=(3,12),LTH=11,                                      +        
               ATTR=(PROT,MOD)                                                  
FLD0402  DFLD  POS=(4,2),LTH=3,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'ERSÄTTNINGSKOD C1',                                    +        
               POS=(5,2),LTH=17,                                       +        
               ATTR=(PROT)                                                      
FLD0534  DFLD  POS=(5,34),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'ERSÄTTNINGSDATUM',                                     +        
               POS=(6,2),LTH=16,                                       +        
               ATTR=(PROT)                                                      
FLD0631  DFLD  POS=(6,31),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'ANTAL FÖR ERSATT ARTIKEL',                             +        
               POS=(7,2),LTH=24,                                       +        
               ATTR=(PROT)                                                      
FLD0729  DFLD  POS=(7,29),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'TILLKOMMANDE',                                         +        
               POS=(9,2),LTH=12,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'ARTIKELNR',                                            +        
               POS=(10,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'ANTAL',                                                +        
               POS=(10,17),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'ARTIKELNR',                                            +        
               POS=(10,30),LTH=9,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'ANTAL',                                                +        
               POS=(10,45),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'ARTIKELNR',                                            +        
               POS=(10,58),LTH=9,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'ANTAL',                                                +        
               POS=(10,73),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLD1102  DFLD  POS=(11,2),LTH=20,                                      +        
               ATTR=(PROT)                                                      
FLD1130  DFLD  POS=(11,30),LTH=20,                                     +        
               ATTR=(PROT)                                                      
FLD1158  DFLD  POS=(11,58),LTH=20,                                     +        
               ATTR=(PROT)                                                      
FLD1202  DFLD  POS=(12,2),LTH=20,                                      +        
               ATTR=(PROT)                                                      
FLD1230  DFLD  POS=(12,30),LTH=20,                                     +        
               ATTR=(PROT)                                                      
FLD1258  DFLD  POS=(12,58),LTH=20,                                     +        
               ATTR=(PROT)                                                      
FLD1302  DFLD  POS=(13,2),LTH=20,                                      +        
               ATTR=(PROT)                                                      
FLD1330  DFLD  POS=(13,30),LTH=20,                                     +        
               ATTR=(PROT)                                                      
FLD1358  DFLD  POS=(13,58),LTH=20,                                     +        
               ATTR=(PROT)                                                      
FLD1402  DFLD  POS=(14,2),LTH=20,                                      +        
               ATTR=(PROT)                                                      
FLD1430  DFLD  POS=(14,30),LTH=20,                                     +        
               ATTR=(PROT)                                                      
FLD1458  DFLD  POS=(14,58),LTH=20,                                     +        
               ATTR=(PROT)                                                      
FLD1502  DFLD  POS=(15,2),LTH=20,                                      +        
               ATTR=(PROT)                                                      
FLD1530  DFLD  POS=(15,30),LTH=20,                                     +        
               ATTR=(PROT)                                                      
FLD1558  DFLD  POS=(15,58),LTH=20,                                     +        
               ATTR=(PROT)                                                      
FLD1602  DFLD  POS=(16,2),LTH=20,                                      +        
               ATTR=(PROT)                                                      
FLD1630  DFLD  POS=(16,30),LTH=20,                                     +        
               ATTR=(PROT)                                                      
FLD1658  DFLD  POS=(16,58),LTH=20,                                     +        
               ATTR=(PROT)                                                      
FLD1702  DFLD  POS=(17,2),LTH=20,                                      +        
               ATTR=(PROT)                                                      
FLD1730  DFLD  POS=(17,30),LTH=20,                                     +        
               ATTR=(PROT)                                                      
FLD1758  DFLD  POS=(17,58),LTH=20,                                     +        
               ATTR=(PROT)                                                      
FLD1802  DFLD  POS=(18,2),LTH=20,                                      +        
               ATTR=(PROT)                                                      
FLD1830  DFLD  POS=(18,30),LTH=20,                                     +        
               ATTR=(PROT)                                                      
FLD1858  DFLD  POS=(18,58),LTH=20,                                     +        
               ATTR=(PROT)                                                      
FLD1902  DFLD  POS=(19,2),LTH=20,                                      +        
               ATTR=(PROT)                                                      
FLD1930  DFLD  POS=(19,30),LTH=20,                                     +        
               ATTR=(PROT)                                                      
FLD1958  DFLD  POS=(19,58),LTH=20,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '13 PRISBILD',                                          +        
               POS=(21,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '14 ERSÄTTES AV  15 ERSÄTTER    16',                    +        
               POS=(21,18),LTH=33,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '17',                                                   +        
               POS=(21,66),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '20',                                                   +        
               POS=(22,34),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '21',                                                   +        
               POS=(22,50),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W9O10201 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W9F102,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W9I10201,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0212,                                                +        
               LTH=9                                                            
         MFLD  FLD0312,                                                +        
               LTH=11                                                           
         MFLD  FLD0402,                                                +        
               LTH=3                                                            
         MFLD  FLD0534,                                                +        
               LTH=3                                                            
         MFLD  FLD0631,                                                +        
               LTH=6                                                            
         MFLD  FLD0729,                                                +        
               LTH=8                                                            
         MFLD  FLD1102,                                                +        
               LTH=20                                                           
         MFLD  FLD1202,                                                +        
               LTH=20                                                           
         MFLD  FLD1302,                                                +        
               LTH=20                                                           
         MFLD  FLD1402,                                                +        
               LTH=20                                                           
         MFLD  FLD1502,                                                +        
               LTH=20                                                           
         MFLD  FLD1602,                                                +        
               LTH=20                                                           
         MFLD  FLD1702,                                                +        
               LTH=20                                                           
         MFLD  FLD1802,                                                +        
               LTH=20                                                           
         MFLD  FLD1902,                                                +        
               LTH=20                                                           
         MFLD  FLD1130,                                                +        
               LTH=20                                                           
         MFLD  FLD1230,                                                +        
               LTH=20                                                           
         MFLD  FLD1330,                                                +        
               LTH=20                                                           
         MFLD  FLD1430,                                                +        
               LTH=20                                                           
         MFLD  FLD1530,                                                +        
               LTH=20                                                           
         MFLD  FLD1630,                                                +        
               LTH=20                                                           
         MFLD  FLD1730,                                                +        
               LTH=20                                                           
         MFLD  FLD1830,                                                +        
               LTH=20                                                           
         MFLD  FLD1930,                                                +        
               LTH=20                                                           
         MFLD  FLD1158,                                                +        
               LTH=20                                                           
         MFLD  FLD1258,                                                +        
               LTH=20                                                           
         MFLD  FLD1358,                                                +        
               LTH=20                                                           
         MFLD  FLD1458,                                                +        
               LTH=20                                                           
         MFLD  FLD1558,                                                +        
               LTH=20                                                           
         MFLD  FLD1658,                                                +        
               LTH=20                                                           
         MFLD  FLD1758,                                                +        
               LTH=20                                                           
         MFLD  FLD1858,                                                +        
               LTH=20                                                           
         MFLD  FLD1958,                                                +        
               LTH=20                                                           
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W9I10201 MSG   TYPE=INPUT,                                             +        
               SOR=(W9F102),                                           +        
               OPT=2,                                                  +        
               NXT=W9O10201                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F9'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '91021',                                                +        
               LTH=5                                                            
         MFLD  (FLD0212,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0312,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0402,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
