***********************************************************************         
* CREATED BY V040073   ON 00/01/11  AT 09:20                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W9F112   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W9T111  ',                                           +        
               2='W0T501  ',                                           +        
               3='W9T113  ',                                           +        
               4='W9T114  ',                                           +        
               5='W9T115  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T502  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W9F112   DPAGE CURSOR=((2,13)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'ARTIKEL INFORMATION',                                  +        
               POS=(1,13),LTH=19,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Artikelnr',                                            +        
               POS=(2,2),LTH=9,                                        +        
               ATTR=(NUM,PROT)                                                  
IDARTNRI DFLD  POS=(2,13),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Distrikt',                                             +        
               POS=(2,27),LTH=8,                                       +        
               ATTR=(PROT)                                                      
IDDISTRI DFLD  POS=(2,36),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
IDARTNRU DFLD  POS=(3,13),LTH=11,                                      +        
               ATTR=(PROT,MOD)                                                  
IDDISTRU DFLD  POS=(3,36),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0402  DFLD  POS=(4,2),LTH=3,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Baspris',                                              +        
               POS=(5,2),LTH=7,                                        +        
               ATTR=(PROT)                                                      
FLD0522  DFLD  POS=(5,16),LTH=10,                                      +        
               ATTR=(PROT)                                                      
KDVALISO DFLD  POS=(5,27),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Engelska',                                             +        
               POS=(5,31),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD0541  DFLD  POS=(5,41),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Rabattkod',                                            +        
               POS=(6,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
FLD0617  DFLD  POS=(6,24),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Franska',                                              +        
               POS=(6,31),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD0641  DFLD  POS=(6,41),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Kampanjkod',                                           +        
               POS=(7,2),LTH=10,                                       +        
               ATTR=(PROT)                                                      
FLD0725  DFLD  POS=(7,21),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Spanska',                                              +        
               POS=(7,31),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD0741  DFLD  POS=(7,41),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Produktslag',                                          +        
               POS=(8,2),LTH=11,                                       +        
               ATTR=(PROT)                                                      
FLD0823  DFLD  POS=(8,24),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Tyska',                                                +        
               POS=(8,31),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLD0841  DFLD  POS=(8,41),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Bytes-',                                               +        
               POS=(8,68),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Funktionsgrupp',                                       +        
               POS=(9,2),LTH=14,                                       +        
               ATTR=(PROT)                                                      
FLD0925  DFLD  POS=(9,22),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Svenska',                                              +        
               POS=(9,31),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD0941  DFLD  POS=(9,41),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'poäng',                                                +        
               POS=(9,68),LTH=5,                                       +        
               ATTR=(PROT)                                                      
KVPOINT  DFLD  POS=(9,74),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Enhet',                                                +        
               POS=(10,2),LTH=5,                                       +        
               ATTR=(NUM,PROT)                                                  
FLD1025  DFLD  POS=(10,24),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Publ. vecka',                                          +        
               POS=(10,31),LTH=11,                                     +        
               ATTR=(PROT)                                                      
FLD1051  DFLD  POS=(10,51),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'BPSR',                                                 +        
               POS=(10,60),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD1065  DFLD  POS=(10,65),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'SRA',                                                  +        
               POS=(10,68),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD1073  DFLD  POS=(10,74),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Ursprung',                                             +        
               POS=(11,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD1124  DFLD  POS=(11,24),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Undantags art',                                        +        
               POS=(11,31),LTH=13,                                     +        
               ATTR=(PROT)                                                      
FLD1155  DFLD  POS=(11,55),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Ingår i sats',                                         +        
               POS=(11,60),LTH=12,                                     +        
               ATTR=(PROT)                                                      
FLD1175  DFLD  POS=(11,74),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Beredarenummer',                                       +        
               POS=(12,2),LTH=14,                                      +        
               ATTR=(PROT)                                                      
FLD1224  DFLD  POS=(12,23),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Lev. som reservdel',                                   +        
               POS=(12,31),LTH=18,                                     +        
               ATTR=(PROT)                                                      
FLD1255  DFLD  POS=(12,55),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Statist.nr',                                           +        
               POS=(12,60),LTH=10,                                     +        
               ATTR=(PROT)                                                      
STATIST  DFLD  POS=(12,72),LTH=9,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Farligt gods',                                         +        
               POS=(13,2),LTH=12,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1325  DFLD  POS=(13,24),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Reg. för vagn:',                                       +        
               POS=(13,31),LTH=14,                                     +        
               ATTR=(PROT)                                                      
FLD1349  DFLD  POS=(13,49),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLD1355  DFLD  POS=(13,55),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1361  DFLD  POS=(13,61),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Åld.kod',                                              +        
               POS=(13,68),LTH=7,                                      +        
               ATTR=(PROT)                                                      
FLD1377  DFLD  POS=(13,77),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Vikt',                                                 +        
               POS=(14,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
FLD1420  DFLD  POS=(14,19),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Artikel i vagn:',                                      +        
               POS=(14,31),LTH=15,                                     +        
               ATTR=(PROT)                                                      
FLD1449  DFLD  POS=(14,49),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLD1455  DFLD  POS=(14,55),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1461  DFLD  POS=(14,61),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1467  DFLD  POS=(14,67),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1473  DFLD  POS=(14,73),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Volym (CM3)',                                          +        
               POS=(15,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
FLD1517  DFLD  POS=(15,16),LTH=10,                                     +        
               ATTR=(PROT)                                                      
FLD1531  DFLD  POS=(15,31),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLD1537  DFLD  POS=(15,37),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1543  DFLD  POS=(15,43),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1549  DFLD  POS=(15,49),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1555  DFLD  POS=(15,55),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1561  DFLD  POS=(15,61),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1567  DFLD  POS=(15,67),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1573  DFLD  POS=(15,73),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Kvantitet Q0',                                         +        
               POS=(16,2),LTH=12,                                      +        
               ATTR=(PROT)                                                      
FLD1625  DFLD  POS=(16,21),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLD1631  DFLD  POS=(16,31),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLD1637  DFLD  POS=(16,37),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1643  DFLD  POS=(16,43),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1649  DFLD  POS=(16,49),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1655  DFLD  POS=(16,55),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1661  DFLD  POS=(16,61),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1667  DFLD  POS=(16,67),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1673  DFLD  POS=(16,73),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Ersättningskod',                                       +        
               POS=(17,2),LTH=14,                                      +        
               ATTR=(PROT)                                                      
FLD1724  DFLD  POS=(17,23),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FLD1731  DFLD  POS=(17,31),LTH=5,                                      +        
               ATTR=(PROT)                                                      
FLD1737  DFLD  POS=(17,37),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1743  DFLD  POS=(17,43),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1749  DFLD  POS=(17,49),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1755  DFLD  POS=(17,55),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1761  DFLD  POS=(17,61),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1767  DFLD  POS=(17,67),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD1774  DFLD  POS=(17,74),LTH=4,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Ersättningsdatum',                                     +        
               POS=(18,2),LTH=16,                                      +        
               ATTR=(PROT)                                                      
FLD1821  DFLD  POS=(18,21),LTH=5,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Speciell information från Volvo Car Parts:',           +        
               POS=(18,31),LTH=42,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Tillkommande',                                         +        
               POS=(19,2),LTH=12,                                      +        
               ATTR=(PROT)                                                      
FLD1916  DFLD  POS=(19,15),LTH=11,                                     +        
               ATTR=(PROT)                                                      
FLD1931  DFLD  POS=(19,31),LTH=40,                                     +        
               ATTR=(PROT)                                                      
FLD2031  DFLD  POS=(20,31),LTH=40,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '1 PART INFO-RS ',                                      +        
               POS=(21,2),LTH=15,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '3 DELIVERY INFO ',                                     +        
               POS=(21,18),LTH=16,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '4 DELIVERY INFO CDC ',                                 +        
               POS=(21,35),LTH=20,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '5 DELIVERY INFO DC',                                   +        
               POS=(21,56),LTH=18,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(22,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCP',                                                  +        
               POS=(23,59),LTH=3,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W9O11201 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W9F112,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W9I11201,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W9F112                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  IDARTNRI,                                               +        
               LTH=9                                                            
         MFLD  IDARTNRU,                                               +        
               LTH=11                                                           
         MFLD  IDDISTRI,                                               +        
               LTH=4                                                            
         MFLD  IDDISTRU,                                               +        
               LTH=4                                                            
         MFLD  FLD0402,                                                +        
               LTH=3                                                            
         MFLD  FLD0522,                                                +        
               LTH=10                                                           
         MFLD  KDVALISO,                                               +        
               LTH=3                                                            
         MFLD  FLD0541,                                                +        
               LTH=25                                                           
         MFLD  FLD0617,                                                +        
               LTH=2                                                            
         MFLD  FLD0641,                                                +        
               LTH=25                                                           
         MFLD  FLD0725,                                                +        
               LTH=5                                                            
         MFLD  FLD0741,                                                +        
               LTH=25                                                           
         MFLD  FLD0823,                                                +        
               LTH=2                                                            
         MFLD  FLD0841,                                                +        
               LTH=25                                                           
         MFLD  FLD0925,                                                +        
               LTH=4                                                            
         MFLD  FLD0941,                                                +        
               LTH=25                                                           
         MFLD  KVPOINT,                                                +        
               LTH=7                                                            
         MFLD  FLD1025,                                                +        
               LTH=2                                                            
         MFLD  FLD1051,                                                +        
               LTH=5                                                            
         MFLD  FLD1065,                                                +        
               LTH=1                                                            
         MFLD  FLD1073,                                                +        
               LTH=3                                                            
         MFLD  FLD1124,                                                +        
               LTH=2                                                            
         MFLD  FLD1155,                                                +        
               LTH=1                                                            
         MFLD  FLD1175,                                                +        
               LTH=1                                                            
         MFLD  FLD1224,                                                +        
               LTH=3                                                            
         MFLD  FLD1255,                                                +        
               LTH=1                                                            
         MFLD  STATIST,                                                +        
               LTH=9                                                            
         MFLD  FLD1325,                                                +        
               LTH=2                                                            
         MFLD  FLD1349,                                                +        
               LTH=5                                                            
         MFLD  FLD1355,                                                +        
               LTH=5                                                            
         MFLD  FLD1361,                                                +        
               LTH=5                                                            
         MFLD  FLD1377,                                                +        
               LTH=1                                                            
         MFLD  FLD1420,                                                +        
               LTH=7                                                            
         MFLD  FLD1517,                                                +        
               LTH=10                                                           
         MFLD  FLD1625,                                                +        
               LTH=5                                                            
         MFLD  FLD1724,                                                +        
               LTH=3                                                            
         MFLD  FLD1449,                                                +        
               LTH=5                                                            
         MFLD  FLD1455,                                                +        
               LTH=5                                                            
         MFLD  FLD1461,                                                +        
               LTH=5                                                            
         MFLD  FLD1467,                                                +        
               LTH=5                                                            
         MFLD  FLD1473,                                                +        
               LTH=5                                                            
         MFLD  FLD1531,                                                +        
               LTH=5                                                            
         MFLD  FLD1537,                                                +        
               LTH=5                                                            
         MFLD  FLD1543,                                                +        
               LTH=5                                                            
         MFLD  FLD1549,                                                +        
               LTH=5                                                            
         MFLD  FLD1555,                                                +        
               LTH=5                                                            
         MFLD  FLD1561,                                                +        
               LTH=5                                                            
         MFLD  FLD1567,                                                +        
               LTH=5                                                            
         MFLD  FLD1573,                                                +        
               LTH=5                                                            
         MFLD  FLD1631,                                                +        
               LTH=5                                                            
         MFLD  FLD1637,                                                +        
               LTH=5                                                            
         MFLD  FLD1643,                                                +        
               LTH=5                                                            
         MFLD  FLD1649,                                                +        
               LTH=5                                                            
         MFLD  FLD1655,                                                +        
               LTH=5                                                            
         MFLD  FLD1661,                                                +        
               LTH=5                                                            
         MFLD  FLD1667,                                                +        
               LTH=5                                                            
         MFLD  FLD1673,                                                +        
               LTH=5                                                            
         MFLD  FLD1731,                                                +        
               LTH=5                                                            
         MFLD  FLD1737,                                                +        
               LTH=5                                                            
         MFLD  FLD1743,                                                +        
               LTH=5                                                            
         MFLD  FLD1749,                                                +        
               LTH=5                                                            
         MFLD  FLD1755,                                                +        
               LTH=5                                                            
         MFLD  FLD1761,                                                +        
               LTH=5                                                            
         MFLD  FLD1767,                                                +        
               LTH=5                                                            
         MFLD  FLD1774,                                                +        
               LTH=4                                                            
         MFLD  FLD1821,                                                +        
               LTH=5                                                            
         MFLD  FLD1916,                                                +        
               LTH=11                                                           
         MFLD  FLD1931,                                                +        
               LTH=40                                                           
         MFLD  FLD2031,                                                +        
               LTH=40                                                           
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W9I11201 MSG   TYPE=INPUT,                                             +        
               SOR=(W9F112),                                           +        
               OPT=2,                                                  +        
               NXT=W9O11201                                                     
MID      LPAGE SOR=(W9F112)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F9'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '91121',                                                +        
               LTH=5                                                            
         MFLD  (IDARTNRI,                                              +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDARTNRU,                                               +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (IDDISTRI,                                              +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  IDDISTRU,                                               +        
               LTH=4,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0402,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
