*          DATA SET W9F111FII0 AT LEVEL 003 AS OF 84/03/12                      
         PRINT NOGEN                                                            
W9F111   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W9T112  ',                                           +        
               3='W9T113  ',                                           +        
               4='W9T114  ',                                           +        
               5='W9T115  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W9T111U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W9T111U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
         DPAGE CURSOR=((02,12)),                                       *        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(01,02),LTH=0001,ATTR=(ALPHA,NOPROT,MOD)                     
FLD0104  DFLD  POS=(01,04),LTH=0001,ATTR=(NUM)                                  
FLD0106  DFLD  POS=(01,06),LTH=0001,ATTR=(NUM)                                  
FLD0108  DFLD  POS=(01,08),LTH=0001,ATTR=(NUM)                                  
         DFLD  'ARTIKELINFO-RS',                                       *        
               POS=(01,10),LTH=0014,ATTR=(NUM,PROT)                             
FLD0141  DFLD  POS=(01,41),LTH=0040,ATTR=(NUM,PROT,HI)                          
         DFLD  'ARTIKELNR',                                            *        
               POS=(02,02),LTH=0009,ATTR=(NUM,PROT)                             
FLD0212  DFLD  POS=(02,12),LTH=0009,ATTR=(NUM)                                  
FLD0312  DFLD  POS=(03,12),LTH=0009,ATTR=(NUM,PROT,MOD)                         
         DFLD  'SV BENÄMN',                                            *        
               POS=(05,02),LTH=0009,ATTR=(NUM,PROT)                             
FLD0513  DFLD  POS=(05,13),LTH=0025,ATTR=(NUM,PROT)                             
         DFLD  'ENG BENÄMN',                                           *        
               POS=(05,40),LTH=0010,ATTR=(NUM,PROT)                             
FLD0552  DFLD  POS=(05,52),LTH=0025,ATTR=(NUM,PROT)                             
         DFLD  'ANSK',                                                 *        
               POS=(07,02),LTH=0004,ATTR=(NUM,PROT)                             
FLD0717  DFLD  POS=(07,17),LTH=0003,ATTR=(NUM,PROT)                             
         DFLD  'SJÄLVKOST',                                            *        
               POS=(07,31),LTH=0009,ATTR=(NUM,PROT)                             
FLD0746  DFLD  POS=(07,46),LTH=0010,ATTR=(NUM,PROT)                             
         DFLD  'INKNR',                                                *        
               POS=(08,02),LTH=0005,ATTR=(NUM,PROT)                             
FLD0817  DFLD  POS=(08,16),LTH=0004,ATTR=(PROT)                                 
         DFLD  'DISP LAGER C1',                                        *        
               POS=(08,31),LTH=0013,ATTR=(NUM,PROT)                             
FLD0850  DFLD  POS=(08,50),LTH=0006,ATTR=(NUM,PROT)                             
         DFLD  'LEVNR',                                                *        
               POS=(09,02),LTH=0005,ATTR=(PROT)                                 
FLD0915  DFLD  POS=(09,15),LTH=0005,ATTR=(NUM,PROT)                             
         DFLD  'PERIODBEHOV C1',                                       *        
               POS=(09,31),LTH=0014,ATTR=(NUM,PROT)                             
FLD0948  DFLD  POS=(09,48),LTH=0008,ATTR=(NUM,PROT)                             
         DFLD  'HF-MÄRKN',                                             *        
               POS=(10,02),LTH=0008,ATTR=(NUM,PROT)                             
FLD1019  DFLD  POS=(10,19),LTH=0001,ATTR=(NUM,PROT)                             
         DFLD  'INGÅR I SATS',                                         *        
               POS=(12,02),LTH=0012,ATTR=(NUM,PROT)                             
FLD1219  DFLD  POS=(12,19),LTH=0001,ATTR=(NUM,PROT)                             
         DFLD  'SRA',                                                  *        
               POS=(13,02),LTH=0003,ATTR=(NUM,PROT)                             
FLD1318  DFLD  POS=(13,18),LTH=0002,ATTR=(NUM,PROT)                             
         DFLD  'URSPR',                                                *        
               POS=(14,02),LTH=0005,ATTR=(NUM,PROT)                             
FLD1418  DFLD  POS=(14,18),LTH=0002,ATTR=(NUM,PROT)                             
         DFLD  'TULLRESTITUTION',                                      *        
               POS=(16,02),LTH=0015,ATTR=(NUM,PROT)                             
FLD1620  DFLD  POS=(16,20),LTH=0001,ATTR=(NUM,PROT)                             
         DFLD  'NY TULLRE',                                            *        
               POS=(16,23),LTH=0009,ATTR=(NUM,PROT)                             
FLD1635  DFLD  POS=(16,35),LTH=0001,ATTR=(NUM)                                  
         DFLD  '2 PART INFO',                                          +        
               POS=(21,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  ' 3 DELIVERY INFO',                                     +        
               POS=(21,14),LTH=16,                                     +        
               ATTR=(PROT)                                                      
         DFLD  ' 4 DELIVERY INFO CDC',                                 +        
               POS=(21,31),LTH=20,                                     +        
               ATTR=(PROT)                                                      
         DFLD  ' 5 DELIVERY INFO DC',                                  +        
               POS=(21,52),LTH=19,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(21,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,02),LTH=0055,ATTR=(NUM,PROT,HI)                          
         DFLD  ' VCAS',POS=(23,73)                                              
FSYSMSG  DFLD  POS=(24,02),LTH=0079,ATTR=(NUM,PROT,HI)                          
         FMTEND                                                                 
         EJECT                                                                  
W9O11101 MSG   TYPE=OUTPUT,                                            *        
               SOR=(W9F111,IGNORE),                                    *        
               OPT=2,                                                  *        
               NXT=W9I11101,                                           *        
               FILL=PT,                                                *        
               PAGE=NO                                                          
         SEG                                                                    
         MFLD  FLD0102,LTH=0001                                                 
         MFLD  FLD0104,LTH=0001                                                 
         MFLD  FLD0106,LTH=0001                                                 
         MFLD  FLD0108,LTH=0001                                                 
         MFLD  FLD0141,LTH=0040                                                 
         MFLD  FLD0212,LTH=0002                                                 
         MFLD  FLD0312,LTH=0009                                                 
         MFLD  FLD0513,LTH=0025                                                 
         MFLD  FLD0552,LTH=0025                                                 
         MFLD  FLD0717,LTH=0003                                                 
         MFLD  FLD0746,LTH=0010                                                 
         MFLD  FLD0817,LTH=0004                                                 
         MFLD  FLD0850,LTH=0006                                                 
         MFLD  FLD0915,LTH=0005                                                 
         MFLD  FLD0948,LTH=0008                                                 
         MFLD  FLD1019,LTH=0001                                                 
         MFLD  FLD1219,LTH=0001                                                 
         MFLD  FLD1318,LTH=0002                                                 
         MFLD  FLD1418,LTH=0002                                                 
         MFLD  FLD1620,LTH=0003,ATTR=YES                                        
         MFLD  FLD1635,LTH=0004,ATTR=YES                                        
         MFLD  FLD2302,LTH=0055                                                 
         MFLD  (FSYSMSG,' '),LTH=1                                              
         MSGEND                                                                 
         EJECT                                                                  
W9I11101 MSG   TYPE=INPUT,                                             *        
               SOR=W9F111,                                             *        
               OPT=2,                                                  *        
               NXT=W9O11101                                                     
         SEG                                                                    
         MFLD  FLDPFK,LTH=0008,FILL=NULL                                        
         MFLD  'W',LTH=1                                                        
         MFLD  FLD0102,LTH=0001,FILL=C'9'                                       
         MFLD  'T',LTH=1                                                        
         MFLD  FLD0104,LTH=0001,FILL=C'1'                                       
         MFLD  FLD0106,LTH=0001,FILL=C'1'                                       
         MFLD  FLD0108,LTH=0001,FILL=C'1'                                       
         MFLD  '  ',LTH=2                                                       
         MFLD  '91111',LTH=5                                                    
         MFLD  (FLD0212,'+++++++++'),LTH=0009,FILL=C'0',JUST=R                  
         MFLD  FLD0312,LTH=0009,FILL=C'0'                                       
         MFLD  (FLD1635,'+'),LTH=0001,FILL=C'0',JUST=R                          
         MSGEND                                                                 
         EJECT                                                                  
         END                                                                    
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
