***********************************************************************         
* CREATED BY R0C3633   ON 90/10/30  AT 15:07                                    
***********************************************************************         
         TITLE 'FR≈GA ORDER ARTIKLAR VIA VDI    '                               
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyzˆÈ¸‰Â…'                               
W9F313   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080'                                                     
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,2)),                                         +        
               FILL=NONE                                                        
FLD0202  DFLD  POS=(2,2),LTH=5,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0210  DFLD  POS=(2,10),LTH=10,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD0203  DFLD  POS=(3,2),LTH=60,                                       +        
               ATTR=(NUM,NOPROT)                                                
COL0204  DFLD  POS=(4,2),LTH=43,                                       +        
               ATTR=(NUM,PROT)                                                  
COL0205  DFLD  POS=(5,2),LTH=43,                                       +        
               ATTR=(NUM,PROT)                                                  
COL0206  DFLD  POS=(6,2),LTH=43,                                       +        
               ATTR=(NUM,PROT)                                                  
COL0207  DFLD  POS=(7,2),LTH=43,                                       +        
               ATTR=(NUM,PROT)                                                  
COL0208  DFLD  POS=(8,2),LTH=43,                                       +        
               ATTR=(NUM,PROT)                                                  
COL0209  DFLD  POS=(9,2),LTH=43,                                       +        
               ATTR=(NUM,PROT)                                                  
COL0210  DFLD  POS=(10,2),LTH=43,                                      +        
               ATTR=(NUM,PROT)                                                  
COL0211  DFLD  POS=(11,2),LTH=43,                                      +        
               ATTR=(NUM,PROT)                                                  
COL0212  DFLD  POS=(12,2),LTH=43,                                      +        
               ATTR=(NUM,PROT)                                                  
COL0213  DFLD  POS=(13,2),LTH=43,                                      +        
               ATTR=(NUM,PROT)                                                  
COL0214  DFLD  POS=(14,2),LTH=43,                                      +        
               ATTR=(NUM,PROT)                                                  
COL0215  DFLD  POS=(15,2),LTH=43,                                      +        
               ATTR=(NUM,PROT)                                                  
COL0216  DFLD  POS=(16,2),LTH=43,                                      +        
               ATTR=(NUM,PROT)                                                  
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT)                                                  
         FMTEND                                                                 
W9O31301 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W9F313,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W9I31301,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  FLD0210,                                                +        
               LTH=10                                                           
         MFLD  FLD0203,                                                +        
               LTH=60                                                           
         MFLD  COL0204,                                                +        
               LTH=43                                                           
         MFLD  COL0205,                                                +        
               LTH=43                                                           
         MFLD  COL0206,                                                +        
               LTH=43                                                           
         MFLD  COL0207,                                                +        
               LTH=43                                                           
         MFLD  COL0208,                                                +        
               LTH=43                                                           
         MFLD  COL0209,                                                +        
               LTH=43                                                           
         MFLD  COL0210,                                                +        
               LTH=43                                                           
         MFLD  COL0211,                                                +        
               LTH=43                                                           
         MFLD  COL0212,                                                +        
               LTH=43                                                           
         MFLD  COL0213,                                                +        
               LTH=43                                                           
         MFLD  COL0214,                                                +        
               LTH=43                                                           
         MFLD  COL0215,                                                +        
               LTH=43                                                           
         MFLD  COL0216,                                                +        
               LTH=43                                                           
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W9I31301 MSG   TYPE=INPUT,                                             +        
               SOR=(W9F313),                                           +        
               OPT=2,                                                  +        
               NXT=W9O31301                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  'R90313T',                                              +        
               LTH=8                                                            
         MFLD  FLD0202,                                                +        
               LTH=5                                                            
         MFLD  FLD0203,                                                +        
               LTH=60                                                           
         MSGEND                                                                 
         END                                                                    
