***********************************************************************         
* CREATED BY v0C3830   ON 03/08/26  AT 09:04                                    
***********************************************************************         
         TITLE '                                '                               
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyzˆÈ¸‰Â…'                               
W9F331   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080'                                                     
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,2)),                                         +        
               FILL=NONE                                                        
FLD0202  DFLD  POS=(2,2),LTH=5,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0210  DFLD  POS=(2,10),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'DistKundnrArtnr---Beart-VO',                           +        
               POS=(4,2),LTH=26,                                       +        
               ATTR=(PROT)                                                      
INDATA   DFLD  POS=(5,2),LTH=26,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Avbar-TFrDispd-DCOb',                                  +        
               POS=(8,2),LTH=19                                        +        
               ATTR=(PROT)                                                      
UTDATA   DFLD  POS=(9,2),LTH=26,                                       +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT)                                                      
         FMTEND                                                                 
W9O33101 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W9F331,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W9I33101,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0210,                                                +        
               LTH=7                                                            
         MFLD  UTDATA,                                                 +        
               LTH=19                                                           
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W9I33101 MSG   TYPE=INPUT,                                             +        
               SOR=(W9F331),                                           +        
               OPT=2,                                                  +        
               NXT=W9O33101                                                     
MID      LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  'W90331T ',                                             +        
               LTH=8                                                            
         MFLD  FLD0202,                                                +        
               LTH=5                                                            
         MFLD  INDATA,                                                 +        
               LTH=26                                                           
         MSGEND                                                                 
         END                                                                    
