***********************************************************************         
* CREATED BY PC30174   ON 97/03/17  AT 14:49                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'TILLGÄNGLIGHETSFRÅGA VDI        '                               
W9F321   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080'                                                     
         DIV   TYPE=INOUT                                                       
W9F321   DPAGE CURSOR=((2,2)),                                         +        
               FILL=NONE                                                        
FLD0202  DFLD  POS=(2,2),LTH=5,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0210  DFLD  POS=(2,10),LTH=7,                                       +        
               ATTR=(PROT)                                                      
FLD0302  DFLD  POS=(3,2),LTH=24,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD0402  DFLD  POS=(4,2),LTH=19,                                       +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT)                                                      
         FMTEND                                                                 
W9O32101 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W9F321,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W9I32101,                                           +        
               FILL=PT                                                          
DGI1     LPAGE SOR=W9F321                                                       
         SEG                                                                    
         MFLD  FLD0210,                                                +        
               LTH=7                                                            
         MFLD  FLD0402,                                                +        
               LTH=19                                                           
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W9I32101 MSG   TYPE=INPUT,                                             +        
               SOR=(W9F321),                                           +        
               OPT=2,                                                  +        
               NXT=W9O32101                                                     
DGI2     LPAGE SOR=(W9F321)                                                     
         SEG                                                                    
         MFLD  'W90321T ',                                             +        
               LTH=8                                                            
         MFLD  FLD0202,                                                +        
               LTH=5                                                            
         MFLD  FLD0302,                                                +        
               LTH=24                                                           
         MSGEND                                                                 
         END                                                                    
