***********************************************************************         
* CREATED BY R0C3633   ON 90/08/13  AT 08:43                                    
***********************************************************************         
         TITLE '                                '                               
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyzˆÈ¸‰Â…'                               
W9F303   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080'                                                     
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,2)),                                         +        
               FILL=NONE                                                        
FLD0202  DFLD  POS=(2,2),LTH=5,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0210  DFLD  POS=(2,10),LTH=10,                                      +        
               ATTR=(PROT)                                                      
FLD0302  DFLD  POS=(3,2),LTH=44,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD0402  DFLD  POS=(4,2),LTH=21,                                       +        
               ATTR=(PROT)                                                      
COL0205  DFLD  POS=(5,2),LTH=17,                                       +        
               ATTR=(PROT)                                                      
COL0206  DFLD  POS=(6,2),LTH=17,                                       +        
               ATTR=(PROT)                                                      
COL0207  DFLD  POS=(7,2),LTH=17,                                       +        
               ATTR=(PROT)                                                      
COL0208  DFLD  POS=(8,2),LTH=17,                                       +        
               ATTR=(PROT)                                                      
COL0209  DFLD  POS=(9,2),LTH=17,                                       +        
               ATTR=(PROT)                                                      
COL0210  DFLD  POS=(10,2),LTH=17,                                      +        
               ATTR=(PROT)                                                      
COL0211  DFLD  POS=(11,2),LTH=17,                                      +        
               ATTR=(PROT)                                                      
COL0212  DFLD  POS=(12,2),LTH=17,                                      +        
               ATTR=(PROT)                                                      
COL0213  DFLD  POS=(13,2),LTH=17,                                      +        
               ATTR=(PROT)                                                      
COL0214  DFLD  POS=(14,2),LTH=17,                                      +        
               ATTR=(PROT)                                                      
COL0215  DFLD  POS=(15,2),LTH=17,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT)                                                      
         FMTEND                                                                 
W9O30301 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W9F303,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W9I30301,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0210,                                                +        
               LTH=10                                                           
         MFLD  FLD0302,                                                +        
               LTH=44                                                           
         MFLD  FLD0402,                                                +        
               LTH=21                                                           
         MFLD  COL0205,                                                +        
               LTH=17                                                           
         MFLD  COL0206,                                                +        
               LTH=17                                                           
         MFLD  COL0207,                                                +        
               LTH=17                                                           
         MFLD  COL0208,                                                +        
               LTH=17                                                           
         MFLD  COL0209,                                                +        
               LTH=17                                                           
         MFLD  COL0210,                                                +        
               LTH=17                                                           
         MFLD  COL0211,                                                +        
               LTH=17                                                           
         MFLD  COL0212,                                                +        
               LTH=17                                                           
         MFLD  COL0213,                                                +        
               LTH=17                                                           
         MFLD  COL0214,                                                +        
               LTH=17                                                           
         MFLD  COL0215,                                                +        
               LTH=17                                                           
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W9I30301 MSG   TYPE=INPUT,                                             +        
               SOR=(W9F303),                                           +        
               OPT=2,                                                  +        
               NXT=W9O30301                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  'R90303T ',                                             +        
               LTH=8                                                            
         MFLD  FLD0202,                                                +        
               LTH=5                                                            
         MFLD  FLD0302,                                                +        
               LTH=44                                                           
         MSGEND                                                                 
         END                                                                    
