         TITLE 'SPIE - CHANGE PART INFORMATION'                                 
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyzˆÈ¸‰Â…'                               
W9F411   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080'                                            +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W9T411U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
FORMAT   DPAGE CURSOR=((2,2)),                                         +        
               FILL=NONE                                                        
FLD0202  DFLD  POS=(2,2),LTH=5,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0210  DFLD  POS=(2,10),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
MFSFEL   DFLD  POS=(2,15),LTH=40,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'PART ',                                                +        
               POS=(3,2),LTH=5,                                        +        
               ATTR=(PROT)                                                      
ARTNRI   DFLD  POS=(3,10),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
ARTNRO   DFLD  POS=(4,10),LTH=9,                                       +        
               ATTR=(NUM,PROT)                                                  
         DFLD  'Bered',                                                +        
               POS=(5,2),LTH=5,                                        +        
               ATTR=(PROT)                                                      
BERED    DFLD  POS=(5,9),LTH=2,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Prodsl',                                               +        
               POS=(5,13),LTH=6,                                       +        
               ATTR=(PROT)                                                      
PRODSL   DFLD  POS=(5,21),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Sort',                                                 +        
               POS=(5,24),LTH=4,                                       +        
               ATTR=(PROT)                                                      
SORT     DFLD  POS=(5,30),LTH=2,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Enh1',                                                 +        
               POS=(5,34),LTH=4,                                       +        
               ATTR=(PROT)                                                      
PROENH1  DFLD  POS=(5,40),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Enh2',                                                 +        
               POS=(5,50),LTH=4,                                       +        
               ATTR=(PROT)                                                      
PROENH2  DFLD  POS=(5,56),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Enh3',                                                 +        
               POS=(5,66),LTH=4,                                       +        
               ATTR=(PROT)                                                      
PROENH3  DFLD  POS=(5,72),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Uart',                                                 +        
               POS=(6,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
UART     DFLD  POS=(6,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Proj',                                                 +        
               POS=(6,11),LTH=4,                                       +        
               ATTR=(PROT)                                                      
PROJ     DFLD  POS=(6,17),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Pisk',                                                 +        
               POS=(6,23),LTH=4,                                       +        
               ATTR=(PROT)                                                      
PISK     DFLD  POS=(6,30),LTH=1,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Kat1',                                                 +        
               POS=(6,33),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KAT1     DFLD  POS=(6,39),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Kat2',                                                 +        
               POS=(6,46),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KAT2     DFLD  POS=(6,52),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Kat4',                                                 +        
               POS=(6,60),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KAT4     DFLD  POS=(6,66),LTH=5,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Lstdel',                                               +        
               POS=(7,2),LTH=6,                                        +        
               ATTR=(PROT)                                                      
LSTDEL   DFLD  POS=(7,10),LTH=1,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Projk',                                                +        
               POS=(7,13),LTH=5,                                       +        
               ATTR=(PROT)                                                      
PROJK    DFLD  POS=(7,20),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Bpsr',                                                 +        
               POS=(7,25),LTH=4,                                       +        
               ATTR=(PROT)                                                      
BPSR     DFLD  POS=(7,31),LTH=1,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Fkn',                                                  +        
               POS=(7,34),LTH=3,                                       +        
               ATTR=(PROT)                                                      
FKNGRP   DFLD  POS=(7,39),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Proj',                                                 +        
               POS=(7,45),LTH=4,                                       +        
               ATTR=(PROT)                                                      
PROJUP   DFLD  POS=(7,52),LTH=8,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Part',                                                 +        
               POS=(7,62),LTH=4,                                       +        
               ATTR=(PROT)                                                      
ARTNRM   DFLD  POS=(7,68),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Ritnr',                                                +        
               POS=(8,2),LTH=5,                                        +        
               ATTR=(PROT)                                                      
RITN     DFLD  POS=(8,10),LTH=10,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'vagn',                                                 +        
               POS=(8,22),LTH=4,                                       +        
               ATTR=(PROT)                                                      
ARTVAGN  DFLD  POS=(8,28),LTH=3,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Age',                                                  +        
               POS=(8,33),LTH=3,                                       +        
               ATTR=(PROT)                                                      
AGE      DFLD  POS=(8,39),LTH=1,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'A01',                                                  +        
               POS=(9,2),LTH=3,                                        +        
               ATTR=(PROT)                                                      
AO1      DFLD  POS=(9,6),LTH=10,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'A02',                                                  +        
               POS=(9,17),LTH=3,                                       +        
               ATTR=(PROT)                                                      
AO2      DFLD  POS=(9,21),LTH=10,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'A03',                                                  +        
               POS=(9,32),LTH=3,                                       +        
               ATTR=(PROT)                                                      
AO3      DFLD  POS=(9,36),LTH=10,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'A04',                                                  +        
               POS=(9,47),LTH=3,                                       +        
               ATTR=(PROT)                                                      
AO4      DFLD  POS=(9,51),LTH=10,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'A05',                                                  +        
               POS=(9,62),LTH=3,                                       +        
               ATTR=(PROT)                                                      
AO5      DFLD  POS=(9,66),LTH=10,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Ors',                                                  +        
               POS=(10,02),LTH=3,                                      +        
               ATTR=(PROT)                                                      
ORSAK    DFLD  POS=(10,07),LTH=50,                                     +        
               ATTR=(NOPROT)                                                    
         DFLD  'SOP',                                                  +        
               POS=(10,60),LTH=3,                                      +        
               ATTR=(PROT)                                                      
SOP      DFLD  POS=(10,65),LTH=5,                                      +        
               ATTR=(NUM,NOPROT)                                                
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT)                                                  
         FMTEND                                                                 
W90411O1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W9F411,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W90411I1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=FORMAT                                                       
         SEG                                                                    
         MFLD  FLD0210,                                                +        
               LTH=4                                                            
         MFLD  MFSFEL,                                                 +        
               LTH=40                                                           
         MFLD  FILX48,                                                 +        
               LTH=48                                                           
         MFLD  PROENH4,                                                +        
               LTH=10                                                           
         MFLD  PROENH5,                                                +        
               LTH=10                                                           
         MFLD  PROENH6,                                                +        
               LTH=10                                                           
         MFLD  BERED,                                                  +        
               LTH=4                                                            
         MFLD  PRODSL,                                                 +        
               LTH=4                                                            
         MFLD  SORT,                                                   +        
               LTH=4                                                            
         MFLD  PROENH7,                                                +        
               LTH=4                                                            
         MFLD  PROENH8,                                                +        
               LTH=4                                                            
         MFLD  PROENH9,                                                +        
               LTH=4                                                            
         MFLD  FILX12,                                                 +        
               LTH=12                                                           
         MFLD  KAT1,                                                   +        
               LTH=7                                                            
         MFLD  KAT2,                                                   +        
               LTH=7                                                            
         MFLD  KAT3,                                                   +        
               LTH=7                                                            
         MFLD  UART,                                                   +        
               LTH=4                                                            
         MFLD  PROJ,                                                   +        
               LTH=4                                                            
         MFLD  PISK,                                                   +        
               LTH=4                                                            
         MFLD  KATIN1,                                                 +        
               LTH=4                                                            
         MFLD  KATIN2,                                                 +        
               LTH=4                                                            
         MFLD  KATIN3,                                                 +        
               LTH=4                                                            
         MFLD  LSRDEL,                                                 +        
               LTH=2                                                            
         MFLD  FILX21,                                                 +        
               LTH=21                                                           
         MFLD  PROJK,                                                  +        
               LTH=4                                                            
         MFLD  BPSR,                                                   +        
               LTH=4                                                            
         MFLD  SOP,                                                    +        
               LTH=4                                                            
         MFLD  FILX27,                                                 +        
               LTH=27                                                           
         MFLD  FKNGRP,                                                 +        
               LTH=4                                                            
         MFLD  PROJUP,                                                 +        
               LTH=4                                                            
         MFLD  ARTNRM,                                                 +        
               LTH=4                                                            
         MFLD  FILX31,                                                 +        
               LTH=31                                                           
         MFLD  AGE,                                                    +        
               LTH=1                                                            
         MFLD  FILX4A,                                                 +        
               LTH=4                                                            
         MFLD  RITN,                                                   +        
               LTH=4                                                            
         MFLD  ARTVAGN,                                                +        
               LTH=4                                                            
         MFLD  FILX4B,                                                 +        
               LTH=4                                                            
         MFLD  AGEIN,                                                  +        
               LTH=4                                                            
         MFLD  AO1,                                                    +        
               LTH=12                                                           
         MFLD  AO2,                                                    +        
               LTH=12                                                           
         MFLD  AO3,                                                    +        
               LTH=12                                                           
         MFLD  AO4,                                                    +        
               LTH=12                                                           
         MFLD  AO5,                                                    +        
               LTH=12                                                           
         MFLD  AOIN1,                                                  +        
               LTH=4                                                            
         MFLD  AOIN2,                                                  +        
               LTH=4                                                            
         MFLD  AOIN3,                                                  +        
               LTH=4                                                            
         MFLD  AOIN4,                                                  +        
               LTH=4                                                            
         MFLD  AOIN5,                                                  +        
               LTH=4                                                            
         MFLD  ORSAK,                                                  +        
               LTH=52                                                           
         MFLD  FILX97,                                                 +        
               LTH=97                                                           
         MFLD  (FSYGMSG,                                               +        
               ' ')                                                    +        
               LTH=1                                                            
         MSGEND                                                                 
W90411I1 MSG   TYPE=INPUT,                                             +        
               SOR=(W9F411),                                           +        
               OPT=2,                                                  +        
               NXT=W90411O1                                                     
MID      LPAGE SOR=(FORMAT)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W9T411 ',                                              +        
               LTH=8                                                            
         MFLD  FLD0202,                                                +        
               LTH=5                                                            
         MFLD  ARTNRI,                                                 +        
               LTH=9                                                            
         MFLD  ARTNRO,                                                 +        
               LTH=9                                                            
         MFLD  BERED,                                                  +        
               LTH=2                                                            
         MFLD  PRODSL,                                                 +        
               LTH=2                                                            
         MFLD  SORT,                                                   +        
               LTH=2                                                            
         MFLD  PROENH1,                                                +        
               LTH=8                                                            
         MFLD  PROENH2,                                                +        
               LTH=8                                                            
         MFLD  PROENH3,                                                +        
               LTH=8                                                            
         MFLD  UART,                                                   +        
               LTH=1                                                            
         MFLD  PROJ,                                                   +        
               LTH=4                                                            
         MFLD  PISK,                                                   +        
               LTH=1                                                            
         MFLD  KAT1,                                                   +        
               LTH=5                                                            
         MFLD  KAT2,                                                   +        
               LTH=5                                                            
         MFLD  KAT3,                                                   +        
               LTH=5                                                            
         MFLD  LSRDEL,                                                 +        
               LTH=1                                                            
         MFLD  PROJK,                                                  +        
               LTH=4                                                            
         MFLD  BPSR,                                                   +        
               LTH=1                                                            
         MFLD  FKNGRP,                                                 +        
               LTH=4                                                            
         MFLD  PROJUP,                                                 +        
               LTH=8                                                            
         MFLD  ARTNRM,                                                 +        
               LTH=9                                                            
         MFLD  FILX1,                                                  +        
               LTH=1                                                            
         MFLD  RITN,                                                   +        
               LTH=10                                                           
         MFLD  ARTVAGN,                                                +        
               LTH=3                                                            
         MFLD  FILX7,                                                  +        
               LTH=7                                                            
         MFLD  AGE,                                                    +        
               LTH=1                                                            
         MFLD  AO1,                                                    +        
               LTH=10                                                           
         MFLD  AO2,                                                    +        
               LTH=10                                                           
         MFLD  AO3,                                                    +        
               LTH=10                                                           
         MFLD  AO4,                                                    +        
               LTH=10                                                           
         MFLD  AO5,                                                    +        
               LTH=10                                                           
         MFLD  ORSAK,                                                  +        
               LTH=50                                                           
         MFLD  FILX40,                                                 +        
               LTH=40                                                           
         MFLD  SOP,                                                    +        
               LTH=5                                                            
         MSGEND                                                                 
         END                                                                    
