***********************************************************************         
* CREATED BY V028439   ON 07/10/31  AT 15:24                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'SPIE2 ARTIKELINFO               '                               
W9F438   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T105  ',                                           +        
               2='W0T105  ',                                           +        
               3='W0T105  ',                                           +        
               4='W0T105  ',                                           +        
               5='W0T105  ',                                           +        
               6='W0T105  ',                                           +        
               7='W0T105  ',                                           +        
               8='W0T105  ',                                           +        
               9='W0T105  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T105  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T105  ',                                          +        
               14='W0T105  ',                                          +        
               15='W0T105  ',                                          +        
               16='W0T105  ',                                          +        
               17='W0T105  ',                                          +        
               18='W0T105  ',                                          +        
               19='W0T105  ',                                          +        
               20='W0T105  ',                                          +        
               21='W0T105  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T105  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W9F438   DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'SPIE2 Artinfo',                                        +        
               POS=(1,12),LTH=13,                                      +        
               ATTR=(PROT)                                                      
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Artikelnr',                                            +        
               POS=(2,2),LTH=9,                                        +        
               ATTR=(ALPHA,PROT)                                                
ARTNRIN  DFLD  POS=(2,12),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Levnr',                                                +        
               POS=(2,24),LTH=5,                                       +        
               ATTR=(PROT)                                                      
LEVNRIN  DFLD  POS=(2,30),LTH=5,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Val',                                                  +        
               POS=(2,41),LTH=3,                                       +        
               ATTR=(PROT)                                                      
VALIN    DFLD  POS=(2,45),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
ARTNRUT  DFLD  POS=(3,12),LTH=9,                                       +        
               ATTR=(PROT)                                                      
LEVNRUT  DFLD  POS=(3,30),LTH=5,                                       +        
               ATTR=(PROT)                                                      
VALUT    DFLD  POS=(3,45),LTH=7,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Lev-Namn',                                             +        
               POS=(5,2),LTH=8,                                        +        
               ATTR=(PROT)                                                      
BELEV    DFLD  POS=(5,11),LTH=60,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Lev-Land',                                             +        
               POS=(6,2),LTH=8,                                        +        
               ATTR=(PROT)                                                      
LEVLND   DFLD  POS=(6,11),LTH=20,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'LT',                                                   +        
               POS=(6,33),LTH=2,                                       +        
               ATTR=(PROT)                                                      
LT       DFLD  POS=(6,36),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'FT',                                                   +        
               POS=(6,40),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FT       DFLD  POS=(6,43),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Inl',                                                  +        
               POS=(6,46),LTH=3,                                       +        
               ATTR=(NUM,PROT)                                                  
INL      DFLD  POS=(6,50),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'PB-p',                                                 +        
               POS=(6,53),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
PBPLAN   DFLD  POS=(6,58),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'PB-s',                                                 +        
               POS=(6,67),LTH=4,                                       +        
               ATTR=(NUM,PROT)                                                  
PBSATS   DFLD  POS=(6,72),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Ansk',                                                 +        
               POS=(7,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
NAMNA    DFLD  POS=(7,7),LTH=40,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'T',                                                    +        
               POS=(7,49),LTH=1,                                       +        
               ATTR=(PROT)                                                      
TFNA     DFLD  POS=(7,51),LTH=20,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Ber',                                                  +        
               POS=(8,2),LTH=3,                                        +        
               ATTR=(PROT)                                                      
NAMNB    DFLD  POS=(8,7),LTH=40,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'T',                                                    +        
               POS=(8,49),LTH=1,                                       +        
               ATTR=(PROT)                                                      
TFNB     DFLD  POS=(8,51),LTH=20,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Ink',                                                  +        
               POS=(9,2),LTH=3,                                        +        
               ATTR=(PROT)                                                      
NAMNI    DFLD  POS=(9,7),LTH=40,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'T',                                                    +        
               POS=(9,49),LTH=1,                                       +        
               ATTR=(PROT)                                                      
TFNI     DFLD  POS=(9,51),LTH=20,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Forp',                                                 +        
               POS=(10,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
NAMNF    DFLD  POS=(10,7),LTH=40,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'T',                                                    +        
               POS=(10,49),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TFNF     DFLD  POS=(10,51),LTH=20,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Kval',                                                 +        
               POS=(11,2),LTH=4,                                       +        
               ATTR=(PROT)                                                      
NAMNK    DFLD  POS=(11,7),LTH=40,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'T',                                                    +        
               POS=(11,49),LTH=1,                                      +        
               ATTR=(PROT)                                                      
TFNK     DFLD  POS=(11,51),LTH=20,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Avt',                                                  +        
               POS=(12,2),LTH=3,                                       +        
               ATTR=(PROT)                                                      
AVTAL    DFLD  POS=(12,6),LTH=1,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Omr',                                                  +        
               POS=(12,10),LTH=3,                                      +        
               ATTR=(PROT)                                                      
LAGOMR   DFLD  POS=(12,14),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Gång',                                                 +        
               POS=(12,18),LTH=4,                                      +        
               ATTR=(NUM,PROT)                                                  
ADGANG   DFLD  POS=(12,23),LTH=3,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Plats',                                                +        
               POS=(12,27),LTH=5,                                      +        
               ATTR=(NUM,PROT)                                                  
ADPLATS  DFLD  POS=(12,33),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'CDC Arb.s',                                            +        
               POS=(13,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
ARBSALD1 DFLD  POS=(13,12),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'CDC disp',                                             +        
               POS=(13,22),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DISP1    DFLD  POS=(13,31),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'CDC LS',                                               +        
               POS=(13,41),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KVLS1    DFLD  POS=(13,48),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'CDC AKS',                                              +        
               POS=(13,58),LTH=7,                                      +        
               ATTR=(PROT)                                                      
AKS1     DFLD  POS=(13,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'SDC Arb.s',                                            +        
               POS=(14,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
ARBSALD2 DFLD  POS=(14,12),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'SDC disp',                                             +        
               POS=(14,22),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DISP2    DFLD  POS=(14,31),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'SDC LS',                                               +        
               POS=(14,41),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KVLS2    DFLD  POS=(14,48),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'SDC AKS',                                              +        
               POS=(14,58),LTH=7,                                      +        
               ATTR=(PROT)                                                      
AKS2     DFLD  POS=(14,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'NDC Arb.s',                                            +        
               POS=(15,2),LTH=9,                                       +        
               ATTR=(PROT)                                                      
ARBSALD3 DFLD  POS=(15,12),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'NDC disp',                                             +        
               POS=(15,22),LTH=8,                                      +        
               ATTR=(PROT)                                                      
DISP3    DFLD  POS=(15,31),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'NDC LS',                                               +        
               POS=(15,41),LTH=6,                                      +        
               ATTR=(PROT)                                                      
KVLS3    DFLD  POS=(15,48),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'NDC AKS',                                              +        
               POS=(15,58),LTH=7,                                      +        
               ATTR=(PROT)                                                      
AKS3     DFLD  POS=(15,66),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Ord.ing.År',                                           +        
               POS=(16,2),LTH=10,                                      +        
               ATTR=(PROT)                                                      
AARTAL1  DFLD  POS=(16,13),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'År',                                                   +        
               POS=(16,22),LTH=2,                                      +        
               ATTR=(PROT)                                                      
AARTAL2  DFLD  POS=(16,25),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'År',                                                   +        
               POS=(16,35),LTH=2,                                      +        
               ATTR=(PROT)                                                      
AARTAL3  DFLD  POS=(16,38),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'År',                                                   +        
               POS=(16,47),LTH=2,                                      +        
               ATTR=(PROT)                                                      
AARTAL4  DFLD  POS=(16,50),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'År',                                                   +        
               POS=(16,59),LTH=2,                                      +        
               ATTR=(PROT)                                                      
AARTAL5  DFLD  POS=(16,62),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'År',                                                   +        
               POS=(16,71),LTH=2,                                      +        
               ATTR=(PROT)                                                      
AARTAL6  DFLD  POS=(16,74),LTH=4,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '-"- Tot',                                              +        
               POS=(17,2),LTH=7,                                       +        
               ATTR=(PROT)                                                      
OITOT1   DFLD  POS=(17,10),LTH=7,                                      +        
               ATTR=(PROT)                                                      
OITOT2   DFLD  POS=(17,22),LTH=7,                                      +        
               ATTR=(PROT)                                                      
OITOT3   DFLD  POS=(17,35),LTH=7,                                      +        
               ATTR=(PROT)                                                      
OITOT4   DFLD  POS=(17,47),LTH=7,                                      +        
               ATTR=(PROT)                                                      
OITOT5   DFLD  POS=(17,59),LTH=7,                                      +        
               ATTR=(PROT)                                                      
OITOT6   DFLD  POS=(17,71),LTH=7,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Senaste PER',                                          +        
               POS=(18,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
SULEVPER DFLD  POS=(18,14),LTH=11,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Hitt. iÅR',                                            +        
               POS=(18,26),LTH=9,                                      +        
               ATTR=(NUM,PROT)                                                  
SULEVAAR DFLD  POS=(18,37),LTH=11,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Mots.föreg.ÅR',                                        +        
               POS=(18,53),LTH=13,                                     +        
               ATTR=(PROT)                                                      
SULEVFAA DFLD  POS=(18,67),LTH=11,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Rull.  ÅR',                                            +        
               POS=(19,26),LTH=9,                                      +        
               ATTR=(PROT)                                                      
SULEVRAA DFLD  POS=(19,37),LTH=11,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Rull. föreg. ÅR',                                      +        
               POS=(19,51),LTH=15,                                     +        
               ATTR=(PROT)                                                      
SULEVFRA DFLD  POS=(19,67),LTH=11,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Val : T,P,D,S,N,E,R OR L',                             +        
               POS=(21,2),LTH=24,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCCS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W90438O1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W9F438,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W90438I1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W9F438                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  ARTNRIN,                                                +        
               LTH=10,                                                 +        
               ATTR=(YES)                                                       
         MFLD  ARTNRUT,                                                +        
               LTH=8                                                            
         MFLD  LEVNRIN,                                                +        
               LTH=7,                                                  +        
               ATTR=(YES)                                                       
         MFLD  LEVNRUT,                                                +        
               LTH=5                                                            
         MFLD  VALIN,                                                  +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  VALUT,                                                  +        
               LTH=7                                                            
         MFLD  BELEV,                                                  +        
               LTH=60                                                           
         MFLD  LEVLND,                                                 +        
               LTH=20                                                           
         MFLD  LT,                                                     +        
               LTH=2                                                            
         MFLD  FT,                                                     +        
               LTH=2                                                            
         MFLD  INL,                                                    +        
               LTH=2                                                            
         MFLD  PBPLAN,                                                 +        
               LTH=8                                                            
         MFLD  PBSATS,                                                 +        
               LTH=8                                                            
         MFLD  NAMNA,                                                  +        
               LTH=40                                                           
         MFLD  TFNA,                                                   +        
               LTH=20                                                           
         MFLD  NAMNB,                                                  +        
               LTH=40                                                           
         MFLD  TFNB,                                                   +        
               LTH=20                                                           
         MFLD  NAMNI,                                                  +        
               LTH=40                                                           
         MFLD  TFNI,                                                   +        
               LTH=20                                                           
         MFLD  NAMNF,                                                  +        
               LTH=40                                                           
         MFLD  TFNF,                                                   +        
               LTH=20                                                           
         MFLD  NAMNK,                                                  +        
               LTH=40                                                           
         MFLD  TFNK,                                                   +        
               LTH=20                                                           
         MFLD  AVTAL,                                                  +        
               LTH=1                                                            
         MFLD  LAGOMR,                                                 +        
               LTH=3                                                            
         MFLD  ADGANG,                                                 +        
               LTH=3                                                            
         MFLD  ADPLATS,                                                +        
               LTH=6                                                            
         MFLD  ARBSALD1,                                               +        
               LTH=8                                                            
         MFLD  DISP1,                                                  +        
               LTH=8                                                            
         MFLD  KVLS1,                                                  +        
               LTH=8                                                            
         MFLD  AKS1,                                                   +        
               LTH=8                                                            
         MFLD  ARBSALD2,                                               +        
               LTH=8                                                            
         MFLD  DISP2,                                                  +        
               LTH=8                                                            
         MFLD  KVLS2,                                                  +        
               LTH=8                                                            
         MFLD  AKS2,                                                   +        
               LTH=8                                                            
         MFLD  ARBSALD3,                                               +        
               LTH=8                                                            
         MFLD  DISP3,                                                  +        
               LTH=8                                                            
         MFLD  KVLS3,                                                  +        
               LTH=8                                                            
         MFLD  AKS3,                                                   +        
               LTH=8                                                            
         MFLD  AARTAL1,                                                +        
               LTH=4                                                            
         MFLD  OITOT1,                                                 +        
               LTH=7                                                            
         MFLD  AARTAL2,                                                +        
               LTH=4                                                            
         MFLD  OITOT2,                                                 +        
               LTH=7                                                            
         MFLD  AARTAL3,                                                +        
               LTH=4                                                            
         MFLD  OITOT3,                                                 +        
               LTH=7                                                            
         MFLD  AARTAL4,                                                +        
               LTH=4                                                            
         MFLD  OITOT4,                                                 +        
               LTH=7                                                            
         MFLD  AARTAL5,                                                +        
               LTH=4                                                            
         MFLD  OITOT5,                                                 +        
               LTH=7                                                            
         MFLD  AARTAL6,                                                +        
               LTH=4                                                            
         MFLD  OITOT6,                                                 +        
               LTH=7                                                            
         MFLD  SULEVPER,                                               +        
               LTH=11                                                           
         MFLD  SULEVAAR,                                               +        
               LTH=11                                                           
         MFLD  SULEVFAA,                                               +        
               LTH=11                                                           
         MFLD  SULEVRAA,                                               +        
               LTH=11                                                           
         MFLD  SULEVFRA,                                               +        
               LTH=11                                                           
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W90438I1 MSG   TYPE=INPUT,                                             +        
               SOR=(W9F438),                                           +        
               OPT=2,                                                  +        
               NXT=W90438O1                                                     
MID      LPAGE SOR=(W9F438)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F9'                                                       
         MFLD  '0',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F4'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F8'                                                       
         MFLD  'T ',                                                   +        
               LTH=2                                                            
         MFLD  '94381',                                                +        
               LTH=5                                                            
         MFLD  (ARTNRIN,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ARTNRUT,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (LEVNRIN,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (LEVNRUT,                                               +        
               '+++++'),                                               +        
               LTH=5,                                                  +        
               JUST=L,                                                 +        
               FILL=X'40'                                                       
         MFLD  (VALIN,                                                 +        
               '+'),                                                   +        
               LTH=1                                                            
         MFLD  (VALUT,                                                 +        
               '+++++++'),                                             +        
               LTH=7                                                            
         MSGEND                                                                 
         END                                                                    
