***********************************************************************         
* CREATED BY PC30186   ON 97/05/05  AT 14:03                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE '                                '                               
W9N111   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T501  ',                                           +        
               2='W9T112  ',                                           +        
               3='W9T113  ',                                           +        
               4='W9T114  ',                                           +        
               5='W9T115  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W0T501  ',                                           +        
               10='WHELP   ',                                          +        
               11='W9T111U ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W9T111U ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,12)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'ARTIKELINFO-RS',                                       +        
               POS=(1,10),LTH=14,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'ARTIKELNR',                                            +        
               POS=(2,2),LTH=9,                                        +        
               ATTR=(NUM,PROT)                                                  
FLD0212  DFLD  POS=(2,12),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
FLD0312  DFLD  POS=(3,12),LTH=9,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'SV BENÄMN',                                            +        
               POS=(5,2),LTH=9,                                        +        
               ATTR=(PROT)                                                      
FLD0513  DFLD  POS=(5,13),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'ENG BENÄMN',                                           +        
               POS=(5,40),LTH=10,                                      +        
               ATTR=(PROT)                                                      
FLD0552  DFLD  POS=(5,52),LTH=25,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'ANSK',                                                 +        
               POS=(7,2),LTH=4,                                        +        
               ATTR=(PROT)                                                      
FLD0717  DFLD  POS=(7,17),LTH=3,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'SJÄLVKOST',                                            +        
               POS=(7,31),LTH=9,                                       +        
               ATTR=(PROT)                                                      
FLD0746  DFLD  POS=(7,46),LTH=10,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'INKNR',                                                +        
               POS=(8,2),LTH=5,                                        +        
               ATTR=(PROT)                                                      
FLD0817  DFLD  POS=(8,16),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'DISP LAGER C1',                                        +        
               POS=(8,31),LTH=13,                                      +        
               ATTR=(PROT)                                                      
FLD0850  DFLD  POS=(8,50),LTH=6,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'LEVNR',                                                +        
               POS=(9,2),LTH=5,                                        +        
               ATTR=(PROT)                                                      
FLD0915  DFLD  POS=(9,15),LTH=5,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'PERIODBEHOV C1',                                       +        
               POS=(9,31),LTH=14,                                      +        
               ATTR=(PROT)                                                      
FLD0948  DFLD  POS=(9,48),LTH=8,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'HF-MÄRKN',                                             +        
               POS=(10,2),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD1019  DFLD  POS=(10,19),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'INGÅR I SATS',                                         +        
               POS=(12,2),LTH=12,                                      +        
               ATTR=(PROT)                                                      
FLD1219  DFLD  POS=(12,19),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'SRA',                                                  +        
               POS=(13,2),LTH=3,                                       +        
               ATTR=(PROT)                                                      
FLD1318  DFLD  POS=(13,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'URSPR',                                                +        
               POS=(14,2),LTH=5,                                       +        
               ATTR=(PROT)                                                      
FLD1418  DFLD  POS=(14,18),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'TULLRESTITUTION',                                      +        
               POS=(16,2),LTH=15,                                      +        
               ATTR=(PROT)                                                      
FLD1620  DFLD  POS=(16,20),LTH=1,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'NY TULLRE',                                            +        
               POS=(16,23),LTH=9,                                      +        
               ATTR=(PROT)                                                      
FLD1635  DFLD  POS=(16,35),LTH=1,                                      +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  '2 PART INFO',                                          +        
               POS=(21,2),LTH=11,                                      +        
               ATTR=(PROT)                                                      
         DFLD  ' 3 DELIVERY INFO',                                     +        
               POS=(21,14),LTH=16,                                     +        
               ATTR=(PROT)                                                      
         DFLD  ' 4 DELIVERY INFO CDC',                                 +        
               POS=(21,31),LTH=20,                                     +        
               ATTR=(PROT)                                                      
         DFLD  ' 5 DELIVERY INFO DC',                                  +        
               POS=(21,52),LTH=19,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '10 WHELP',                                             +        
               POS=(21,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,73),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W9O111N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W9N111,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W9I111N1,                                           +        
               FILL=PT                                                          
DGI00002 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0212,                                                +        
               LTH=2                                                            
         MFLD  FLD0312,                                                +        
               LTH=9                                                            
         MFLD  FLD0513,                                                +        
               LTH=25                                                           
         MFLD  FLD0552,                                                +        
               LTH=25                                                           
         MFLD  FLD0717,                                                +        
               LTH=3                                                            
         MFLD  FLD0746,                                                +        
               LTH=10                                                           
         MFLD  FLD0817,                                                +        
               LTH=4                                                            
         MFLD  FLD0850,                                                +        
               LTH=6                                                            
         MFLD  FLD0915,                                                +        
               LTH=5                                                            
         MFLD  FLD0948,                                                +        
               LTH=8                                                            
         MFLD  FLD1019,                                                +        
               LTH=1                                                            
         MFLD  FLD1219,                                                +        
               LTH=1                                                            
         MFLD  FLD1318,                                                +        
               LTH=2                                                            
         MFLD  FLD1418,                                                +        
               LTH=2                                                            
         MFLD  FLD1620,                                                +        
               LTH=3,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD1635,                                                +        
               LTH=4,                                                  +        
               ATTR=(YES)                                                       
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W9I111N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W9N111),                                           +        
               OPT=2,                                                  +        
               NXT=W9O111N1                                                     
DGI00003 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F9'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '91111',                                                +        
               LTH=5                                                            
         MFLD  (FLD0212,                                               +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0312,                                                +        
               LTH=9,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD1635,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MSGEND                                                                 
         END                                                                    
