***********************************************************************         
* CREATED BY R030174   ON 92/10/19  AT 12:25                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'LEVERANSINFORMATION             '                               
W9N113   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W9T111  ',                                           +        
               2='W9T112  ',                                           +        
               3='W0T501  ',                                           +        
               4='W9T114  ',                                           +        
               5='W9T115  ',                                           +        
               6='W0T501  ',                                           +        
               7='W0T501  ',                                           +        
               8='W0T501  ',                                           +        
               9='W9T113 9',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W0T501  ',                                          +        
               14='W0T501  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
W9N113   DPAGE CURSOR=((2,10)),                                        +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT,MOD)                                            
         DFLD  'Delivery information',                                 +        
               POS=(1,10),LTH=20,                                      +        
               ATTR=(PROT)                                                      
FLD0140  DFLD  POS=(1,40),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Part no',                                              +        
               POS=(2,2),LTH=7,                                        +        
               ATTR=(PROT)                                                      
ARTIN    DFLD  POS=(2,10),LTH=9,                                       +        
               ATTR=(NUM,NOPROT)                                                
ARTUT    DFLD  POS=(3,10),LTH=11,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Quantity',                                             +        
               POS=(2,22),LTH=8,                                       +        
               ATTR=(PROT)                                                      
ANTIN    DFLD  POS=(2,31),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
ANTUT    DFLD  POS=(3,31),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'District',                                             +        
               POS=(2,38),LTH=8,                                       +        
               ATTR=(PROT)                                                      
DISTIN   DFLD  POS=(2,47),LTH=4,                                       +        
               ATTR=(NUM,NOPROT)                                                
DISTUT   DFLD  POS=(3,47),LTH=4,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Cust',                                                 +        
               POS=(2,52),LTH=4,                                       +        
               ATTR=(PROT)                                                      
KUNDIN   DFLD  POS=(2,57),LTH=6,                                       +        
               ATTR=(NUM,NOPROT)                                                
KUNDUT   DFLD  POS=(3,57),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Class (D/B)',                                          +        
               POS=(2,64),LTH=11,                                      +        
               ATTR=(PROT)                                                      
KLASSIN  DFLD  POS=(2,76),LTH=1,                                       +        
               ATTR=(NUM,NOPROT)                                                
KLASSUT  DFLD  POS=(3,76),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
BEART    DFLD  POS=(4,14),LTH=25,                                      +        
               ATTR=(PROT,MOD)                                                  
         DFLD  'Prel. available qty',                                  +        
               POS=(09,5),LTH=19,                                      +        
               ATTR=(PROT)                                                      
TILLG    DFLD  POS=(09,25),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TILLG2   DFLD  POS=(09,38),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TEREGDAT DFLD  POS=(08,02),LTH=22,                                     +        
               ATTR=(PROT)                                                      
TIREGDAT DFLD  POS=(08,25),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'DC available date',                                    +        
               POS=(10,07),LTH=17,                                     +        
               ATTR=(PROT)                                                      
TIDISPIN DFLD  POS=(10,25),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TIDISPI2 DFLD  POS=(10,38),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Customer ETA',                                         +        
               POS=(11,12),LTH=12,                                     +        
               ATTR=(PROT)                                                      
TIKLAR   DFLD  POS=(11,25),LTH=6,                                      +        
               ATTR=(PROT)                                                      
TIKLAR2  DFLD  POS=(11,38),LTH=6,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Delivering DC',                                        +        
               POS=(12,11),LTH=13,                                     +        
               ATTR=(PROT)                                                      
LEVDC    DFLD  POS=(12,25),LTH=2,                                      +        
               ATTR=(PROT)                                                      
LEVDC2   DFLD  POS=(12,38),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Order confirmation',                                   +        
               POS=(13,6),LTH=18,                                      +        
               ATTR=(PROT)                                                      
ORDBEK   DFLD  POS=(13,25),LTH=2,                                      +        
               ATTR=(PROT)                                                      
ORDBEK2  DFLD  POS=(13,38),LTH=2,                                      +        
               ATTR=(PROT)                                                      
TEORDBEK DFLD  POS=(14,11),LTH=70,                                     +        
               ATTR=(PROT)                                                      
         DFLD  'Unit',                                                 +        
               POS=(16,11),LTH=4,                                      +        
               ATTR=(PROT)                                                      
KDSORT   DFLD  POS=(16,25),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'Repl. part no',                                        +        
               POS=(17,11),LTH=13,                                     +        
               ATTR=(PROT)                                                      
ARTTIL   DFLD  POS=(17,25),LTH=8,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'PF1=PART INFO-RS  PF2=PART INFO  PF4=DELIVERY INFO CDC +        
                PF5=DELIVERY INFO DC',                                 +        
               POS=(21,2),LTH=77,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'PF10 WHELP',                                           +        
               POS=(22,58),LTH=10,                                     +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  ' VCAS',POS=(23,58)                                              
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(PROT,HI)                                                   
         FMTEND                                                                 
W9O113N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W9N113,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W9I113N1,                                           +        
               FILL=PT                                                          
MOD      LPAGE SOR=W9N113                                                       
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0140,                                                +        
               LTH=40                                                           
         MFLD  ARTIN,                                                  +        
               LTH=9                                                            
         MFLD  ARTUT,                                                  +        
               LTH=11                                                           
         MFLD  DISTIN,                                                 +        
               LTH=4                                                            
         MFLD  DISTUT,                                                 +        
               LTH=4                                                            
         MFLD  KUNDIN,                                                 +        
               LTH=6                                                            
         MFLD  KUNDUT,                                                 +        
               LTH=6                                                            
         MFLD  ANTIN,                                                  +        
               LTH=6                                                            
         MFLD  ANTUT,                                                  +        
               LTH=6                                                            
         MFLD  KLASSIN,                                                +        
               LTH=1                                                            
         MFLD  KLASSUT,                                                +        
               LTH=1                                                            
         MFLD  TILLG,                                                  +        
               LTH=6                                                            
         MFLD  TILLG2,                                                 +        
               LTH=6                                                            
         MFLD  TEREGDAT,                                               +        
               LTH=22                                                           
         MFLD  TIREGDAT,                                               +        
               LTH=6                                                            
         MFLD  TIDISPIN,                                               +        
               LTH=6                                                            
         MFLD  TIDISPI2,                                               +        
               LTH=6                                                            
         MFLD  TIKLAR,                                                 +        
               LTH=6                                                            
         MFLD  TIKLAR2,                                                +        
               LTH=6                                                            
         MFLD  LEVDC,                                                  +        
               LTH=2                                                            
         MFLD  LEVDC2,                                                 +        
               LTH=2                                                            
         MFLD  ORDBEK,                                                 +        
               LTH=2                                                            
         MFLD  ORDBEK2,                                                +        
               LTH=2                                                            
         MFLD  BEART,                                                  +        
               LTH=25                                                           
         MFLD  KDSORT,                                                 +        
               LTH=2                                                            
         MFLD  TEORDBEK,                                               +        
               LTH=70                                                           
         MFLD  ARTTIL,                                                 +        
               LTH=8                                                            
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W9I113N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W9N113),                                           +        
               OPT=2,                                                  +        
               NXT=W9O113N1                                                     
MID      LPAGE SOR=(W9N113)                                                     
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F9'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F3'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '91132',                                                +        
               LTH=5                                                            
         MFLD  (ARTIN,                                                 +        
               '+++++++++'),                                           +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (DISTIN,                                                +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KUNDIN,                                                +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (ANTIN,                                                 +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (KLASSIN,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MSGEND                                                                 
         END                                                                    
