***********************************************************************         
* CREATED BY PC28439   ON 93/11/19  AT 07:33                                    
***********************************************************************         
         PRINT ON,NOGEN                                                         
         ALPHA 'abcdefghijklmnopqrstuvwxyz â{àáã}çñ`êëèíîïìßÂ#ÀÁÃ$ÇÑöø\+        
               ÊËÈÍÎÏÌéØ«»ðýþ±°ªºæ¸Æ]µü¡¿ÐÝÞ®¢£¥·©[¶¼½¾¬|¯¨´×ä­ô¦òóõå¹û+        
               ~ùúÿÉ÷²Ô@ÒÓÕ³ÛÜÙÚŸ'                                              
         TITLE 'BASIC STOCK MARKET QUE          '                               
W9N121   FMT                                                                    
         DEV   TYPE=(3270,2),                                          +        
               FEAT=IGNORE,                                            +        
               SYSMSG=FSYSMSG,                                         +        
               DSCA=X'0080',                                           +        
               PFK=(FLDPFK,                                            +        
               1='W0T551U ',                                           +        
               2='W0T501  ',                                           +        
               3='W0T501  ',                                           +        
               4='W0T501  ',                                           +        
               5='W0T501  ',                                           +        
               6='W0T501  ',                                           +        
               7='W9T121 7',                                           +        
               8='W9T121 8',                                           +        
               9='W0T791  ',                                           +        
               10='WHELP   ',                                          +        
               11='W0T501  ',                                          +        
               12='/RCL.   ',                                          +        
               13='W9T121  ',                                          +        
               14='W9T122  ',                                          +        
               15='W0T501  ',                                          +        
               16='W0T501  ',                                          +        
               17='W0T501  ',                                          +        
               18='W0T501  ',                                          +        
               19='W0T501  ',                                          +        
               20='W0T501  ',                                          +        
               21='W0T501  ',                                          +        
               22='WHELP   ',                                          +        
               23='W0T501  ',                                          +        
               24='/RCL.   ')                                                   
         DIV   TYPE=INOUT                                                       
DGI00001 DPAGE CURSOR=((2,7)),                                         +        
               FILL=NONE                                                        
FLD0102  DFLD  POS=(1,2),LTH=1,                                        +        
               ATTR=(NOPROT,MOD)                                                
FLD0104  DFLD  POS=(1,4),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0106  DFLD  POS=(1,6),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
FLD0108  DFLD  POS=(1,8),LTH=1,                                        +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'BASIC STOCK MARKET QUEUE',                             +        
               POS=(1,10),LTH=24,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD0141  DFLD  POS=(1,41),LTH=40,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'Proj',                                                 +        
               POS=(2,2),LTH=4,                                        +        
               ATTR=(NUM,PROT)                                                  
FLD0207  DFLD  POS=(2,7),LTH=4,                                        +        
               ATTR=(NOPROT)                                                    
         DFLD  'Market Code',                                          +        
               POS=(2,12),LTH=11,                                      +        
               ATTR=(NUM,PROT)                                                  
FLD0224  DFLD  POS=(2,24),LTH=6,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'Lang.Code',                                            +        
               POS=(2,32),LTH=9,                                       +        
               ATTR=(PROT)                                                      
FLD0242  DFLD  POS=(2,42),LTH=3,                                       +        
               ATTR=(NOPROT)                                                    
         DFLD  'SR',                                                   +        
               POS=(2,47),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD0250  DFLD  POS=(2,50),LTH=1,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'SR',                                                   +        
               POS=(2,53),LTH=2,                                       +        
               ATTR=(PROT)                                                      
FLD0256  DFLD  POS=(2,56),LTH=1,                                       +        
               ATTR=(NUM,NOPROT)                                                
         DFLD  'Prod.GRP',                                             +        
               POS=(2,60),LTH=8,                                       +        
               ATTR=(PROT)                                                      
FLD0269  DFLD  POS=(2,69),LTH=2,                                       +        
               ATTR=(NOPROT)                                                    
FLD0307  DFLD  POS=(3,7),LTH=4,                                        +        
               ATTR=(PROT,MOD)                                                  
FLD0324  DFLD  POS=(3,24),LTH=6,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0342  DFLD  POS=(3,42),LTH=3,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0350  DFLD  POS=(3,50),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0356  DFLD  POS=(3,56),LTH=1,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0369  DFLD  POS=(3,69),LTH=2,                                       +        
               ATTR=(PROT,MOD)                                                  
FLD0402  DFLD  POS=(4,2),LTH=9,                                        +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0412  DFLD  POS=(4,12),LTH=9,                                       +        
               ATTR=(NUM,PROT,NODISP,MOD)                                       
FLD0425  DFLD  POS=(4,25),LTH=4,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
FLD0435  DFLD  POS=(4,35),LTH=4,                                       +        
               ATTR=(PROT,NODISP,MOD)                                           
         DFLD  'Func',                                                 +        
               POS=(5,46),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Prod',                                                 +        
               POS=(5,62),LTH=4,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'Mark  Back',                                           +        
               POS=(5,71),LTH=10,                                      +        
               ATTR=(PROT)                                                      
         DFLD  'S  Partnumber    Description',                         +        
               POS=(6,2),LTH=28,                                       +        
               ATTR=(PROT)                                                      
         DFLD  'GRP  Last-date  GRP  SR Note Queue',                   +        
               POS=(6,47),LTH=34,                                      +        
               ATTR=(PROT)                                                      
COL0207  DFLD  POS=(7,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
COL0407  DFLD  POS=(7,4),LTH=11,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
MODRAD1  DFLD  POS=(7,19),LTH=61,                                      +        
               ATTR=(PROT)                                                      
COL0208  DFLD  POS=(8,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
COL0408  DFLD  POS=(8,4),LTH=11,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
MODRAD2  DFLD  POS=(8,19),LTH=61,                                      +        
               ATTR=(PROT)                                                      
COL0209  DFLD  POS=(9,2),LTH=1,                                        +        
               ATTR=(NOPROT)                                                    
COL0409  DFLD  POS=(9,4),LTH=11,                                       +        
               ATTR=(NUM,PROT,MOD)                                              
MODRAD3  DFLD  POS=(9,19),LTH=61,                                      +        
               ATTR=(PROT)                                                      
COL0210  DFLD  POS=(10,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0410  DFLD  POS=(10,4),LTH=11,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
MODRAD4  DFLD  POS=(10,19),LTH=61,                                     +        
               ATTR=(PROT)                                                      
COL0211  DFLD  POS=(11,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0411  DFLD  POS=(11,4),LTH=11,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
MODRAD5  DFLD  POS=(11,19),LTH=61,                                     +        
               ATTR=(PROT)                                                      
COL0212  DFLD  POS=(12,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0412  DFLD  POS=(12,4),LTH=11,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
MODRAD6  DFLD  POS=(12,19),LTH=61,                                     +        
               ATTR=(PROT)                                                      
COL0213  DFLD  POS=(13,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0413  DFLD  POS=(13,4),LTH=11,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
MODRAD7  DFLD  POS=(13,19),LTH=61,                                     +        
               ATTR=(PROT)                                                      
COL0214  DFLD  POS=(14,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0414  DFLD  POS=(14,4),LTH=11,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
MODRAD8  DFLD  POS=(14,19),LTH=61,                                     +        
               ATTR=(PROT)                                                      
COL0215  DFLD  POS=(15,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0415  DFLD  POS=(15,4),LTH=11,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
MODRAD9  DFLD  POS=(15,19),LTH=61,                                     +        
               ATTR=(PROT)                                                      
COL0216  DFLD  POS=(16,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0416  DFLD  POS=(16,4),LTH=11,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
MODRAD10 DFLD  POS=(16,19),LTH=61,                                     +        
               ATTR=(PROT)                                                      
COL0217  DFLD  POS=(17,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0417  DFLD  POS=(17,4),LTH=11,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
MODRAD11 DFLD  POS=(17,19),LTH=61,                                     +        
               ATTR=(PROT)                                                      
COL0218  DFLD  POS=(18,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0418  DFLD  POS=(18,4),LTH=11,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
MODRAD12 DFLD  POS=(18,19),LTH=61,                                     +        
               ATTR=(PROT)                                                      
COL0219  DFLD  POS=(19,2),LTH=1,                                       +        
               ATTR=(NOPROT)                                                    
COL0419  DFLD  POS=(19,4),LTH=11,                                      +        
               ATTR=(NUM,PROT,MOD)                                              
MODRAD13 DFLD  POS=(19,19),LTH=61,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '13 BAS.ST. MARK.QUE.14 BAS.ST.MARK.QUANT.  16',        +        
               POS=(21,2),LTH=45,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '1 INFO-HLP',                                           +        
               POS=(21,66),LTH=10,                                     +        
               ATTR=(PROT)                                                      
         DFLD  '18',                                                   +        
               POS=(22,2),LTH=2,                                       +        
               ATTR=(PROT)                                                      
         DFLD  '19',                                                   +        
               POS=(22,22),LTH=2,                                      +        
               ATTR=(PROT)                                                      
         DFLD  '9 BASIC STOCK LIST 10 WHELP',                          +        
               POS=(22,46),LTH=27,                                     +        
               ATTR=(PROT)                                                      
FLD2302  DFLD  POS=(23,2),LTH=55,                                      +        
               ATTR=(PROT,HI)                                                   
         DFLD  'VCAS',                                                 +        
               POS=(23,59),LTH=4,                                      +        
               ATTR=(PROT)                                                      
FLD2364  DFLD  POS=(23,64),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FLD2373  DFLD  POS=(23,73),LTH=8,                                      +        
               ATTR=(PROT)                                                      
FSYSMSG  DFLD  POS=(24,2),LTH=79,                                      +        
               ATTR=(NUM,PROT,HI)                                               
         FMTEND                                                                 
W9O121N1 MSG   TYPE=OUTPUT,                                            +        
               SOR=(W9N121,IGNORE),                                    +        
               OPT=2,                                                  +        
               NXT=W9I121N1,                                           +        
               FILL=PT                                                          
DGIMOD02 LPAGE SOR=DGI00001                                                     
         SEG                                                                    
         MFLD  FLD0102,                                                +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1                                                            
         MFLD  FLD0106,                                                +        
               LTH=1                                                            
         MFLD  FLD0108,                                                +        
               LTH=1                                                            
         MFLD  FLD0141,                                                +        
               LTH=40                                                           
         MFLD  FLD0207,                                                +        
               LTH=2                                                            
         MFLD  FLD0307,                                                +        
               LTH=4                                                            
         MFLD  FLD0224,                                                +        
               LTH=2                                                            
         MFLD  FLD0324,                                                +        
               LTH=6                                                            
         MFLD  FLD0242,                                                +        
               LTH=2                                                            
         MFLD  FLD0342,                                                +        
               LTH=3                                                            
         MFLD  FLD0250,                                                +        
               LTH=2                                                            
         MFLD  FLD0350,                                                +        
               LTH=1                                                            
         MFLD  FLD0256,                                                +        
               LTH=2                                                            
         MFLD  FLD0356,                                                +        
               LTH=1                                                            
         MFLD  FLD0269,                                                +        
               LTH=2                                                            
         MFLD  FLD0369,                                                +        
               LTH=2                                                            
         MFLD  FLD0402,                                                +        
               LTH=9                                                            
         MFLD  FLD0412,                                                +        
               LTH=9                                                            
         MFLD  FLD0425,                                                +        
               LTH=4                                                            
         MFLD  FLD0435,                                                +        
               LTH=4                                                            
         MFLD  COL0207,                                                +        
               LTH=1                                                            
         MFLD  COL0407,                                                +        
               LTH=11                                                           
         MFLD  MODRAD1,                                                +        
               LTH=61                                                           
         MFLD  COL0208,                                                +        
               LTH=1                                                            
         MFLD  COL0408,                                                +        
               LTH=11                                                           
         MFLD  MODRAD2,                                                +        
               LTH=61                                                           
         MFLD  COL0209,                                                +        
               LTH=1                                                            
         MFLD  COL0409,                                                +        
               LTH=11                                                           
         MFLD  MODRAD3,                                                +        
               LTH=61                                                           
         MFLD  COL0210,                                                +        
               LTH=1                                                            
         MFLD  COL0410,                                                +        
               LTH=11                                                           
         MFLD  MODRAD4,                                                +        
               LTH=61                                                           
         MFLD  COL0211,                                                +        
               LTH=1                                                            
         MFLD  COL0411,                                                +        
               LTH=11                                                           
         MFLD  MODRAD5,                                                +        
               LTH=61                                                           
         MFLD  COL0212,                                                +        
               LTH=1                                                            
         MFLD  COL0412,                                                +        
               LTH=11                                                           
         MFLD  MODRAD6,                                                +        
               LTH=61                                                           
         MFLD  COL0213,                                                +        
               LTH=1                                                            
         MFLD  COL0413,                                                +        
               LTH=11                                                           
         MFLD  MODRAD7,                                                +        
               LTH=61                                                           
         MFLD  COL0214,                                                +        
               LTH=1                                                            
         MFLD  COL0414,                                                +        
               LTH=11                                                           
         MFLD  MODRAD8,                                                +        
               LTH=61                                                           
         MFLD  COL0215,                                                +        
               LTH=1                                                            
         MFLD  COL0415,                                                +        
               LTH=11                                                           
         MFLD  MODRAD9,                                                +        
               LTH=61                                                           
         MFLD  COL0216,                                                +        
               LTH=1                                                            
         MFLD  COL0416,                                                +        
               LTH=11                                                           
         MFLD  MODRAD10,                                               +        
               LTH=61                                                           
         MFLD  COL0217,                                                +        
               LTH=1                                                            
         MFLD  COL0417,                                                +        
               LTH=11                                                           
         MFLD  MODRAD11,                                               +        
               LTH=61                                                           
         MFLD  COL0218,                                                +        
               LTH=1                                                            
         MFLD  COL0418,                                                +        
               LTH=11                                                           
         MFLD  MODRAD12,                                               +        
               LTH=61                                                           
         MFLD  COL0219,                                                +        
               LTH=1                                                            
         MFLD  COL0419,                                                +        
               LTH=11                                                           
         MFLD  MODRAD13,                                               +        
               LTH=61                                                           
         MFLD  FLD2302,                                                +        
               LTH=55                                                           
         MFLD  (FLD2364,                                               +        
               DATE4)                                                           
         MFLD  (FLD2373,                                               +        
               TIME)                                                            
         MFLD  (FSYSMSG,                                               +        
               ' '),                                                   +        
               LTH=1                                                            
         MSGEND                                                                 
W9I121N1 MSG   TYPE=INPUT,                                             +        
               SOR=(W9N121),                                           +        
               OPT=2,                                                  +        
               NXT=W9O121N1                                                     
DGIMID03 LPAGE SOR=(DGI00001)                                                   
         SEG                                                                    
         MFLD  FLDPFK,                                                 +        
               LTH=8,                                                  +        
               FILL=NULL                                                        
         MFLD  'W',                                                    +        
               LTH=1                                                            
         MFLD  FLD0102,                                                +        
               LTH=1,                                                  +        
               FILL=X'F9'                                                       
         MFLD  'T',                                                    +        
               LTH=1                                                            
         MFLD  FLD0104,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  FLD0106,                                                +        
               LTH=1,                                                  +        
               FILL=X'F2'                                                       
         MFLD  FLD0108,                                                +        
               LTH=1,                                                  +        
               FILL=X'F1'                                                       
         MFLD  '  ',                                                   +        
               LTH=2                                                            
         MFLD  '91212',                                                +        
               LTH=5                                                            
         MFLD  (FLD0207,                                               +        
               '++++'),                                                +        
               LTH=4,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLD0307,                                                +        
               LTH=4,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0224,                                               +        
               '++++++'),                                              +        
               LTH=6,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLD0324,                                                +        
               LTH=6,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0242,                                               +        
               '+++'),                                                 +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  FLD0342,                                                +        
               LTH=3,                                                  +        
               FILL=X'40'                                                       
         MFLD  (FLD0250,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0350,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0256,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0356,                                                +        
               LTH=1,                                                  +        
               FILL=X'F0'                                                       
         MFLD  (FLD0269,                                               +        
               '++'),                                                  +        
               LTH=2,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0369,                                                +        
               LTH=2,                                                  +        
               FILL=X'F0'                                                       
         MFLD  FLD0402,                                                +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0412,                                                +        
               LTH=9,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0425,                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  FLD0435,                                                +        
               LTH=4,                                                  +        
               JUST=R,                                                 +        
               FILL=X'F0'                                                       
         MFLD  (COL0207,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0407,                                                +        
               LTH=9,                                                  +        
               JUST=L,                                                 +        
               FILL=X'4E'                                                       
         MFLD  (COL0208,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0408,                                                +        
               LTH=9,                                                  +        
               JUST=L,                                                 +        
               FILL=X'4E'                                                       
         MFLD  (COL0209,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0409,                                                +        
               LTH=9,                                                  +        
               JUST=L,                                                 +        
               FILL=X'4E'                                                       
         MFLD  (COL0210,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0410,                                                +        
               LTH=9,                                                  +        
               JUST=L,                                                 +        
               FILL=X'4E'                                                       
         MFLD  (COL0211,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0411,                                                +        
               LTH=9,                                                  +        
               JUST=L,                                                 +        
               FILL=X'4E'                                                       
         MFLD  (COL0212,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0412,                                                +        
               LTH=9,                                                  +        
               JUST=L,                                                 +        
               FILL=X'4E'                                                       
         MFLD  (COL0213,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0413,                                                +        
               LTH=9,                                                  +        
               JUST=L,                                                 +        
               FILL=X'4E'                                                       
         MFLD  (COL0214,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0414,                                                +        
               LTH=9,                                                  +        
               JUST=L,                                                 +        
               FILL=X'4E'                                                       
         MFLD  (COL0215,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0415,                                                +        
               LTH=9,                                                  +        
               JUST=L,                                                 +        
               FILL=X'4E'                                                       
         MFLD  (COL0216,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0416,                                                +        
               LTH=9,                                                  +        
               JUST=L,                                                 +        
               FILL=X'4E'                                                       
         MFLD  (COL0217,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0417,                                                +        
               LTH=9,                                                  +        
               JUST=L,                                                 +        
               FILL=X'4E'                                                       
         MFLD  (COL0218,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0418,                                                +        
               LTH=9,                                                  +        
               JUST=L,                                                 +        
               FILL=X'4E'                                                       
         MFLD  (COL0219,                                               +        
               '+'),                                                   +        
               LTH=1,                                                  +        
               FILL=X'40'                                                       
         MFLD  COL0419,                                                +        
               LTH=9,                                                  +        
               JUST=L,                                                 +        
               FILL=X'4E'                                                       
         MSGEND                                                                 
         END                                                                    
