    DSN SYSTEM(D2G0)                                                            
      RUN PROGRAM(DSNTEP2)  PLAN(DSNTEP2)                                       
    END                                                                         
