    DSN SYSTEM(D2G0)                                                            
      RUN PROGRAM(DSNTIAUL) PLAN(DSNTIAUL)                                      
    END                                                                         
