//SM02RS    JOB (61099043800),'RTN= SM02RS',                            00000010
//        CLASS=J,MSGCLASS=M,NOTIFY=S00OPER                             00000020
//*                                                                     00000030
/*ROUTE  XEQ  NJEKM                                                             
/*ROUTE  PRINT NJOKM                                                            
//RECV    EXEC PGM=BDTRECV                                                      
//SYSPRINT DD SYSOUT=*                                                          
//OUT101   DD DSN=SM02.SM02RS(+1),                                              
//         UNIT=PP,DCB=MODEL,                                                   
//         SPACE=(6233,(1000,100),RLSE),                                        
//         DISP=(NEW,CATLG,DELETE)                                              
//INP101   DD *                                                                 
