 SORT FIELDS=(5,3,CH,A,8,5,PD,A),FILSZ=E3000                            00000010
      END                                                               00000020
