 SORT FIELDS=(13,38,CH,A),EQUALS                                        00000010
      END                                                               00000020
