 SORT  FIELDS=(24,5,PD,A,270,5,PD,A)                                    00010021
 INCLUDE COND=(59,2,CH,EQ,C'11',AND,(172,1,PD,EQ,+1,OR,173,1,PD,EQ,+1)) 00040020
