 SORT FIELDS=COPY                                                               
 OUTFIL FNAMES=SORTOUT,                                                         
        INCLUDE=(5,20,CH,NE,C'¤MQMPROP Vidb_Source'),                           
        IFTHEN=(WHEN=(5,17,CH,EQ,C'¤MQMPROP LoadType'),                         
        OVERLAY=(5:C'¤DAPSSDVIPS            ')),                                
        IFTHEN=(WHEN=(5,15,CH,EQ,C'¤MQMPROP Market'),                           
        OVERLAY=(5:C'¤DAP',9:21,2,11:C'                '))                      
