 SORT FIELDS=(6,2,CH,A)                                                         
 SUM FIELDS=NONE                                                                
