 INCLUDE COND=(18,1,CH,EQ,C'N')                                                 
 SORT    FIELDS=(19,5,PD,A,1,5,PD,D)                                            
 SUM     FIELDS=NONE                                                            
