 INCLUDE COND=(5,8,CH,EQ,C'WDK712')                                             
 SORT FIELDS=(13,5,PD,A,18,2,CH,A)                                              
