 SORT FIELDS=(1,5,PD,A),EQUALS                                                  
 INCLUDE COND=(6,2,CH,EQ,C'51')                                                 
 SUM  FIELDS=(NONE)                                                             
 END                                                                            
