 OPTION COPY                                                                    
 OUTREC FIELDS=(1,23,24:28,313)                                                 
