 INCLUDE COND=(5,8,CH,EQ,C'WDK611')                                             
 SORT FIELDS=(13,5,PD,A)                                                        
