     INCLUDE COND=(1,8,CH,EQ,C'W116480A')                               00010019
     SORT    FIELDS=(1,8,CH,A)                                          00020021
