 INCLUDE COND=(5,3,CH,EQ,C'211')                                                
 SORT FIELDS=(8,5,PD,A)                                                         
