 SORT FIELDS=(1,5,PD,A)                                                *00000010
               FILSZ=E10000                                             00000020
      END                                                               00000030
