 SORT FIELDS=(6,7,CH,A,19,15,CH,A)                                      00021015
 INCLUDE COND=(1,3,CH,EQ,C'Q9A')                                        00030015
