 SORT FIELDS=(6,3,PD,A,1,5,PD,A)                                        00000010
 END                                                                    00000030
