 SORT FIELDS=(6,5,CH,A,11,2,ZD,A,15,1,PD,A,57,8,CH,A,1,5,PD,A)          00000010
 END                                                                    00000030
