 SORT FIELDS=(4,5,CH,A),FILSZ=E200                                      00000010
      END                                                               00000020
