 OPTION Y2PAST=1950                                                     00000010
 SORT FIELDS=(1,3,CH,A,4,2,Y2C,A,6,2,CH,A                            *  00000010
              8,2,Y2C,A,10,2,CH,A),FILSZ=E1000                          00000010
      END                                                               00000020
