     SORT FIELDS=(1,5,CH,A,6,2,CH,A,8,3,ZD,A),EQUALS                            
     INCLUDE COND=(6,2,CH,EQ,C'11')                                             
