 SORT FIELDS=(1,10,CH,A),FILSZ=E1000                                    00000010
      END                                                               00000020
