 SORT FIELDS=(1,3,CH,A)                                                 00000010
      END                                                               00000020
