 SORT FIELDS=(3,5,CH,A,1,2,CH,A,8,5,PD,A)                                       
 END                                                                            
