 SORT FIELDS=(1,9,CH,A,10,5,CH,A),                                      0000000 
      EQUALS                                                            0000000 
      END                                                               0000000 
