     SORT FIELDS=(1,5,PD,A,6,2,CH,A),EQUALS                                     
     INCLUDE COND=(6,1,CH,EQ,C'7',OR,                                           
                   6,1,CH,EQ,C'4')                                              
