 SORT FIELDS=(5,2,CH,A,7,5,PD,A,12,2,PD,A)                                      
 SUM  FIELDS=(NONE)                                                             
 END                                                                            
