 SORT FIELDS=(1,5,PD,A,6,2,CH,A),FILSZ=E3000                            00000010
      END                                                               00000020
