 SORT FIELDS=(6,2,CH,A,1,5,PD,A),FILSZ=E3000                                    
      END                                                                       
