 OPTION Y2PAST=1950                                                             
 SORT FIELDS=(4,5,PD,A,9,2,CH,A,                                      *         
              11,5,CH,A,16,2,Y2P,A,17,2,PD,A),FILSZ=E10000                      
