      SORT     FIELDS=(5,2,CH,A,9,5,CH,A),                             *00000010
               FILSZ=E2500,EQUALS                                       00000020
      END                                                               00000030
