 OPTION Y2PAST=1950                                                             
 SORT FIELDS=(4,5,PD,A,9,5,CH,A,14,2,Y2P,A,15,2,PD,A),FILSZ=E10000              
