 SORT    FIELDS=(19,5,PD,A)                                                     
 SUM     FIELDS=NONE                                                            
