 SORT FIELDS=(1,5,PD,A,6,2,CH,A),EQUALS                                         
     INCLUDE COND=(6,2,CH,EQ,C'41',OR,                                          
                   6,2,CH,EQ,C'61',OR,                                          
                   6,2,CH,EQ,C'62',OR,                                          
                   6,2,CH,EQ,C'67',OR,                                          
                   6,2,CH,EQ,C'71',OR,                                          
                   6,2,CH,EQ,C'72')                                             
