 SORT    FIELDS=(6,5,PD,A)                                                      
 SUM     FIELDS=NONE                                                            
