 INCLUDE COND=(46,2,CH,EQ,C'  ')                                                
 SORT FIELDS=COPY                                                               
