 SORT FIELDS=(1,5,PD,A,6,2,CH,A)                                                
 INCLUDE COND=(8,1,CH,NE,C'7')                                                  
