 SORT FIELDS=(1,5,PD,A,6,2,CH,A)                                                
 INCLUDE COND=(6,1,CH,EQ,C'4',OR,6,1,CH,EQ,C'5',                                
               OR,6,1,CH,EQ,C'6',OR,6,1,CH,EQ,C'7',                             
               OR,6,1,CH,EQ,C'8')                                               
