 SORT FIELDS=(1,8,CH,A,9,8,CH,A,17,4,PD,A,33,2,PD,A,74,5,PD,D),       * 0000000 
         FILSZ=E10000                                                   0000000 
