*      SORTBEGREPP       SORTERAS FÖR S&T                                       
*        IDARTNR                                                                
*        TIFSGVV                                                                
*        IDDISTR                                                                
*                                                                               
 SORT FIELDS=(1,9,CH,A,10,6,CH,A,16,5,CH,A)                             0000000 
 END                                                                            
