 SORT FIELDS=(1,8,CH,A,9,8,CH,A,17,4,PD,A,                            * 0000000 
           29,3,CH,A)                                                   0000000 
