*      SORTBEGREPP                                                              
*        IDARTNR                                                                
*                                                                               
 SORT FIELDS=(27,9,CH,A)                                                0000000 
 END                                                                            
