 SORT FIELDS=(1,9,CH,A)                                               *         
 SUM FIELDS=NONE                                                                
 END                                                                            
