 SORT FIELDS=(1,9,CH,A,10,3,PD,A)                                       0000000 
 SUM FIELDS=NONE                                                        0000000 
