 SORT FIELDS=(1,5,PD,A,6,4,CH,A,10,4,PD,A)                                      
 SUM  FIELDS=NONE                                                               
 END                                                                            
