 SORT FIELDS=(47,2,PD,A,21,3,PD,A,15,3,CH,D,18,3,PD,A,43,4,PD,A,36,3,  *        
              PD,A)                                                             
