 SORT FIELDS=(1,6,CH,A,21,3,PD,A,18,3,PD,A,47,2,PD,A,15,3,CH,A,         00000010
              43,4,PD,A,39,4,PD,A,24,5,PD,A),FILSZ=E100000              00000010
