 SORT FIELDS=(6,2,CH,A),EQUALS                                                  
 INCLUDE COND=(6,2,CH,EQ,C'1A',OR,                                              
               6,2,CH,EQ,C'1B',OR,                                              
               6,2,CH,EQ,C'1C',OR,                                              
               6,2,CH,EQ,C'1D',OR,                                              
               6,2,CH,EQ,C'1E',OR,                                              
               6,2,CH,EQ,C'1F',OR,                                              
               6,2,CH,EQ,C'1G',OR,                                              
               6,2,CH,EQ,C'21',OR,                                              
               6,2,CH,EQ,C'24',OR,                                              
               6,2,CH,EQ,C'25',OR,                                              
               6,2,CH,EQ,C'26',OR,                                              
               6,2,CH,EQ,C'3A',OR,                                              
               6,2,CH,EQ,C'3B',OR,                                              
               6,2,CH,EQ,C'3C',OR,                                              
               6,2,CH,EQ,C'3E',OR,                                              
               6,2,CH,EQ,C'3G',OR,                                              
               6,2,CH,EQ,C'3H',OR,                                              
               6,2,CH,EQ,C'3J',OR,                                              
               6,2,CH,EQ,C'3K',OR,                                              
               6,2,CH,EQ,C'3L',OR,                                              
               6,2,CH,EQ,C'3M',OR,                                              
               6,2,CH,EQ,C'3N',OR,                                              
               6,2,CH,EQ,C'3O',OR,                                              
               6,2,CH,EQ,C'3P',OR,                                              
               6,2,CH,EQ,C'3R',OR,                                              
               6,2,CH,EQ,C'3S',OR,                                              
               6,2,CH,EQ,C'3T')                                                 
