     SORT      FIELDS=(12,3,PD,A,                                      *00001000
               15,4,PD,A,                                              *00001100
               19,10,CH,A,                                             *00001200
               5,3,CH,A,                                               *00001300
               31,5,CH,A)                                               00002000
