  SORT FIELDS=COPY                                                              
  OUTFIL FNAMES=SORTOF01,INCLUDE=(39,1,CH,EQ,C'8')                              
  OUTFIL FNAMES=SORTOF02,INCLUDE=(39,1,CH,NE,C'8')                              
