 SORT FIELDS=(4,4,ZD,A,8,6,ZD,A,14,7,ZD,A,23,7,ZD,A,36,9,ZD,A,         *        
              45,5,ZD,A,1,3,CH,A)                                               
