 OPTION Y2PAST=1950                                                     00000010
 SORT FIELDS=(6,5,PD,A,24,2,Y2P,A,25,3,PD,A)                            00000010
 END                                                                    00000030
