     OPTION VLSCMP                                                              
     SORT FIELDS=COPY                                                           
     INCLUDE COND=((3,2,SS,EQ,C'41,42,43,44,45,46,47,51,CA'),                   
               OR,(3,1,SS,EQ,C'1,2,3'))                                         
