 OPTION Y2PAST=1950                                                     0000000 
 SORT FIELDS=(5,8,CH,A,13,2,Y2P,D,14,2,PD,D,16,7,CH,A),                 0000000 
            FILSZ=E100000                                               0000000 
