     SORT FIELDS=(6,2,CH,A,1,5,PD,A),EQUALS                                     
     INCLUDE COND=(6,2,CH,EQ,C'41',OR,                                          
                   6,2,CH,EQ,C'43',OR,                                          
                   6,2,CH,EQ,C'44',OR,                                          
                   6,2,CH,EQ,C'45',OR,                                          
                   6,2,CH,EQ,C'46',OR,                                          
                   6,2,CH,EQ,C'47',OR,                                          
                   6,2,CH,EQ,C'51',OR,                                          
                   6,2,CH,EQ,C'92',OR,                                          
                   6,1,CH,EQ,C'7')                                              
