 OPTION Y2PAST=1950                                                     0000000 
 SORT FIELDS=(5,3,CH,A,8,2,CH,A,10,2,Y2P,A,11,3,PD,A,                   0000000 
             14,2,Y2P,A,15,3,PD,A,18,2,Y2P,A,19,3,PD,A),                0000000 
             FILSZ=E100000                                              0000000 
