 SORT FIELDS=(1,3,PD,A,4,4,PD,A)                                                
 SUM  FIELDS=NONE                                                               
 END                                                                            
