  OPTION Y2PAST=1950                                                            
  SORT FIELDS=(66,2,CH,A,24,5,PD,A,112,2,PD,A,148,2,Y2P,A,                      
               149,3,PD,A)                                                      
