 SORT FIELDS=(4,3,PD,A,1,3,CH,A),FILSZ=E10000                           00000010
 END                                                                    00000020
