 SORT FIELDS=(13,9,A,86,1,A,58,4,A,87,1,A,3,4,D,7,6,A,53,5,A,1,2,A),    00000010
               FORMAT=CH,FILSZ=E3000                                    00000020
