  SORT FIELDS=(60,4,PD,A,49,3,PD,A,52,4,PD,A,56,4,PD,A,  *              00010016
               4,4,PD,A)                                                00020017
