  SORT FIELDS=(10,8,CH,A,6,4,PD,A,29,4,PD,A,33,4,PD,A,    *             00030018
               37,3,PD,A,18,7,CH,A,48,9,CH,A)                           00050018
