  SORT FIELDS=(1,4,PD,A,5,3,PD,A,8,4,PD,A,12,4,PD,A,  *                 00010017
               16,4,PD,A,23,5,CH,A,20,3,PD,A,28,3,CH,A)                 00020018
