   SORT FIELDS=(9,7,CH,A,16,3,PD,A,19,4,PD,A,23,2,CH,A, *                       
                25,4,PD,A,29,3,PD,A,5,4,CH,A)                                   
