    SORT FIELDS=(16,3,PD,A,19,4,PD,A,23,10,CH,A,5,2,CH,A,     *                 
               7,4,PD,A,11,2,PD,A)                                              
