* SORTFÄLT    IDDC                                                              
 SORT FIELDS=(1,2,CH,A)                                                 0000000 
