 SORT FIELDS=(4,4,PD,A,10,4,PD,A,14,2,PD,A),                            0000000 
 FILSZ=E5000                                                            0000000 
