* SORTFÄLTEN  IDDISTR,  IDKUNDNR, IDKUNDRF,  IDPRODNR  IDSEGM.                  
 SORT FIELDS=(11,3,PD,A,14,4,PD,A,18,10,CH,A,28,4,PD,A,5,6,CH,A),       0000000 
 FILSZ=E2000000                                                         0000000 
