 SORT  FIELDS=(1,5,CH,A,38,4,CH,A,33,5,CH,A)                            0000000 
 INCLUDE COND=(52,1,CH,EQ,C'R')                                         0000000 
