 SORT FIELDS=(3,3,PD,A,1,2,CH,A,20,2,CH,A)                                      
 SUM FIELDS=NONE                                                                
