 SORT FIELDS=(3,3,PD,A,6,4,PD,A,10,10,CH,A,     *                               
               1,2,CH,A,20,4,PD,A,24,2,PD,A)                                    
 INCLUDE COND=(1,2,CH,NE,C'11')                                                 
 END                                                                            
