 SORT FIELDS=(1,16,CH,A)                                                        
 SUM FIELDS=NONE                                                                
