 SORT FIELDS=(5,3,PD,A),                                                0000000 
 FILSZ=E5000                                                            0000000 
