     INCLUDE COND=(6,1,PD,EQ,+1)                                        00010000
     OPTION COPY                                                        00020000
