 SORT FIELDS=(24,10,CH,A,9,3,CH,A,12,3,CH,A,15,3,CH,A,34,9,CH,A),       00010011
 FILSZ=E250000                                                          00020009
