** SORT ON THE IDARTNR AND IDDC                                                 
 SORT FIELDS=(7,5,PD,A,5,2,CH,A)                                                
