 SORT FIELDS=COPY                                                               
 OUTFIL FNAMES=(SORTOF1,SORTOF2,SORTOF3),SPLITBY=125000                         
