     SORT      FIELDS=(1,5,PD,A),                                       00001004
 FILSZ=E30000                                                           00002005
