** SORT ON THE IDDC AND IDARTNR                                                 
** COPYTEXT IS W56131                                                           
     SORT FIELDS=(3,2,CH,A,25,5,PD,A)                                           
