 SORT FIELDS=(1,5,PD,A,6,2,CH,A,8,5,CH,A)                                       
 SUM FIELDS=NONE                                                                
