 SORT FIELDS=(20,4,CH,A,30,8,ZD,A,87,10,CH,A,290,3,CH,A,                        
              99,6,CH,A,                                                        
              105,5,CH,D,112,2,PD,A)                                            
 INCLUDE COND=(20,4,CH,EQ,C'TW01')                                              
