 SORT FIELDS=(20,4,CH,A,30,8,ZD,A,87,10,CH,A,99,11,CH,A,112,2,PD,A)             
 INCLUDE COND=(20,4,CH,EQ,C'W570')                                              
