 OPTION ZDPRINT                                                                 
 SORT FIELDS=(4,4,CH,A,18,16,CH,A,36,10,CH,A,176,18,CH,A,                       
              34,2,CH,A,128,10,CH,A,138,10,CH,A,                                
              148,12,CH,A)                                                      
 SUM FIELDS=(47,15,ZD,63,15,ZD)                                                 
 OUTFIL FNAMES=VBOUT,FTOV,OUTREC=(1,751)                                        
