 SORT FIELDS=COPY                                                               
 INCLUDE COND=(5,3,CH,EQ,C'200',OR,5,3,CH,EQ,C'300',OR,                         
            5,3,CH,EQ,C'600')                                                   
 OMIT COND=(24,5,CH,EQ,C'     ')                                                
