 SORT FIELDS=(5,300,CH,A)                                                       
 SUM FIELDS=NONE                                                                
 OPTION VLSHRT                                                                  
