 SORT FIELDS=(1,5,PD,A)                                                         
 SUM FIELDS=NONE                                                                
