 OPTION COPY                                                                    
 OUTREC FIELDS=(1,4,5:6)                                                        
