 SORT FIELDS=(16,5,PD,A,14,2,CH,A,6,3,PD,D)                             00000010
 END                                                                    00000030
