 SORT   FIELDS=(12,5,PD,A,17,3,PD,A,3,4,PD,A,7,5,PD,A)                  00010000
 INCLUDE COND=(1,2,CH,EQ,C'11')                                         00020000
