 SORT FIELDS=(16,2,CH,A,14,2,CH,A,18,4,PD,A,26,10,PD,A,           *     ,A)     
              22,4,PD,A,36,3,PD,A,62,1,PD,A)                            ,A)     
