     SORT FIELDS=COPY,EQUALS                                                    
     INCLUDE COND=(6,2,CH,EQ,C'61',OR,                                          
                   6,2,CH,EQ,C'62')                                             
