     SORT FIELDS=(6,2,CH,A,1,5,PD,A),EQUALS                                     
     INCLUDE COND=(6,1,CH,EQ,C'4',OR,                                           
                   6,2,CH,EQ,C'51',OR,                                          
                   6,2,CH,EQ,C'52',OR,                                          
                   6,2,CH,EQ,C'53',OR,                                          
                   6,2,CH,EQ,C'86',OR,                                          
                   6,2,CH,EQ,C'92',OR,                                          
                   6,2,CH,EQ,C'CA',OR,                                          
                   6,1,CH,EQ,C'1',OR,                                           
                   6,1,CH,EQ,C'2',OR,                                           
                   6,1,CH,EQ,C'3')                                              
