 SORT FIELDS=(6,2,CH,A,50,2,PD,A)                                               
 OMIT COND=(6,1,CH,EQ,C'7')                                                     
