     SORT FIELDS=(6,2,CH,A,1,5,PD,A),EQUALS                                     
     INCLUDE COND=(6,2,SS,EQ,C'61,62,63,64,65,66,67,71,72,73,74,87,93')         
