   SORT FIELDS=(5,2,CH,A,7,2,CH,A,26,5,PD,A)                                    
   OMIT COND=(5,2,CH,EQ,C'  ')                                                  
