 SORT FIELDS=(6,2,CH,A,1,5,PD,A)                                                
 INCLUDE COND=(6,2,CH,EQ,C'53',OR,                                              
               6,2,CH,EQ,C'87')                                                 
