 SORT   FIELDS=(1,2,PD,A)                                                       
 OUTFIL FILES=01,INCLUDE=(3,2,CH,EQ,C'11')                                      
 OUTFIL FILES=02,INCLUDE=(3,1,CH,EQ,C'7')                                       
