 /*      VSAM-DEFINITION AV W6D1C                                     */        
 DELETE  (WG01.QASE.W6D1CK)                                                     
 /*                                                          */                 
 DEFINE  CLUSTER                                 -                              
         (NAME (WG01.QASE.W6D1CK)                -                              
          MGMTCLAS(TP0) DATACLAS(MVOL)           -                              
          UNIQUE                                 -                              
          CYL (35 5)                             -                              
          IMBED                                  -                              
          SPEED                                  -                              
          FREESPACE (20 05)                      -                              
          SHAREOPTIONS (3 3)                     -                              
          INDEXED KEYS (39,5)                    -                              
          RECORDSIZE (44,44))                    -                              
 DATA    (CISZ (4096)                            -                              
          NAME (WG01.QASE.W6D1CK.DATA))          -                              
 INDEX   (CISZ (8192)                            -                              
          NAME (WG01.QASE.W6D1CK.INDEX))                                        
 /*                                                                   */        
