 /*      VSAM-DEFINITION AV W6D1H                                     */        
 DELETE  (WG01.QASE.W6D1HK)                                                     
 /*                                                          */                 
 DEFINE  CLUSTER                                 -                              
         (NAME (WG01.QASE.W6D1HK)                -                              
          MGMTCLAS(TP0) DATACLAS(MVOL)           -                              
          UNIQUE                                 -                              
          CYL (25 1)                             -                              
          IMBED                                  -                              
          SPEED                                  -                              
          FREESPACE (20 05)                      -                              
          SHAREOPTIONS (3 3)                     -                              
          INDEXED KEYS (27,5)                    -                              
          RECORDSIZE (34,34))                    -                              
 DATA    (CISZ (4096)                            -                              
          NAME (WG01.QASE.W6D1HK.DATA))          -                              
 INDEX   (CISZ (8192)                            -                              
          NAME (WG01.QASE.W6D1HK.INDEX))                                        
 /*                                                                   */        
