 /*      VSAM-DEFINITION AV W6D1G                                     */        
 DELETE  (WG01.QASE.W6D1GK)                                                     
 /*                                                          */                 
 DEFINE  CLUSTER                                 -                              
         (NAME (WG01.QASE.W6D1GK)                -                              
          MGMTCLAS(TP0) DATACLAS(MVOL)           -                              
          UNIQUE                                 -                              
          CYL (2 1)                              -                              
          IMBED                                  -                              
          SPEED                                  -                              
          FREESPACE (10 05)                      -                              
          SHAREOPTIONS (3 3)                     -                              
          INDEXED KEYS (31,5)                    -                              
          RECORDSIZE (44,44))                    -                              
 DATA    (CISZ (4096)                            -                              
          NAME (WG01.QASE.W6D1GK.DATA))          -                              
 INDEX   (CISZ (8192)                            -                              
          NAME (WG01.QASE.W6D1GK.INDEX))                                        
 /*                                                                   */        
