 /*      VSAM-DEFINITION AV W6G3                                      */        
 DELETE (WG01.QASE.W6G3K)                                                       
 /*                                                                   */        
 DEFINE  CLUSTER                                 -                              
         (NAME (WG01.QASE.W6G3K)                 -                              
          MGMTCLAS(TP0) DATACLAS(MVOL)           -                              
          UNIQUE                                 -                              
          CYL (75 10)                            -                              
          IMBED                                  -                              
          SPEED                                  -                              
          FREESPACE (20 10)                      -                              
          SHAREOPTIONS (3 3)                     -                              
          INDEXED KEYS (27,6)                    -                              
          RECORDSIZE (240,240))                  -                              
 DATA    (CISZ (4096)                            -                              
          NAME (WG01.QASE.W6G3K.DATA))           -                              
 INDEX   (CISZ (8192)                            -                              
          NAME (WG01.QASE.W6G3K.INDEX))                                         
 /*                                                                   */        
