 /*      VSAM-DEFINITION AV W6H7C                                     */        
 DELETE  (WG01.QASE.W6H7CK)                                                     
 /*                                                                             
 DEFINE  CLUSTER                                 -                              
         (NAME (WG01.QASE.W6H7CK)                -                              
          MGMTCLAS(TP0) DATACLAS(MVOL)            -                             
          UNIQUE                                 -                              
          CYL (1 1)                              -                              
          IMBED                                  -                              
          SPEED                                  -                              
          FREESPACE (30 10)                      -                              
          SHAREOPTIONS (3 3)                     -                              
          INDEXED KEYS (18,5)                    -                              
          RECORDSIZE (24,24))                    -                              
 DATA    (CISZ (4096)                            -                              
          NAME (WG01.QASE.W6H7CK.DATA))          -                              
 INDEX   (CISZ (8192)                            -                              
          NAME (WG01.QASE.W6H7CK.INDEX))                                        
 /*                                                                   */        
