 SORT FIELDS=(8,3,A,11,4,A,15,1,A,16,2,A,18,3,A,21,2,A,23,5,A,         *00000000
             30,2,A,28,2,A),FORMAT=PD                                   00000101
      END                                                               00000300
