 SORT FIELDS=COPY                                                               
 JOINKEYS FILES=F1,FIELDS=(1,25,A,30,4,A,38,2,A,40,2,A)                         
 JOINKEYS FILES=F2,FIELDS=(1,25,A,30,4,A,38,2,A,40,2,A)                         
 JOIN UNPAIRED,F2,ONLY                                                          
 REFORMAT FIELDS=(F2:1,70)                                                      
