 SORT FIELDS=(1,8,CH,A)                                                 00010013
 SUM FIELDS=NONE                                                        00020009
 END                                                                    00030011
