 SORT FIELDS=(1,8,CH,A,39,22,CH,A)                                      00010008
 SUM FIELDS=NONE                                                        00020009
