 OPTION Y2PAST=1950                                                     00000006
 SORT FIELDS=(11,2,Y2P,A,12,3,PD,A,1,10,CH,A)                           00010006
