 /*      VSAM-DEFINITION FÖR WDA2C                                    */        
 /*                                                                   */        
 DELETE  (WG01.QASE.WDA2CK)                                                     
 /*                                                                   */        
 DEFINE  CLUSTER                                  -                             
         (NAME (WG01.QASE.WDA2CK)                 -                             
          MGMTCLAS(TP0) DATACLAS(MVOL)            -                             
          UNIQUE                                  -                             
          CYL (2 1)                               -                             
          IMBED                                   -                             
          SPEED                                   -                             
          FREESPACE (10 10)                       -                             
          SHAREOPTIONS (3 3)                      -                             
          INDEXED KEYS (43,5)                     -                             
          RECORDSIZE (54,54))                     -                             
 DATA    (CISZ (4096)                             -                             
          NAME (WG01.QASE.WDA2CK.DATA))           -                             
 INDEX   (CISZ (8192)                             -                             
          NAME (WG01.QASE.WDA2CK.INDEX))                                        
 /*                                                                   */        
