 /*      VSAM-DEFINITION FÖR WDA2D                                    */        
 /*                                                                   */        
 DELETE  (WG01.QASE.WDA2DK)                                                     
 /*                                                                   */        
 DEFINE  CLUSTER                                  -                             
         (NAME (WG01.QASE.WDA2DK)                 -                             
          MGMTCLAS(TP0) DATACLAS(MVOL)            -                             
          UNIQUE                                  -                             
          CYL (90 5)                              -                             
          IMBED                                   -                             
          SPEED                                   -                             
          FREESPACE (10 10)                       -                             
          SHAREOPTIONS (3 3)                      -                             
          INDEXED KEYS (24,5)                     -                             
          RECORDSIZE (36,36))                     -                             
 DATA    (CISZ (4096)                             -                             
          NAME (WG01.QASE.WDA2DK.DATA))           -                             
 INDEX   (CISZ (8192)                             -                             
          NAME (WG01.QASE.WDA2DK.INDEX))                                        
 /*                                                                   */        
