 /*      VSAM-DEFINITION AV WDA3:S                                    */        
 /*      SEKUNDÄRA INDEX WDA3A                                        */        
 DELETE  (WG01.QASE.WDA3DK)                                                     
 /*                                                                             
 DEFINE  CLUSTER                                 -                              
         (NAME (WG01.QASE.WDA3DK)               -                               
          MGMTCLAS(TP0) DATACLAS(MVOL)            -                             
          UNIQUE                                 -                              
          CYL (3 1)                             -                               
          IMBED                                  -                              
          SPEED                                  -                              
          FREESPACE (10 10)                      -                              
          SHAREOPTIONS (3 3)                     -                              
          INDEXED KEYS (59,5)                    -                              
          RECORDSIZE (74,74))                    -                              
 DATA    (CISZ (4096)                            -                              
          NAME (WG01.QASE.WDA3DK.DATA))          -                              
 INDEX   (CISZ (8192)                            -                              
          NAME (WG01.QASE.WDA3DK.INDEX))                                        
