 /*      VSAM-DEFINITION AV WDA3:S                                    */        
 /*      SEKUNDÄRA INDEX WDA3A                                        */        
 DELETE  (WG01.QASE.WDA3FK)                                                     
 /*                                                                             
 DEFINE  CLUSTER                                 -                              
         (NAME (WG01.QASE.WDA3FK)               -                               
          MGMTCLAS(TP0) DATACLAS(MVOL)            -                             
          UNIQUE                                 -                              
          CYL (1 1)                             -                               
          IMBED                                  -                              
          SPEED                                  -                              
          FREESPACE (10 10)                      -                              
          SHAREOPTIONS (3 3)                     -                              
          INDEXED KEYS (38,5)                    -                              
          RECORDSIZE (44,44))                    -                              
 DATA    (CISZ (4096)                            -                              
          NAME (WG01.QASE.WDA3FK.DATA))          -                              
 INDEX   (CISZ (8192)                            -                              
          NAME (WG01.QASE.WDA3FK.INDEX))                                        
