 /*      VSAM-DEFINITION FÖR WDA5C                                    */        
 /*                                                                   */        
 DELETE  (WG01.QASE.WDA5CK)                                                     
 /*                                                                   */        
 DEFINE  CLUSTER                                  -                             
         (NAME (WG01.QASE.WDA5CK)                 -                             
          MGMTCLAS(TP0) DATACLAS(MVOL)            -                             
          UNIQUE                                  -                             
          CYL (30 5)                              -                             
          IMBED                                   -                             
          SPEED                                   -                             
          FREESPACE (20 10)                       -                             
          SHAREOPTIONS (3 3)                      -                             
          INDEXED KEYS (27,1)                     -                             
          RECORDSIZE (54,54))                     -                             
 DATA    (CISZ (4096)                             -                             
          NAME (WG01.QASE.WDA5CK.DATA))           -                             
 INDEX   (CISZ (8192)                             -                             
          NAME (WG01.QASE.WDA5CK.INDEX))                                        
