 /*      VSAM-DEFINITION AV WDA5                                      */        
 DELETE  (WG01.QASE.WDA5K)                                                      
 /*                                                                   */        
 DEFINE  CLUSTER                                 -                              
         (NAME (WG01.QASE.WDA5K)                 -                              
          MGMTCLAS(TP0) DATACLAS(MVOL)            -                             
          STORCLAS(TP0B)                          -                             
          UNIQUE                                 -                              
          CYL (70 20)                            -                              
          IMBED                                  -                              
          SPEED                                  -                              
          FREESPACE (20 10)                      -                              
          SHAREOPTIONS (3 3)                     -                              
          INDEXED KEYS (24,6)                    -                              
          RECORDSIZE (340,340))                  -                              
 DATA    (CISZ (4096)                            -                              
          NAME (WG01.QASE.WDA5K.DATA))           -                              
 INDEX   (CISZ (8192)                            -                              
          NAME (WG01.QASE.WDA5K.INDEX))                                         
