 /*      VSAM-DEFINITION FÖR WDA5D                                    */        
 /*                                                                   */        
 DELETE  (WG01.QASE.WDA5DK)                                                     
 /*                                                                   */        
 DEFINE  CLUSTER                                  -                             
         (NAME (WG01.QASE.WDA5DK)                 -                             
          MGMTCLAS(TP0) DATACLAS(MVOL)            -                             
          UNIQUE                                  -                             
          CYL (25 4)                              -                             
          IMBED                                   -                             
          SPEED                                   -                             
          FREESPACE (20 10)                       -                             
          SHAREOPTIONS (3 3)                      -                             
          INDEXED KEYS (24,1)                     -                             
          RECORDSIZE (56,56))                     -                             
 DATA    (CISZ (4096)                             -                             
          NAME (WG01.QASE.WDA5DK.DATA))           -                             
 INDEX   (CISZ (8192)                             -                             
          NAME (WG01.QASE.WDA5DK.INDEX))                                        
