 /*      VSAM-DEFINITION AV WDA5E                                     */        
 DELETE  (WG01.QASE.WDA5EK)                                                     
 /*                                                                   */        
 DEFINE  CLUSTER                                 -                              
         (NAME (WG01.QASE.WDA5EK)                -                              
          MGMTCLAS(TP0) DATACLAS(MVOL)            -                             
          UNIQUE                                 -                              
          CYL (1 1)                              -                              
          IMBED                                  -                              
          SPEED                                  -                              
          FREESPACE (5 5)                        -                              
          SHAREOPTIONS (3 3)                     -                              
          INDEXED KEYS (38,1)                    -                              
          RECORDSIZE (64,64))                    -                              
 DATA    (CISZ (4096)                            -                              
          NAME (WG01.QASE.WDA5EK.DATA))          -                              
 INDEX   (CISZ (8192)                            -                              
          NAME (WG01.QASE.WDA5EK.INDEX))                                        
