 /*      VSAM-DEFINITION AV WDA6J                                     */        
 DELETE  (WG01.QASE.WDA6JK)                                                     
 /*                                                                   */        
 DEFINE  CLUSTER                                 -                              
         (NAME (WG01.QASE.WDA6JK)                -                              
          MGMTCLAS(TP0) DATACLAS(MVOL)           -                              
          UNIQUE                                 -                              
          CYL (1 3)                              -                              
          IMBED                                  -                              
          SPEED                                  -                              
          FREESPACE (10 5)                       -                              
          SHAREOPTIONS (3 3)                     -                              
          INDEXED KEYS (14,5)                     -                             
          RECORDSIZE (20,20))                    -                              
 DATA    (CISZ (4096)                            -                              
          NAME (WG01.QASE.WDA6JK.DATA))          -                              
 INDEX   (CISZ (8192)                            -                              
          NAME (WG01.QASE.WDA6JK.INDEX))                                        
