 /*      VSAM-DEFINITION FÖR WDA7A                                    */        
 /*                                                                   */        
 DELETE  (WG01.QASE.WDA7AK)                                                     
 /*                                                                   */        
 DEFINE  CLUSTER                                  -                             
         (NAME (WG01.QASE.WDA7AK)                 -                             
          MGMTCLAS(TP0) DATACLAS(MVOL)            -                             
          UNIQUE                                  -                             
          CYL (1 1)                              -                              
          IMBED                                   -                             
          SPEED                                   -                             
          FREESPACE (30 10)                       -                             
          SHAREOPTIONS (3 3)                      -                             
          INDEXED KEYS (11,1)                     -                             
          RECORDSIZE (30,30))                     -                             
 DATA    (CISZ (4096)                             -                             
          NAME (WG01.QASE.WDA7AK.DATA))           -                             
 INDEX   (CISZ (8192)                             -                             
          NAME (WG01.QASE.WDA7AK.INDEX))                                        
 /*                                                                   */        
