 /*      VSAM-DEFINITION AV WDA7                                      */        
 DELETE  (WG01.QASE.WDA7K)                                                      
 /*                                                                   */        
 DEFINE  CLUSTER                                 -                              
         (NAME (WG01.QASE.WDA7K)                 -                              
          MGMTCLAS(TP0) DATACLAS(MVOL)            -                             
          STORCLAS(TP0B)                          -                             
          UNIQUE                                 -                              
          CYL (95 5)                            -                               
          IMBED                                  -                              
          SPEED                                  -                              
          FREESPACE (10 10)                      -                              
          SHAREOPTIONS (3 3)                     -                              
          INDEXED KEYS (18,6)                    -                              
          RECORDSIZE (126,126))                  -                              
 DATA    (CISZ (4096)                            -                              
          NAME (WG01.QASE.WDA7K.DATA))           -                              
 INDEX   (CISZ (8192)                            -                              
          NAME (WG01.QASE.WDA7K.INDEX))                                         
