 /*      VSAM-DEFINITION FÖR WDA8B                                      00020000
 /*                                                                     00030000
 DELETE  (WG01.QASE.WDA8BK)                                             00040000
 /*                                                                     00050000
 DEFINE  CLUSTER                                  -                     00060000
         (NAME (WG01.QASE.WDA8BK)                 -                     00070000
          MGMTCLAS(TP0) DATACLAS(MVOL)            -                     00080000
          UNIQUE                                  -                     00090000
          CYL (1 1)                              -                      00100000
          IMBED                                   -                     00110000
          SPEED                                   -                     00120000
          FREESPACE (30 10)                       -                     00130000
          SHAREOPTIONS (3 3)                      -                     00140000
          INDEXED KEYS (20,5)                     -                     00150000
          RECORDSIZE (26,26))                     -                     00160000
 DATA    (CISZ (4096)                             -                     00170000
          NAME (WG01.QASE.WDA8BK.DATA))           -                     00180000
 INDEX   (CISZ (8192)                             -                     00190000
          NAME (WG01.QASE.WDA8BK.INDEX))                                00200000
 /*                                                                     00210000
