 /*      VSAM-DEFINITION AV WDA9:S                                    */        
 /*      SEKUNDÄRA INDEX WDA9A                                        */        
 DELETE  (WG01.QASE.WDA9AK)                                                     
 /*                                                                             
 DEFINE  CLUSTER                                 -                              
         (NAME (WG01.QASE.WDA9AK)               -                               
          MGMTCLAS(TP0) DATACLAS(MVOL)            -                             
          UNIQUE                                 -                              
          CYL (2 1)                             -                               
          IMBED                                  -                              
          SPEED                                  -                              
          FREESPACE (10 10)                      -                              
          SHAREOPTIONS (3 3)                     -                              
          INDEXED KEYS (8,5)                    -                               
          RECORDSIZE (14,14))                    -                              
 DATA    (CISZ (4096)                            -                              
          NAME (WG01.QASE.WDA9AK.DATA))          -                              
 INDEX   (CISZ (8192)                            -                              
          NAME (WG01.QASE.WDA9AK.INDEX))                                        
