 /*      VSAM-DEFINITION FÖR WDB1B                                    */        
 /*                                                                   */        
 DELETE  (WG01.QASE.WDB1BK)                                                     
 /*                                                                   */        
 DEFINE  CLUSTER                                  -                             
         (NAME (WG01.QASE.WDB1BK)                 -                             
          MGMTCLAS(TP0) DATACLAS(MVOL)            -                             
          UNIQUE                                  -                             
          CYL (1 1)                               -                             
          IMBED                                   -                             
          SPEED                                   -                             
          FREESPACE (05 05)                       -                             
          SHAREOPTIONS (3 3)                      -                             
          INDEXED KEYS (14,1)                     -                             
          RECORDSIZE (62,62))                     -                             
 DATA    (CISZ (4096)                             -                             
          NAME (WG01.QASE.WDB1BK.DATA))           -                             
 INDEX   (CISZ (8192)                             -                             
          NAME (WG01.QASE.WDB1BK.INDEX))                                        
 /*                                                                   */        
