 /*      VSAM-DEFINITION FÖR WDB2                                     */        
 /*                                                                   */        
 DELETE  (WG01.QASE.WDB2K)                                                      
 /*                                                                   */        
 DEFINE  CLUSTER                                  -                             
         (NAME (WG01.QASE.WDB2K)                  -                             
          MGMTCLAS(TP0) DATACLAS(MVOL)            -                             
          UNIQUE                                  -                             
          CYL (25 1)                               -                            
          IMBED                                   -                             
          SPEED                                   -                             
          FREESPACE (05 05)                       -                             
          SHAREOPTIONS (3 3)                      -                             
          INDEXED KEYS (7,6)                      -                             
          RECORDSIZE (1362,1362))                 -                             
 DATA    (CISZ (4096)                             -                             
          NAME (WG01.QASE.WDB2K.DATA))            -                             
 INDEX   (CISZ (8192)                             -                             
          NAME (WG01.QASE.WDB2K.INDEX))                                         
 /*                                                                   */        
