 /*      VSAM-DEFINITION FÖR WDB3                                     */        
 /*                                                                   */        
 DELETE  (WG01.QASE.WDB3K)                                                      
 /*                                                                   */        
 DEFINE  CLUSTER                                  -                             
         (NAME (WG01.QASE.WDB3K)                  -                             
          MGMTCLAS(TP0) DATACLAS(MVOL)            -                             
          UNIQUE                                  -                             
          CYL (1 1)                               -                             
          IMBED                                   -                             
          SPEED                                   -                             
          FREESPACE (05 05)                       -                             
          SHAREOPTIONS (3 3)                      -                             
          INDEXED KEYS (9,6)                      -                             
          RECORDSIZE (56,56))                     -                             
 DATA    (CISZ (4096)                             -                             
          NAME (WG01.QASE.WDB3K.DATA))            -                             
 INDEX   (CISZ (8192)                             -                             
          NAME (WG01.QASE.WDB3K.INDEX))                                         
 /*                                                                   */        
