 /*      VSAM-DEFINITION AV WDB6A                                     */        
 DELETE  (WG01.QASE.WDB6AK)                                                     
 /*                                                                   */        
 DEFINE  CLUSTER                                 -                              
         (NAME (WG01.QASE.WDB6AK)                -                              
          MGMTCLAS(TP0) DATACLAS(MVOL)           -                              
          UNIQUE                                 -                              
          CYL (1 1)                              -                              
          IMBED                                  -                              
          SPEED                                  -                              
          FREESPACE (10 5)                       -                              
          SHAREOPTIONS (3 3)                     -                              
          INDEXED KEYS (2,5)                     -                              
          RECORDSIZE (8,8))                    -                                
 DATA    (CISZ (4096)                            -                              
          NAME (WG01.QASE.WDB6AK.DATA))          -                              
 INDEX   (CISZ (8192)                            -                              
          NAME (WG01.QASE.WDB6AK.INDEX))                                        
