 /*      VSAM-DEFINITION FÖR WDB7                                     */        
 /*                                                                   */        
 DELETE  (WG01.QASE.WDB7K)                                                      
 /*                                                                   */        
 DEFINE  CLUSTER                                  -                             
         (NAME (WG01.QASE.WDB7K)                  -                             
          MGMTCLAS(TP0) DATACLAS(MVOL)            -                             
          UNIQUE                                  -                             
          CYL (7 1)                               -                             
          IMBED                                   -                             
          SPEED                                   -                             
          FREESPACE (05 05)                       -                             
          SHAREOPTIONS (3 3)                      -                             
          INDEXED KEYS (7,6)                      -                             
          RECORDSIZE (314,314))                   -                             
 DATA    (CISZ (4096)                             -                             
          NAME (WG01.QASE.WDB7K.DATA))            -                             
 INDEX   (CISZ (8192)                             -                             
          NAME (WG01.QASE.WDB7K.INDEX))                                         
 /*                                                                   */        
