 /*                                                                   */        
 /*      VSAM-DEFINITION FÖR WDC6A                                    */        
 /*                                                                   */        
 DELETE  (WG01.QASE.WDC6AK)                                                     
 /*                                                                   */        
 DEFINE  CLUSTER                                 -                              
         (NAME (WG01.QASE.WDC6AK)                -                              
          MGMTCLAS(TP0) DATACLAS(MVOL)           -                              
          UNIQUE                                 -                              
          CYL (5 1)                              -                              
          IMBED                                  -                              
          SPEED                                  -                              
          FREESPACE (5 5)                        -                              
          SHAREOPTIONS (3 3)                     -                              
          INDEXED KEYS (10,5)                     -                             
          RECORDSIZE (20,20))                    -                              
 DATA    (CISZ (4096)                            -                              
          NAME (WG01.QASE.WDC6AK.DATA))          -                              
 INDEX   (CISZ (8192)                            -                              
          NAME (WG01.QASE.WDC6AK.INDEX))                                        
