 /*                                                                   */        
 /*      VSAM-DEFINITION FÖR WDC7A                                    */        
 /*                                                                   */        
 DELETE  (WG01.QASE.WDC7AK)                                                     
 /*                                                                   */        
 DEFINE  CLUSTER                                 -                              
         (NAME (WG01.QASE.WDC7AK)                -                              
          MGMTCLAS(TP0) DATACLAS(MVOL)           -                              
          UNIQUE                                 -                              
          CYL (20 2)                             -                              
          IMBED                                  -                              
          SPEED                                  -                              
          FREESPACE (5 5)                        -                              
          SHAREOPTIONS (3 3)                     -                              
          INDEXED KEYS (43,5)                    -                              
          RECORDSIZE (68,68))                    -                              
 DATA    (CISZ (4096)                            -                              
          NAME (WG01.QASE.WDC7AK.DATA))          -                              
 INDEX   (CISZ (8192)                            -                              
          NAME (WG01.QASE.WDC7AK.INDEX))                                        
