 /*                                                                   */        
 /*      VSAM-DEFINITION FÖR WDC7B                                    */        
 /*                                                                   */        
 DELETE  (WG01.QASE.WDC7BK)                                                     
 /*                                                                   */        
 DEFINE  CLUSTER                                 -                              
         (NAME (WG01.QASE.WDC7BK)                -                              
          MGMTCLAS(TP0) DATACLAS(MVOL)           -                              
          UNIQUE                                 -                              
          CYL (20 2)                             -                              
          IMBED                                  -                              
          SPEED                                  -                              
          FREESPACE (5 5)                        -                              
          SHAREOPTIONS (3 3)                     -                              
          INDEXED KEYS (43,5)                     -                             
          RECORDSIZE (66,66))                    -                              
 DATA    (CISZ (4096)                            -                              
          NAME (WG01.QASE.WDC7BK.DATA))          -                              
 INDEX   (CISZ (8192)                            -                              
          NAME (WG01.QASE.WDC7BK.INDEX))                                        
