 /*      VSAM-DEFINITION AV WDC9:S                                    */        
 /*                                                                   */        
 DELETE  (WG01.QASE.WDC9AK)                                                     
 /*      SEKUNDÄRA INDEX WDC9A                                        */        
 DEFINE  CLUSTER                                 -                              
         (NAME (WG01.QASE.WDC9AK)                -                              
          MGMTCLAS(TP0) DATACLAS(MVOL)          -                               
          UNIQUE                                 -                              
          CYL (1 1)                              -                              
          IMBED                                  -                              
          SPEED                                  -                              
          FREESPACE (05 05)                      -                              
          SHAREOPTIONS (3 3)                     -                              
          INDEXED KEYS (10,1)                     -                             
          RECORDSIZE (18,18))                    -                              
 DATA    (CISZ (4096)                            -                              
          NAME (WG01.QASE.WDC9AK.DATA))          -                              
 INDEX   (CISZ (8192)                            -                              
          NAME (WG01.QASE.WDC9AK.INDEX))                                        
