 /*      VSAM-DEFINITION FÖR WDD1:S SEKUNDÄRA INDEX WDD1A             */        
 /*                                                                   */        
 DELETE  (WG01.QASE.WDD1AK)                                                     
 /*                                                                   */        
 DEFINE  CLUSTER                                  -                             
         (NAME (WG01.QASE.WDD1AK)                 -                             
          MGMTCLAS(TP0) DATACLAS(MVOL)            -                             
          UNIQUE                                  -                             
          CYL (1 1)                               -                             
          IMBED                                   -                             
          SPEED                                   -                             
          FREESPACE (10 10)                       -                             
          SHAREOPTIONS (3 3)                      -                             
          INDEXED KEYS (9 5)                      -                             
          RECORDSIZE (14,14))                     -                             
 DATA    (CISZ (4096)                             -                             
          NAME (WG01.QASE.WDD1AK.DATA))           -                             
 INDEX   (CISZ (8192)                             -                             
          NAME (WG01.QASE.WDD1AK.INDEX))                                        
 /*                                                                   */        
