 /*      VSAM-DEFINITION FÖR WDD3B                                    */        
 /*                                                                   */        
 DELETE  (WG01.QASE.WDD3BK)                                                     
 /*                                                                   */        
 DEFINE  CLUSTER                                  -                             
         (NAME (WG01.QASE.WDD3BK)                 -                             
          MGMTCLAS(TP0) DATACLAS(MVOL)            -                             
          UNIQUE                                  -                             
          CYL (7 1)                               -                             
          IMBED                                   -                             
          SPEED                                   -                             
          FREESPACE (10 5)                        -                             
          SHAREOPTIONS (3 3)                      -                             
          INDEXED KEYS (5 5)                      -                             
          RECORDSIZE (10 10))                     -                             
 DATA    (CISZ (4096)                             -                             
          NAME (WG01.QASE.WDD3BK.DATA))           -                             
 INDEX   (CISZ (8192)                             -                             
          NAME (WG01.QASE.WDD3BK.INDEX))                                        
