 /*      VSAM-DEFINITION FÖR WDD3A                                    */        
 /*                                                                   */        
 DELETE  (WG01.QASE.WDD3AK)                                                     
 /*                                                                   */        
 DEFINE  CLUSTER                                  -                             
         (NAME (WG01.QASE.WDD3AK)                 -                             
          MGMTCLAS(TP0) DATACLAS(MVOL)            -                             
          UNIQUE                                  -                             
          TRK (150 15)                            -                             
          IMBED                                   -                             
          SPEED                                   -                             
          FREESPACE (10 5)                        -                             
          SHAREOPTIONS (3 3)                      -                             
          INDEXED KEYS (32 5)                     -                             
          RECORDSIZE (38 38))                     -                             
 DATA    (CISZ (4096)                             -                             
          NAME (WG01.QASE.WDD3AK.DATA))           -                             
 INDEX   (CISZ (8192)                             -                             
          NAME (WG01.QASE.WDD3AK.INDEX))                                        
