 /*      VSAM-DEFINITION AV WDD4                                      */        
 /*                                                                   */        
 DELETE  (WG01.QASE.WDD4K)                                                      
 /*                                                                   */        
 DEFINE  CLUSTER                                 -                              
         (NAME (WG01.QASE.WDD4K)                 -                              
          MGMTCLAS(TP0) DATACLAS(MVOL)            -                             
          UNIQUE                                 -                              
          TRK (150 15)                             -                            
          IMBED                                  -                              
          SPEED                                  -                              
          FREESPACE (30 30)                      -                              
          SHAREOPTIONS (3 3)                     -                              
          INDEXED KEYS (13,6)                    -                              
          RECORDSIZE (60,60))                  -                                
 DATA    (CISZ (4096)                            -                              
          NAME (WG01.QASE.WDD4K.DATA))           -                              
 INDEX   (CISZ (8192)                            -                              
          NAME (WG01.QASE.WDD4K.INDEX))                                         
 /*                                                                   */        
