 /*      VSAM-DEFINITION FÖR WDD7:S SEKUNDÄRA INDEX WDD7A             */        
 /*                                                                   */        
 DELETE  (WG01.QASE.WDD7AK)                                                     
 /*                                                                   */        
 DEFINE  CLUSTER                                  -                             
         (NAME (WG01.QASE.WDD7AK)                 -                             
          MGMTCLAS(TP0) DATACLAS(MVOL)            -                             
          UNIQUE                                  -                             
          CYL (3 1)                               -                             
          IMBED                                   -                             
          SPEED                                   -                             
          FREESPACE (20 10)                       -                             
          SHAREOPTIONS (3 3)                      -                             
          INDEXED KEYS (12,5)                     -                             
          RECORDSIZE (18,18))                     -                             
 DATA    (CISZ (4096)                             -                             
          NAME (WG01.QASE.WDD7AK.DATA))           -                             
 INDEX   (CISZ (8192)                             -                             
          NAME (WG01.QASE.WDD7AK.INDEX))                                        
 /*                                                                   */        
