 /* VSAM CLUSTER-DEFINITION AV WDD8:S SEKUNDÄRA INDEX WDD8A  */                 
 DELETE  (WG01.QASE.WDD8AK)                                                     
 /*                                                          */                 
 DEFINE  CLUSTER                                 -                              
         (NAME (WG01.QASE.WDD8AK)                -                              
          MGMTCLAS(TP0) DATACLAS(MVOL)           -                              
          UNIQUE                                 -                              
          CYL (10 2)                             -                              
          IMBED                                  -                              
          SPEED                                  -                              
          FREESPACE (10 10)                      -                              
          SHAREOPTIONS (3 3)                     -                              
          INDEXED KEYS (22,5)                    -                              
          RECORDSIZE (28 28))                    -                              
 DATA    (CISZ (4096)                            -                              
          NAME (WG01.QASE.WDD8AK.DATA))          -                              
 INDEX   (CISZ (8192)                            -                              
          NAME (WG01.QASE.WDD8AK.INDEX))                                        
