 /*      VSAM-DEFINITION AV WDE3                                      */        
 DELETE  (WG01.QASE.WDE3K)                                                      
 /*                                                                   */        
 DEFINE  CLUSTER                                 -                              
         (NAME (WG01.QASE.WDE3K)                 -                              
          MGMTCLAS(TP0) DATACLAS(MVOL)           -                              
          UNIQUE                                 -                              
          CYL (3 1)                              -                              
          IMBED                                  -                              
          SPEED                                  -                              
          FREESPACE (10 10)                      -                              
          SHAREOPTIONS (3 3)                     -                              
          INDEXED KEYS (13,6)                    -                              
          RECORDSIZE (74,74))                    -                              
 DATA    (CISZ (4096)                            -                              
          NAME (WG01.QASE.WDE3K.DATA))           -                              
 INDEX   (CISZ (8192)                            -                              
          NAME (WG01.QASE.WDE3K.INDEX))                                         
