 /*      VSAM-DEFINITION FÖR WDE3B                                    */        
 /*                                                                   */        
 DELETE  (WG01.QASE.WDE3BK)                                                     
 /*                                                                   */        
 DEFINE  CLUSTER                                  -                             
         (NAME (WG01.QASE.WDE3BK)                 -                             
          MGMTCLAS(TP0) DATACLAS(MVOL)            -                             
          UNIQUE                                  -                             
          CYL (4 1)                               -                             
          IMBED                                   -                             
          SPEED                                   -                             
          FREESPACE (20 10)                       -                             
          SHAREOPTIONS (3 3)                      -                             
          INDEXED KEYS (10,1)                     -                             
          RECORDSIZE (26,26))                     -                             
 DATA    (CISZ (4096)                             -                             
          NAME (WG01.QASE.WDE3BK.DATA))           -                             
 INDEX   (CISZ (8192)                             -                             
          NAME (WG01.QASE.WDE3BK.INDEX))                                        
