 /*      VSAM-DEFINITION FÖR WDE4F                                    */        
 DELETE  (WG01.QASE.WDE4FK)                                                     
 /*                                                                   */        
 DEFINE  CLUSTER                                  -                             
         (NAME (WG01.QASE.WDE4FK)                 -                             
          MGMTCLAS(TP0) DATACLAS(MVOL)            -                             
          UNIQUE                                  -                             
          CYL (180 10)                            -                             
          IMBED                                   -                             
          SPEED                                   -                             
          FREESPACE (20 10)                       -                             
          SHAREOPTIONS (3 3)                      -                             
          INDEXED KEYS (29,5)                     -                             
          RECORDSIZE (38 38))                     -                             
 DATA    (CISZ (4096)                             -                             
          NAME (WG01.QASE.WDE4FK.DATA))           -                             
 INDEX   (CISZ (8192)                             -                             
          NAME (WG01.QASE.WDE4FK.INDEX))                                        
