 /*      VSAM-DEFINITION FÖR WDE4D                                    */        
 DELETE  (WG01.QASE.WDE4DK)                                                     
 /*                                                                   */        
 DEFINE  CLUSTER                                  -                             
         (NAME (WG01.QASE.WDE4DK)                 -                             
          MGMTCLAS(TP0) DATACLAS(MVOL)            -                             
          UNIQUE                                  -                             
          CYL (1 1)                               -                             
          IMBED                                   -                             
          SPEED                                   -                             
          FREESPACE (20 10)                       -                             
          SHAREOPTIONS (3 3)                      -                             
          INDEXED KEYS (27,5)                     -                             
          RECORDSIZE (42 42))                     -                             
 DATA    (CISZ (4096)                             -                             
          NAME (WG01.QASE.WDE4DK.DATA))           -                             
 INDEX   (CISZ (8192)                             -                             
          NAME (WG01.QASE.WDE4DK.INDEX))                                        
