 /*      VSAM-DEFINITION FÖR WDE4C                                    */        
 DELETE  (WG01.QASE.WDE4CK)                                                     
 /*                                                                   */        
 DEFINE  CLUSTER                                  -                             
         (NAME (WG01.QASE.WDE4CK)                 -                             
          MGMTCLAS(TP0) DATACLAS(MVOL)            -                             
          UNIQUE                                  -                             
          CYL (150 20)                            -                             
          IMBED                                   -                             
          SPEED                                   -                             
          FREESPACE (20 10)                       -                             
          SHAREOPTIONS (3 3)                      -                             
          INDEXED KEYS (12,5)                     -                             
          RECORDSIZE (38,38))                     -                             
 DATA    (CISZ (4096)                             -                             
          NAME (WG01.QASE.WDE4CK.DATA))           -                             
 INDEX   (CISZ (8192)                             -                             
          NAME (WG01.QASE.WDE4CK.INDEX))                                        
