 /*      VSAM-DEFINITION FÖR WDE4E                                    */        
 DELETE  (WG01.QASE.WDE4EK)                                                     
 /*                                                                   */        
 DEFINE  CLUSTER                                  -                             
         (NAME (WG01.QASE.WDE4EK)                 -                             
          MGMTCLAS(TP0) DATACLAS(MVOL)            -                             
          UNIQUE                                  -                             
          CYL (25 2)                              -                             
          IMBED                                   -                             
          SPEED                                   -                             
          FREESPACE (20 10)                       -                             
          SHAREOPTIONS (3 3)                      -                             
          INDEXED KEYS (23,5)                     -                             
          RECORDSIZE (28 28))                     -                             
 DATA    (CISZ (4096)                             -                             
          NAME (WG01.QASE.WDE4EK.DATA))           -                             
 INDEX   (CISZ (8192)                             -                             
          NAME (WG01.QASE.WDE4EK.INDEX))                                        
