 /*     VSAM DEFINITION AV WDE4A                             */                 
 DELETE  (WG01.QASE.WDE4AK)                                                     
 /*                                                          */                 
 DEFINE  CLUSTER                                 -                              
         (NAME (WG01.QASE.WDE4AK)                -                              
          MGMTCLAS(TP0) DATACLAS(MVOL)           -                              
          UNIQUE                                 -                              
          CYL (40 5)                             -                              
          IMBED                                  -                              
          SPEED                                  -                              
          FREESPACE (20 10)                      -                              
          SHAREOPTIONS (3 3)                     -                              
          INDEXED KEYS (23,5)                    -                              
          RECORDSIZE (28 28))                    -                              
 DATA    (CISZ (4096)                            -                              
          NAME (WG01.QASE.WDE4AK.DATA))          -                              
 INDEX   (CISZ (8192)                            -                              
          NAME (WG01.QASE.WDE4AK.INDEX))                                        
