 /*      VSAM-DEFINITION FÖR WDE6B                                    */        
 /*                                                                   */        
 DELETE  (WG01.QASE.WDE6BK)                                                     
 /*                                                                   */        
 DEFINE  CLUSTER                                  -                             
         (NAME (WG01.QASE.WDE6BK)                 -                             
          MGMTCLAS(TP0) DATACLAS(MVOL)            -                             
          UNIQUE                                  -                             
          CYL (1 1)                               -                             
          IMBED                                   -                             
          SPEED                                   -                             
          FREESPACE (20 10)                       -                             
          SHAREOPTIONS (3 3)                      -                             
          INDEXED KEYS (15,5)                     -                             
          RECORDSIZE (20,20))                     -                             
 DATA    (CISZ (4096)                             -                             
          NAME (WG01.QASE.WDE6BK.DATA))           -                             
 INDEX   (CISZ (8192)                             -                             
          NAME (WG01.QASE.WDE6BK.INDEX))                                        
