 /*      VSAM-DEFINITION AV WDE8                                      */        
 DELETE  (WG01.QASE.WDE8K)                                                      
 /*                                                                   */        
 DEFINE  CLUSTER                                 -                              
         (NAME (WG01.QASE.WDE8K)                 -                              
          MGMTCLAS(TP0) DATACLAS(MVOL)           -                              
          UNIQUE                                 -                              
          CYL (5 1)                              -                              
          IMBED                                  -                              
          SPEED                                  -                              
          FREESPACE (0 0)                        -                              
          SHAREOPTIONS (3 3)                     -                              
          INDEXED KEYS (17,6)                    -                              
          RECORDSIZE (2042,2042))                -                              
 DATA    (CISZ (4096)                            -                              
          NAME (WG01.QASE.WDE8K.DATA))           -                              
 INDEX   (CISZ (8192)                            -                              
          NAME (WG01.QASE.WDE8K.INDEX))                                         
 /*                                                                   */        
