 /*      VSAM-DEFINITION AV WDF1A                                               
 DELETE  (WG01.QASE.WDF1AK)                                                     
 /*                                                                             
 DEFINE  CLUSTER                                 -                              
         (NAME (WG01.QASE.WDF1AK)                -                              
          MGMTCLAS(TP0) DATACLAS(MVOL)           -                              
          UNIQUE                                 -                              
          CYL (2 1)                              -                              
          IMBED                                  -                              
          SPEED                                  -                              
          FREESPACE (10 5)                       -                              
          SHAREOPTIONS (3 3)                     -                              
          INDEXED KEYS (13,5)                     -                             
          RECORDSIZE (18,18))                    -                              
 DATA    (CISZ (4096)                            -                              
          NAME (WG01.QASE.WDF1AK.DATA))          -                              
 INDEX   (CISZ (8192)                            -                              
          NAME (WG01.QASE.WDF1AK.INDEX))                                        
