 /*      VSAM-DEFINITION AV WDF2B                                     */        
 DELETE  (WG01.QASE.WDF2BK)                                                     
 /*                                                                   */        
 DEFINE  CLUSTER                                 -                              
         (NAME (WG01.QASE.WDF2BK)                -                              
          MGMTCLAS(TP0) DATACLAS(MVOL)           -                              
          UNIQUE                                 -                              
          CYL (2 1)                              -                              
          IMBED                                  -                              
          SPEED                                  -                              
          FREESPACE (20 5)                       -                              
          SHAREOPTIONS (3 3)                     -                              
          INDEXED KEYS (15,5)                    -                              
          RECORDSIZE (20,20))                    -                              
 DATA    (CISZ (4096)                            -                              
          NAME (WG01.QASE.WDF2BK.DATA))          -                              
 INDEX   (CISZ (8192)                            -                              
          NAME (WG01.QASE.WDF2BK.INDEX))                                        
