 /*      VSAM-DEFINITION FÖR WDF6:S SESUNDÄRA INDEX WDF6A             */        
 /*                                                                   */        
 DELETE  (WG01.QASE.WDF6AK)                                                     
 /*                                                                   */        
 DEFINE  CLUSTER                                  -                             
         (NAME (WG01.QASE.WDF6AK)                 -                             
          MGMTCLAS(TP0) DATACLAS(MVOL)            -                             
          UNIQUE                                  -                             
          CYL (40 5)                              -                             
          IMBED                                   -                             
          SPEED                                   -                             
          FREESPACE (10 5)                        -                             
          SHAREOPTIONS (3 3)                      -                             
          INDEXED KEYS (17 5)                     -                             
          RECORDSIZE (22,22))                     -                             
 DATA    (CISZ (4096)                             -                             
          NAME (WG01.QASE.WDF6AK.DATA))           -                             
 INDEX   (CISZ (8192)                             -                             
          NAME (WG01.QASE.WDF6AK.INDEX))                                        
 /*                                                                   */        
