 /*      VSAM-DEFINITION AV WDF8A                                     */        
 DELETE  (WG01.QASE.WDF8AK)                                                     
 /*                                                                   */        
 DEFINE  CLUSTER                                 -                              
         (NAME (WG01.QASE.WDF8AK)                -                              
          MGMTCLAS(TP0) DATACLAS(MVOL)           -                              
          UNIQUE                                 -                              
          CYL (2 1)                              -                              
          IMBED                                  -                              
          SPEED                                  -                              
          FREESPACE (10 5)                       -                              
          SHAREOPTIONS (3 3)                     -                              
          INDEXED KEYS (24,5)                     -                             
          RECORDSIZE (50,50))                    -                              
 DATA    (CISZ (4096)                            -                              
          NAME (WG01.QASE.WDF8AK.DATA))          -                              
 INDEX   (CISZ (8192)                            -                              
          NAME (WG01.QASE.WDF8AK.INDEX))                                        
