 /*      VSAM-DEFINITION FÖR WDG8A                                    */        
 /*                                                                   */        
 DELETE  (WG01.QASE.WDG8AK)                                                     
 /*                                                                   */        
 DEFINE  CLUSTER                                  -                             
         (NAME (WG01.QASE.WDG8AK)                 -                             
          MGMTCLAS(TP0) DATACLAS(MVOL)            -                             
          UNIQUE                                  -                             
          CYL (5 1)                               -                             
          IMBED                                   -                             
          SPEED                                   -                             
          FREESPACE (0 30)                        -                             
          SHAREOPTIONS (3 3)                      -                             
          INDEXED KEYS (17,5)                     -                             
          RECORDSIZE (42,42))                     -                             
 DATA    (CISZ (4096)                             -                             
          NAME (WG01.QASE.WDG8AK.DATA))           -                             
 INDEX   (CISZ (8192)                            -                              
          NAME (WG01.QASE.WDG8AK.INDEX))                                        
 /*                                                                   */        
