 /*      VSAM-DEFINITION AV WDH1:S                                    */        
 /*      SEKUNDÄRA INDEX WDH1F                                        */        
 /*                                                                   */        
 DELETE  (WG01.QASE.WDH1FK)                                                     
 /*                                                                   */        
 DEFINE  CLUSTER                                   -                            
         (NAME (WG01.QASE.WDH1FK)                  -                            
          MGMTCLAS(TP0) DATACLAS(MVOL)             -                            
          UNIQUE                                   -                            
          CYL (3 1)                                -                            
          IMBED                                    -                            
          SPEED                                    -                            
          FREESPACE (10 10)                        -                            
          SHAREOPTIONS (3 3)                       -                            
          INDEXED KEYS (31,5)                      -                            
          RECORDSIZE (36,36))                      -                            
 DATA    (CISZ (4096)                              -                            
          NAME (WG01.QASE.WDH1FK.DATA))            -                            
 INDEX   (CISZ (8192)                              -                            
          NAME (WG01.QASE.WDH1FK.INDEX))                                        
