 /*      VSAM-DEFINITION AV WDH8                                      */        
 DELETE  (WG01.QASE.WDH8K)                                                      
 /*                                                                   */        
 DEFINE  CLUSTER                                 -                              
         (NAME (WG01.QASE.WDH8K)                 -                              
          MGMTCLAS(TP0) DATACLAS(MVOL)           -                              
          UNIQUE                                 -                              
          CYL (2 1)                              -                              
          IMBED                                  -                              
          SPEED                                  -                              
          FREESPACE (5 5)                        -                              
          SHAREOPTIONS (3 3)                     -                              
          INDEXED KEYS (17,6)                    -                              
          RECORDSIZE (270,270))                  -                              
 DATA    (CISZ (4096)                            -                              
          NAME (WG01.QASE.WDH8K.DATA))           -                              
 INDEX   (CISZ (8192)                            -                              
          NAME (WG01.QASE.WDH8K.INDEX))                                         
