 /*      VSAM-DEFINITION FÖR WDJ1C                                    */        
 /*                                                                   */        
 DELETE  (WG01.QASE.WDJ1CK)                                                     
 /*                                                                   */        
 DEFINE  CLUSTER                                  -                             
         (NAME (WG01.QASE.WDJ1CK)                 -                             
          MGMTCLAS(TP0) DATACLAS(MVOL)            -                             
          UNIQUE                                  -                             
          CYL (5 1)                               -                             
          IMBED                                   -                             
          SPEED                                   -                             
          FREESPACE (30 10)                       -                             
          SHAREOPTIONS (3 3)                      -                             
          INDEXED KEYS (49,5)                     -                             
          RECORDSIZE (54,54))                     -                             
 DATA    (CISZ (4096)                             -                             
          NAME (WG01.QASE.WDJ1CK.DATA))           -                             
 INDEX   (CISZ (8192)                             -                             
          NAME (WG01.QASE.WDJ1CK.INDEX))                                        
 /*                                                                   */        
