 /*      VSAM-DEFINITION FÖR WDJ1D                                    */        
 /*                                                                   */        
 DELETE  (WG01.QASE.WDJ1DK)                                                     
 /*                                                                   */        
 DEFINE  CLUSTER                                  -                             
         (NAME (WG01.QASE.WDJ1DK)                 -                             
          MGMTCLAS(TP0) DATACLAS(MVOL)            -                             
          UNIQUE                                  -                             
          CYL (1 1)                               -                             
          IMBED                                   -                             
          SPEED                                   -                             
          FREESPACE (30 10)                       -                             
          SHAREOPTIONS (3 3)                      -                             
          INDEXED KEYS (13,5)                     -                             
          RECORDSIZE (18,18))                     -                             
 DATA    (CISZ (4096)                             -                             
          NAME (WG01.QASE.WDJ1DK.DATA))           -                             
 INDEX   (CISZ (8192)                             -                             
          NAME (WG01.QASE.WDJ1DK.INDEX))                                        
 /*                                                                   */        
