 /*      VSAM-DEFINITION WDJ3                                         */        
 /*                                                                   */        
 DELETE  (WG01.QASE.WDJ3K)                                                      
 /*                                                                   */        
 DEFINE  CLUSTER                                  -                             
         (NAME (WG01.QASE.WDJ3K)                  -                             
          MGMTCLAS(TP0) DATACLAS(MVOL)            -                             
          UNIQUE                                  -                             
          CYL (10 5)                              -                             
          IMBED                                   -                             
          SPEED                                   -                             
          FREESPACE (20 10)                       -                             
          SHAREOPTIONS (3 3)                      -                             
          INDEXED KEYS (13,6)                     -                             
          RECORDSIZE (26,26))                     -                             
 DATA    (CISZ (4096)                             -                             
          NAME (WG01.QASE.WDJ3K.DATA))            -                             
 INDEX   (CISZ (8192)                             -                             
          NAME (WG01.QASE.WDJ3K.INDEX))                                         
 /*                                                                   */        
