 /*      VSAM-DEFINITION AV WDJ7E                                     */        
 DELETE  (WG01.QASE.WDJ7EK)                                                     
 DEFINE  CLUSTER                                 -                              
         (NAME (WG01.QASE.WDJ7EK)                -                              
          MGMTCLAS(TP0) DATACLAS(MVOL)           -                              
          UNIQUE                                 -                              
          CYL (5 5)                             -                               
          IMBED                                  -                              
          SPEED                                  -                              
          FREESPACE (30 30)                      -                              
          SHAREOPTIONS (3 3)                     -                              
          INDEXED KEYS (20,1)                    -                              
          RECORDSIZE (58,58))                    -                              
 DATA    (CISZ (4096)                            -                              
          NAME (WG01.QASE.WDJ7EK.DATA))          -                              
 INDEX   (CISZ (8192)                            -                              
          NAME (WG01.QASE.WDJ7EK.INDEX))                                        
 /*                                                                   */        
