 /*      VSAM-DEFINITION FÖR WDK6:S SEKUNDÄRA INDEX WDK6A             */        
 /*                                                                   */        
 DELETE  (WG01.QASE.WDK6AK)                                                     
 /*                                                                   */        
 DEFINE  CLUSTER                                  -                             
         (NAME (WG01.QASE.WDK6AK)                 -                             
          MGMTCLAS(TP0) DATACLAS(MVOL)            -                             
          UNIQUE                                  -                             
          CYL (15 5)                              -                             
          IMBED                                   -                             
          SPEED                                   -                             
          FREESPACE (0 0)                         -                             
          SHAREOPTIONS (3 3)                      -                             
          INDEXED KEYS (10 5)                      -                            
          RECORDSIZE (18,18))                     -                             
 DATA    (CISZ (4096)                             -                             
          NAME (WG01.QASE.WDK6AK.DATA))           -                             
 INDEX   (CISZ (8192)                             -                             
          NAME (WG01.QASE.WDK6AK.INDEX))                                        
 /*                                                                   */        
