 /*      VSAM-DEFINITION FÖR WDK6:S SEKUNDÄRA INDEX WDK6H             */        
 /*                                                                   */        
 DELETE  (WG01.QASE.WDK6HK)                                                     
 /*                                                                   */        
 DEFINE  CLUSTER                                  -                             
         (NAME (WG01.QASE.WDK6HK)                 -                             
          MGMTCLAS(TP0) DATACLAS(MVOL)            -                             
          UNIQUE                                  -                             
          CYL (10 5)                              -                             
          IMBED                                   -                             
          SPEED                                   -                             
          FREESPACE (0 0)                         -                             
          SHAREOPTIONS (3 3)                      -                             
          INDEXED KEYS (7 5)                     -                              
          RECORDSIZE (14,14))                     -                             
 DATA    (CISZ (4096)                             -                             
          NAME (WG01.QASE.WDK6HK.DATA))           -                             
 INDEX   (CISZ (8192)                             -                             
          NAME (WG01.QASE.WDK6HK.INDEX))                                        
 /*                                                                   */        
