 /*      VSAM-DEFINITION FÖR WDK6:S SEKUNDÄRA INDEX WDK6F             */        
 /*                                                                   */        
 DELETE  (WG01.QASE.WDK6FK)                                                     
 /*                                                                   */        
 DEFINE  CLUSTER                                  -                             
         (NAME (WG01.QASE.WDK6FK)                 -                             
          MGMTCLAS(TP0) DATACLAS(MVOL)            -                             
          UNIQUE                                  -                             
          CYL (40 5)                              -                             
          IMBED                                   -                             
          SPEED                                   -                             
          FREESPACE (0 0)                         -                             
          SHAREOPTIONS (3 3)                      -                             
          INDEXED KEYS (15 5)                     -                             
          RECORDSIZE (20,20))                     -                             
 DATA    (CISZ (4096)                             -                             
          NAME (WG01.QASE.WDK6FK.DATA))           -                             
 INDEX   (CISZ (8192)                             -                             
          NAME (WG01.QASE.WDK6FK.INDEX))                                        
 /*                                                                   */        
