 /*      VSAM-DEFINITION FÖR WDK7:S SEKUNDÄRA INDEX WDK7B             */        
 /*                                                                   */        
 DELETE  (WG01.QASE.WDK7BK)                                                     
 /*                                                                   */        
 DEFINE  CLUSTER                                  -                             
         (NAME (WG01.QASE.WDK7BK)                 -                             
          MGMTCLAS(TP0) DATACLAS(MVOL)            -                             
          UNIQUE                                  -                             
          CYL (20 5)                              -                             
          IMBED                                   -                             
          SPEED                                   -                             
          FREESPACE (0 0)                         -                             
          SHAREOPTIONS (3 3)                      -                             
          INDEXED KEYS (9 5)                      -                             
          RECORDSIZE (14,14))                     -                             
 DATA    (CISZ (4096)                             -                             
          NAME (WG01.QASE.WDK7BK.DATA))           -                             
 INDEX   (CISZ (8192)                             -                             
          NAME (WG01.QASE.WDK7BK.INDEX))                                        
 /*                                                                   */        
