 /*      VSAM-DEFINITION WDK8                                         */        
 /*                                                                   */        
 DELETE  (WG01.QASE.WDK8K)                                                      
 /*                                                                   */        
 DEFINE  CLUSTER                                  -                             
         (NAME (WG01.QASE.WDK8K)                  -                             
          MGMTCLAS(TP0) DATACLAS(MVOL)            -                             
          UNIQUE                                  -                             
          CYL (460 20)                            -                             
          IMBED                                   -                             
          SPEED                                   -                             
          FREESPACE (0 0)                         -                             
          SHAREOPTIONS (3 3)                      -                             
          INDEXED KEYS (13,6)                     -                             
          RECORDSIZE (60,60))                     -                             
 DATA    (CISZ (4096)                             -                             
          NAME (WG01.QASE.WDK8K.DATA))            -                             
 INDEX   (CISZ (8192)                             -                             
          NAME (WG01.QASE.WDK8K.INDEX))                                         
 /*                                                                   */        
