 /*      VSAM-DEFINITION AV WDL3                                      */        
 /*                                                                   */        
 DELETE  (WG01.QASE.WDL3K)                                                      
 /*                                                                   */        
 DEFINE  CLUSTER                                 -                              
         (NAME (WG01.QASE.WDL3K)                 -                              
          MGMTCLAS(TP0) DATACLAS(MVOL)           -                              
          UNIQUE                                 -                              
          CYL (990 50)                           -                              
          IMBED                                  -                              
          SPEED                                  -                              
          FREESPACE (10 30)                      -                              
          SHAREOPTIONS (3 3)                     -                              
          INDEXED KEYS (20,6)                    -                              
          RECORDSIZE (140,140))                  -                              
 DATA    (CISZ (4096)                            -                              
          NAME (WG01.QASE.WDL3K.DATA))           -                              
 INDEX   (CISZ (8192)                            -                              
          NAME (WG01.QASE.WDL3K.INDEX))                                         
