 /*      VSAM-DEFINITION WDL6A                                        */        
 /*                                                                   */        
 DELETE  (WG01.QASE.WDL6AK)                                                     
 /*                                                                   */        
 DEFINE  CLUSTER                                  -                             
         (NAME (WG01.QASE.WDL6AK)                 -                             
          MGMTCLAS(TP0) DATACLAS(MVOL)            -                             
          UNIQUE                                  -                             
          CYL (30 5)                              -                             
          IMBED                                   -                             
          SPEED                                   -                             
          FREESPACE (20 10)                       -                             
          SHAREOPTIONS (3 3)                      -                             
          INDEXED KEYS (42,5)                     -                             
          RECORDSIZE (60,60))                     -                             
 DATA    (CISZ (4096)                             -                             
          NAME (WG01.QASE.WDL6AK.DATA))           -                             
 INDEX   (CISZ (8192)                             -                             
          NAME (WG01.QASE.WDL6AK.INDEX))                                        
 /*                                                                   */        
