 /*      VSAM-DEFINITION WDL6C                                        */        
 /*                                                                   */        
 DELETE  (WG01.QASE.WDL6CK)                                                     
 /*                                                                   */        
 DEFINE  CLUSTER                                  -                             
         (NAME (WG01.QASE.WDL6CK)                 -                             
          MGMTCLAS(TP0) DATACLAS(MVOL)            -                             
          UNIQUE                                  -                             
          CYL (300 30)                            -                             
          IMBED                                   -                             
          SPEED                                   -                             
          FREESPACE (20 10)                       -                             
          SHAREOPTIONS (3 3)                      -                             
          INDEXED KEYS (27,5)                     -                             
          RECORDSIZE (36,36))                     -                             
 DATA    (CISZ (4096)                             -                             
          NAME (WG01.QASE.WDL6CK.DATA))           -                             
 INDEX   (CISZ (8192)                             -                             
          NAME (WG01.QASE.WDL6CK.INDEX))                                        
 /*                                                                   */        
