 /*      VSAM-DEFINITION AV WDL9                                      */        
 /*                                                                   */        
 DELETE  (WG01.QASE.WDL9K)                                                      
 /*                                                                   */        
 DEFINE  CLUSTER                                 -                              
         (NAME (WG01.QASE.WDL9K)                 -                              
          MGMTCLAS(TP0) DATACLAS(MVOL)           -                              
          UNIQUE                                 -                              
          CYL (4000 400)                          -                             
          IMBED                                  -                              
          SPEED                                  -                              
          FREESPACE (10 30)                      -                              
          SHAREOPTIONS (3 3)                     -                              
          INDEXED KEYS (20,6)                    -                              
          RECORDSIZE (126,126))                  -                              
 DATA    (CISZ (4096)                            -                              
          NAME (WG01.QASE.WDL9K.DATA))           -                              
 INDEX   (CISZ (8192)                            -                              
          NAME (WG01.QASE.WDL9K.INDEX))                                         
