 /*      VSAM-DEFINITION FÖR WDM3A                                    */        
 /*                                                                   */        
 DELETE  (WG01.QASE.WDM3AK)                                                     
 /*                                                                   */        
 DEFINE  CLUSTER                                  -                             
         (NAME (WG01.QASE.WDM3AK)                 -                             
          MGMTCLAS(TP0) DATACLAS(MVOL)            -                             
          UNIQUE                                  -                             
          CYL (1 1)                               -                             
          IMBED                                   -                             
          SPEED                                   -                             
          FREESPACE (30 10)                       -                             
          SHAREOPTIONS (3 3)                      -                             
          INDEXED KEYS (32,5)                     -                             
          RECORDSIZE (38,38))                     -                             
 DATA    (CISZ (4096)                             -                             
          NAME (WG01.QASE.WDM3AK.DATA))           -                             
 INDEX   (CISZ (8192)                            -                              
          NAME (WG01.QASE.WDM3AK.INDEX))                                        
 /*                                                                   */        
