 /*      VSAM-DEFINITION FÖR WDM6C                                    */        
 /*                                                                   */        
 DELETE  (WG01.QASE.WDM6CK)                                                     
 /*                                                                   */        
 DEFINE  CLUSTER                                  -                             
         (NAME (WG01.QASE.WDM6CK)                 -                             
          MGMTCLAS(TP0) DATACLAS(MVOL)            -                             
          UNIQUE                                  -                             
          CYL (10 1)                               -                            
          IMBED                                   -                             
          SPEED                                   -                             
          FREESPACE (30 20)                       -                             
          SHAREOPTIONS (3 3)                      -                             
          INDEXED KEYS (18,5)                     -                             
          RECORDSIZE (28,28))                     -                             
 DATA    (CISZ (4096)                             -                             
          NAME (WG01.QASE.WDM6CK.DATA))           -                             
 INDEX   (CISZ (8192)                            -                              
          NAME (WG01.QASE.WDM6CK.INDEX))                                        
 /*                                                                   */        
