 /*      VSAM-DEFINITION FÖR WDM7                                     */        
 /*                                                                   */        
 DELETE  (WG01.QASE.WDM7K)                                                      
 /*                                                                   */        
 DEFINE  CLUSTER                                  -                             
         (NAME (WG01.QASE.WDM7K)                  -                             
          MGMTCLAS(TP0) DATACLAS(MVOL)            -                             
          UNIQUE                                  -                             
          CYL (10 2)                              -                             
          IMBED                                   -                             
          SPEED                                   -                             
          FREESPACE (70 10)                       -                             
          SHAREOPTIONS (3 3)                      -                             
          INDEXED KEYS (15,6)                     -                             
          RECORDSIZE (370,370))                   -                             
 DATA    (CISZ (4096)                             -                             
          NAME (WG01.QASE.WDM7K.DATA))            -                             
 INDEX   (CISZ (8192)                             -                             
          NAME (WG01.QASE.WDM7K.INDEX))                                         
 /*                                                                   */        
