 /*      VSAM-DEFINITION FÖR WDM7B                                    */        
 /*                                                                   */        
 DELETE  (WG01.QASE.WDM7BK)                                                     
 /*                                                                   */        
 DEFINE  CLUSTER                                  -                             
         (NAME (WG01.QASE.WDM7BK)                  -                            
          MGMTCLAS(TP0) DATACLAS(MVOL)            -                             
          UNIQUE                                  -                             
          CYL (3 1)                               -                             
          IMBED                                   -                             
          SPEED                                   -                             
          FREESPACE (40 10)                       -                             
          SHAREOPTIONS (3 3)                      -                             
          INDEXED KEYS (33,1)                     -                             
          RECORDSIZE (50,50))                   -                               
 DATA    (CISZ (4096)                             -                             
          NAME (WG01.QASE.WDM7BK.DATA))            -                            
 INDEX   (CISZ (8192)                             -                             
          NAME (WG01.QASE.WDM7BK.INDEX))                                        
 /*                                                                   */        
