 /*      VSAM-DEFINITION FÖR WDM8                                     */        
 /*                                                                   */        
 DELETE  (WG01.QASE.WDM8K)                                                      
 /*                                                                   */        
 DEFINE  CLUSTER                                  -                             
         (NAME (WG01.QASE.WDM8K)                  -                             
          MGMTCLAS(TP0) DATACLAS(MVOL)            -                             
          UNIQUE                                  -                             
          CYL (5 5)                               -                             
          IMBED                                   -                             
          SPEED                                   -                             
          FREESPACE (20 10)                       -                             
          SHAREOPTIONS (3 3)                      -                             
          INDEXED KEYS (19,6)                     -                             
          RECORDSIZE (88,88))                     -                             
 DATA    (CISZ (4096)                             -                             
          NAME (WG01.QASE.WDM8K.DATA))            -                             
 INDEX   (CISZ (8192)                             -                             
          NAME (WG01.QASE.WDM8K.INDEX))                                         
 /*                                                                   */        
