 /*      VSAM-DEFINITION FÖR WDM9B                                    */        
 /*                                                                   */        
 DELETE  (WG01.QASE.WDM9BK)                                                     
 /*                                                                   */        
 DEFINE  CLUSTER                                  -                             
         (NAME (WG01.QASE.WDM9BK)                 -                             
          MGMTCLAS(TP0) DATACLAS(MVOL)            -                             
          UNIQUE                                  -                             
          CYL (10 1)                              -                             
          IMBED                                   -                             
          SPEED                                   -                             
          FREESPACE (0 0)                         -                             
          SHAREOPTIONS (3 3)                      -                             
          INDEXED KEYS (22,5)                     -                             
          RECORDSIZE (28,28))                     -                             
 DATA    (CISZ (4096)                             -                             
          NAME (WG01.QASE.WDM9BK.DATA))           -                             
 INDEX   (CISZ (8192)                             -                             
          NAME (WG01.QASE.WDM9BK.INDEX))                                        
