 SORT FIELDS=(2,25,CH,A)                                                00000010
 END                                                                    00000030
