 SORT FIELDS=(1,36,CH,A)                                                00000010
 END                                                                    00000030
