 /*      VSAM-DEFINITION AV WDN2A                                     */        
 /*                                                                   */        
 DELETE  (WG01.QASE.WDN2AK)                                                     
 /*                                                                   */        
 DEFINE  CLUSTER                                 -                              
         (NAME (WG01.QASE.WDN2AK)                -                              
          MGMTCLAS(TP0) DATACLAS(MVOL)           -                              
          UNIQUE                                 -                              
          CYL (2 1)                              -                              
          IMBED                                  -                              
          SPEED                                  -                              
          FREESPACE (5 5)                        -                              
          SHAREOPTIONS (3 3)                     -                              
          INDEXED KEYS (7 5)                     -                              
          RECORDSIZE (42 42))                    -                              
 DATA    (CISZ (4096)                            -                              
          NAME (WG01.QASE.WDN2AK.DATA))          -                              
 INDEX   (CISZ (8192)                            -                              
          NAME (WG01.QASE.WDN2AK.INDEX))                                        
