 /*      VSAM-DEFINITION FÖR WDN5G                                    */        
 /*                                                                   */        
 DELETE  (WG01.QASE.WDN5GK)                                                     
 /*                                                                   */        
 DEFINE  CLUSTER                                  -                             
         (NAME (WG01.QASE.WDN5GK)                 -                             
          MGMTCLAS(TP0) DATACLAS(MVOL)            -                             
          UNIQUE                                  -                             
          CYL (15 2)                              -                             
          IMBED                                   -                             
          SPEED                                   -                             
          FREESPACE (20 10)                       -                             
          SHAREOPTIONS (3 3)                      -                             
          INDEXED KEYS (42,5)                     -                             
          RECORDSIZE (48,48))                     -                             
 DATA    (CISZ (4096)                             -                             
          NAME (WG01.QASE.WDN5GK.DATA))           -                             
 INDEX   (CISZ (8192)                             -                             
          NAME (WG01.QASE.WDN5GK.INDEX))                                        
