 /*      VSAM-DEFINITION FÖR WDN5B                                    */        
 /*                                                                   */        
 DELETE  (WG01.QASE.WDN5BK)                                                     
 /*                                                                   */        
 DEFINE  CLUSTER                                  -                             
         (NAME (WG01.QASE.WDN5BK)                 -                             
          MGMTCLAS(TP0) DATACLAS(MVOL)            -                             
          UNIQUE                                  -                             
          CYL (50 5)                              -                             
          IMBED                                   -                             
          SPEED                                   -                             
          FREESPACE (20 10)                       -                             
          SHAREOPTIONS (3 3)                      -                             
          INDEXED KEYS (26,5)                     -                             
          RECORDSIZE (32,32))                     -                             
 DATA    (CISZ (4096)                             -                             
          NAME (WG01.QASE.WDN5BK.DATA))           -                             
 INDEX   (CISZ (8192)                             -                             
          NAME (WG01.QASE.WDN5BK.INDEX))                                        
