 /*      VSAM-DEFINITION FÖR WDN6A                                    */        
 /*                                                                   */        
 DELETE  (WG01.QASE.WDN6AK)                                                     
 /*                                                                   */        
 DEFINE  CLUSTER                                  -                             
         (NAME (WG01.QASE.WDN6AK)                 -                             
          MGMTCLAS(TP0) DATACLAS(MVOL)            -                             
          UNIQUE                                  -                             
          CYL (40 5)                              -                             
          IMBED                                   -                             
          SPEED                                   -                             
          FREESPACE (20 10)                       -                             
          SHAREOPTIONS (3 3)                      -                             
          INDEXED KEYS (14 5)                     -                             
          RECORDSIZE (34 34))                     -                             
 DATA    (CISZ (4096)                             -                             
          NAME (WG01.QASE.WDN6AK.DATA))           -                             
 INDEX   (CISZ (8192)                             -                             
          NAME (WG01.QASE.WDN6AK.INDEX))                                        
