 /*      VSAM-DEFINITION AV WDN7A                                     */        
 /*                                                                   */        
 DELETE  (WG01.QASE.WDN7AK)                                                     
 /*                                                                   */        
 DEFINE  CLUSTER                                 -                              
         (NAME (WG01.QASE.WDN7AK)                -                              
          MGMTCLAS(TP0) DATACLAS(MVOL)           -                              
          UNIQUE                                 -                              
          CYL (1 1)                              -                              
          IMBED                                  -                              
          SPEED                                  -                              
          FREESPACE (5 5)                        -                              
          SHAREOPTIONS (3 3)                     -                              
          INDEXED KEYS (3 5)                     -                              
          RECORDSIZE (8 8))                      -                              
 DATA    (CISZ (4096)                            -                              
          NAME (WG01.QASE.WDN7AK.DATA))          -                              
 INDEX   (CISZ (8192)                            -                              
          NAME (WG01.QASE.WDN7AK.INDEX))                                        
