 /*      VSAM-DEFINITION FÖR WDP3B                                    */        
 /*                                                                   */        
 DELETE  (WG01.QASE.WDP3BK)                                                     
 /*                                                                   */        
 DEFINE  CLUSTER                                  -                             
         (NAME (WG01.QASE.WDP3BK)                 -                             
          MGMTCLAS(TP0) DATACLAS(MVOL)            -                             
          UNIQUE                                  -                             
          TRK (15 5)                              -                             
          IMBED                                   -                             
          SPEED                                   -                             
          FREESPACE (0 0)                         -                             
          SHAREOPTIONS (3 3)                      -                             
          INDEXED KEYS (15,5)                     -                             
          RECORDSIZE (22,22))                     -                             
 DATA    (CISZ (4096)                             -                             
          NAME (WG01.QASE.WDP3BK.DATA))           -                             
 INDEX   (CISZ (8192)                             -                             
          NAME (WG01.QASE.WDP3BK.INDEX))                                        
 /*                                                                   */        
