 /*      VSAM-DEFINITION AV WDP4A                                     */        
 DELETE  (WG01.QASE.WDP4AK)                                                     
 /*                                                                   */        
 DEFINE  CLUSTER                                 -                              
         (NAME (WG01.QASE.WDP4AK)                -                              
          MGMTCLAS(TP0) DATACLAS(MVOL)           -                              
          UNIQUE                                 -                              
          CYL (1 1)                              -                              
          IMBED                                  -                              
          SPEED                                  -                              
          FREESPACE (10 5)                       -                              
          SHAREOPTIONS (3 3)                     -                              
          INDEXED KEYS (11,5)                     -                             
          RECORDSIZE (16,16))                    -                              
 DATA    (CISZ (4096)                            -                              
          NAME (WG01.QASE.WDP4AK.DATA))          -                              
 INDEX   (CISZ (8192)                            -                              
          NAME (WG01.QASE.WDP4AK.INDEX))                                        
