 /*      VSAM-DEFINITION FÖR WDP8A                                    */        
 /*                                                                   */        
 DELETE  (WG01.QASE.WDP8AK)                                                     
 /*                                                                   */        
 DEFINE  CLUSTER                                  -                             
         (NAME (WG01.QASE.WDP8AK)                 -                             
          MGMTCLAS(TP0) DATACLAS(MVOL)            -                             
          UNIQUE                                  -                             
          CYL (12 12)                              -                            
          IMBED                                   -                             
          SPEED                                   -                             
          FREESPACE (0 0)                         -                             
          SHAREOPTIONS (3 3)                      -                             
          INDEXED KEYS (25,5)                     -                             
          RECORDSIZE (60,60))                     -                             
 DATA    (CISZ (4096)                             -                             
          NAME (WG01.QASE.WDP8AK.DATA))           -                             
 INDEX   (CISZ (8192)                             -                             
          NAME (WG01.QASE.WDP8AK.INDEX))                                        
 /*                                                                   */        
