 /*      VSAM-DEFINITION AV WDQ1B                                     */        
 DELETE  (WG01.QASE.WDQ1BK)                                                     
 /*                                                                   */        
 DEFINE  CLUSTER                                 -                              
         (NAME (WG01.QASE.WDQ1BK)                -                              
          MGMTCLAS(TP0) DATACLAS(MVOL)           -                              
          STORCLAS(TP0B)                         -                              
          UNIQUE                                 -                              
          CYL (230 20)                           -                              
          IMBED                                  -                              
          SPEED                                  -                              
          FREESPACE (20 5)                       -                              
          SHAREOPTIONS (3 3)                     -                              
          INDEXED KEYS (42,1)                    -                              
          RECORDSIZE (60,60))                    -                              
 DATA    (CISZ (4096)                            -                              
          NAME (WG01.QASE.WDQ1BK.DATA))          -                              
 INDEX   (CISZ (8192)                            -                              
          NAME (WG01.QASE.WDQ1BK.INDEX))                                        
