 /*      VSAM-DEFINITION AV WDQ2E                                     */        
 DELETE  (WG01.QASE.WDQ2EK)                                                     
 /*                                                                   */        
 DEFINE  CLUSTER                                 -                              
         (NAME (WG01.QASE.WDQ2EK)                -                              
          MGMTCLAS(TP0) DATACLAS(MVOL)           -                              
          UNIQUE                                 -                              
          CYL (5 2)                             -                               
          IMBED                                  -                              
          SPEED                                  -                              
          FREESPACE (20 5)                       -                              
          SHAREOPTIONS (3 3)                     -                              
          INDEXED KEYS (16,5)                    -                              
          RECORDSIZE (22,22))                    -                              
 DATA    (CISZ (4096)                            -                              
          NAME (WG01.QASE.WDQ2EK.DATA))          -                              
 INDEX   (CISZ (8192)                            -                              
          NAME (WG01.QASE.WDQ2EK.INDEX))                                        
