 /*      VSAM-DEFINITION AV WDQ2D                                     */        
 DELETE  (WG01.QASE.WDQ2DK)                                                     
 /*                                                                   */        
 DEFINE  CLUSTER                                 -                              
         (NAME (WG01.QASE.WDQ2DK)                -                              
          MGMTCLAS(TP0) DATACLAS(MVOL)           -                              
          UNIQUE                                 -                              
          CYL (40 2)                             -                              
          IMBED                                  -                              
          SPEED                                  -                              
          FREESPACE (20 5)                       -                              
          SHAREOPTIONS (3 3)                     -                              
          INDEXED KEYS (16,5)                    -                              
          RECORDSIZE (26,26))                    -                              
 DATA    (CISZ (4096)                            -                              
          NAME (WG01.QASE.WDQ2DK.DATA))          -                              
 INDEX   (CISZ (8192)                            -                              
          NAME (WG01.QASE.WDQ2DK.INDEX))                                        
