 /*      VSAM-DEFINITION AV WDQ3G                                     */        
 DELETE  (WG01.QASE.WDQ3GK)                                                     
 /*                                                                   */        
 DEFINE  CLUSTER                                 -                              
         (NAME (WG01.QASE.WDQ3GK)                -                              
          MGMTCLAS(TP0) DATACLAS(MVOL)           -                              
          UNIQUE                                 -                              
          CYL (90 10)                            -                              
          IMBED                                  -                              
          SPEED                                  -                              
          FREESPACE (20 5)                       -                              
          SHAREOPTIONS (3 3)                     -                              
          INDEXED KEYS (29,1)                    -                              
          RECORDSIZE (72,72))                    -                              
 DATA    (CISZ (4096)                            -                              
          NAME (WG01.QASE.WDQ3GK.DATA))          -                              
 INDEX   (CISZ (8192)                            -                              
          NAME (WG01.QASE.WDQ3GK.INDEX))                                        
 /*                                                                   */        
