 /*      VSAM-DEFINITION AV WDQ3D                                     */        
 DELETE  (WG01.QASE.WDQ3DK)                                                     
 /*                                                                   */        
 DEFINE  CLUSTER                                 -                              
         (NAME (WG01.QASE.WDQ3DK)                -                              
          MGMTCLAS(TP0) DATACLAS(MVOL)           -                              
          UNIQUE                                 -                              
          CYL (25 2)                             -                              
          IMBED                                  -                              
          SPEED                                  -                              
          FREESPACE (5 5)                        -                              
          SHAREOPTIONS (3 3)                     -                              
          INDEXED KEYS (12,1)                    -                              
          RECORDSIZE (26,26))                    -                              
 DATA    (CISZ (4096)                            -                              
          NAME (WG01.QASE.WDQ3DK.DATA))          -                              
 INDEX   (CISZ (8192)                            -                              
          NAME (WG01.QASE.WDQ3DK.INDEX))                                        
