 /*      VSAM-DEFINITION AV WDQ3F                                     */        
 DELETE  (WG01.QASE.WDQ3FK)                                                     
 /*                                                                   */        
 DEFINE  CLUSTER                                 -                              
         (NAME (WG01.QASE.WDQ3FK)                -                              
          MGMTCLAS(TP0) DATACLAS(MVOL)           -                              
          UNIQUE                                 -                              
          CYL (40 10)                            -                              
          IMBED                                  -                              
          SPEED                                  -                              
          FREESPACE (20 5)                       -                              
          SHAREOPTIONS (3 3)                     -                              
          INDEXED KEYS (24,1)                    -                              
          RECORDSIZE (42,42))                    -                              
 DATA    (CISZ (4096)                            -                              
          NAME (WG01.QASE.WDQ3FK.DATA))          -                              
 INDEX   (CISZ (8192)                            -                              
          NAME (WG01.QASE.WDQ3FK.INDEX))                                        
 /*                                                                   */        
