 /*      VSAM-DEFINITION AV WDQ3J                                     */        
 DELETE  (WG01.QASE.WDQ3JK)                                                     
 /*                                                                   */        
 DEFINE  CLUSTER                                 -                              
         (NAME (WG01.QASE.WDQ3JK)                -                              
          MGMTCLAS(TP0) DATACLAS(MVOL)           -                              
          UNIQUE                                 -                              
          CYL (05 10)                            -                              
          IMBED                                  -                              
          SPEED                                  -                              
          FREESPACE (20 5)                       -                              
          SHAREOPTIONS (3 3)                     -                              
          INDEXED KEYS (26,1)                    -                              
          RECORDSIZE (48,48))                    -                              
 DATA    (CISZ (4096)                            -                              
          NAME (WG01.QASE.WDQ3JK.DATA))          -                              
 INDEX   (CISZ (8192)                            -                              
          NAME (WG01.QASE.WDQ3JK.INDEX))                                        
 /*                                                                   */        
