 /*      VSAM-DEFINITION AV WDQ3I                                     */        
 DELETE  (WG01.QASE.WDQ3IK)                                                     
 /*                                                                   */        
 DEFINE  CLUSTER                                 -                              
         (NAME (WG01.QASE.WDQ3IK)                -                              
          MGMTCLAS(TP0) DATACLAS(MVOL)           -                              
          UNIQUE                                 -                              
          CYL (10 10)                            -                              
          IMBED                                  -                              
          SPEED                                  -                              
          FREESPACE (20 5)                       -                              
          SHAREOPTIONS (3 3)                     -                              
          INDEXED KEYS (14,1)                    -                              
          RECORDSIZE (28,28))                    -                              
 DATA    (CISZ (4096)                            -                              
          NAME (WG01.QASE.WDQ3IK.DATA))          -                              
 INDEX   (CISZ (8192)                            -                              
          NAME (WG01.QASE.WDQ3IK.INDEX))                                        
 /*                                                                   */        
