 /*      VSAM-DEFINITION AV WDQ4                                      */        
 DELETE  (WG01.QASE.WDQ4K)                                                      
 /*                                                                   */        
 DEFINE  CLUSTER                                 -                              
         (NAME (WG01.QASE.WDQ4K)                 -                              
          MGMTCLAS(TP0) DATACLAS(MVOL)           -                              
          STORCLAS(TP0B)                         -                              
          UNIQUE                                 -                              
          CYL (300 20)                           -                              
          IMBED                                  -                              
          SPEED                                  -                              
          FREESPACE (40 30)                      -                              
          SHAREOPTIONS (3 3)                     -                              
          INDEXED KEYS (20,6)                    -                              
          RECORDSIZE (370,370))                  -                              
 DATA    (CISZ (4096)                            -                              
          NAME (WG01.QASE.WDQ4K.DATA))           -                              
 INDEX   (CISZ (8192)                            -                              
          NAME (WG01.QASE.WDQ4K.INDEX))                                         
