 /*      VSAM-DEFINITION AV WDQ4A                                     */        
 DELETE  (WG01.QASE.WDQ4AK)                                                     
 /*                                                                   */        
 DEFINE  CLUSTER                                 -                              
         (NAME (WG01.QASE.WDQ4AK)                -                              
          MGMTCLAS(TP0) DATACLAS(MVOL)           -                              
          UNIQUE                                 -                              
          CYL (60 10)                            -                              
          IMBED                                  -                              
          SPEED                                  -                              
          FREESPACE (40 20)                      -                              
          SHAREOPTIONS (3 3)                     -                              
          INDEXED KEYS (20,1)                    -                              
          RECORDSIZE (42,42))                    -                              
 DATA    (CISZ (4096)                            -                              
          NAME (WG01.QASE.WDQ4AK.DATA))          -                              
 INDEX   (CISZ (8192)                            -                              
          NAME (WG01.QASE.WDQ4AK.INDEX))                                        
