 /*      VSAM-DEFINITION AV WDQ4B                                     */        
 DELETE  (WG01.QASE.WDQ4BK)                                                     
 /*                                                                   */        
 DEFINE  CLUSTER                                 -                              
         (NAME (WG01.QASE.WDQ4BK)                -                              
          MGMTCLAS(TP0) DATACLAS(MVOL)           -                              
          UNIQUE                                 -                              
          CYL (15 5)                             -                              
          IMBED                                  -                              
          SPEED                                  -                              
          FREESPACE (30 5)                       -                              
          SHAREOPTIONS (3 3)                     -                              
          INDEXED KEYS (37,1)                    -                              
          RECORDSIZE (62,62))                    -                              
 DATA    (CISZ (4096)                            -                              
          NAME (WG01.QASE.WDQ4BK.DATA))          -                              
 INDEX   (CISZ (8192)                            -                              
          NAME (WG01.QASE.WDQ4BK.INDEX))                                        
