 /*      VSAM-DEFINITION AV WDQ5                                      */        
 DELETE  (WG01.QASE.WDQ5K)                                                      
 /*                                                                   */        
 DEFINE  CLUSTER                                 -                              
         (NAME (WG01.QASE.WDQ5K)                 -                              
          MGMTCLAS(TP0) DATACLAS(MVOL)           -                              
          STORCLAS(TP0B)                         -                              
          UNIQUE                                 -                              
          CYL (200 10)                            -                             
          IMBED                                  -                              
          SPEED                                  -                              
          FREESPACE (10 5)                       -                              
          SHAREOPTIONS (3 3)                     -                              
          INDEXED KEYS (17,6)                    -                              
          RECORDSIZE (340,340))                  -                              
 DATA    (CISZ (4096)                            -                              
          NAME (WG01.QASE.WDQ5K.DATA))           -                              
 INDEX   (CISZ (8192)                            -                              
          NAME (WG01.QASE.WDQ5K.INDEX))                                         
