 /*      VSAM-DEFINITION AV WDR3                                      */        
 DELETE  (WG01.QASE.WDR3K)                                                      
 /*                                                                   */        
 DEFINE  CLUSTER                                 -                              
         (NAME (WG01.QASE.WDR3K)                 -                              
          MGMTCLAS(TP0) DATACLAS(MVOL)           -                              
          UNIQUE                                 -                              
          CYL (10 10)                            -                              
          IMBED                                  -                              
          SPEED                                  -                              
          FREESPACE (10 5)                       -                              
          SHAREOPTIONS (3 3)                     -                              
          INDEXED KEYS (27,6)                    -                              
          RECORDSIZE (240,240))                  -                              
 DATA    (CISZ (4096)                            -                              
          NAME (WG01.QASE.WDR3K.DATA))           -                              
 INDEX   (CISZ (8192)                            -                              
          NAME (WG01.QASE.WDR3K.INDEX))                                         
