 /*      VSAM-DEFINITION FÖR WDT1D                                      00020002
 /*                                                                     00030000
 DELETE  (WG01.QASE.WDT1DK)                                             00040002
 /*                                                                     00050000
 DEFINE  CLUSTER                                  -                     00060000
         (NAME (WG01.QASE.WDT1DK)                 -                     00070002
          MGMTCLAS(TP0) DATACLAS(MVOL)            -                     00080000
          UNIQUE                                  -                     00090000
          CYL (1 1)                               -                     00100000
          SPEED                                   -                     00110000
          FREESPACE (05 05)                       -                     00120000
          SHAREOPTIONS (3 3)                      -                     00130000
          INDEXED KEYS (21,1)                     -                     00140001
          RECORDSIZE (42,42))                     -                     00150001
 DATA    (CISZ (4096)                             -                     00160000
          NAME (WG01.QASE.WDT1DK.DATA))           -                     00170002
 INDEX   (CISZ (8192)                             -                     00180000
          NAME (WG01.QASE.WDT1DK.INDEX))                                00190002
 /*                                                                     00200000
