 /*      VSAM-DEFINITION FÖR WDT1F                                      00020004
 /*                                                                     00030000
 DELETE  (WG01.QASE.WDT1FK)                                             00040004
 /*                                                                     00050000
 DEFINE  CLUSTER                                  -                     00060000
         (NAME (WG01.QASE.WDT1FK)                 -                     00070004
          MGMTCLAS(TP0) DATACLAS(MVOL)            -                     00080000
          UNIQUE                                  -                     00090000
          CYL (1 1)                               -                     00100000
          SPEED                                   -                     00110000
          FREESPACE (05 05)                       -                     00120000
          SHAREOPTIONS (3 3)                      -                     00130000
          INDEXED KEYS (30,1)                     -                     00140003
          RECORDSIZE (50,50))                     -                     00150003
 DATA    (CISZ (4096)                             -                     00160000
          NAME (WG01.QASE.WDT1FK.DATA))           -                     00170004
 INDEX   (CISZ (8192)                             -                     00180000
          NAME (WG01.QASE.WDT1FK.INDEX))                                00190004
 /*                                                                     00200000
