 /*      VSAM-DEFINITION FÖR WDT1G                                      00020005
 /*                                                                     00030000
 DELETE  (WG01.QASE.WDT1GK)                                             00040005
 /*                                                                     00050000
 DEFINE  CLUSTER                                  -                     00060000
         (NAME (WG01.QASE.WDT1GK)                 -                     00070005
          MGMTCLAS(TP0) DATACLAS(MVOL)            -                     00080000
          UNIQUE                                  -                     00090000
          CYL (1 1)                               -                     00100000
          SPEED                                   -                     00110000
          FREESPACE (05 05)                       -                     00120000
          SHAREOPTIONS (3 3)                      -                     00130000
          INDEXED KEYS (23,1)                     -                     00140006
          RECORDSIZE (44,44))                     -                     00150006
 DATA    (CISZ (4096)                             -                     00160000
          NAME (WG01.QASE.WDT1GK.DATA))           -                     00170005
 INDEX   (CISZ (8192)                             -                     00180000
          NAME (WG01.QASE.WDT1GK.INDEX))                                00190005
 /*                                                                     00200000
