 SORT FIELDS=(1,13,CH,A,14,2,PD,A)                                              
 SUM FIELDS=NONE                                                                
