 /*      VSAM-DEFINITION FÖR WGB1A                                    */        
 /*                                                                   */        
 DELETE  (WG01.QASE.WGB1AK)                                                     
 /*                                                                   */        
 DEFINE  CLUSTER                                  -                             
         (NAME (WG01.QASE.WGB1AK)                 -                             
          MGMTCLAS(TP0)                           -                             
          UNIQUE                                  -                             
          CYL (1 1)                              -                              
          IMBED                                   -                             
          SPEED                                   -                             
          FREESPACE (10 00)                       -                             
          SHAREOPTIONS (3 3)                      -                             
          INDEXED KEYS (9,5)                      -                             
          RECORDSIZE (14,14))                     -                             
 DATA    (CISZ (4096)                             -                             
          NAME (WG01.QASE.WGB1AK.DATA))           -                             
 INDEX   (CISZ (8192)                             -                             
          NAME (WG01.QASE.WGB1AK.INDEX))                                        
 /*                                                                   */        
