** SORT ON THE IDARTNR AND IDDC                                                 
 SORT FIELDS=(1,5,PD,A,6,2,CH,A)                                                
