    INCLUDE COND=(25,2,CH,NE,C'11')                                     00010027
    SORT FIELDS=(25,2,CH,A,1,4,ZD,A,54,1,ZD,A,                *         00020027
               18,7,ZD,A,5,6,ZD,A,95,5,ZD,A)                            00030027
