 SORT FIELDS=(11,4,PD,A,86,3,PD,A),                                             
 FILSZ=E5000                                                                    
