 OPTION Y2PAST=1950                                                     00010025
 SORT FIELDS=(1,2,Y2C,A,3,2,ZD,A,5,2,CH,A,7,4,CH,A,11,1,ZD,A,12,4,ZD,A) 00020025
