 SORT    FIELDS=(25,2,CH,A,42,8,ZD,A)                                           
 INCLUDE COND=(25,2,CH,NE,C'11')                                                
