     ALTSEQ  CODE=(000A,010B,020C,030D,040E)                            00001014
     SORT    FIELDS=(1,3,AQ,A,4,3,PD,A)                                 00010014
