 SORT FIELDS=(4,4,PD,A,8,3,PD,A),                                               
 FILSZ=E5000                                                                    
