     OPTION Y2PAST=1950                                                 00010002
     SORT    FIELDS=(1,2,Y2C,A,3,2,ZD,A)                                00020002
