 SORT FIELDS=(1,4,PD,A,5,2,CH,A,7,4,PD,A,11,2,PD,A),                    0000000 
 FILSZ=E5000                                                            0000000 
