     INCLUDE COND=(36,2,CH,NE,C'11')                                    00010017
     SORT    FIELDS=(36,2,CH,A,1,4,ZD,A)                                00020018
