     ALTSEQ  CODE=(F0FA,F1FB,F2FC,F3FD,F4FE)                            00010019
     SORT    FIELDS=(1,1,AQ,A,2,3,CH,A,5,2,CH,A,7,3,PD,A)               00030019
