 OPTION Y2PAST=1950                                                             
 SORT FIELDS=(4,5,PD,A,9,3,PD,A,12,2,Y2P,A,13,3,PD,A),FILSZ=E10000              
