*                                                                               
         PCB   TYPE=DB,DBDNAME=WDF5,PROCOPT=G,KEYLEN=11,POS=S                   
         SENSEG NAME=WDF501,PARENT=0,PROCOPT=GIRD                               
         SENSEG NAME=WDF502,PARENT=WDF501,PROCOPT=GIRD                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDF5A,PROCOPT=GOT,KEYLEN=41,POS=S                
         SENSEG NAME=WDF5A1,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDF5B,PROCOPT=GOT,KEYLEN=41,POS=S                
         SENSEG NAME=WDF5B1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W00107                                       
         END                                                                    
