*        SÄNDER MAIL TILL VALFRI MOTTAGARE                                      
*                                                                               
*        TRANS TILL DISTRIBUTION & PRINT                                        
DISTRDOC PCB   TYPE=TP,NAME=WZ0420X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W00541                                       
         END                                                                    
