*                                                                               
         PCB   TYPE=DB,DBDNAME=WDP5,PROCOPT=G,KEYLEN=21,POS=S                   
         SENSEG NAME=WDP501,PARENT=0,PROCOPT=GID                                
         SENSEG NAME=WDP512,PARENT=WDP501,PROCOPT=GID                           
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDP5,PROCOPT=GOT,KEYLEN=21,POS=S                 
         SENSEG NAME=WDP501,PARENT=0                                            
         SENSEG NAME=WDP512,PARENT=WDP501                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W00555                                       
         END                                                                    
