*        WINFO                                                                  
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W00503,IOASIZE=132                           
         END                                                                    
