*        SECURITY UPDATE                                                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GR                               
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W00514                                       
         END                                                                    
