*        DUMMY-PROGRAM FÖR LOGON-FORMAT                                         
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W00501                                       
         END                                                                    
