*        CHANGE-CALL PROGRAM FÖR PV (V2)                                        
*                                                                               
         PCB   TYPE=TP,NAME=,ALTRESP=NO,SAMETRM=NO,                    *        
               MODIFY=YES,EXPRESS=NO                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W00505                                       
         END                                                                    
