*        DISPATCHER                                                             
*                                                                               
         PCB   TYPE=TP,NAME=W0T621,ALTRESP=NO,SAMETRM=NO,              *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLKOMB,PROCOPT=GOT,KEYLEN=25,POS=S               
         SENSEG NAME=WLKOMB01,PARENT=0                                          
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W00622                                       
         END                                                                    
