*          DATA SET W00608PII0 AT LEVEL 002 AS OF 90/02/26                      
*                                                                               
         PCB   TYPE=TP,NAME=W0T709U,ALTRESP=NO,SAMETRM=NO,             *        
                MODIFY=NO,EXPRESS=NO                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W00608,IOASIZE=132                           
         END                                                                    
