*          DATA SET W00604PII0 AT LEVEL 004 AS OF 87/08/12                      
*                                                                               
         PCB   TYPE=TP,NAME=W0T606U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXDD,PROCOPT=G,KEYLEN=38,POS=S                 
         SENSEG NAME=WLXXDD01,PARENT=0                                          
         SENSEG NAME=WLXXDD11,PARENT=WLXXDD01,PROCOPT=GD                        
         SENSEG NAME=WLXXDD12,PARENT=WLXXDD01,PROCOPT=GR                        
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W00604                                       
         END                                                                    
