*        ÅTERSTART AV LISTOR                                                    
*                                                                               
         PCB   TYPE=TP,NAME=W0T691X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLLISB,PROCOPT=GR,KEYLEN=17,POS=S                
         SENSEG NAME=WLLISB01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLLISC,PROCOPT=GOT,KEYLEN=17,POS=S               
         SENSEG NAME=WLLISC01,PARENT=0                                          
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W00601                                       
         END                                                                    
