*          DATA SET W00701PII0 AT LEVEL 005 AS OF 87/08/12                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLJCLA,PROCOPT=G,KEYLEN=46,POS=S                 
         SENSEG NAME=WLJCLA01,PARENT=0                                          
         SENSEG NAME=WLJCLA11,PARENT=WLJCLA01,PROCOPT=GID                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLJCLA,PROCOPT=GOT,KEYLEN=46,POS=S               
         SENSEG NAME=WLJCLA01,PARENT=0                                          
         SENSEG NAME=WLJCLA11,PARENT=WLJCLA01                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W00701                                       
         END                                                                    
