*          DATA SET W00707PII0 AT LEVEL 004 AS OF 87/08/12                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLJCLA,PROCOPT=GOT,KEYLEN=46,POS=S               
         SENSEG NAME=WLJCLA01,PARENT=0                                          
         SENSEG NAME=WLJCLA11,PARENT=WLJCLA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLJCLD,PROCOPT=G,KEYLEN=33,POS=S                 
         SENSEG NAME=WLJCLD01,PARENT=0                                          
         SENSEG NAME=WLJCLD12,PARENT=WLJCLD01,PROCOPT=A                         
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W00707                                       
         END                                                                    
