*          DATA SET W00812PII0 AT LEVEL 001 AS OF 88/06/27                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXJM,PROCOPT=GOT,KEYLEN=35,POS=S               
         SENSEG NAME=WLXXJM01,PARENT=0                                          
         SENSEG NAME=WLXXJM11,PARENT=WLXXJM01                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W00812                                       
         END                                                                    
