*          DATA SET W00807PII0 AT LEVEL 002 AS OF 87/08/12                      
*                                                                               
         PCB  TYPE=DB,DBDNAME=WL4738,PROCOPT=G,KEYLEN=31,POS=S                  
         SENSEG NAME=WL473801,PARENT=0,PROCOPT=GID                              
         SENSEG NAME=WL473811,PARENT=WL473801,PROCOPT=GIR                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W00807                                       
         END                                                                    
