*********************  PSB W00832                                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLZZAD,PROCOPT=G,KEYLEN=09,POS=S                 
         SENSEG NAME=WLZZAD01,PARENT=0,PROCOPT=GI                               
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W00832                                       
         END                                                                    
