*                                                                               
         PCB    TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                 
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXDT,PROCOPT=G,KEYLEN=31,POS=S                 
         SENSEG NAME=WLXXDT01,PARENT=0,PROCOPT=GID                              
         SENSEG NAME=WLXXDT11,PARENT=WLXXDT01,PROCOPT=GIR                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=5,POS=S                
         SENSEG NAME=WLARTC01,PARENT=0                                          
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W00816                                       
         END                                                                    
