*          DATA SET W00811PII0 AT LEVEL 001 AS OF 88/06/27                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXJM,PROCOPT=G,KEYLEN=35,POS=S                 
         SENSEG NAME=WLXXJM01,PARENT=0                                          
         SENSEG NAME=WLXXJM11,PARENT=WLXXJM01,PROCOPT=GIR                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXJN,PROCOPT=G,KEYLEN=40,POS=S                 
         SENSEG NAME=WLXXJN01,PARENT=0                                          
         SENSEG NAME=WLXXJN11,PARENT=WLXXJN01,PROCOPT=GID                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W00811                                       
         END                                                                    
