*          DATA SET W00803PII0 AT LEVEL 002 AS OF 87/08/12                      
*                                                                               
         PCB  TYPE=DB,DBDNAME=WLXXDA,PROCOPT=G,KEYLEN=31,POS=S                  
         SENSEG NAME=WLXXDA01,PARENT=0,PROCOPT=GID                              
         SENSEG NAME=WLXXDA11,PARENT=WLXXDA01,PROCOPT=GI                        
*                                                                               
         PCB  TYPE=DB,DBDNAME=WLXXDB,PROCOPT=G,KEYLEN=31,POS=S                  
         SENSEG NAME=WLXXDB01,PARENT=0,PROCOPT=GID                              
         SENSEG NAME=WLXXDB11,PARENT=WLXXDB01,PROCOPT=GI                        
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W00803                                       
         END                                                                    
