*          DATA SET W00805PII0 AT LEVEL 024 AS OF 90/10/16                      
*          DATA SET W00805PII0 AT LEVEL 002 AS OF 90/04/18                      
*                                                                               
*        FÖRÅDSDATATEXT          WDGX HTYP=4535                                 
*                                                                               
         PCB    TYPE=DB,DBDNAME=WLXXKU,PROCOPT=G,KEYLEN=35,POS=S                
         SENSEG NAME=WLXXKU01,PARENT=0,PROCOPT=GIRD                             
         SENSEG NAME=WLXXKU11,PARENT=WLXXKU01,PROCOPT=GIRD                      
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W00805                                       
         END                                                                    
