*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=G,KEYLEN=18,POS=S                   
         SENSEG NAME=WDK601,PARENT=0,PROCOPT=GR                                 
         SENSEG NAME=WDK611,PARENT=WDK601,PROCOPT=GR                            
         SENSEG NAME=WDK613,PARENT=WDK601,PROCOPT=GRI                           
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDJ9,PROCOPT=G,KEYLEN=25,POS=S                   
         SENSEG NAME=WDJ901,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDJ911,PARENT=WDJ901,PROCOPT=GI                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLLOGA,PROCOPT=G,KEYLEN=20,POS=S                 
         SENSEG NAME=WLLOGA01,PARENT=0,PROCOPT=GI                               
*                                                                               
* WDK6-PCB2                                                                     
         PCB TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=06,POS=S                   
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
* WDD7A-PCB                                                                     
         PCB TYPE=DB,DBDNAME=WDD7A,PROCOPT=GOT,KEYLEN=12,POS=S                  
         SENSEG NAME=WDD7A1,PARENT=0                                            
*                                                                               
* WDG3   OMSPEC-ORSAK     IDHTYP=2204                                           
         PCB   TYPE=DB,DBDNAME=WLXXBJ,PROCOPT=G,KEYLEN=40,POS=S                 
         SENSEG NAME=WLXXBJ01,PARENT=0                                          
         SENSEG NAME=WLXXBJ11,PARENT=WLXXBJ01,PROCOPT=GI                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR8,PROCOPT=G,KEYLEN=27,POS=S                   
         SENSEG NAME=WDR801,PARENT=0,PROCOPT=GIR                                
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
*WDK7-PCB                                                                       
         PCB TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=08,POS=S                   
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK722,PARENT=WDK711                                       
*                                                                               
*WDT3-PCB                                                                       
         PCB TYPE=DB,DBDNAME=WDT3,PROCOPT=G,KEYLEN=20,POS=S                     
         SENSEG NAME=WDT301,PARENT=0                                            
         SENSEG NAME=WDT311,PARENT=WDT301,PROCOPT=GI                            
*                                                                               
*XXBX-PCB - ANSK-ALARM  WDR2  IDHTYP=2231                                       
         PCB   TYPE=DB,DBDNAME=WDR2,PROCOPT=GOT,KEYLEN=35,POS=S                 
         SENSEG NAME=WDR201,PARENT=0                                            
         SENSEG NAME=WDR220,PARENT=WDR201                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=G,KEYLEN=40,POS=S                   
         SENSEG NAME=WDR501,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDR550,PARENT=WDR501,PROCOPT=GIRD                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDT5,PROCOPT=G,KEYLEN=19,POS=S                   
         SENSEG NAME=WDT501,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDT511,PARENT=WDT501,PROCOPT=GIR                           
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W01102,CMPAT=YES                             
         END                                                                    
