*                                                                               
*        LÄSNING AV WDD2 MED HSSR                                               
         PCB   TYPE=DB,DBDNAME=WDD2,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDD201,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W01166                                       
         END                                                                    
