*                                                                               
*        LÄSER WDD9 MED HSSR                                                    
         PCB   TYPE=DB,DBDNAME=WDD9,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDD901,PARENT=0                                            
         SENSEG NAME=WDD902,PARENT=WDD901                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W01173                                       
         END                                                                    
