*                                                                               
         PCB   TYPE=DB,DBDNAME=WDQ2,PROCOPT=G,KEYLEN=88,POS=S                   
         SENSEG NAME=WDQ201,PARENT=0,PROCOPT=GR                                 
*                                                                               
         PCB   TYPE=DB,DBDNAME=WL4579,PROCOPT=G,KEYLEN=31,POS=S                 
         SENSEG NAME=WL457901,PARENT=0,PROCOPT=GIRD                             
         SENSEG NAME=WL457911,PARENT=WL457901,PROCOPT=GIRD                      
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W01568,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
