*        RENSNING ÅTERSTARTSREGISTRET                                           
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDG8,PROCOPT=GD,KEYLEN=17,POS=S                  
         SENSEG NAME=WDG801,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDG8A,PROCOPT=GOT,KEYLEN=17,POS=S                
         SENSEG NAME=WDG8A1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W01541,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
