*                                                                               
         PCB   TYPE=TP,NAME=W4T397X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE4,PROCOPT=GOT,KEYLEN=07,POS=S,       *        
               PROCSEQ=WDE4E                                                    
         SENSEG NAME=WDE401,PARENT=0                                            
         SENSEG NAME=WDE411,PARENT=WDE401                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDQ3,PROCOPT=GOT,KEYLEN=06,POS=S,       *        
               PROCSEQ=WDQ3D                                                    
         SENSEG NAME=WDQ301,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W015X2                                       
         END                                                                    
