*                                                                               
         PCB   TYPE=DB,DBDNAME=WDQ3,PROCOPT=A,KEYLEN=12,POS=S                   
         SENSEG NAME=WDQ301,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W015X9                                       
         END                                                                    
