***** DISPATCHER                                                                
         PCB   TYPE=TP,NAME=W0T693X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
**** KOMMUNIKATIONS DB                                                          
         PCB   TYPE=DB,DBDNAME=WDP8,PROCOPT=GOT,KEYLEN=28,POS=S                 
         SENSEG NAME=WDP801,PARENT=0                                            
         SENSEG NAME=WDP811,PARENT=WDP801                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W01521,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
