*                                                                               
         PCB   TYPE=DB,DBDNAME=W6H7,PROCOPT=G,KEYLEN=06,POS=S                   
         SENSEG NAME=W6H701,PARENT=0                                            
         SENSEG NAME=W6H714,PARENT=W6H701,PROCOPT=GI                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W01512                                       
         END                                                                    
