*        RENSNING HELP-DATABASE                                                 
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDP5,PROCOPT=G,KEYLEN=21,POS=S                   
         SENSEG NAME=WDP501,PARENT=0,PROCOPT=GD                                 
         SENSEG NAME=WDP512,PARENT=WDP501                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W01542,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
