*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=06,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR2,PROCOPT=GOT,KEYLEN=35,POS=S                 
         SENSEG NAME=WDR201,PARENT=0                                            
         SENSEG NAME=WDR220,PARENT=WDR201                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=G,KEYLEN=40,POS=S                   
         SENSEG NAME=WDR501,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDR550,PARENT=WDR501,PROCOPT=GI                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W09275,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
