*                                                                               
         PCB   TYPE=DB,DBDNAME=WLZZAC,PROCOPT=GOT,KEYLEN=18,POS=S               
         SENSEG NAME=WLZZAC01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W09208                                       
         END                                                                    
