* W0W521T ACCESS THE DB2 TABLE TP0WLOG                                          
         PSBGEN LANG=COBOL,PSBNAME=W0W521                                       
         END                                                                    
