*          DATA SET W10153PII0 AT LEVEL 001 AS OF 88/05/24                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GIR,KEYLEN=8,POS=S                
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
         PCB TYPE=DB,DBDNAME=WLXXAQ,PROCOPT=G,KEYLEN=45,POS=S                   
         SENSEG NAME=WLXXAQ01,PARENT=0                                          
         SENSEG NAME=WLXXAQ11,PARENT=WLXXAQ01,PROCOPT=GIRD                      
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W10153                                       
         END                                                                    
