*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GIR,KEYLEN=8,POS=S                
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTG,PROCOPT=G,KEYLEN=5,POS=S                  
         SENSEG NAME=WLARTG01,PARENT=0,PROCOPT=GR                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTG,PROCOPT=G,KEYLEN=5,POS=S                  
         SENSEG NAME=WLARTG01,PARENT=0,PROCOPT=GD                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
         SENSEG NAME=WLARTC22,PARENT=WLARTC11                                   
         SENSEG NAME=WLARTC23,PARENT=WLARTC11                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXAS,PROCOPT=GOT,KEYLEN=40,POS=S               
         SENSEG NAME=WLXXAS01,PARENT=0                                          
         SENSEG NAME=WLXXAS11,PARENT=WLXXAS01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLZZAC,PROCOPT=G,KEYLEN=18,POS=S                 
         SENSEG NAME=WLZZAC01,PARENT=0,PROCOPT=GI                               
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W10115                                       
         END                                                                    
