*          DATA SET W10161PII0 AT LEVEL 001 AS OF 88/09/27                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTG,PROCOPT=GOT,KEYLEN=11,POS=S               
         SENSEG NAME=WLARTG01,PARENT=0                                          
         SENSEG NAME=WLARTG11,PARENT=WLARTG01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTJ,PROCOPT=GOT,KEYLEN=19,POS=S               
         SENSEG NAME=WLARTJ01,PARENT=0                                          
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W10161                                       
         END                                                                    
