*          DATA SET W10114PII0 AT LEVEL 002 AS OF 88/11/28                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GIR,KEYLEN=08,POS=S               
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXAP,PROCOPT=G,KEYLEN=46,POS=S                 
         SENSEG NAME=WLXXAP01,PARENT=0                                          
         SENSEG NAME=WLXXAP11,PARENT=WLXXAP01,PROCOPT=GR                        
         SENSEG NAME=WLXXAP12,PARENT=WLXXAP01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTG,PROCOPT=G,KEYLEN=11,POS=S                 
         SENSEG NAME=WLARTG01,PARENT=0,PROCOPT=GR                               
         SENSEG NAME=WLARTG11,PARENT=WLARTG01,PROCOPT=GIRD                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTG,PROCOPT=G,KEYLEN=11,POS=S                 
         SENSEG NAME=WLARTG01,PARENT=0,PROCOPT=GR                               
         SENSEG NAME=WLARTG11,PARENT=WLARTG01,PROCOPT=GI                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTJ,PROCOPT=GOT,KEYLEN=15,POS=S               
         SENSEG NAME=WLARTJ01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=G,KEYLEN=07,POS=S                 
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
         SENSEG NAME=WLARTC25,PARENT=WLARTC11,PROCOPT=GIRD                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLERSB,PROCOPT=GOT,KEYLEN=12,POS=S               
         SENSEG NAME=WLERSB01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=13,POS=S,     *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W10114                                       
         END                                                                    
