*                                                                               
         PCB TYPE=DB,DBDNAME=WLARTH,PROCOPT=GOT,KEYLEN=17,POS=S                 
         SENSEG NAME=WLARTH01,PARENT=0                                          
*                                                                               
         PCB TYPE=DB,DBDNAME=WLARTG,PROCOPT=G,KEYLEN=5,POS=S                    
         SENSEG NAME=WLARTG01,PARENT=0,PROCOPT=GR                               
*                                                                               
         PCB TYPE=DB,DBDNAME=WLZZAC,PROCOPT=G,KEYLEN=105,POS=S                  
         SENSEG NAME=WLZZAC01,PARENT=0,PROCOPT=GI                               
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W10142                                       
         END                                                                    
