*                                                                               
* BENAA-PCB                                                                     
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=G,KEYLEN=34,POS=S,       *        
               PROCSEQ=WDD3A                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
* BENA-PCB                                                                      
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=G,KEYLEN=13,POS=S                 
         SENSEG NAME=WLBENA01,PARENT=0,PROCOPT=GIR                              
         SENSEG NAME=WLBENA11,PARENT=WLBENA01,PROCOPT=GIR                       
         SENSEG NAME=WLBENA12,PARENT=WLBENA01                                   
         SENSEG NAME=WLBENA13,PARENT=WLBENA01,PROCOPT=GIR                       
* WDP7-PCB                                                                      
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GIR,KEYLEN=8,POS=S                
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
* WDK6-PCB                                                                      
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=05,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
*                                                                               
* WDG2-PCB XXAI                                                                 
         PCB   TYPE=DB,DBDNAME=WLXXAI,PROCOPT=G,KEYLEN=31,POS=S                 
         SENSEG NAME=WLXXAI01,PARENT=0                                          
         SENSEG NAME=WLXXAI11,PARENT=WLXXAI01,PROCOPT=GR                        
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W10122                                       
         END                                                                    
