*          DATA SET W10117PII0 AT LEVEL 003 AS OF 90/10/12                      
*        MSGKOM-PCB                                                             
         PCB   TYPE=TP,NAME=W0T693X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GIR,KEYLEN=8,POS=S                
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
         PCB TYPE=DB,DBDNAME=WLARTC,PROCOPT=G,KEYLEN=07,POS=S                   
         SENSEG NAME=WLARTC01,PARENT=0,PROCOPT=GR                               
         SENSEG NAME=WLARTC11,PARENT=WLARTC01,PROCOPT=GR                        
         SENSEG NAME=WLARTC25,PARENT=WLARTC11,PROCOPT=GRID                      
*                                                                               
         PCB TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=13,POS=S,       *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
         PCB TYPE=DB,DBDNAME=WLERSB,PROCOPT=GOT,KEYLEN=12,POS=S                 
         SENSEG NAME=WLERSB01,PARENT=0                                          
*                                                                               
         PCB TYPE=DB,DBDNAME=WLARTG,PROCOPT=G,KEYLEN=05,POS=S                   
         SENSEG NAME=WLARTG01,PARENT=0,PROCOPT=GIRD                             
*                                                                               
         PCB TYPE=DB,DBDNAME=WLLEVA,PROCOPT=GOT,KEYLEN=05,POS=S                 
         SENSEG NAME=WLLEVA01,PARENT=0                                          
*                                                                               
         PCB TYPE=DB,DBDNAME=WLXXAQ,PROCOPT=G,KEYLEN=45,POS=S                   
         SENSEG NAME=WLXXAQ01,PARENT=0                                          
         SENSEG NAME=WLXXAQ11,PARENT=WLXXAQ01,PROCOPT=GR                        
*                                                                               
         PCB TYPE=DB,DBDNAME=WLXXAT,PROCOPT=GOT,KEYLEN=35,POS=S                 
         SENSEG NAME=WLXXAT01,PARENT=0                                          
         SENSEG NAME=WLXXAT11,PARENT=WLXXAT01                                   
*                                                                               
         PCB TYPE=DB,DBDNAME=WLXXAP,PROCOPT=GOT,KEYLEN=40,POS=S                 
         SENSEG NAME=WLXXAP01,PARENT=0                                          
         SENSEG NAME=WLXXAP11,PARENT=WLXXAP01                                   
*                                                                               
         PCB TYPE=DB,DBDNAME=WLZZAC,PROCOPT=G,KEYLEN=18,POS=S                   
         SENSEG NAME=WLZZAC01,PARENT=0,PROCOPT=GI                               
*                                                                               
         PCB TYPE=DB,DBDNAME=WL1117,PROCOPT=G,KEYLEN=35,POS=S                   
         SENSEG NAME=WL111701,PARENT=0                                          
         SENSEG NAME=WL111711,PARENT=WL111701,PROCOPT=GIRD                      
*                                                                               
         PCB TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=07,POS=S                     
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
*                                                                               
* XXBX-PCB - ÖVERSÄTTNING ANSK-LARM  WDR2  IDHTYP=2231                          
         PCB   TYPE=DB,DBDNAME=WDR2,PROCOPT=GOT,KEYLEN=35,POS=S                 
         SENSEG NAME=WDR201,PARENT=0                                            
         SENSEG NAME=WDR220,PARENT=WDR201                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR8,PROCOPT=G,KEYLEN=27,POS=S                   
         SENSEG NAME=WDR801,PARENT=0,PROCOPT=GIR                                
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR2,PROCOPT=G,KEYLEN=40,POS=S                   
         SENSEG NAME=WDR201,PARENT=0                                            
         SENSEG NAME=WDGX2264,PARENT=WDR201,PROCOPT=GD                          
         SENSEG NAME=WDGX2266,PARENT=WDGX2264,PROCOPT=GD                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR2,PROCOPT=G,KEYLEN=40,POS=S                   
         SENSEG NAME=WDR201,PARENT=0                                            
         SENSEG NAME=WDGX2264,PARENT=WDR201,PROCOPT=GI                          
         SENSEG NAME=WDGX2266,PARENT=WDGX2264,PROCOPT=GI                        
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W10117                                       
         END                                                                    
