*                                                                               
         PCB    TYPE=DB,DBDNAME=WDP7,PROCOPT=G,KEYLEN=8,POS=S                   
         SENSEG NAME=WDP701,PARENT=0,PROCOPT=GIR                                
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDF7,PROCOPT=GOT,KEYLEN=08,POS=S                 
         SENSEG NAME=WDF701,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDF7A,PROCOPT=GOT,KEYLEN=42,POS=S                
         SENSEG NAME=WDF7A1,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD2,PROCOPT=GOT,KEYLEN=05,POS=S                 
         SENSEG NAME=WDD201,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=05,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W10105                                       
         END                                                                    
