*          DATA SET W10215PII0 AT LEVEL 002 AS OF 91/01/14                      
*                                                                               
         PCB   TYPE=TP,NAME=W1T231,MODIFY=NO                                    
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLSATB,PROCOPT=G,KEYLEN=12,POS=S                 
         SENSEG NAME=WLSATB01,PARENT=0,PROCOPT=GR                               
         SENSEG NAME=WLSATB11,PARENT=WLSATB01,PROCOPT=GIRD                      
         SENSEG NAME=WLSATB22,PARENT=WLSATB11,PROCOPT=GIRD                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=8,POS=S,      *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLARTC01,PARENT=0,PROCOPT=GR                               
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLSATB,PROCOPT=G,KEYLEN=12,POS=S                 
         SENSEG NAME=WLSATB01,PARENT=0,PROCOPT=GR                               
         SENSEG NAME=WLSATB11,PARENT=WLSATB01,PROCOPT=GIRD                      
         SENSEG NAME=WLSATB22,PARENT=WLSATB11,PROCOPT=GIRD                      
*                                                                               
          PCB   TYPE=DB,DBDNAME=WLXXBY,PROCOPT=G,KEYLEN=30,POS=S                
          SENSEG NAME=WLXXBY01,PARENT=0                                         
          SENSEG NAME=WLXXBY11,PARENT=WLXXBY01,PROCOPT=GID                      
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W10215                                       
         END                                                                    
