*          DATA SET W10292PII0 AT LEVEL 001 AS OF 90/10/23                      
*                                                                               
      PCB   TYPE=TP,NAME=,ALTRESP=NO,SAMETRM=NO,                       *        
               MODIFY=YES,EXPRESS=NO                                            
*                                                                               
      PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=7,POS=S                   
      SENSEG NAME=WLARTC01,PARENT=0                                             
      SENSEG NAME=WLARTC11,PARENT=WLARTC01                                      
*                                                                               
      PCB   TYPE=DB,DBDNAME=WLSATB,PROCOPT=GOT,KEYLEN=10,POS=S                  
      SENSEG NAME=WLSATB01,PARENT=0                                             
      SENSEG NAME=WLSATB11,PARENT=WLSATB01                                      
      SENSEG NAME=WLSATB22,PARENT=WLSATB11                                      
*                                                                               
      PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=34,POS=S,        *        
               PROCSEQ=WDD3A                                                    
      SENSEG NAME=WLBENA01,PARENT=0                                             
      SENSEG NAME=WLBENA11,PARENT=WLBENA01                                      
*                                                                               
      PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=13,POS=S,        *        
               PROCSEQ=WDD3B                                                    
      SENSEG NAME=WLBENA01,PARENT=0                                             
      SENSEG NAME=WLBENA11,PARENT=WLBENA01                                      
*                                                                               
      PSBGEN LANG=COBOL,PSBNAME=W10292                                          
      END                                                                       
