*                                                                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=31,POS=S,     *        
               PROCSEQ=WDD3A                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=8,POS=S,      *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=G,KEYLEN=6,POS=S                  
         SENSEG NAME=WLARTC01,PARENT=0,PROCOPT=GR                               
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDF5,PROCOPT=GOT,KEYLEN=11,POS=S                 
         SENSEG NAME=WDF501,PARENT=0                                            
         SENSEG NAME=WDF502,PARENT=WDF501                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDF5,PROCOPT=GOT,KEYLEN=41,POS=S,       *        
               PROCSEQ=WDF5A                                                    
         SENSEG NAME=WDF501,PARENT=0                                            
         SENSEG NAME=WDF502,PARENT=WDF501                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLSATB,PROCOPT=A,KEYLEN=12,POS=S                 
         SENSEG NAME=WLSATB01,PARENT=0                                          
         SENSEG NAME=WLSATB11,PARENT=WLSATB01                                   
         SENSEG NAME=WLSATB22,PARENT=WLSATB11                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLSATB,PROCOPT=A,KEYLEN=12,POS=S                 
         SENSEG NAME=WLSATB01,PARENT=0                                          
         SENSEG NAME=WLSATB11,PARENT=WLSATB01                                   
         SENSEG NAME=WLSATB22,PARENT=WLSATB11                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLSATB,PROCOPT=GOTP,KEYLEN=45,POS=S,    *        
               PROCSEQ=WDJ1C                                                    
         SENSEG NAME=WLSATB11,PARENT=0                                          
         SENSEG NAME=WLSATB01,PARENT=WLSATB11                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLSATB,PROCOPT=GOT,KEYLEN=18,POS=S,     *        
               PROCSEQ=WDJ1D                                                    
         SENSEG NAME=WLSATB01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXAZ,PROCOPT=G,KEYLEN=82,POS=S                 
         SENSEG NAME=WLXXAZ01,PARENT=0                                          
         SENSEG NAME=WLXXAZ11,PARENT=WLXXAZ01,PROCOPT=GD                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXBY,PROCOPT=G,KEYLEN=30,POS=S                 
         SENSEG NAME=WLXXBY01,PARENT=0                                          
         SENSEG NAME=WLXXBY11,PARENT=WLXXBY01,PROCOPT=GI                        
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W10212                                       
         END                                                                    
