*                                                                               
         PCB   TYPE=TP,NAME=W0T606U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB TYPE=DB,DBDNAME=WLKATH,PROCOPT=GOT,KEYLEN=11,POS=S,       *        
               PROCSEQ=WDN5A                                                    
         SENSEG NAME=WLKATH01,PARENT=0                                          
*                                                                               
         PCB TYPE=DB,DBDNAME=WLKATM,PROCOPT=GOT,KEYLEN=5,POS=S                  
         SENSEG NAME=WLKATM01,PARENT=0                                          
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W10524                                       
         END                                                                    
