*          DATA SET W10561PII0 AT LEVEL 003 AS OF 87/08/12                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLKATK,PROCOPT=G,KEYLEN=3,POS=S                  
         SENSEG NAME=WLKATK01,PARENT=0,PROCOPT=GIRD                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLKATM,PROCOPT=GOT,KEYLEN=5,POS=S                
         SENSEG NAME=WLKATM01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLKATB,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG NAME=WLKATB01,PARENT=0                                          
         SENSEG NAME=WLKATB11,PARENT=WLKATB01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXAJ,PROCOPT=G,KEYLEN=31,POS=S                 
         SENSEG NAME=WLXXAJ01,PARENT=0                                          
         SENSEG NAME=WLXXAJ11,PARENT=WLXXAJ01,PROCOPT=GR                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLKATO,PROCOPT=GOT,KEYLEN=20,POS=S               
         SENSEG NAME=WLKATO01,PARENT=0                                          
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W10561                                       
         END                                                                    
