*                                                                               
         PCB    TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                 
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDN1,PROCOPT=GOT,KEYLEN=09,POS=S                 
         SENSEG NAME=WDN101,PARENT=0                                            
         SENSEG NAME=WDN111,PARENT=WDN101                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDN6,PROCOPT=GOTP,KEYLEN=14,POS=S                
         SENSEG NAME=WDN601,PARENT=0                                            
         SENSEG NAME=WDN611,PARENT=WDN601                                       
         SENSEG NAME=WDN621,PARENT=WDN611                                       
         SENSEG NAME=WDN612,PARENT=WDN601                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD3,PROCOPT=GOT,KEYLEN=37,POS=S,       *        
               PROCSEQ=WDD3A                                                    
         SENSEG NAME=WDD301,PARENT=0                                            
         SENSEG NAME=WDD311,PARENT=WDD301                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD3,PROCOPT=GOT,KEYLEN=11,POS=S,       *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WDD301,PARENT=0                                            
         SENSEG NAME=WDD311,PARENT=WDD301                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W10543                                       
         END                                                                    
