*        KATALOG GENERERINGSTABELL                                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLKATM,PROCOPT=G,KEYLEN=09,POS=S                 
         SENSEG NAME=WLKATM01,PARENT=0                                          
         SENSEG NAME=WLKATM11,PARENT=WLKATM01,PROCOPT=GIRD                      
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W10533                                       
         END                                                                    
