*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GIR,KEYLEN=08,POS=S               
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLKATM,PROCOPT=G,KEYLEN=5,POS=S                  
         SENSEG NAME=WLKATM01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLKATH,PROCOPT=G,KEYLEN=21,POS=S                 
         SENSEG NAME=WLKATH01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLKATH11,PARENT=WLKATH01,PROCOPT=GID                       
         SENSEG NAME=WLKATH12,PARENT=WLKATH01,PROCOPT=GID                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLKATK,PROCOPT=GOT,KEYLEN=3,POS=S                
         SENSEG NAME=WLKATK01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDN1A,PROCOPT=GOT,KEYLEN=6,POS=S                 
         SENSEG NAME=WDN1A1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W10531                                       
         END                                                                    
