*                                                                               
          PCB   TYPE=DB,DBDNAME=WLKATM,PROCOPT=G,KEYLEN=09,POS=S                
          SENSEG NAME=WLKATM01,PARENT=0,PROCOPT=GR                              
          SENSEG NAME=WLKATM11,PARENT=WLKATM01                                  
*                                                                               
          PCB   TYPE=DB,DBDNAME=WDR2,PROCOPT=GOT,KEYLEN=33,POS=S                
          SENSEG NAME=WDR201,PARENT=0                                           
          SENSEG NAME=WDGX1212,PARENT=WDR201                                    
*                                                                               
          PCB   TYPE=DB,DBDNAME=WDR2,PROCOPT=GOT,KEYLEN=45,POS=S                
          SENSEG NAME=WDR201,PARENT=0                                           
          SENSEG NAME=WDGX1214,PARENT=WDR201                                    
*                                                                               
          PCB   TYPE=DB,DBDNAME=WDR2,PROCOPT=GOT,KEYLEN=45,POS=S                
          SENSEG NAME=WDR201,PARENT=0                                           
          SENSEG NAME=WDGX1216,PARENT=WDR201                                    
*                                                                               
          PSBGEN LANG=COBOL,PSBNAME=W10532                                      
          END                                                                   
