*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GIR,KEYLEN=08,POS=S               
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
          PCB   TYPE=DB,DBDNAME=WLKATH,PROCOPT=G,KEYLEN=21,POS=S                
          SENSEG NAME=WLKATH01,PARENT=0,PROCOPT=GR                              
          SENSEG NAME=WLKATH12,PARENT=WLKATH01,PROCOPT=G                        
          SENSEG NAME=WLKATH13,PARENT=WLKATH01,PROCOPT=A                        
*                                                                               
          PCB   TYPE=DB,DBDNAME=WDR2,PROCOPT=GOT,KEYLEN=33,POS=S                
          SENSEG NAME=WDR201,PARENT=0                                           
          SENSEG NAME=WDGX1212,PARENT=WDR201                                    
*                                                                               
          PCB   TYPE=DB,DBDNAME=WDR2,PROCOPT=GOT,KEYLEN=45,POS=S                
          SENSEG NAME=WDR201,PARENT=0                                           
          SENSEG NAME=WDGX1214,PARENT=WDR201                                    
*                                                                               
          PCB   TYPE=DB,DBDNAME=WDR2,PROCOPT=GOT,KEYLEN=45,POS=S                
          SENSEG NAME=WDR201,PARENT=0                                           
          SENSEG NAME=WDGX1216,PARENT=WDR201                                    
*                                                                               
          PCB   TYPE=DB,DBDNAME=WDR2,PROCOPT=GOT,KEYLEN=38,POS=S                
          SENSEG NAME=WDR201,PARENT=0                                           
          SENSEG NAME=WDGX1218,PARENT=WDR201                                    
*                                                                               
          PSBGEN LANG=COBOL,PSBNAME=W10515                                      
          END                                                                   
