*          DATA SET W10514PII0 AT LEVEL 003 AS OF 87/08/12                      
*                                                                               
* AVSNITT                                                                       
         PCB   TYPE=DB,DBDNAME=WLKATH,PROCOPT=G,KEYLEN=21,POS=S                 
         SENSEG NAME=WLKATH01,PARENT=0,PROCOPT=GIR                              
         SENSEG NAME=WLKATH11,PARENT=WLKATH01,PROCOPT=GIRD                      
         SENSEG NAME=WLKATH12,PARENT=WLKATH01,PROCOPT=GIRD                      
         SENSEG NAME=WLKATH22,PARENT=WLKATH12,PROCOPT=GIRD                      
         SENSEG NAME=WLKATH25,PARENT=WLKATH12,PROCOPT=GIRD                      
         SENSEG NAME=WLKATH26,PARENT=WLKATH12,PROCOPT=GIRD                      
         SENSEG NAME=WLKATH13,PARENT=WLKATH01,PROCOPT=GIRD                      
* RUBRIK                                                                        
         PCB   TYPE=DB,DBDNAME=WLKATB,PROCOPT=GOT,KEYLEN=3,POS=S                
         SENSEG NAME=WLKATB01,PARENT=0                                          
* FOTNOT                                                                        
         PCB   TYPE=DB,DBDNAME=WLKATF,PROCOPT=GOT,KEYLEN=3,POS=S                
         SENSEG NAME=WLKATF01,PARENT=0                                          
*                                                                               
* ILLUSTRATION, SEKVENS                                                         
         PCB   TYPE=DB,DBDNAME=WLKATL,PROCOPT=GOT,KEYLEN=3,POS=S                
         SENSEG NAME=WLKATL01,PARENT=0                                          
* KATALOGINFO                                                                   
         PCB   TYPE=DB,DBDNAME=WLKATM,PROCOPT=GOT,KEYLEN=9,POS=S                
         SENSEG NAME=WLKATM01,PARENT=0                                          
         SENSEG NAME=WLKATM11,PARENT=WLKATM01                                   
* AVSNITT KOPIERING                                                             
         PCB   TYPE=DB,DBDNAME=WLKATH,PROCOPT=G,KEYLEN=21,POS=S                 
         SENSEG NAME=WLKATH01,PARENT=0,PROCOPT=G                                
         SENSEG NAME=WLKATH11,PARENT=WLKATH01,PROCOPT=GI                        
         SENSEG NAME=WLKATH12,PARENT=WLKATH01,PROCOPT=GI                        
         SENSEG NAME=WLKATH22,PARENT=WLKATH12,PROCOPT=GI                        
         SENSEG NAME=WLKATH25,PARENT=WLKATH12,PROCOPT=GI                        
         SENSEG NAME=WLKATH26,PARENT=WLKATH12,PROCOPT=GI                        
         SENSEG NAME=WLKATH13,PARENT=WLKATH01,PROCOPT=GI                        
* NOTE-SEGMENTET                                                                
         PCB   TYPE=DB,DBDNAME=WLKATH,PROCOPT=G,KEYLEN=22,POS=S                 
         SENSEG NAME=WLKATH01,PARENT=0,PROCOPT=G                                
         SENSEG NAME=WLKATH12,PARENT=WLKATH01,PROCOPT=G                         
         SENSEG NAME=WLKATH24,PARENT=WLKATH12,PROCOPT=GI                        
*                                                                               
* HÄNVISN-REF                                                                   
         PCB   TYPE=DB,DBDNAME=WLKATS,PROCOPT=GOT,KEYLEN=42,POS=S               
         SENSEG NAME=WLKATS01,PARENT=0                                          
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W10514                                       
         END                                                                    
