*                                                                               
*                                                                               
         PCB   TYPE=TP,NAME=W0T606U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLKATM,PROCOPT=GOT,KEYLEN=09,POS=S               
         SENSEG NAME=WLKATM01,PARENT=0                                          
         SENSEG NAME=WLKATM11,PARENT=WLKATM01                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W10518                                       
         END                                                                    
