*          DATA SET W10552PII0 AT LEVEL 003 AS OF 87/08/12                      
*                                                                               
         PCB   TYPE=TP,NAME=W1T552U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLKATH,PROCOPT=GOT,KEYLEN=24,POS=S               
         SENSEG NAME=WLKATH01,PARENT=0                                          
         SENSEG NAME=WLKATH11,PARENT=WLKATH01                                   
         SENSEG NAME=WLKATH12,PARENT=WLKATH01                                   
         SENSEG NAME=WLKATH21,PARENT=WLKATH12                                   
         SENSEG NAME=WLKATH22,PARENT=WLKATH12                                   
         SENSEG NAME=WLKATH23,PARENT=WLKATH12                                   
         SENSEG NAME=WLKATH24,PARENT=WLKATH12                                   
         SENSEG NAME=WLKATH25,PARENT=WLKATH12                                   
         SENSEG NAME=WLKATH26,PARENT=WLKATH12                                   
         SENSEG NAME=WLKATH27,PARENT=WLKATH12                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLKATH,PROCOPT=G,KEYLEN=24,POS=S                 
         SENSEG NAME=WLKATH01,PARENT=0                                          
         SENSEG NAME=WLKATH11,PARENT=WLKATH01,PROCOPT=GI                        
         SENSEG NAME=WLKATH12,PARENT=WLKATH01,PROCOPT=GIR                       
         SENSEG NAME=WLKATH21,PARENT=WLKATH12,PROCOPT=GIR                       
         SENSEG NAME=WLKATH22,PARENT=WLKATH12,PROCOPT=GIR                       
         SENSEG NAME=WLKATH23,PARENT=WLKATH12,PROCOPT=GI                        
         SENSEG NAME=WLKATH24,PARENT=WLKATH12,PROCOPT=GI                        
         SENSEG NAME=WLKATH25,PARENT=WLKATH12,PROCOPT=GI                        
         SENSEG NAME=WLKATH26,PARENT=WLKATH12,PROCOPT=GI                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLKATM,PROCOPT=GOT,KEYLEN=9,POS=S                
         SENSEG NAME=WLKATM01,PARENT=0                                          
         SENSEG NAME=WLKATM11,PARENT=WLKATM01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLKATH,PROCOPT=G,KEYLEN=24,POS=S                 
         SENSEG NAME=WLKATH01,PARENT=0                                          
         SENSEG NAME=WLKATH11,PARENT=WLKATH01                                   
         SENSEG NAME=WLKATH12,PARENT=WLKATH01                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W10552                                       
         END                                                                    
