*                                                                               
         PCB   TYPE=TP,NAME=W1T551U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
* KATH1-PCB                                                                     
         PCB   TYPE=DB,DBDNAME=WLKATH,PROCOPT=G,KEYLEN=36,POS=S                 
         SENSEG NAME=WLKATH01,PARENT=0                                          
         SENSEG NAME=WLKATH12,PARENT=WLKATH01,PROCOPT=GD                        
         SENSEG NAME=WLKATH21,PARENT=WLKATH12,PROCOPT=GD                        
         SENSEG NAME=WLKATH22,PARENT=WLKATH12,PROCOPT=GD                        
         SENSEG NAME=WLKATH23,PARENT=WLKATH12,PROCOPT=GD                        
         SENSEG NAME=WLKATH24,PARENT=WLKATH12,PROCOPT=GD                        
         SENSEG NAME=WLKATH25,PARENT=WLKATH12,PROCOPT=GD                        
         SENSEG NAME=WLKATH26,PARENT=WLKATH12,PROCOPT=GD                        
         SENSEG NAME=WLKATH27,PARENT=WLKATH12,PROCOPT=GD                        
* KATH2-PCB                                                                     
         PCB   TYPE=DB,DBDNAME=WLKATH,PROCOPT=G,KEYLEN=36,POS=S                 
         SENSEG NAME=WLKATH01,PARENT=0                                          
         SENSEG NAME=WLKATH12,PARENT=WLKATH01,PROCOPT=GI                        
         SENSEG NAME=WLKATH21,PARENT=WLKATH12,PROCOPT=GI                        
         SENSEG NAME=WLKATH22,PARENT=WLKATH12,PROCOPT=GI                        
         SENSEG NAME=WLKATH23,PARENT=WLKATH12,PROCOPT=GI                        
         SENSEG NAME=WLKATH24,PARENT=WLKATH12,PROCOPT=GI                        
         SENSEG NAME=WLKATH25,PARENT=WLKATH12,PROCOPT=GI                        
         SENSEG NAME=WLKATH26,PARENT=WLKATH12,PROCOPT=GI                        
         SENSEG NAME=WLKATH27,PARENT=WLKATH12,PROCOPT=GI                        
* KATH3-PCB                                                                     
         PCB   TYPE=DB,DBDNAME=WLKATH,PROCOPT=G,KEYLEN=36,POS=S                 
         SENSEG NAME=WLKATH01,PARENT=0                                          
         SENSEG NAME=WLKATH12,PARENT=WLKATH01,PROCOPT=GID                       
         SENSEG NAME=WLKATH27,PARENT=WLKATH12,PROCOPT=GID                       
* HÄNVISN-REF                                                                   
         PCB   TYPE=DB,DBDNAME=WLKATS,PROCOPT=GOT,KEYLEN=43,POS=S               
         SENSEG NAME=WLKATS01,PARENT=0                                          
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W10551                                       
         END                                                                    
