*                                                                               
         PCB   TYPE=DB,DBDNAME=WLKATH,PROCOPT=G,KEYLEN=24,POS=S                 
         SENSEG NAME=WLKATH01,PARENT=0,PROCOPT=GR                               
         SENSEG NAME=WLKATH11,PARENT=WLKATH01,PROCOPT=G                         
         SENSEG NAME=WLKATH12,PARENT=WLKATH01,PROCOPT=GIRD                      
         SENSEG NAME=WLKATH21,PARENT=WLKATH12,PROCOPT=GIRD                      
         SENSEG NAME=WLKATH22,PARENT=WLKATH12,PROCOPT=GIRD                      
         SENSEG NAME=WLKATH23,PARENT=WLKATH12,PROCOPT=GIRD                      
         SENSEG NAME=WLKATH24,PARENT=WLKATH12,PROCOPT=GIRD                      
         SENSEG NAME=WLKATH25,PARENT=WLKATH12,PROCOPT=GID                       
         SENSEG NAME=WLKATH26,PARENT=WLKATH12,PROCOPT=GID                       
         SENSEG NAME=WLKATH27,PARENT=WLKATH12,PROCOPT=GID                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLKATH,PROCOPT=G,KEYLEN=22,POS=S                 
         SENSEG NAME=WLKATH01,PARENT=0,PROCOPT=GR                               
         SENSEG NAME=WLKATH12,PARENT=WLKATH01                                   
         SENSEG NAME=WLKATH24,PARENT=WLKATH12,PROCOPT=GI                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=6,POS=S                
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLKATB,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG NAME=WLKATB01,PARENT=0                                          
         SENSEG NAME=WLKATB11,PARENT=WLKATB01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLKATF,PROCOPT=GOT,KEYLEN=3,POS=S                
         SENSEG NAME=WLKATF01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLKATD,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG NAME=WLKATD01,PARENT=0                                          
         SENSEG NAME=WLKATD11,PARENT=WLKATD01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLKATM,PROCOPT=GOT,KEYLEN=9,POS=S                
         SENSEG NAME=WLKATM01,PARENT=0                                          
         SENSEG NAME=WLKATM11,PARENT=WLKATM01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=34,POS=S,     *        
               PROCSEQ=WDD3A                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
         SENSEG NAME=WLBENA12,PARENT=WLBENA01                                   
         SENSEG NAME=WLBENA13,PARENT=WLBENA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=13,POS=S,     *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
         SENSEG NAME=WLBENA12,PARENT=WLBENA01                                   
         SENSEG NAME=WLBENA13,PARENT=WLBENA01                                   
*                                                                               
* WLKATS =WDN5G  SEKUNDÄRREG FÖR HAEN/REF                                       
         PCB   TYPE=DB,DBDNAME=WLKATS,PROCOPT=GOT,KEYLEN=42,POS=S               
         SENSEG NAME=WLKATS01,PARENT=0                                          
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W10512                                       
         END                                                                    
