         PCB   TYPE=DB,DBDNAME=WLXXID,PROCOPT=G,KEYLEN=35,POS=S                 
         SENSEG NAME=WLXXID01,PARENT=0                                          
         SENSEG NAME=WLXXID11,PARENT=WLXXID01,PROCOPT=GD                        
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W11174,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
