*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=6,POS=S                
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLERSA,PROCOPT=GOT,KEYLEN=6,POS=S                
         SENSEG NAME=WLERSA01,PARENT=0                                          
         SENSEG NAME=WLERSA13,PARENT=WLERSA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLERSA,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG NAME=WLERSA01,PARENT=0                                          
         SENSEG NAME=WLERSA11,PARENT=WLERSA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTM,PROCOPT=GOT,KEYLEN=5,POS=S                
         SENSEG NAME=WLARTM01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
         SENSEG NAME=WLARTC23,PARENT=WLARTC11                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTG,PROCOPT=GOT,KEYLEN=5,POS=S                
         SENSEG NAME=WLARTG01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=GOT,KEYLEN=35,POS=S                 
         SENSEG NAME=WDR501,PARENT=0                                            
         SENSEG NAME=WDGX1134,PARENT=WDR501                                     
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDL2,PROCOPT=GOT,KEYLEN=21,POS=S                 
         SENSEG NAME=WDL201,PARENT=0                                            
         SENSEG NAME=WDL211,PARENT=WDL201                                       
         SENSEG NAME=WDL221,PARENT=WDL211                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDH1,PROCOPT=GOT,KEYLEN=22,POS=S                 
         SENSEG NAME=WDH101,PARENT=0                                            
         SENSEG NAME=WDH111,PARENT=WDH101                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W11118                                       
         END                                                                    
