*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXAV,PROCOPT=G,KEYLEN=31,POS=S                 
         SENSEG NAME=WLXXAV01,PARENT=0                                          
         SENSEG NAME=WLXXAV11,PARENT=WLXXAV01,PROCOPT=GI                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXCW,PROCOPT=G,KEYLEN=37,POS=S                 
         SENSEG NAME=WLXXCW01,PARENT=0                                          
         SENSEG NAME=WLXXCW11,PARENT=WLXXCW01,PROCOPT=GI                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDG3,PROCOPT=G,KEYLEN=30,POS=S                   
         SENSEG NAME=WDG301,PARENT=0                                            
         SENSEG NAME=WDGX2304,PARENT=WDG301,PROCOPT=GI                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=G,KEYLEN=35,POS=S                   
         SENSEG NAME=WDR501,PARENT=0                                            
         SENSEG NAME=WDGX1134,PARENT=WDR501,PROCOPT=GID                         
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W11121,CMPAT=YES                             
         END                                                                    
