*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=6,POS=S                
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLERSA,PROCOPT=GOT,KEYLEN=6,POS=S                
         SENSEG NAME=WLERSA01,PARENT=0                                          
         SENSEG NAME=WLERSA13,PARENT=WLERSA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLERSA,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG NAME=WLERSA01,PARENT=0                                          
         SENSEG NAME=WLERSA11,PARENT=WLERSA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD7,PROCOPT=GOT,KEYLEN=18,POS=S                 
         SENSEG NAME=WDD701,PARENT=0                                            
         SENSEG NAME=WDD713,PARENT=WDD701                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTM,PROCOPT=GOT,KEYLEN=05,POS=S               
         SENSEG NAME=WLARTM01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
         SENSEG NAME=WLARTC23,PARENT=WLARTC11                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTG,PROCOPT=GOT,KEYLEN=05,POS=S               
         SENSEG NAME=WLARTG01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLINLB,PROCOPT=GOT,KEYLEN=12,POS=S               
         SENSEG NAME=WLINLB01,PARENT=0                                          
         SENSEG NAME=WLINLB11,PARENT=WLINLB01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLINLE,PROCOPT=GOT,KEYLEN=21,POS=S               
         SENSEG NAME=WLINLE01,PARENT=0                                          
         SENSEG NAME=WLINLE11,PARENT=WLINLE01                                   
         SENSEG NAME=WLINLE21,PARENT=WLINLE11                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDH1,PROCOPT=GOT,KEYLEN=22,POS=S                 
         SENSEG NAME=WDH101,PARENT=0                                            
         SENSEG NAME=WDH111,PARENT=WDH101                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W11120                                       
*                                                                               
         END                                                                    
