*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=G,KEYLEN=06,POS=S                   
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601,PROCOPT=R                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDM1,PROCOPT=G,KEYLEN=24,POS=S                   
         SENSEG NAME=WDM101,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDM111,PARENT=WDM101,PROCOPT=GI                            
         SENSEG NAME=WDM121,PARENT=WDM111,PROCOPT=GIR                           
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDT5,PROCOPT=G,KEYLEN=19,POS=S                   
         SENSEG NAME=WDT501,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDT511,PARENT=WDT501,PROCOPT=GIR                           
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W11152,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
