*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=G,KEYLEN=05,POS=S                 
         SENSEG NAME=WLARTC01,PARENT=0,PROCOPT=GR                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLSATB,PROCOPT=G,KEYLEN=10,POS=S                 
         SENSEG NAME=WLSATB01,PARENT=0                                          
         SENSEG NAME=WLSATB11,PARENT=WLSATB01,PROCOPT=GR                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLSATB,PROCOPT=G,KEYLEN=5,POS=S                  
         SENSEG NAME=WLSATB01,PARENT=0,PROCOPT=GR                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLSATB,PROCOPT=GOTP,KEYLEN=45,POS=S,    *        
               PROCSEQ=WDJ1C                                                    
         SENSEG NAME=WLSATB11,PARENT=0                                          
         SENSEG NAME=WLSATB01,PARENT=WLSATB11                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXBY,PROCOPT=G,KEYLEN=30,POS=S                 
         SENSEG NAME=WLXXBY01,PARENT=0                                          
         SENSEG NAME=WLXXBY11,PARENT=WLXXBY01,PROCOPT=GI                        
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W11216                                       
         END                                                                    
