*          DATA SET W11214PII0 AT LEVEL 001 AS OF 91/02/13                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDJ1,PROCOPT=G,KEYLEN=9,POS=S                    
         SENSEG NAME=WDJ101,PARENT=0                                            
         SENSEG NAME=WDJ111,PARENT=WDJ101,PROCOPT=GR                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=5,POS=S                  
         SENSEG NAME=WDK601,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDJ1,PROCOPT=G,KEYLEN=5,POS=S                    
         SENSEG NAME=WDJ101,PARENT=0,PROCOPT=GD                                 
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W11214                                       
         END                                                                    
