*                                                                               
         PCB TYPE=DB,DBDNAME=WDD2,PROCOPT=G,KEYLEN=05,POS=S                     
         SENSEG NAME=WDD201,PARENT=0,PROCOPT=GIRD                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR4,PROCOPT=G,KEYLEN=31,POS=S                   
         SENSEG NAME=WDR401,PARENT=0                                            
         SENSEG NAME=WDR470,PARENT=WDR401,PROCOPT=GIR                           
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=5,POS=S                  
         SENSEG NAME=WDK601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W11412,CMPAT=YES                             
         END                                                                    
