*          DATA SET W11430PII0 AT LEVEL 001 AS OF 89/01/11                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTG,PROCOPT=G,KEYLEN=5,POS=S                  
         SENSEG NAME=WLARTG01,PARENT=0,PROCOPT=GR                               
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W11430,CMPAT=YES                             
         END                                                                    
