*                                                                               
         PCB   TYPE=DB,DBDNAME=WDF7,PROCOPT=L,KEYLEN=08,POS=S                   
         SENSEG NAME=WDF701,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W11410                                       
         END                                                                    
