         PCB   TYPE=DB,DBDNAME=WDD3,PROCOPT=GOT,KEYLEN=13,POS=S,       *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WDD301,PARENT=0                                            
         SENSEG NAME=WDD311,PARENT=WDD301                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=20,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
         SENSEG NAME=WDK621,PARENT=WDK611                                       
         SENSEG NAME=WDK625,PARENT=WDK611                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDL8,PROCOPT=GOT,KEYLEN=09,POS=S                 
         SENSEG NAME=WDL801,PARENT=0                                            
         SENSEG NAME=WDL811,PARENT=WDL801                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDN1,PROCOPT=GOT,KEYLEN=05,POS=S                 
         SENSEG NAME=WDN101,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDN6,PROCOPT=GOT,KEYLEN=14,POS=S                 
         SENSEG NAME=WDN601,PARENT=0                                            
         SENSEG NAME=WDN611,PARENT=WDN601                                       
         SENSEG NAME=WDN621,PARENT=WDN611                                       
         SENSEG NAME=WDN612,PARENT=WDN601                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W11530                                       
         END                                                                    
