*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTM,PROCOPT=G,KEYLEN=11,POS=S                 
         SENSEG NAME=WLARTM01,PARENT=0,PROCOPT=GR                               
         SENSEG NAME=WLARTM11,PARENT=WLARTM01,PROCOPT=GRD                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W11514,CMPAT=YES                             
         END                                                                    
