*          DATA SET W11520PII0 AT LEVEL 001 AS OF 88/09/27                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD2,PROCOPT=GOT,KEYLEN=211,POS=S                
         SENSEG NAME=WDD201,PARENT=0                                            
         SENSEG NAME=WDD211,PARENT=WDD201                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=05,POS=S               
         SENSEG NAME=WLARTC01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXAP,PROCOPT=GOT,KEYLEN=50,POS=S               
         SENSEG NAME=WLXXAP01,PARENT=0                                          
         SENSEG NAME=WLXXAP11,PARENT=WLXXAP01                                   
         SENSEG NAME=WLXXAP12,PARENT=WLXXAP01                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W11520                                       
         END                                                                    
