*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTG,PROCOPT=G,KEYLEN=11,POS=S                 
         SENSEG NAME=WLARTG01,PARENT=0,PROCOPT=GR                               
         SENSEG NAME=WLARTG11,PARENT=WLARTG01,PROCOPT=GD                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=5,POS=S                
         SENSEG NAME=WLARTC01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXAP,PROCOPT=GOT,KEYLEN=45,POS=S               
         SENSEG NAME=WLXXAP01,PARENT=0                                          
         SENSEG NAME=WLXXAP12,PARENT=WLXXAP01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXCW,PROCOPT=G,KEYLEN=37,POS=S                 
         SENSEG NAME=WLXXCW01,PARENT=0                                          
         SENSEG NAME=WLXXCW11,PARENT=WLXXCW01,PROCOPT=GD                        
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W11512,CMPAT=YES                             
         END                                                                    
