*          DATA SET W11527PII0 AT LEVEL 005 AS OF 91/01/09                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXBJ,PROCOPT=G,KEYLEN=30,POS=S                 
         SENSEG NAME=WLXXBJ01,PARENT=0                                          
         SENSEG NAME=WLXXBJ11,PARENT=WLXXBJ01,PROCOPT=GI                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTM,PROCOPT=G,KEYLEN=11,POS=S                 
         SENSEG NAME=WLARTM01,PARENT=0,PROCOPT=GRI                              
         SENSEG NAME=WLARTM11,PARENT=WLARTM01,PROCOPT=GIRD                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXAA,PROCOPT=G,KEYLEN=31,POS=S                 
         SENSEG NAME=WLXXAA01,PARENT=0,PROCOPT=G                                
         SENSEG NAME=WLXXAA11,PARENT=WLXXAA01,PROCOPT=GIRD                      
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W11527,CMPAT=YES                             
         END                                                                    
