*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=05,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD7,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDD701,PARENT=0                                            
         SENSEG NAME=WDD702,PARENT=WDD701                                       
         SENSEG NAME=WDD704,PARENT=WDD701                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W11688                                       
         END                                                                    
