*                                                                               
         PCB   TYPE=DB,DBDNAME=WLERSA,PROCOPT=GOT,KEYLEN=07,POS=S               
         SENSEG NAME=WLERSA01,PARENT=0                                          
         SENSEG NAME=WLERSA11,PARENT=WLERSA01                                   
         SENSEG NAME=WLERSA13,PARENT=WLERSA01                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W11649                                       
         END                                                                    
