*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTS,PROCOPT=GOT,KEYLEN=07,POS=S               
         SENSEG NAME=WLARTS01,PARENT=0                                          
         SENSEG NAME=WLARTS11,PARENT=WLARTS01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=05,POS=S               
         SENSEG NAME=WLARTC01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLERSA,PROCOPT=GOT,KEYLEN=07,POS=S               
         SENSEG NAME=WLERSA01,PARENT=0                                          
         SENSEG NAME=WLERSA11,PARENT=WLERSA01                                   
         SENSEG NAME=WLERSA13,PARENT=WLERSA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDL6,PROCOPT=GOT,KEYLEN=21,POS=S                 
         SENSEG NAME=WDL601,PARENT=0                                            
         SENSEG NAME=WDL611,PARENT=WDL601                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S,        *        
               PROCSEQ=WDB6A                                                    
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W11634,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
