*                                                                               
         PCB   TYPE=TP,NAME=W0T693X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDP8,PROCOPT=G,KEYLEN=28,POS=S                   
         SENSEG NAME=WDP801,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDP811,PARENT=WDP801,PROCOPT=GI                            
*                                                                               
* WDK6                                                                          
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOTP,KEYLEN=06,POS=S                
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
* WDD2                                                                          
         PCB   TYPE=DB,DBDNAME=WDD2,PROCOPT=GOT,KEYLEN=05,POS=S                 
         SENSEG NAME=WDD201,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W11813,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
