*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD3,PROCOPT=GOT,KEYLEN=35,POS=S,       *        
               PROCSEQ=WDD3A                                                    
         SENSEG NAME=WDD301,PARENT=0                                            
         SENSEG NAME=WDD311,PARENT=WDD301                                       
         SENSEG NAME=WDD313,PARENT=WDD301                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W12148                                       
         END                                                                    
