*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD3,PROCOPT=GOT,KEYLEN=212,POS=S                
         SENSEG NAME=WDD301,PARENT=0                                            
         SENSEG NAME=WDD311,PARENT=WDD301                                       
         SENSEG NAME=WDD312,PARENT=WDD301                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W12102                                       
         END                                                                    
