*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTG,PROCOPT=G,KEYLEN=11,POS=S                 
         SENSEG NAME=WLARTG01,PARENT=0,PROCOPT=GD                               
         SENSEG NAME=WLARTG11,PARENT=WLARTG01,PROCOPT=GD                        
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W12275,CMPAT=YES                             
         END                                                                    
