*                                                                               
         PCB TYPE=DB,DBDNAME=WLARTS,PROCOPT=G,KEYLEN=07,POS=S                   
         SENSEG NAME=WLARTS01,PARENT=0,PROCOPT=GD                               
         SENSEG NAME=WLARTS11,PARENT=WLARTS01,PROCOPT=GD                        
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W12280,CMPAT=YES                             
         END                                                                    
