*          DATA SET W12240PII0 AT LEVEL 001 AS OF 87/10/19                      
         PCB   TYPE=DB,DBDNAME=WLKATN,PROCOPT=G,KEYLEN=10,POS=S                 
         SENSEG NAME=WLKATN01,PARENT=0,PROCOPT=GR                               
         SENSEG NAME=WLKATN12,PARENT=WLKATN01,PROCOPT=GIR                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W12240                                       
         END                                                                    
