*          DATA SET W12260PII0 AT LEVEL 004 AS OF 90/10/24                      
*                                                                               
         PCB TYPE=DB,DBDNAME=WLARTM,PROCOPT=D,KEYLEN=5,POS=S                    
         SENSEG NAME=WLARTM01,PARENT=0                                          
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W12260,CMPAT=YES                             
         END                                                                    
