*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD1,PROCOPT=G,KEYLEN=9,POS=S                    
         SENSEG NAME=WDD101,PARENT=0,PROCOPT=G                                  
         SENSEG NAME=WDD111,PARENT=WDD101,PROCOPT=GD                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD1A,PROCOPT=GOT,KEYLEN=9,POS=S                 
         SENSEG NAME=WDD1A1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W12226,CMPAT=YES                             
         END                                                                    
