*        ARTIKEL RENSNING                                                       
*                                                                               
         PCB TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=207,POS=S                  
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
         PCB TYPE=DB,DBDNAME=WLARTM,PROCOPT=GOT,KEYLEN=5,POS=S                  
         SENSEG NAME=WLARTM01,PARENT=0                                          
*                                                                               
         PCB TYPE=DB,DBDNAME=WLINLB,PROCOPT=GOT,KEYLEN=12,POS=S                 
         SENSEG NAME=WLINLB01,PARENT=0                                          
         SENSEG NAME=WLINLB11,PARENT=WLINLB01                                   
*                                                                               
         PCB TYPE=DB,DBDNAME=WLARTS,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WLARTS01,PARENT=0                                          
         SENSEG NAME=WLARTS11,PARENT=WLARTS01                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W12204                                       
         END                                                                    
