*                                                                               
         PCB   TYPE=DB,DBDNAME=WDT4,PROCOPT=G,KEYLEN=05,POS=S                   
         SENSEG NAME=WDT401,PARENT=0,PROCOPT=GD                                 
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W12238,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
