*          DATA SET W12224PII0 AT LEVEL 001 AS OF 87/09/21                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=G,KEYLEN=13,POS=S,       *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
         SENSEG NAME=WLBENA12,PARENT=WLBENA01,PROCOPT=GD                        
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W12224                                       
         END                                                                    
