*                                                                               
         PCB   TYPE=DB,DBDNAME=WLSATB,PROCOPT=GOT,KEYLEN=5,POS=S                
         SENSEG NAME=WLSATB01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=G,KEYLEN=13,POS=S,       *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLSATB,PROCOPT=G,KEYLEN=10,POS=S                 
         SENSEG NAME=WLSATB01,PARENT=0,PROCOPT=GD                               
         SENSEG NAME=WLSATB11,PARENT=WLSATB01,PROCOPT=GR                        
         SENSEG NAME=WLSATB22,PARENT=WLSATB11                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=5,POS=S                
         SENSEG NAME=WLARTC01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLSATB,PROCOPT=GOTP,KEYLEN=45,POS=S,    *        
               PROCSEQ=WDJ1C                                                    
         SENSEG NAME=WLSATB11,PARENT=0                                          
         SENSEG NAME=WLSATB01,PARENT=WLSATB11                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W12270                                       
         END                                                                    
