*          DATA SET W13204PII0 AT LEVEL 006 AS OF 90/11/14                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=6,POS=S                
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W13204                                       
         END                                                                    
