                                                                                
*    RUBRIK-LEXREG                                                              
         PCB   TYPE=DB,DBDNAME=WDN2,PROCOPT=G,KEYLEN=07,POS=S                   
         SENSEG NAME=WDN201,PARENT=0,PROCOPT=GR                                 
         SENSEG NAME=WDN211,PARENT=WDN201,PROCOPT=GIRD                          
*                                                                               
*    FOTNOT-LEXREG                                                              
         PCB   TYPE=DB,DBDNAME=WDN3,PROCOPT=G,KEYLEN=10,POS=S                   
         SENSEG NAME=WDN301,PARENT=0                                            
         SENSEG NAME=WDN311,PARENT=WDN301                                       
         SENSEG NAME=WDN321,PARENT=WDN311,PROCOPT=GIRD                          
                                                                                
*    TILLÄGGSTEXT-LEXREG                                                        
         PCB   TYPE=DB,DBDNAME=WDN4,PROCOPT=G,KEYLEN=06,POS=S                   
         SENSEG NAME=WDN401,PARENT=0,PROCOPT=GR                                 
         SENSEG NAME=WDN411,PARENT=WDN401,PROCOPT=GIR                           
                                                                                
*    BENREG                                                                     
         PCB   TYPE=DB,DBDNAME=WDD3,PROCOPT=G,KEYLEN=09,POS=S                   
         SENSEG NAME=WDD301,PARENT=0,PROCOPT=GR                                 
         SENSEG NAME=WDD311,PARENT=WDD301,PROCOPT=GIR                           
         SENSEG NAME=WDD312,PARENT=WDD301,PROCOPT=G                             
                                                                                
*    ÖVERSÄTTNINGSBEVAKNING                                                     
         PCB   TYPE=DB,DBDNAME=WDR2,PROCOPT=G,KEYLEN=41,POS=S                   
         SENSEG NAME=WDR201,PARENT=0                                            
         SENSEG NAME=WDGX1206,PARENT=WDR201,PROCOPT=GRD                         
*                                                                               
*    WDN5  KATALOGRADER                                                         
         PCB   TYPE=DB,DBDNAME=WDN5,PROCOPT=G,KEYLEN=21,POS=S                   
         SENSEG NAME=WDN501,PARENT=0,PROCOPT=GR                                 
         SENSEG NAME=WDN512,PARENT=WDN501,PROCOPT=GR                            
*                                                                               
*    WDN5D     SEQ FÖR TILLÄGGSTEXT PÅ KATALOGRAD                               
         PCB   TYPE=DB,DBDNAME=WDN5D,PROCOPT=GOT,KEYLEN=24,POS=S                
         SENSEG NAME=WDN5D1,PARENT=0                                            
*                                                                               
*    WDN5E     SEQ FÖR RUBRIKNUMMER PÅ KATALOGRAD                               
         PCB   TYPE=DB,DBDNAME=WDN5E,PROCOPT=GOT,KEYLEN=24,POS=S                
         SENSEG NAME=WDN5E1,PARENT=0                                            
*                                                                               
*    WDN5F     SEQ FÖR FOTNOTNUMMER PÅ KATALOGRAD                               
         PCB   TYPE=DB,DBDNAME=WDN5F,PROCOPT=GOT,KEYLEN=24,POS=S                
         SENSEG NAME=WDN5F1,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=05,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W15212,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
