*          DATA SET W15602PII0 AT LEVEL 005 AS OF 90/11/15                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLKATN,PROCOPT=GOT,KEYLEN=11,POS=S               
         SENSEG NAME=WLKATN01,PARENT=0                                          
         SENSEG NAME=WLKATN11,PARENT=WLKATN01                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W15602                                       
         END                                                                    
