*                                                                               
         PCB   TYPE=DB,DBDNAME=WLKATN,PROCOPT=G,KEYLEN=11,POS=S                 
         SENSEG NAME=WLKATN01,PARENT=0                                          
         SENSEG NAME=WLKATN11,PARENT=WLKATN01,PROCOPT=GR                        
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W15603,CMPAT=YES                             
         END                                                                    
