*                                                                               
         PCB   TYPE=DB,DBDNAME=WDN6,PROCOPT=G,KEYLEN=14,POS=S                   
         SENSEG NAME=WDN601,PARENT=0,PROCOPT=GIRD                               
         SENSEG NAME=WDN611,PARENT=WDN601,PROCOPT=GID                           
         SENSEG NAME=WDN621,PARENT=WDN611,PROCOPT=GIRD                          
         SENSEG NAME=WDN612,PARENT=WDN601,PROCOPT=GIRD                          
                                                                                
* SÖK-PCB WDN6S                                                                 
         PCB   TYPE=DB,DBDNAME=WDN6,PROCOPT=GOT,KEYLEN=11,POS=S                 
         SENSEG NAME=WDN601,PARENT=0                                            
         SENSEG NAME=WDN611,PARENT=WDN601                                       
                                                                                
* MODELLREGISTER 1212                                                           
         PCB   TYPE=DB,DBDNAME=WDR2,PROCOPT=GOT,KEYLEN=33,POS=S                 
         SENSEG NAME=WDR201,PARENT=0                                            
         SENSEG NAME=WDGX1212,PARENT=WDR201                                     
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W15601,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
