*          DATA SET W15604PII0 AT LEVEL 005 AS OF 89/01/16                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDN6,PROCOPT=GOT,KEYLEN=211,POS=S                
         SENSEG NAME=WDN601,PARENT=0                                            
         SENSEG NAME=WDN611,PARENT=WDN601                                       
         SENSEG NAME=WDN612,PARENT=WDN601                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W15604                                       
         END                                                                    
