*                                                                               
         PCB   TYPE=DB,DBDNAME=WDN6,PROCOPT=G,KEYLEN=14,POS=S                   
         SENSEG NAME=WDN601,PARENT=0,PROCOPT=GIRD                               
         SENSEG NAME=WDN611,PARENT=WDN601,PROCOPT=GIRD                          
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W15610,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
