*                                                                               
         PCB   TYPE=DB,DBDNAME=WDN5,PROCOPT=GOT,KEYLEN=36,POS=S,       *        
               PROCSEQ=WDN5A                                                    
         SENSEG NAME=WDN501,PARENT=0                                            
         SENSEG NAME=WDN511,PARENT=WDN501                                       
         SENSEG NAME=WDN512,PARENT=WDN501                                       
         SENSEG NAME=WDN521,PARENT=WDN512                                       
         SENSEG NAME=WDN522,PARENT=WDN512                                       
         SENSEG NAME=WDN523,PARENT=WDN512                                       
         SENSEG NAME=WDN524,PARENT=WDN512                                       
         SENSEG NAME=WDN525,PARENT=WDN512                                       
         SENSEG NAME=WDN526,PARENT=WDN512                                       
         SENSEG NAME=WDN527,PARENT=WDN512                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W15996                                       
         END                                                                    
