*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD3,PROCOPT=G,KEYLEN=8,POS=S,          *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WDD301,PARENT=0,PROCOPT=GR                                 
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W15905,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
