*          DATA SET W20117PII0 AT LEVEL 002 AS OF 87/08/12                      
*                                                                               
*        USERREGISTER                                                           
         PCB    TYPE=DB,DBDNAME=WDP7,PROCOPT=G,KEYLEN=8,POS=S                   
         SENSEG NAME=WDP701,PARENT=0,PROCOPT=GIR                                
*                                                                               
         PCB TYPE=DB,DBDNAME=WDR2,PROCOPT=G,KEYLEN=37,POS=S                     
         SENSEG NAME=WDR201,PARENT=0                                            
         SENSEG NAME=WDGX2206,PARENT=WDR201,PROCOPT=GR                          
*                                                                               
         PCB TYPE=DB,DBDNAME=WDB6,PROCOPT=G,KEYLEN=2,POS=S                      
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W20117                                       
         END                                                                    
