*          DATA SET W20112PII0 AT LEVEL 005 AS OF 90/02/19                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDP7,PROCOPT=GIR,KEYLEN=8,POS=S                  
         SENSEG NAME=WDP701,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLLEVA,PROCOPT=GOT,KEYLEN=10,POS=S               
         SENSEG NAME=WLLEVA01,PARENT=0                                          
         SENSEG NAME=WLLEVA11,PARENT=WLLEVA01                                   
         SENSEG NAME=WLLEVA12,PARENT=WLLEVA01                                   
         SENSEG NAME=WLLEVA13,PARENT=WLLEVA01                                   
         SENSEG NAME=WLLEVA14,PARENT=WLLEVA01                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W20112                                       
         END                                                                    
