*          DATA SET W20103PII0 AT LEVEL 007 AS OF 90/09/04                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GIR,KEYLEN=08,POS=S               
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
         SENSEG NAME=WDK623,PARENT=WDK611                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD9,PROCOPT=G,KEYLEN=19,POS=S                   
         SENSEG NAME=WDD901,PARENT=0                                            
         SENSEG NAME=WDD902,PARENT=WDD901,PROCOPT=GR                            
         SENSEG NAME=WDD904,PARENT=WDD902,PROCOPT=GD                            
         SENSEG NAME=WDD905,PARENT=WDD902,PROCOPT=GIRD                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD3,PROCOPT=GOT,KEYLEN=13,POS=S,       *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WDD301,PARENT=0                                            
         SENSEG NAME=WDD311,PARENT=WDD301                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDF1,PROCOPT=GOT,KEYLEN=06,POS=S                 
         SENSEG NAME=WDF101,PARENT=0                                            
         SENSEG NAME=WDF106,PARENT=WDF101                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDF3,PROCOPT=GOT,KEYLEN=15,POS=S                 
         SENSEG NAME=WDF301,PARENT=0                                            
         SENSEG NAME=WDF311,PARENT=WDF301                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXBL,PROCOPT=G,KEYLEN=42,POS=S                 
         SENSEG NAME=WLXXBL01,PARENT=0                                          
         SENSEG NAME=WLXXBL11,PARENT=WLXXBL01,PROCOPT=GI                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXBK,PROCOPT=GOT,KEYLEN=37,POS=S               
         SENSEG NAME=WLXXBK01,PARENT=0                                          
         SENSEG NAME=WLXXBK11,PARENT=WLXXBK01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXCZ,PROCOPT=G,KEYLEN=40,POS=S                 
         SENSEG NAME=WLXXCZ01,PARENT=0                                          
         SENSEG NAME=WLXXCZ11,PARENT=WLXXCZ01,PROCOPT=GI                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDG3,PROCOPT=GOT,KEYLEN=51,POS=S                 
         SENSEG NAME=WDG301,PARENT=0                                            
         SENSEG NAME=WDGX2258,PARENT=WDG301                                     
         SENSEG NAME=WDGX2260,PARENT=WDGX2258                                   
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W20139                                       
         END                                                                    
