*        SKROTNING                                                              
*                                                                               
         PCB   TYPE=TP,NAME=W1T113U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=G,KEYLEN=08,POS=S                   
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601,PROCOPT=GR                            
         SENSEG NAME=WDK627,PARENT=WDK611,PROCOPT=GRI                           
         SENSEG NAME=WDK629,PARENT=WDK611,PROCOPT=GR                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=06,POS=S               
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=13,POS=S,     *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTM,PROCOPT=GOT,KEYLEN=05,POS=S               
         SENSEG NAME=WLARTM01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLSATE,PROCOPT=GOT,KEYLEN=49,POS=S               
         SENSEG NAME=WLSATE01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLSATB,PROCOPT=GOT,KEYLEN=9,POS=S                
         SENSEG NAME=WLSATB01,PARENT=0                                          
         SENSEG NAME=WLSATB11,PARENT=WLSATB01                                   
*                                                                               
* SKROTFÖRSLAG                                                                  
         PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=G,KEYLEN=46,POS=S                   
         SENSEG NAME=WDR501,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDGX6322,PARENT=WDR501,PROCOPT=GI                          
         SENSEG NAME=WDGX6324,PARENT=WDGX6322,PROCOPT=GI                        
*                                                                               
******** SUBMODUL    W411SAP   KONTROLL KONTO ANALYSN KOSTC******               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLSAPC,PROCOPT=GOT,KEYLEN=17,POS=S               
         SENSEG NAME=WLSAPC01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=GOT,KEYLEN=45,POS=S                 
         SENSEG NAME=WDR501,PARENT=0                                            
         SENSEG NAME=WDGX6328,PARENT=WDR501                                     
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDN6,PROCOPT=GOT,KEYLEN=11,POS=S                 
         SENSEG NAME=WDN601,PARENT=0                                            
         SENSEG NAME=WDN611,PARENT=WDN601                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W20129                                       
         END                                                                    
