*                                                                               
*--------PCB FÖR TRANS TILL PROGRAM W2010300 VISA LEVPLAN                       
*        -- ALT-2103-PCB                                                        
         PCB   TYPE=TP,NAME=W2T103,ALTRESP=NO,SAMETRM=NO,              *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=G,KEYLEN=19,POS=S                 
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01,PROCOPT=GR                        
         SENSEG NAME=WLARTC21,PARENT=WLARTC11                                   
         SENSEG NAME=WLARTC26,PARENT=WLARTC11                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLINLB,PROCOPT=G,KEYLEN=19,POS=S                 
         SENSEG NAME=WLINLB01,PARENT=0                                          
         SENSEG NAME=WLINLB11,PARENT=WLINLB01                                   
         SENSEG NAME=WLINLB22,PARENT=WLINLB11,PROCOPT=GID                       
         SENSEG NAME=WLINLB23,PARENT=WLINLB11,PROCOPT=GIDR                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=19,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
         SENSEG NAME=WDK621,PARENT=WDK611                                       
         SENSEG NAME=WDK624,PARENT=WDK611                                       
         SENSEG NAME=WDK626,PARENT=WDK611                                       
         SENSEG NAME=WDK629,PARENT=WDK611                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTM,PROCOPT=GOT,KEYLEN=11,POS=S               
         SENSEG NAME=WLARTM01,PARENT=0                                          
         SENSEG NAME=WLARTM11,PARENT=WLARTM01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=8,POS=S                  
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK727,PARENT=WDK711                                       
         SENSEG NAME=WDK712,PARENT=WDK701                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLINLE,PROCOPT=GOT,KEYLEN=21,POS=S               
         SENSEG NAME=WLINLE01,PARENT=0                                          
         SENSEG NAME=WLINLE11,PARENT=WLINLE01                                   
         SENSEG NAME=WLINLE21,PARENT=WLINLE11                                   
*                                                                               
* W2222200 - W271REFL                                                           
         PCB   TYPE=DB,DBDNAME=WL2501,PROCOPT=GOT,KEYLEN=31,POS=S               
         SENSEG NAME=WL250101,PARENT=0                                          
         SENSEG NAME=WL250111,PARENT=WL250101                                   
*                                                                               
* W2222200 - W271REFL                                                           
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=4,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB616,PARENT=WDB601                                       
*                                                                               
* W2222200 - W271REFL                                                           
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=8,POS=S                  
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK727,PARENT=WDK711                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDF1,PROCOPT=GOT,KEYLEN=6,POS=S                  
         SENSEG NAME=WDF101,PARENT=0                                            
         SENSEG NAME=WDF106,PARENT=WDF101                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDP6,PROCOPT=G,KEYLEN=4,POS=S                    
         SENSEG NAME=WDP601,PARENT=0,PROCOPT=G                                  
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDF3,PROCOPT=GOT,KEYLEN=15,POS=S                 
         SENSEG NAME=WDF301,PARENT=0                                            
         SENSEG NAME=WDF311,PARENT=WDF301                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=4,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB616,PARENT=WDB601                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD3,PROCOPT=GOT,KEYLEN=12,POS=S,       *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WDD301,PARENT=0                                            
         SENSEG NAME=WDD311,PARENT=WDD301                                       
*                                                                               
* LEV-PLANE-FÖRSLAGS-KÖ                                                         
         PCB   TYPE=DB,DBDNAME=WDD6,PROCOPT=G,KEYLEN=14,POS=S                   
         SENSEG NAME=WDD601,PARENT=0,PROCOPT=GIRD                               
*                                                                               
* DC-LAGER INFO  WDB6-2-PCB                                                     
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
* WDD7A1      - ERSÄTTNINGSREGISTER                                             
         PCB   TYPE=DB,DBDNAME=WDD7A,PROCOPT=GOT,KEYLEN=12,POS=S                
         SENSEG NAME=WDD7A1,PARENT=0                                            
*                                                                               
* WDK7 ERSATT                                                                   
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
*                                                                               
* W222-UTIL-WDK6-PCB                                                            
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOTP,KEYLEN=8,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
         SENSEG NAME=WDK626,PARENT=WDK611                                       
         SENSEG NAME=WDK629,PARENT=WDK611                                       
*                                                                               
* W222-UTIL-WDK7-PCB                                                            
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=19,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK727,PARENT=WDK711                                       
*                                                                               
* W222-UTIL-WDB6-PCB                                                            
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=4,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB616,PARENT=WDB601                                       
*                                                                               
* W222-UTUP-WDK7-PCB                                                            
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=19,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
*                                                                               
* W222-UTUP-WDB6-PCB                                                            
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=4,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB616,PARENT=WDB601                                       
*                                                                               
* W222-UTUP-UTIL-WDK6-PCB                                                       
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOTP,KEYLEN=8,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
         SENSEG NAME=WDK626,PARENT=WDK611                                       
         SENSEG NAME=WDK629,PARENT=WDK611                                       
*                                                                               
* W222-UTUP-UTIL-WDK7-PCB                                                       
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=19,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK727,PARENT=WDK711                                       
*                                                                               
* W222-UTUP-UTIL-WDB6-PCB                                                       
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=4,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB616,PARENT=WDB601                                       
*                                                                               
* BLOCKADE AVROPSVECKOR FÖR IDLEVNR-SHIP                                        
         PCB   TYPE=DB,DBDNAME=WDG3,PROCOPT=GOT,KEYLEN=51,POS=S                 
         SENSEG NAME=WDG301,PARENT=0                                            
         SENSEG NAME=WDGX2258,PARENT=WDG301                                     
         SENSEG NAME=WDGX2260,PARENT=WDGX2258                                   
*                                                                               
******* SUBMODUL W221BLOC *************************************                 
*                                                                               
* BLOC-WDD9-PCB  LEVERANSPLANEREGISTER                                          
         PCB   TYPE=DB,DBDNAME=WDD9,PROCOPT=G,KEYLEN=19,POS=S                   
         SENSEG NAME=WDD901,PARENT=0                                            
         SENSEG NAME=WDD902,PARENT=WDD901                                       
         SENSEG NAME=WDD905,PARENT=WDD902,PROCOPT=GIR                           
*                                                                               
* BLOC-WDF3-PCB  HELGDAGAR/LAND                                                 
         PCB   TYPE=DB,DBDNAME=WDF3,PROCOPT=GOT,KEYLEN=15,POS=S                 
         SENSEG NAME=WDF301,PARENT=0                                            
*                                                                               
* BLOC-WDR2-PCB ANSKAFFARE LARM                                                 
         PCB   TYPE=DB,DBDNAME=WDR2,PROCOPT=GOT,KEYLEN=35,POS=S                 
         SENSEG NAME=WDR201,PARENT=0                                            
         SENSEG NAME=WDR220,PARENT=WDR201                                       
*                                                                               
* BLOC-WDR5-PCB LARM BILD 2171                                                  
         PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=G,KEYLEN=40,POS=S                   
         SENSEG NAME=WDR501,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDR550,PARENT=WDR501,PROCOPT=GI                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W20135                                       
         END                                                                    
