*          DATA SET W20118PII0 AT LEVEL 002 AS OF 87/08/12                      
*                                                                               
*        USERREGISTER                                                           
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GIR,KEYLEN=08,POS=S               
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
         PCB TYPE=DB,DBDNAME=WDR2,PROCOPT=G,KEYLEN=37,POS=S                     
         SENSEG NAME=WDR201,PARENT=0                                            
         SENSEG NAME=WDGX2206,PARENT=WDR201,PROCOPT=GIRD                        
*                                                                               
         PCB TYPE=DB,DBDNAME=WDB6,PROCOPT=G,KEYLEN=2,POS=S                      
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PCB TYPE=DB,DBDNAME=WDF1,PROCOPT=GOT,KEYLEN=7,POS=S                    
         SENSEG NAME=WDF101,PARENT=0                                            
         SENSEG NAME=WDF116,PARENT=WDF101                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W20118                                       
         END                                                                    
