*                                                                               
         PCB TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GIR,KEYLEN=08,POS=S                 
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
         PCB TYPE=DB,DBDNAME=WLARTC,PROCOPT=G,KEYLEN=19,POS=S                   
         SENSEG NAME=WLARTC01,PARENT=0,PROCOPT=GR                               
         SENSEG NAME=WLARTC11,PARENT=WLARTC01,PROCOPT=GR                        
         SENSEG NAME=WLARTC21,PARENT=WLARTC11,PROCOPT=G                         
         SENSEG NAME=WLARTC23,PARENT=WLARTC11,PROCOPT=G                         
         SENSEG NAME=WLARTC25,PARENT=WLARTC11,PROCOPT=GRID                      
*                                                                               
         PCB TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=07,POS=S                     
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK712,PARENT=WDK701,PROCOPT=GR                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=13,POS=S,     *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
         PCB TYPE=DB,DBDNAME=WLLEVA,PROCOPT=GOT,KEYLEN=17,POS=S                 
         SENSEG NAME=WLLEVA01,PARENT=0                                          
*                                                                               
         PCB TYPE=DB,DBDNAME=WLXXBI,PROCOPT=G,KEYLEN=31,POS=S                   
         SENSEG NAME=WLXXBI01,PARENT=0                                          
         SENSEG NAME=WLXXBI11,PARENT=WLXXBI01,PROCOPT=GI                        
*                                                                               
         PCB TYPE=DB,DBDNAME=WLXXBN,PROCOPT=G,KEYLEN=31,POS=S                   
         SENSEG NAME=WLXXBN01,PARENT=0                                          
         SENSEG NAME=WLXXBN11,PARENT=WLXXBN01,PROCOPT=GI                        
*                                                                               
         PCB TYPE=DB,DBDNAME=WLZZAC,PROCOPT=G,KEYLEN=18,POS=S                   
         SENSEG NAME=WLZZAC01,PARENT=0,PROCOPT=GI                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=G,KEYLEN=13,POS=S                 
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01,PROCOPT=GR                        
*                                                                               
*                                                                               
* LÄSPCB WDK6                                                                   
         PCB TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=06,POS=S                   
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
         PCB TYPE=DB,DBDNAME=WLERSB,PROCOPT=GOT,KEYLEN=12,POS=S                 
         SENSEG NAME=WLERSB01,PARENT=0                                          
*                                                                               
* XXBJ-PCB -                OMSPEC-ORSAK  IDHTYP=2204 (WDG3)                    
         PCB   TYPE=DB,DBDNAME=WLXXBJ,PROCOPT=G,KEYLEN=40,POS=S                 
         SENSEG NAME=WLXXBJ01,PARENT=0                                          
         SENSEG NAME=WLXXBJ11,PARENT=WLXXBJ01,PROCOPT=GI                        
*                                                                               
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W20132                                       
         END                                                                    
