*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GIR,KEYLEN=08,POS=S               
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLORDP,PROCOPT=G,KEYLEN=24,POS=S                 
         SENSEG NAME=WLORDP01,PARENT=0,PROCOPT=GIRD                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLORDS,PROCOPT=GOT,KEYLEN=28,POS=S               
         SENSEG NAME=WLORDS01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLORDQ,PROCOPT=GOT,KEYLEN=40,POS=S               
         SENSEG NAME=WLORDQ01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLZZAC,PROCOPT=G,KEYLEN=18,POS=S                 
         SENSEG NAME=WLZZAC01,PARENT=0,PROCOPT=GI                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=8,POS=S                
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTM,PROCOPT=G,KEYLEN=11,POS=S                 
         SENSEG NAME=WLARTM01,PARENT=0,PROCOPT=GR                               
         SENSEG NAME=WLARTM11,PARENT=WLARTM01,PROCOPT=GIRD                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLGMTA,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG NAME=WLGMTA01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLORQM,PROCOPT=G,KEYLEN=17,POS=S                 
         SENSEG NAME=WLORQM01,PARENT=0,PROCOPT=GI                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLORQI,PROCOPT=GOT,KEYLEN=21,POS=S,     *        
               PROCSEQ=WDQ2C                                                    
         SENSEG NAME=WLORQI01,PARENT=0                                          
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W20125                                       
         END                                                                    
