*                                                                               
         PCB   TYPE=TP,NAME=W0T693X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXBU,PROCOPT=G,KEYLEN=40,POS=S                 
         SENSEG NAME=WLXXBU01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLXXBU11,PARENT=WLXXBU01,PROCOPT=GID                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXBX,PROCOPT=GOT,KEYLEN=40,POS=S               
         SENSEG NAME=WLXXBX01,PARENT=0                                          
         SENSEG NAME=WLXXBX11,PARENT=WLXXBX01                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W20191                                       
         END                                                                    
