*                                                                               
         PCB TYPE=TP,NAME=W1T191U,ALTRESP=NO,SAMETRM=NO,               *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*        MSGKOM-PCB                                                             
         PCB   TYPE=TP,NAME=W0T693X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GIR,KEYLEN=8,POS=S                
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
         PCB TYPE=DB,DBDNAME=WLARTC,PROCOPT=G,KEYLEN=08,POS=S                   
         SENSEG NAME=WLARTC01,PARENT=0,PROCOPT=GR                               
         SENSEG NAME=WLARTC11,PARENT=WLARTC01,PROCOPT=GR                        
         SENSEG NAME=WLARTC22,PARENT=WLARTC11,PROCOPT=G                         
         SENSEG NAME=WLARTC23,PARENT=WLARTC11,PROCOPT=G                         
         SENSEG NAME=WLARTC25,PARENT=WLARTC11,PROCOPT=GRID                      
*                                                                               
         PCB TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=13,POS=S,       *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
         PCB TYPE=DB,DBDNAME=WLLEVA,PROCOPT=GOT,KEYLEN=05,POS=S                 
         SENSEG NAME=WLLEVA01,PARENT=0                                          
*                                                                               
         PCB TYPE=DB,DBDNAME=WLERSB,PROCOPT=GOT,KEYLEN=12,POS=S                 
         SENSEG NAME=WLERSB01,PARENT=0                                          
*                                                                               
         PCB TYPE=DB,DBDNAME=WLARTG,PROCOPT=G,KEYLEN=05,POS=S                   
         SENSEG NAME=WLARTG01,PARENT=0,PROCOPT=GIRD                             
*                                                                               
         PCB TYPE=DB,DBDNAME=WLXXBN,PROCOPT=G,KEYLEN=31,POS=S                   
         SENSEG NAME=WLXXBN01,PARENT=0                                          
         SENSEG NAME=WLXXBN11,PARENT=WLXXBN01,PROCOPT=GI                        
*                                                                               
         PCB TYPE=DB,DBDNAME=WLXXAQ,PROCOPT=G,KEYLEN=45,POS=S                   
         SENSEG NAME=WLXXAQ01,PARENT=0                                          
         SENSEG NAME=WLXXAQ11,PARENT=WLXXAQ01,PROCOPT=GR                        
*                                                                               
         PCB TYPE=DB,DBDNAME=WLXXAT,PROCOPT=GOT,KEYLEN=35,POS=S                 
         SENSEG NAME=WLXXAT01,PARENT=0                                          
         SENSEG NAME=WLXXAT11,PARENT=WLXXAT01                                   
*                                                                               
         PCB TYPE=DB,DBDNAME=WLXXAV,PROCOPT=G,KEYLEN=31,POS=S                   
         SENSEG NAME=WLXXAV01,PARENT=0                                          
         SENSEG NAME=WLXXAV11,PARENT=WLXXAV01,PROCOPT=GIDR                      
*                                                                               
         PCB TYPE=DB,DBDNAME=WLARTI,PROCOPT=GOT,KEYLEN=30,POS=S                 
         SENSEG NAME=WLARTI01,PARENT=0                                          
*                                                                               
         PCB TYPE=DB,DBDNAME=WLARTM,PROCOPT=GOT,KEYLEN=5,POS=S                  
         SENSEG NAME=WLARTM01,PARENT=0                                          
*                                                                               
* HÄNDELSEREGISTER FÖR STD/SJK UPPDATERINGAR, WDH8                              
         PCB   TYPE=DB,DBDNAME=WLPRIG,PROCOPT=G,KEYLEN=17,POS=S                 
         SENSEG NAME=WLPRIG01,PARENT=0,PROCOPT=GI                               
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W20133                                       
         END                                                                    
