*                                                                               
         PCB   TYPE=TP,NAME=W0T606U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GIR,KEYLEN=08,POS=S               
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDG2,PROCOPT=G,KEYLEN=36,POS=S                   
         SENSEG NAME=WDG201,PARENT=0                                            
         SENSEG NAME=WDGX1144,PARENT=WDG201,PROCOPT=GIDR                        
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W20153                                       
         END                                                                    
