*                                                                               
         PCB   TYPE=DB,DBDNAME=WDP7,PROCOPT=G,KEYLEN=8,POS=S                    
         SENSEG NAME=WDP701,PARENT=0,PROCOPT=GIR                                
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR2,PROCOPT=G,KEYLEN=32,POS=S                   
         SENSEG NAME=WDR201,PARENT=0                                            
         SENSEG NAME=WDGX2244,PARENT=WDR201,PROCOPT=GIRD                        
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W20148                                       
         END                                                                    
