*          DATA SET W20114PII0 AT LEVEL 002 AS OF 87/08/12                      
*                                                                               
         PCB TYPE=DB,DBDNAME=WLXXBK,PROCOPT=G,KEYLEN=37,POS=S                   
         SENSEG NAME=WLXXBK01,PARENT=0                                          
         SENSEG NAME=WLXXBK11,PARENT=WLXXBK01,PROCOPT=GIRD                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD9,PROCOPT=GOT,KEYLEN=12,POS=S,       *        
               PROCSEQ=WDD9A                                                    
         SENSEG NAME=WDD902,PARENT=0                                            
         SENSEG NAME=WDD905,PARENT=WDD902                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W20114                                       
         END                                                                    
