*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GIR,KEYLEN=8,POS=S                
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
*        ARTIKELINFORMATION WDK6                                                
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=G,KEYLEN=7,POS=S                  
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01,PROCOPT=GR                        
*                                                                               
*        BENÄMNINGREGISTER WDD3 - SEKUNDÄRINDEX ARTNR                           
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=11,POS=S,     *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
*        DISP.DAT. NÄSTA INLEV. WDGX HTYP=2228                                  
         PCB   TYPE=DB,DBDNAME=WLXXBW,PROCOPT=G,KEYLEN=40,POS=S                 
         SENSEG NAME=WLXXBW01,PARENT=0                                          
         SENSEG NAME=WLXXBW11,PARENT=WLXXBW01,PROCOPT=GI                        
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W20134                                       
         END                                                                    
