*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GIR,KEYLEN=8,POS=S                
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=G,KEYLEN=20,POS=S                 
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01,PROCOPT=GR                        
         SENSEG NAME=WLARTC21,PARENT=WLARTC11,PROCOPT=G                         
         SENSEG NAME=WLARTC22,PARENT=WLARTC11,PROCOPT=GID                       
         SENSEG NAME=WLARTC23,PARENT=WLARTC11,PROCOPT=G                         
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLINLB,PROCOPT=G,KEYLEN=12,POS=S                 
         SENSEG NAME=WLINLB01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLINLB11,PARENT=WLINLB01,PROCOPT=GIRD                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLLEVA,PROCOPT=GOT,KEYLEN=17,POS=S               
         SENSEG NAME=WLLEVA01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXBI,PROCOPT=G,KEYLEN=31,POS=S                 
         SENSEG NAME=WLXXBI01,PARENT=0                                          
         SENSEG NAME=WLXXBI11,PARENT=WLXXBI01,PROCOPT=GI                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXBJ,PROCOPT=G,KEYLEN=31,POS=S                 
         SENSEG NAME=WLXXBJ01,PARENT=0                                          
         SENSEG NAME=WLXXBJ11,PARENT=WLXXBJ01,PROCOPT=GI                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLZZAC,PROCOPT=G,KEYLEN=18,POS=S                 
         SENSEG NAME=WLZZAC01,PARENT=0,PROCOPT=GI                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=20,POS=S               
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
         SENSEG NAME=WLARTC21,PARENT=WLARTC11                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W20121                                       
         END                                                                    
