*                                                                               
*        ALT-PCB                                                                
         PCB   TYPE=TP,NAME=W2T102,ALTRESP=NO,SAMETRM=NO,              *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB    TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                 
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD4,PROCOPT=G,KEYLEN=15,POS=S                   
         SENSEG NAME=WDD401,PARENT=0,PROCOPT=GRD                                
* WDK6                                                                          
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=G,KEYLEN=6,POS=S                    
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXBX,PROCOPT=GOT,KEYLEN=35,POS=S               
         SENSEG NAME=WLXXBX01,PARENT=0                                          
         SENSEG NAME=WLXXBX11,PARENT=WLXXBX01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD4,PROCOPT=GOT,KEYLEN=27,POS=S,       *        
               PROCSEQ=WDD4A                                                    
         SENSEG NAME=WDD401,PARENT=0                                            
*                                                                               
         PCB TYPE=DB,DBDNAME=WDR3,PROCOPT=G,KEYLEN=27,POS=S                     
         SENSEG NAME=WDR301,PARENT=0,PROCOPT=GI                                 
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W20172                                       
         END                                                                    
