*                                                                               
         PCB    TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                 
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=G,KEYLEN=19,POS=S                 
         SENSEG NAME=WLARTC01,PARENT=0,PROCOPT=GR                               
         SENSEG NAME=WLARTC11,PARENT=WLARTC01,PROCOPT=GR                        
         SENSEG NAME=WLARTC21,PARENT=WLARTC11,PROCOPT=G                         
*WDK7-PCB                                                                       
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=09,POS=S                   
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701,PROCOPT=GR                            
         SENSEG NAME=WDK727,PARENT=WDK711                                       
         SENSEG NAME=WDK712,PARENT=WDK701,PROCOPT=GR                            
*WDK72-PCB                                                                      
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=08,POS=S                   
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK721,PARENT=WDK711,PROCOPT=GIR                           
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLLEVA,PROCOPT=GOT,KEYLEN=05,POS=S               
         SENSEG NAME=WLLEVA01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=8,POS=S,      *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
* ------ PCB FÖR SUBPGM W271REFL                                                
*                                                                               
         PCB   TYPE=DB,DBDNAME=WL2501,PROCOPT=GOT,KEYLEN=31,POS=S               
         SENSEG NAME=WL250101,PARENT=0                                          
         SENSEG NAME=WL250111,PARENT=WL250101                                   
*                                                                               
* WDL7 ORDERINGÅNGSREGISTER                                                     
         PCB   TYPE=DB,DBDNAME=WLOIGA,PROCOPT=G,KEYLEN=25,POS=S                 
         SENSEG NAME=WLOIGA01,PARENT=0                                          
         SENSEG NAME=WLOIGA11,PARENT=WLOIGA01,PROCOPT=GR                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=8,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB615,PARENT=WDB601                                       
         SENSEG NAME=WDB616,PARENT=WDB601                                       
*                                                                               
* WDE3 REFILLREGISTER, ORDERFÖRSLAG                                             
         PCB   TYPE=DB,DBDNAME=WDE3,PROCOPT=GOT,KEYLEN=14,POS=S                 
         SENSEG NAME=WDE301,PARENT=0                                            
*                                                                               
* REFERRAL BLOCK HIST                                                           
         PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=G,KEYLEN=39,POS=S                   
         SENSEG NAME=WDR501,PARENT=0                                            
         SENSEG NAME=WDGX2508,PARENT=WDR501,PROCOPT=GI                          
         SENSEG NAME=WDGX2510,PARENT=WDGX2508,PROCOPT=GIR                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W20363                                       
         END                                                                    
