*                                                                               
         PCB    TYPE=DB,DBDNAME=WDP7,PROCOPT=G,KEYLEN=8,POS=S                   
         SENSEG NAME=WDP701,PARENT=0,PROCOPT=GIR                                
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=G,KEYLEN=25,POS=S                   
         SENSEG NAME=WDB601,PARENT=0,PROCOPT=GR                                 
         SENSEG NAME=WDB613,PARENT=WDB601,PROCOPT=GID                           
         SENSEG NAME=WDB615,PARENT=WDB601,PROCOPT=GIR                           
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W20366                                       
         END                                                                    
