*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GIR,KEYLEN=8,POS=S                
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLFILC,PROCOPT=G,KEYLEN=27,POS=S                 
         SENSEG NAME=WLFILC01,PARENT=0,PROCOPT=GI                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDF1,PROCOPT=GOT,KEYLEN=5,POS=S                  
         SENSEG NAME=WDF101,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=5,POS=S                  
         SENSEG NAME=WDK601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W20325                                       
         END                                                                    
