*                                                                               
*        USERREGISTER                                                           
         PCB    TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GIR,KEYLEN=08,POS=S              
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
* ORDERINGÅNGSREGISTER XDC                                                      
         PCB   TYPE=DB,DBDNAME=WDL7,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDL701,PARENT=0                                            
         SENSEG NAME=WDL711,PARENT=WDL701                                       
*                                                                               
* ORDERINGÅNGSHISTORIK XDC                                                      
         PCB   TYPE=DB,DBDNAME=WDL4,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDL401,PARENT=0                                            
         SENSEG NAME=WDL411,PARENT=WDL401                                       
*                                                                               
* WDD3 BENÄMNINGSREGISTER                                                       
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=8,POS=S,      *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
* PART REGISTER SDC/NDC/LDC                                                     
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
*                                                                               
* WDK6                                                                          
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=09,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
         SENSEG NAME=WDK629,PARENT=WDK611                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W20356                                       
         END                                                                    
