* 4289-PCB TRANS TILL PGM W4028900                                              
         PCB   TYPE=TP,NAME=W4T289X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* SYNQ                                                                          
*        TRANSACTION TO DISTRIBUTION & PRINT                                    
PRODUCTM PCB   TYPE=TP,NAME=WZ0440X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*                                                                               
           PCB    TYPE=DB,DBDNAME=WDP7,PROCOPT=G,KEYLEN=8,POS=S                 
           SENSEG NAME=WDP701,PARENT=0,PROCOPT=GIR                              
*                                                                               
           PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GP,KEYLEN=15,POS=S                
           SENSEG NAME=WDK601,PARENT=0,PROCOPT=GPR                              
           SENSEG NAME=WDK611,PARENT=WDK601,PROCOPT=GR                          
           SENSEG NAME=WDK625,PARENT=WDK611,PROCOPT=GIRD                        
           SENSEG NAME=WDK629,PARENT=WDK611,PROCOPT=GIRD                        
*                                                                               
           PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=12,POS=S               
           SENSEG NAME=WDK701,PARENT=0                                          
           SENSEG NAME=WDK711,PARENT=WDK701                                     
           SENSEG NAME=WDK712,PARENT=WDK701                                     
*                                                                               
           PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                
           SENSEG NAME=WDB601,PARENT=0                                          
*                                                                               
           PCB   TYPE=DB,DBDNAME=WDE3,PROCOPT=GOT,KEYLEN=14,POS=S               
           SENSEG NAME=WDE301,PARENT=0                                          
*                                                                               
           PCB   TYPE=DB,DBDNAME=WDT5,PROCOPT=G,KEYLEN=19,POS=S                 
           SENSEG NAME=WDT501,PARENT=0,PROCOPT=GI                               
           SENSEG NAME=WDT511,PARENT=WDT501,PROCOPT=GIR                         
*                                                                               
*                                                                               
******** SUBMODULE  W488PRMA SEND SYNQ EVENT    ************                    
*                                                                               
* SYNQ-ATAB-PCB                                                                 
* EVENT DB FOR API CALLS                                                        
ATAB     PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=GOT,KEYLEN=80,POS=S                 
         SENSEG NAME=WDR501,PARENT=0                                            
         SENSEG NAME=WDGX0104,PARENT=WDR501                                     
*                                                                               
* SYNQ-WDK6-PCB                                                                 
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=6,POS=S                  
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
* SYNQ-WDD3-PCB                                                                 
         PCB   TYPE=DB,DBDNAME=WDD3,PROCOPT=GOT,KEYLEN=8,POS=S,        *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WDD301,PARENT=0                                            
         SENSEG NAME=WDD311,PARENT=WDD301                                       
*                                                                               
           PSBGEN LANG=COBOL,PSBNAME=W20393                                     
           END                                                                  
