*                                                                               
         PCB   TYPE=TP,NAME=W0T693X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*---USERBAS   WDP7                                                              
         PCB    TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                 
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*---DIRLEVERANSBAS WDF2                                                         
         PCB   TYPE=DB,DBDNAME=WDF2,PROCOPT=G,KEYLEN=29,POS=S                   
         SENSEG NAME=WDF201,PARENT=0                                            
         SENSEG NAME=WDF211,PARENT=WDF201,PROCOPT=GIRD                          
*---LEVERANTÖRSBAS WDF1                                                         
         PCB   TYPE=DB,DBDNAME=WDF1,PROCOPT=GOT,KEYLEN=13,POS=S                 
         SENSEG NAME=WDF101,PARENT=0                                            
         SENSEG NAME=WDF118,PARENT=WDF101                                       
*---KUNDBAS  WDB2                                                               
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDB201,PARENT=0                                            
*---DC-REGISTER  WDB6                                                           
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W20335                                       
         END                                                                    
