*                                                                               
         PCB    TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                 
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
* WDF8-PCB SPÄRREGLER                                                           
         PCB   TYPE=DB,DBDNAME=WDF8,PROCOPT=GOT,KEYLEN=24,POS=S                 
         SENSEG NAME=WDF801,PARENT=0                                            
         SENSEG NAME=WDF811,PARENT=WDF801                                       
         SENSEG NAME=WDF812,PARENT=WDF801                                       
         SENSEG NAME=WDF813,PARENT=WDF801                                       
         SENSEG NAME=WDF814,PARENT=WDF801                                       
         SENSEG NAME=WDF815,PARENT=WDF801                                       
*                                                                               
*---SPÄRREGLER (SEKUNDÄRINDEX SPÄRRGRUPP)                                       
         PCB   TYPE=DB,DBDNAME=WDF8,PROCOPT=GOT,KEYLEN=10,POS=S,       *        
               PROCSEQ=WDF8B                                                    
         SENSEG NAME=WDF801,PARENT=0                                            
* WDK6-PCB                                                                      
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=6,POS=S                  
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W20338                                       
*                                                                               
         END                                                                    
