*                                                                               
         PCB    TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                 
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLINLC,PROCOPT=G,KEYLEN=17,POS=S                 
         SENSEG NAME=WLINLC01,PARENT=0                                          
         SENSEG NAME=WLINLC12,PARENT=WLINLC01,PROCOPT=GRD                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTS,PROCOPT=G,KEYLEN=7,POS=S                  
         SENSEG NAME=WLARTS01,PARENT=0                                          
         SENSEG NAME=WLARTS11,PARENT=WLARTS01,PROCOPT=GR                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=8,POS=S,      *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W20358                                       
         END                                                                    
