*                                                                               
         PCB   TYPE=TP,NAME=W0T693X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*---USERBAS                                                                     
         PCB    TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=08,POS=S                
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*---ARTIKELREGISTRET                                                            
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=G,KEYLEN=06,POS=S                   
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601,PROCOPT=GR                            
*---SPÄRREGLER                                                                  
         PCB   TYPE=DB,DBDNAME=WDF8,PROCOPT=G,KEYLEN=24,POS=S                   
         SENSEG NAME=WDF801,PARENT=0,PROCOPT=GIRD                               
         SENSEG NAME=WDF812,PARENT=WDF801,PROCOPT=GIRD                          
         SENSEG NAME=WDF813,PARENT=WDF801,PROCOPT=GIRD                          
         SENSEG NAME=WDF814,PARENT=WDF801,PROCOPT=GIRD                          
         SENSEG NAME=WDF815,PARENT=WDF801,PROCOPT=GIRD                          
*                                                                               
*---SPÄRREGLER (SEKUNDÄRINDEX SPÄRRGRUPP)                                       
         PCB   TYPE=DB,DBDNAME=WDF8,PROCOPT=GOT,KEYLEN=10,POS=S,       *        
               PROCSEQ=WDF8B                                                    
         SENSEG NAME=WDF801,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W20337                                       
         END                                                                    
