*                                                                               
*        USERREGISTER                                                           
         PCB    TYPE=DB,DBDNAME=WDP7,PROCOPT=GIR,KEYLEN=08,POS=S                
         SENSEG NAME=WDP701,PARENT=0                                            
*                                                                               
* WDE3B1 REFILLREGISTER (SEK. INDEX), ORDERFÖRSLAG                              
         PCB   TYPE=DB,DBDNAME=WDE3B,PROCOPT=GOT,KEYLEN=10,POS=S                
         SENSEG NAME=WDE3B1,PARENT=0                                            
*                                                                               
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W20381                                       
         END                                                                    
