*---USERBAS                                                                     
         PCB    TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                 
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*---SPÄRREGLER                                                                  
         PCB   TYPE=DB,DBDNAME=WDF8,PROCOPT=G,KEYLEN=24,POS=S                   
         SENSEG NAME=WDF801,PARENT=0,PROCOPT=GIRD                               
         SENSEG NAME=WDF811,PARENT=WDF801,PROCOPT=G                             
         SENSEG NAME=WDF812,PARENT=WDF801,PROCOPT=G                             
         SENSEG NAME=WDF813,PARENT=WDF801,PROCOPT=G                             
         SENSEG NAME=WDF814,PARENT=WDF801,PROCOPT=G                             
         SENSEG NAME=WDF815,PARENT=WDF801,PROCOPT=G                             
*                                                                               
*---SPÄRREGLER (SEKUNDÄRINDEX SPÄRRGRUPP)                                       
         PCB   TYPE=DB,DBDNAME=WDF8,PROCOPT=GOT,KEYLEN=10,POS=S,       *        
               PROCSEQ=WDF8B                                                    
         SENSEG NAME=WDF801,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W20336                                       
         END                                                                    
