*                                                                               
         PCB    TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                 
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLLEVG,PROCOPT=GOT,KEYLEN=10,POS=S               
         SENSEG NAME=WLLEVG01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLLEVF,PROCOPT=GOT,KEYLEN=15,POS=S               
         SENSEG NAME=WLLEVF01,PARENT=0                                          
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W20334                                       
         END                                                                    
