*                                                                               
*        USERREGISTER                                                           
         PCB    TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GIR,KEYLEN=08,POS=S              
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
* WDE3 REFILLREGISTER                                                           
         PCB   TYPE=DB,DBDNAME=WDE3,PROCOPT=GOT,KEYLEN=14,POS=S                 
         SENSEG NAME=WDE301,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W20391                                       
         END                                                                    
