*---USERBAS                                                                     
         PCB    TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                 
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*---DIRLEVSTYRNINGSBAS                                                          
         PCB   TYPE=DB,DBDNAME=WLLEVF,PROCOPT=G,KEYLEN=20,POS=S                 
         SENSEG NAME=WLLEVF01,PARENT=0,PROCOPT=GIRD                             
         SENSEG NAME=WLLEVF12,PARENT=WLLEVF01,PROCOPT=G                         
*                                                                               
*---DIRLEVSTYRNINGSBAS VIA SEKUNDÄRINDEX                                        
         PCB   TYPE=DB,DBDNAME=WLLEVF,PROCOPT=G,KEYLEN=15,POS=S,       *        
               PROCSEQ=WDF2B                                                    
         SENSEG NAME=WLLEVF01,PARENT=0,PROCOPT=G                                
*                                                                               
*---LEVERANTÖRSSBAS                                                             
         PCB   TYPE=DB,DBDNAME=WLLEVA,PROCOPT=G,KEYLEN=6,POS=S                  
         SENSEG NAME=WLLEVA01,PARENT=0,PROCOPT=G                                
         SENSEG NAME=WLLEVA14,PARENT=WLLEVA01,PROCOPT=G                         
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W20332                                       
         END                                                                    
