*                                                                               
         PCB   TYPE=DB,DBDNAME=WLURVA,PROCOPT=G,KEYLEN=21,POS=S                 
         SENSEG NAME=WLURVA01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLURVA11,PARENT=WLURVA01,PROCOPT=GI                        
         SENSEG NAME=WLURVA12,PARENT=WLURVA01,PROCOPT=GI                        
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W20321                                       
         END                                                                    
