*                                                                               
         PCB   TYPE=TP,NAME=W0T693X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*---USERBAS                                                                     
         PCB    TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                 
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*---DIRLEVERANSBAS                                                              
         PCB   TYPE=DB,DBDNAME=WDF8,PROCOPT=G,KEYLEN=29,POS=S                   
         SENSEG NAME=WDF801,PARENT=0                                            
         SENSEG NAME=WDF811,PARENT=WDF801,PROCOPT=GIRD                          
*---KUNDREGISTERBAS                                                             
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W20339                                       
         END                                                                    
