******************************************* DISPATCHER                          
         PCB   TYPE=TP,NAME=W0T693X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
******************************************* KOMMUNIKATIONS DB                   
         PCB   TYPE=DB,DBDNAME=WLKOMA,PROCOPT=G,KEYLEN=28,POS=S                 
         SENSEG NAME=WLKOMA01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLKOMA11,PARENT=WLKOMA01,PROCOPT=GI                        
*                                                                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=G,KEYLEN=09,POS=S                   
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601,PROCOPT=GR                            
         SENSEG NAME=WDK629,PARENT=WDK611,PROCOPT=GR                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTS,PROCOPT=G,KEYLEN=07,POS=S                 
         SENSEG NAME=WLARTS01,PARENT=0                                          
         SENSEG NAME=WLARTS11,PARENT=WLARTS01,PROCOPT=GR                        
*                                                                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WL2505,PROCOPT=G,KEYLEN=47,POS=S                 
         SENSEG NAME=WL250501,PARENT=0,PROCOPT=GID                              
         SENSEG NAME=WL250511,PARENT=WL250501,PROCOPT=GID                       
*                                                                               
*                                                                               
******** SUBMODUL    W411ORDN  UTTAG AUT. ORDERNUMMER ********                  
*                                                                               
* ORDN-XXKP-PCB - AUTOMATISKA ORDERNUMMER WDR1  IDHTYP=4525                     
         PCB   TYPE=DB,DBDNAME=WLXXKP,PROCOPT=G,KEYLEN=35,POS=S                 
         SENSEG NAME=WLXXKP01,PARENT=0                                          
         SENSEG NAME=WLXXKP11,PARENT=WLXXKP01,PROCOPT=GR                        
*                                                                               
* ORDN-ORQL-PCB - ORDERHUVUDSREG KÖ (WDQ2C)-SEK.INDEX                           
         PCB   TYPE=DB,DBDNAME=WLORQL,PROCOPT=GOT,KEYLEN=17,POS=S               
         SENSEG NAME=WLORQL01,PARENT=0                                          
*                                                                               
* ORDN-PROC-PCB - PROFORMAHUVUDREG    WDE8                                      
         PCB   TYPE=DB,DBDNAME=WLPROC,PROCOPT=GOT,KEYLEN=17,POS=S               
         SENSEG NAME=WLPROC01,PARENT=0                                          
*                                                                               
* ORDN-ORQI-PCB - ORDERHUVUDSREG KÖ (WDQ201)                                    
         PCB   TYPE=DB,DBDNAME=WLORQI,PROCOPT=GOT,KEYLEN=04,POS=S               
         SENSEG NAME=WLORQI01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=4,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB616,PARENT=WDB601                                       
*                                                                               
* KAMPANJREGISTER                                                               
         PCB    TYPE=DB,DBDNAME=WDM2,PROCOPT=GOT,KEYLEN=25,POS=S                
         SENSEG NAME=WDM201,PARENT=0                                            
         SENSEG NAME=WDM211,PARENT=WDM201                                       
         SENSEG NAME=WDM221,PARENT=WDM211                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W20362                                       
*                                                                               
         END                                                                    
