*          DATA SET W20312PII0 AT LEVEL 004 AS OF 91/04/15                      
*          DATA SET W20162PII0 AT LEVEL 008 AS OF 90/10/18                      
*          DATA SET W20162PII0 AT LEVEL 003 AS OF 90/08/28                      
*                                                                               
*        USERREGISTER                                                           
         PCB    TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GIR,KEYLEN=08,POS=S              
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
*        KAMPANJREGISTER                                                        
         PCB    TYPE=DB,DBDNAME=WDM2,PROCOPT=G,KEYLEN=25,POS=S                  
         SENSEG NAME=WDM201,PARENT=0,PROCOPT=GD                                 
         SENSEG NAME=WDM211,PARENT=WDM201,PROCOPT=GIRD                          
         SENSEG NAME=WDM221,PARENT=WDM211,PROCOPT=GIRD                          
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W20312                                       
         END                                                                    
