*                                                                               
         PCB   TYPE=TP,NAME=W0T693X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*---USERBAS                                                                     
         PCB    TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                 
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*---ARTIKELREGISTRET                                                            
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=14,POS=S               
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
         SENSEG NAME=WLARTC23,PARENT=WLARTC11                                   
*---DIRLEVBAS                                                                   
         PCB   TYPE=DB,DBDNAME=WLLEVF,PROCOPT=G,KEYLEN=20,POS=S                 
         SENSEG NAME=WLLEVF01,PARENT=0                                          
         SENSEG NAME=WLLEVF12,PARENT=WLLEVF01,PROCOPT=GIRD                      
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W20333                                       
         END                                                                    
