*                                                                               
*        USERREGISTER                                                           
         PCB    TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GIR,KEYLEN=08,POS=S              
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
* WDE3 REFILLREGISTER, ORDERFÖRSLAG                                             
         PCB   TYPE=DB,DBDNAME=WLORDL,PROCOPT=GOT,KEYLEN=14,POS=S               
         SENSEG NAME=WLORDL01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W20371                                       
         END                                                                    
