*                                                                               
         PCB    TYPE=DB,DBDNAME=WDP7,PROCOPT=G,KEYLEN=8,POS=S                   
         SENSEG NAME=WDP701,PARENT=0,PROCOPT=GIR                                
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDG2,PROCOPT=G,KEYLEN=38,POS=S                   
         SENSEG NAME=WDG201,PARENT=0,PROCOPT=G                                  
         SENSEG NAME=WDGX1140,PARENT=WDG201,PROCOPT=GIRD                        
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W20452                                       
         END                                                                    
