*                                                                               
*        ALT-PCB                                                                
         PCB   TYPE=TP,NAME=W2T402,ALTRESP=NO,SAMETRM=NO,              *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB    TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                 
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD4,PROCOPT=G,KEYLEN=15,POS=S                   
         SENSEG NAME=WDD401,PARENT=0,PROCOPT=GRD                                
* WDK6                                                                          
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=G,KEYLEN=6,POS=S                    
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
* WDK7                                                                          
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=8,POS=S                  
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK722,PARENT=WDK711                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR2,PROCOPT=GOT,KEYLEN=35,POS=S                 
         SENSEG NAME=WDR201,PARENT=0                                            
         SENSEG NAME=WDR220,PARENT=WDR201                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD4,PROCOPT=GOT,KEYLEN=27,POS=S,       *        
               PROCSEQ=WDD4A                                                    
         SENSEG NAME=WDD401,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S,        *        
               PROCSEQ=WDB6A                                                    
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W20472                                       
         END                                                                    
