*                                                                               
         PCB    TYPE=DB,DBDNAME=WDP7,PROCOPT=G,KEYLEN=8,POS=S                   
         SENSEG NAME=WDP701,PARENT=0,PROCOPT=GIR                                
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=02,POS=S                 
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=08,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
         SENSEG NAME=WDK629,PARENT=WDK611                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=08,POS=S                   
         SENSEG NAME=WDK701,PARENT=0,PROCOPT=GIR                                
         SENSEG NAME=WDK711,PARENT=WDK701,PROCOPT=GIR                           
         SENSEG NAME=WDK722,PARENT=WDK711,PROCOPT=GIR                           
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDL7,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDL701,PARENT=0                                            
         SENSEG NAME=WDL711,PARENT=WDL701                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDL8,PROCOPT=GOT,KEYLEN=09,POS=S                 
         SENSEG NAME=WDL801,PARENT=0                                            
         SENSEG NAME=WDL811,PARENT=WDL801                                       
*                                                                               
* ORDERINGÅNGSHISTORIK XDC                                                      
         PCB   TYPE=DB,DBDNAME=WDL4,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDL401,PARENT=0                                            
         SENSEG NAME=WDL411,PARENT=WDL401                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD3,PROCOPT=GOT,KEYLEN=13,POS=S,       *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WDD301,PARENT=0                                            
         SENSEG NAME=WDD311,PARENT=WDD301                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W20404                                       
         END                                                                    
