*                                                                               
         PCB    TYPE=DB,DBDNAME=WDP7,PROCOPT=G,KEYLEN=8,POS=S                   
         SENSEG NAME=WDP701,PARENT=0,PROCOPT=GIR                                
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDC9A,PROCOPT=GOT,KEYLEN=10,POS=S                
         SENSEG NAME=WDC9A1,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDC9,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDC901,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=06,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=10,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK722,PARENT=WDK711                                       
         SENSEG NAME=WDK712,PARENT=WDK701                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=02,POS=S                 
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD2,PROCOPT=GOT,KEYLEN=05,POS=S                 
         SENSEG NAME=WDD201,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W20442                                       
         END                                                                    
