*        UPPDATERING REFILLPUNKT/KVSLAGER LOKAL ANSK                            
*                                                                               
         PCB    TYPE=DB,DBDNAME=WDP7,PROCOPT=G,KEYLEN=8,POS=S                   
         SENSEG NAME=WDP701,PARENT=0,PROCOPT=GIR                                
*                                                                               
         PCB   TYPE=DB,DBDNAME=WL2501,PROCOPT=G,KEYLEN=31,POS=S                 
         SENSEG NAME=WL250101,PARENT=0,PROCOPT=GIRD                             
         SENSEG NAME=WL250111,PARENT=WL250101,PROCOPT=GIRD                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W20456                                       
         END                                                                    
