*        USERREGISTER                                                           
         PCB    TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GIR,KEYLEN=08,POS=S              
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
*WDB6-PCB                                                                       
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=G,KEYLEN=8,POS=S                    
         SENSEG NAME=WDB601,PARENT=0,PROCOPT=GR                                 
         SENSEG NAME=WDB615,PARENT=WDB601,PROCOPT=GIR                           
         SENSEG NAME=WDB603,PARENT=WDB601,PROCOPT=GIRD                          
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W20455                                       
         END                                                                    
