                                                                                
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=G,KEYLEN=7,POS=S                  
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01,PROCOPT=GR                        
         SENSEG NAME=WLARTC23,PARENT=WLARTC11                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W21206,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
