*                                                                               
*        ALT-PCB - MEDDELANDE TILL DISPATCHER                                   
         PCB   TYPE=TP,NAME=W0T693X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=06,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=19,POS=S                   
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK722,PARENT=WDK711,PROCOPT=GIR                           
         SENSEG NAME=WDK723,PARENT=WDK711,PROCOPT=GID                           
         SENSEG NAME=WDK725,PARENT=WDK711,PROCOPT=GI                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=02,POS=S                 
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDF1,PROCOPT=G,KEYLEN=07,POS=S                   
         SENSEG NAME=WDF101,PARENT=0,PROCOPT=G                                  
         SENSEG NAME=WDF102,PARENT=WDF101,PROCOPT=GIRD                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR4,PROCOPT=G,KEYLEN=31,POS=S                   
         SENSEG NAME=WDR401,PARENT=0                                            
         SENSEG NAME=WDR470,PARENT=WDR401,PROCOPT=GR                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDG3,PROCOPT=G,KEYLEN=38,POS=S                   
         SENSEG NAME=WDG301,PARENT=0                                            
         SENSEG NAME=WDG302,PARENT=WDG301,PROCOPT=I                             
         SENSEG NAME=WDGX2254,PARENT=WDG301,PROCOPT=GIR                         
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDC9,PROCOPT=G,KEYLEN=7,POS=S                    
         SENSEG NAME=WDC901,PARENT=0,PROCOPT=GD                                 
*                                                                               
*        KOMMUNIKATIONSDATABAS                                                  
         PCB   TYPE=DB,DBDNAME=WLKOMA,PROCOPT=G,KEYLEN=28,POS=S                 
         SENSEG NAME=WLKOMA01,PARENT=0,PROCOPT=GIR                              
         SENSEG NAME=WLKOMA11,PARENT=WLKOMA01,PROCOPT=GI                        
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W21213,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
