*                                                                               
         PCB   TYPE=DB,DBDNAME=WDF1,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDF101,PARENT=0                                            
         SENSEG NAME=WDF106,PARENT=WDF101                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W21318                                       
         END                                                                    
