*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXBN,PROCOPT=G,KEYLEN=31,POS=S                 
         SENSEG NAME=WLXXBN01,PARENT=0                                          
         SENSEG NAME=WLXXBN11,PARENT=WLXXBN01,PROCOPT=GD                        
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W21330,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
