*                                                                               
         PCB   TYPE=DB,DBDNAME=WDF1,PROCOPT=G,KEYLEN=07,POS=S                   
         SENSEG NAME=WDF101,PARENT=0,PROCOPT=GIRD                               
         SENSEG NAME=WDF102,PARENT=WDF101,PROCOPT=GIRD                          
         SENSEG NAME=WDF106,PARENT=WDF101,PROCOPT=GIRD                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=05,POS=S,       *        
               PROCSEQ=WDK6A                                                    
         SENSEG NAME=WDK601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W21346,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
