*                                                                               
         PCB   TYPE=DB,DBDNAME=WLLEVA,PROCOPT=G,KEYLEN=5,POS=S                  
         SENSEG NAME=WLLEVA01,PARENT=0,PROCOPT=GRID                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=G,KEYLEN=7,POS=S                  
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01,PROCOPT=GR                        
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W21314,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
