*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=6,POS=S                  
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDF5,PROCOPT=GOT,KEYLEN=11,POS=S                 
         SENSEG NAME=WDF501,PARENT=0                                            
         SENSEG NAME=WDF502,PARENT=WDF501                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD9,PROCOPT=GOT,KEYLEN=19,POS=S                 
         SENSEG NAME=WDD901,PARENT=0                                            
         SENSEG NAME=WDD902,PARENT=WDD901                                       
         SENSEG NAME=WDD905,PARENT=WDD902                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W21422                                       
         END                                                                    
