*                                                                               
         PCB   TYPE=DB,DBDNAME=WLSATB,PROCOPT=G,KEYLEN=10,POS=S                 
         SENSEG NAME=WLSATB01,PARENT=0,PROCOPT=GR                               
         SENSEG NAME=WLSATB11,PARENT=WLSATB01,PROCOPT=GR                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=G,KEYLEN=6,POS=S                  
         SENSEG NAME=WLARTC01,PARENT=0,PROCOPT=GR                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXBY,PROCOPT=GI,KEYLEN=30,POS=S                
         SENSEG NAME=WLXXBY01,PARENT=0,PROCOPT=G                                
         SENSEG NAME=WLXXBY11,PARENT=WLXXBY01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXBM,PROCOPT=G,KEYLEN=35,POS=S                 
         SENSEG NAME=WLXXBM01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLXXBM11,PARENT=WLXXBM01,PROCOPT=GI                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLINLB,PROCOPT=G,KEYLEN=25,POS=S                 
         SENSEG NAME=WLINLB01,PARENT=0                                          
         SENSEG NAME=WLINLB11,PARENT=WLINLB01                                   
         SENSEG NAME=WLINLB23,PARENT=WLINLB11                                   
         SENSEG NAME=WLINLB32,PARENT=WLINLB23,PROCOPT=GI                        
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W21503,CMPAT=YES                             
         END                                                                    
