*          DATA SET W21506PII0 AT LEVEL 002 AS OF 91/01/31                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXCN,PROCOPT=G,KEYLEN=40,POS=S                 
         SENSEG NAME=WLXXCN01,PARENT=0                                          
         SENSEG NAME=WLXXCN11,PARENT=WLXXCN01,PROCOPT=I                         
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W21506,CMPAT=YES                             
         END                                                                    
