*          DATA SET W21502PII0 AT LEVEL 006 AS OF 91/05/14                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLSATB,PROCOPT=GOT,KEYLEN=10,POS=S               
         SENSEG NAME=WLSATB01,PARENT=0                                          
         SENSEG NAME=WLSATB11,PARENT=WLSATB01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=6,POS=S                
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLSATB,PROCOPT=GOTP,KEYLEN=45,POS=S,    *        
               PROCSEQ=WDJ1C                                                    
         SENSEG NAME=WLSATB11,PARENT=0                                          
         SENSEG NAME=WLSATB01,PARENT=WLSATB11                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLSATB,PROCOPT=GOT,KEYLEN=5,POS=S                
         SENSEG NAME=WLSATB01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLINLB,PROCOPT=GOT,KEYLEN=25,POS=S               
         SENSEG NAME=WLINLB01,PARENT=0                                          
         SENSEG NAME=WLINLB11,PARENT=WLINLB01                                   
         SENSEG NAME=WLINLB23,PARENT=WLINLB11                                   
         SENSEG NAME=WLINLB32,PARENT=WLINLB23                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W21502                                       
         END                                                                    
