*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=13,POS=S               
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
         SENSEG NAME=WLARTC23,PARENT=WLARTC11                                   
         SENSEG NAME=WLARTC25,PARENT=WLARTC11                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLLEVA,PROCOPT=GOT,KEYLEN=17,POS=S               
         SENSEG NAME=WLLEVA01,PARENT=0                                          
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W21702                                       
         END                                                                    
