*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=G,KEYLEN=13,POS=S                 
         SENSEG NAME=WLARTC01,PARENT=0,PROCOPT=G                                
         SENSEG NAME=WLARTC11,PARENT=WLARTC01,PROCOPT=GR                        
         SENSEG NAME=WLARTC25,PARENT=WLARTC11,PROCOPT=A                         
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W21704,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
