*                                                                               
*        BORTTAG AV HÄNDELSE 2228                                               
         PCB    TYPE=DB,DBDNAME=WLXXBW,PROCOPT=G,KEYLEN=40,POS=S                
         SENSEG NAME=WLXXBW01,PARENT=0                                          
         SENSEG NAME=WLXXBW11,PARENT=WLXXBW01,PROCOPT=GD                        
*                                                                               
*        LÄSNING ÄNDRING AV WDK6                                                
         PCB    TYPE=DB,DBDNAME=WLARTC,PROCOPT=G,KEYLEN=6,POS=S                 
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01,PROCOPT=GR                        
*                                                                               
*        LÄSNING WDK7                                                           
         PCB   TYPE=DB,DBDNAME=WLARTS,PROCOPT=GOT,KEYLEN=07,POS=S               
         SENSEG NAME=WLARTS01,PARENT=0                                          
         SENSEG NAME=WLARTS11,PARENT=WLARTS01                                   
*                                                                               
*        LÄSNING WDL7                                                           
         PCB   TYPE=DB,DBDNAME=WLOIGA,PROCOPT=GOT,KEYLEN=07,POS=S               
         SENSEG NAME=WLOIGA01,PARENT=0                                          
         SENSEG NAME=WLOIGA11,PARENT=WLOIGA01                                   
*                                                                               
*        LÄSNING AV WDD9                                                        
         PCB    TYPE=DB,DBDNAME=WLINLB,PROCOPT=GOT,KEYLEN=20,POS=S              
         SENSEG NAME=WLINLB01,PARENT=0                                          
         SENSEG NAME=WLINLB11,PARENT=WLINLB01                                   
         SENSEG NAME=WLINLB23,PARENT=WLINLB11                                   
         SENSEG NAME=WLINLB24,PARENT=WLINLB11                                   
*                                                                               
*                                                                               
*        PCB FÖR WDG3, ANVÄNDS I W218DISP MEN EJ EFTER CALL                     
*                      FRÅN W21804                                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXCT,PROCOPT=G,KEYLEN=40,POS=S                 
         SENSEG NAME=WLXXCT01,PARENT=0                                          
         SENSEG NAME=WLXXCT11,PARENT=WLXXCT01,PROCOPT=GI                        
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W21804,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
