*                                                                               
*        LÄSNING/UPPDATERING WDK6                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=G,KEYLEN=6,POS=S                  
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01,PROCOPT=GR                        
*                                                                               
*        LÄSNING WDK7                                                           
         PCB   TYPE=DB,DBDNAME=WLARTS,PROCOPT=GOT,KEYLEN=07,POS=S               
         SENSEG NAME=WLARTS01,PARENT=0                                          
         SENSEG NAME=WLARTS11,PARENT=WLARTS01                                   
*                                                                               
*        LÄSNING/UPPDATERING WDG3                                               
         PCB   TYPE=DB,DBDNAME=WLXXCT,PROCOPT=G,KEYLEN=40,POS=S                 
         SENSEG NAME=WLXXCT01,PARENT=0                                          
         SENSEG NAME=WLXXCT11,PARENT=WLXXCT01,PROCOPT=GD                        
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W21806,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
