*                                                                               
*        KAMPANJREGISTER                                                        
         PCB    TYPE=DB,DBDNAME=WDM2,PROCOPT=G,KEYLEN=25,POS=S                  
         SENSEG NAME=WDM201,PARENT=0,PROCOPT=GD                                 
         SENSEG NAME=WDM211,PARENT=WDM201,PROCOPT=GDR                           
         SENSEG NAME=WDM221,PARENT=WDM211,PROCOPT=GD                            
*                                                                               
*        ARTIKELINFO                                                            
         PCB    TYPE=DB,DBDNAME=WDK6,PROCOPT=G,KEYLEN=11,POS=S                  
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601,PROCOPT=GR                            
*                                                                               
*        ARTIKELREGISTER   WDK9                                                 
         PCB    TYPE=DB,DBDNAME=WDK9,PROCOPT=G,KEYLEN=11,POS=S                  
         SENSEG NAME=WDK901,PARENT=0,PROCOPT=GIR                                
         SENSEG NAME=WDK911,PARENT=WDK901,PROCOPT=GIRD                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDP5,PROCOPT=G,KEYLEN=19,POS=S                   
         SENSEG NAME=WDP501,PARENT=0,PROCOPT=GD                                 
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR4,PROCOPT=G,KEYLEN=30,POS=S                   
         SENSEG NAME=WDR401,PARENT=0                                            
         SENSEG NAME=WDR470,PARENT=WDR401,PROCOPT=GR                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W21906,CMPAT=YES                             
         END                                                                    
