*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=5,POS=S                
         SENSEG NAME=WLARTC01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLINLB,PROCOPT=G,KEYLEN=25,POS=S                 
         SENSEG NAME=WLINLB01,PARENT=0                                          
         SENSEG NAME=WLINLB11,PARENT=WLINLB01,PROCOPT=GR                        
         SENSEG NAME=WLINLB22,PARENT=WLINLB11,PROCOPT=GD                        
         SENSEG NAME=WLINLB23,PARENT=WLINLB11,PROCOPT=GD                        
         SENSEG NAME=WLINLB31,PARENT=WLINLB23,PROCOPT=GD                        
         SENSEG NAME=WLINLB32,PARENT=WLINLB23,PROCOPT=GD                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLINLB,PROCOPT=G,KEYLEN=25,POS=S                 
         SENSEG NAME=WLINLB01,PARENT=0                                          
         SENSEG NAME=WLINLB11,PARENT=WLINLB01,PROCOPT=GI                        
         SENSEG NAME=WLINLB22,PARENT=WLINLB11,PROCOPT=GI                        
         SENSEG NAME=WLINLB23,PARENT=WLINLB11,PROCOPT=GI                        
         SENSEG NAME=WLINLB31,PARENT=WLINLB23,PROCOPT=GI                        
         SENSEG NAME=WLINLB32,PARENT=WLINLB23,PROCOPT=GI                        
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W22190,CMPAT=YES                             
         END                                                                    
