*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=G,KEYLEN=06,POS=S                   
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601,PROCOPT=GR                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD9,PROCOPT=G,KEYLEN=19,POS=S                   
         SENSEG NAME=WDD901,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDD902,PARENT=WDD901,PROCOPT=GI                            
         SENSEG NAME=WDD904,PARENT=WDD902,PROCOPT=GIRD                          
         SENSEG NAME=WDD905,PARENT=WDD902,PROCOPT=GIRD                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD6,PROCOPT=G,KEYLEN=14,POS=S                   
         SENSEG NAME=WDD601,PARENT=0,PROCOPT=GD                                 
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR4,PROCOPT=G,KEYLEN=31,POS=S                   
         SENSEG NAME=WDR401,PARENT=0                                            
         SENSEG NAME=WDR470,PARENT=WDR401,PROCOPT=GR                            
*                                                                               
******* SUBMODUL W221BLOC *************************************                 
*                                                                               
* BLOC-WDD9-PCB  LEVERANSPLANEREGISTER                                          
         PCB   TYPE=DB,DBDNAME=WDD9,PROCOPT=G,KEYLEN=19,POS=S                   
         SENSEG NAME=WDD901,PARENT=0                                            
         SENSEG NAME=WDD902,PARENT=WDD901                                       
         SENSEG NAME=WDD905,PARENT=WDD902,PROCOPT=GIR                           
*                                                                               
* BLOC-WDF3-PCB  HELGDAGAR/LAND                                                 
         PCB   TYPE=DB,DBDNAME=WDF3,PROCOPT=GOT,KEYLEN=15,POS=S                 
         SENSEG NAME=WDF301,PARENT=0                                            
*                                                                               
* BLOC-WDR2-PCB ANSKAFFARE LARM                                                 
         PCB   TYPE=DB,DBDNAME=WDR2,PROCOPT=GOT,KEYLEN=35,POS=S                 
         SENSEG NAME=WDR201,PARENT=0                                            
         SENSEG NAME=WDR220,PARENT=WDR201                                       
*                                                                               
* BLOC-WDR5-PCB LARM BILD 2171                                                  
         PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=G,KEYLEN=40,POS=S                   
         SENSEG NAME=WDR501,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDR550,PARENT=WDR501,PROCOPT=GI                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W2215A,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
