*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR2,PROCOPT=G,KEYLEN=37,POS=S                   
         SENSEG NAME=WDR201,PARENT=0                                            
         SENSEG NAME=WDGX2206,PARENT=WDR201,PROCOPT=GR                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=G,KEYLEN=42,POS=S                   
         SENSEG NAME=WDR501,PARENT=0                                            
         SENSEG NAME=WDGX2248,PARENT=WDR501,PROCOPT=G                           
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W2216A                                       
         END                                                                    
