*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD4,PROCOPT=G,KEYLEN=13,POS=S                   
         SENSEG NAME=WDD401,PARENT=0,PROCOPT=GRD                                
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD9,PROCOPT=GOT,KEYLEN=29,POS=S                 
         SENSEG NAME=WDD901,PARENT=0                                            
         SENSEG NAME=WDD902,PARENT=WDD901                                       
         SENSEG NAME=WDD905,PARENT=WDD902                                       
         SENSEG NAME=WDD906,PARENT=WDD905                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W22105,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
