*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXBK,PROCOPT=G,KEYLEN=37,POS=S                 
         SENSEG NAME=WLXXBK01,PARENT=0                                          
         SENSEG NAME=WLXXBK11,PARENT=WLXXBK01,PROCOPT=GR                        
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W22185,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
