*                                                                               
*    WDG3 HÄNDELSEDATABAS  (HTYP 2257)                                          
         PCB   TYPE=DB,DBDNAME=WDG3,PROCOPT=G,KEYLEN=51,POS=S                   
         SENSEG NAME=WDG301,PARENT=0                                            
         SENSEG NAME=WDGX2258,PARENT=WDG301,PROCOPT=GD                          
         SENSEG NAME=WDGX2260,PARENT=WDGX2258,PROCOPT=GD                        
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W2212C,CMPAT=YES                             
         END                                                                    
