*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD9,PROCOPT=GOT,KEYLEN=25,POS=S                 
         SENSEG NAME=WDD901,PARENT=0                                            
         SENSEG NAME=WDD902,PARENT=WDD901                                       
         SENSEG NAME=WDD904,PARENT=WDD902                                       
         SENSEG NAME=WDD905,PARENT=WDD902                                       
         SENSEG NAME=WDD906,PARENT=WDD905                                       
         SENSEG NAME=WDD924,PARENT=WDD902                                       
         SENSEG NAME=WDD925,PARENT=WDD902                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD9,PROCOPT=G,KEYLEN=25,POS=S                   
         SENSEG NAME=WDD901,PARENT=0                                            
         SENSEG NAME=WDD902,PARENT=WDD901,PROCOPT=GD                            
         SENSEG NAME=WDD904,PARENT=WDD902                                       
         SENSEG NAME=WDD905,PARENT=WDD902,PROCOPT=GD                            
         SENSEG NAME=WDD906,PARENT=WDD905,PROCOPT=GD                            
         SENSEG NAME=WDD924,PARENT=WDD902,PROCOPT=GRD                           
         SENSEG NAME=WDD925,PARENT=WDD902,PROCOPT=GD                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6D1,PROCOPT=GOT,KEYLEN=8,POS=S,        *        
               PROCSEQ=W6D1B                                                    
         SENSEG NAME=W6D111,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W22126,CMPAT=YES                             
         END                                                                    
