*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXBK,PROCOPT=GOT,KEYLEN=35,POS=S               
         SENSEG NAME=WLXXBK01,PARENT=0                                          
         SENSEG NAME=WLXXBK11,PARENT=WLXXBK01                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W22186                                       
         END                                                                    
