*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXBL,PROCOPT=G,KEYLEN=42,POS=S                 
         SENSEG NAME=WLXXBL01,PARENT=0                                          
         SENSEG NAME=WLXXBL11,PARENT=WLXXBL01,PROCOPT=GD                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXBK,PROCOPT=GOT,KEYLEN=35,POS=S               
         SENSEG NAME=WLXXBK01,PARENT=0                                          
         SENSEG NAME=WLXXBK11,PARENT=WLXXBK01                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W22183,CMPAT=YES                             
         END                                                                    
