*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD9,PROCOPT=G,KEYLEN=20,POS=S                   
         SENSEG NAME=WDD901,PARENT=0                                            
         SENSEG NAME=WDD902,PARENT=WDD901                                       
         SENSEG NAME=WDD924,PARENT=WDD902                                       
         SENSEG NAME=WDD925,PARENT=WDD902,PROCOPT=GIR                           
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD4,PROCOPT=G,KEYLEN=13,POS=S                   
         SENSEG NAME=WDD401,PARENT=0,PROCOPT=GD                                 
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W2212F,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
