*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD4,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDD401,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W2212D                                       
         END                                                                    
