*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXBL,PROCOPT=G,KEYLEN=42,POS=S                 
         SENSEG NAME=WLXXBL01,PARENT=0                                          
         SENSEG NAME=WLXXBL11,PARENT=WLXXBL01,PROCOPT=GD                        
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W22182,CMPAT=YES                             
         END                                                                    
