*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=G,KEYLEN=6,POS=S                  
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01,PROCOPT=GR                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXBI,PROCOPT=G,KEYLEN=31,POS=S                 
         SENSEG NAME=WLXXBI01,PARENT=0                                          
         SENSEG NAME=WLXXBI11,PARENT=WLXXBI01,PROCOPT=GD                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXBJ,PROCOPT=G,KEYLEN=31,POS=S                 
         SENSEG NAME=WLXXBJ01,PARENT=0                                          
         SENSEG NAME=WLXXBJ11,PARENT=WLXXBJ01,PROCOPT=GI                        
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W22116,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
