                                                                                
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GR,KEYLEN=08,POS=S                  
         SENSEG NAME=WDK601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W22169,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
