*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=G,KEYLEN=06,POS=S                   
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601,PROCOPT=GR                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD9,PROCOPT=G,KEYLEN=19,POS=S                   
         SENSEG NAME=WDD901,PARENT=0,PROCOPT=GD                                 
         SENSEG NAME=WDD902,PARENT=WDD901                                       
         SENSEG NAME=WDD904,PARENT=WDD902,PROCOPT=GD                            
         SENSEG NAME=WDD905,PARENT=WDD902,PROCOPT=GD                            
*                                                                               
* LEV-PLANEFÖRSLAGSKÖ                                                           
         PCB   TYPE=DB,DBDNAME=WDD6,PROCOPT=G,KEYLEN=14,POS=S                   
         SENSEG NAME=WDD601,PARENT=0,PROCOPT=GD                                 
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W2214A,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
