*          DATA SET W22132PII0 AT LEVEL 004 AS OF 89/01/18                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDF1,PROCOPT=GOT,KEYLEN=208,POS=S                
         SENSEG NAME=WDF101,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W22132                                       
         END                                                                    
