* WDD9                                                                          
         PCB TYPE=DB,DBDNAME=WDD9,PROCOPT=GOT,KEYLEN=20,POS=S                   
         SENSEG NAME=WDD901,PARENT=0                                            
         SENSEG NAME=WDD902,PARENT=WDD901                                       
         SENSEG NAME=WDD905,PARENT=WDD902                                       
         SENSEG NAME=WDD924,PARENT=WDD902                                       
* WDR2                                                                          
         PCB   TYPE=DB,DBDNAME=WDR2,PROCOPT=GOT,KEYLEN=35,POS=S                 
         SENSEG NAME=WDR201,PARENT=0                                            
         SENSEG NAME=WDR220,PARENT=WDR201                                       
* WDL2                                                                          
         PCB   TYPE=DB,DBDNAME=WDL2,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDL201,PARENT=0                                            
         SENSEG NAME=WDL211,PARENT=WDL201                                       
         SENSEG NAME=WDL221,PARENT=WDL211                                       
         SENSEG NAME=WDL231,PARENT=WDL221                                       
* WDK7                                                                          
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
*                                                                               
* WDK9-PCB - ARTIKELREGISTER ORDER ENTRY                                        
         PCB   TYPE=DB,DBDNAME=WDK9,PROCOPT=GOT,KEYLEN=05,POS=S                 
         SENSEG NAME=WDK901,PARENT=0                                            
*                                                                               
***************************************************************                 
* ----- BEHOVSMODULENS (W22222)                                                 
***************************************************************                 
* WDK6                                                                          
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=19,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
         SENSEG NAME=WDK621,PARENT=WDK611                                       
         SENSEG NAME=WDK624,PARENT=WDK611                                       
         SENSEG NAME=WDK626,PARENT=WDK611                                       
         SENSEG NAME=WDK629,PARENT=WDK611                                       
* WDK7                                                                          
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=8,POS=S                  
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK727,PARENT=WDK711                                       
         SENSEG NAME=WDK712,PARENT=WDK701                                       
* WDK9                                                                          
         PCB   TYPE=DB,DBDNAME=WLARTM,PROCOPT=GOT,KEYLEN=11,POS=S               
         SENSEG NAME=WLARTM01,PARENT=0                                          
         SENSEG NAME=WLARTM11,PARENT=WLARTM01                                   
*                                                                               
* WDR2   SUB-PGM W271REFL                                                       
         PCB   TYPE=DB,DBDNAME=WL2501,PROCOPT=GOT,KEYLEN=31,POS=S               
         SENSEG NAME=WL250101,PARENT=0                                          
         SENSEG NAME=WL250111,PARENT=WL250101                                   
                                                                                
*                                                                               
* WDB6R  SUB-PGM W271REFL                                                       
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=4,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB616,PARENT=WDB601                                       
*                                                                               
* WDK7   SUB-PGM W271REFL                                                       
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=8,POS=S                  
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK727,PARENT=WDK711                                       
*                                                                               
* WDB6                                                                          
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=4,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB616,PARENT=WDB601                                       
*                                                                               
* WDD7A1      - ERSÄTTNINGSREGISTER                                             
         PCB   TYPE=DB,DBDNAME=WDD7A,PROCOPT=GOT,KEYLEN=12,POS=S                
         SENSEG NAME=WDD7A1,PARENT=0                                            
*                                                                               
* WDK7 ERSATT                                                                   
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
*                                                                               
* W222-UTIL-WDK6-PCB                                                            
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOTP,KEYLEN=8,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
         SENSEG NAME=WDK626,PARENT=WDK611                                       
         SENSEG NAME=WDK629,PARENT=WDK611                                       
*                                                                               
* W222-UTIL-WDK7-PCB                                                            
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=19,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK727,PARENT=WDK711                                       
*                                                                               
* W222-UTIL-WDB6-PCB                                                            
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=4,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB616,PARENT=WDB601                                       
*                                                                               
* W222-UTUP-WDK7-PCB                                                            
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=19,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
*                                                                               
* W222-UTUP-WDB6-PCB                                                            
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=4,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB616,PARENT=WDB601                                       
*                                                                               
* W222-UTUP-UTIL-WDK6-PCB                                                       
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOTP,KEYLEN=8,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
         SENSEG NAME=WDK626,PARENT=WDK611                                       
         SENSEG NAME=WDK629,PARENT=WDK611                                       
*                                                                               
* W222-UTUP-UTIL-WDK7-PCB                                                       
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=19,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK727,PARENT=WDK711                                       
*                                                                               
* W222-UTUP-UTIL-WDB6-PCB                                                       
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=4,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB616,PARENT=WDB601                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W22194                                       
         END                                                                    
