*          DATA SET W22160PII0 AT LEVEL 002 AS OF 90/12/01                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=13,POS=S               
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
         SENSEG NAME=WLARTC22,PARENT=WLARTC11                                   
         SENSEG NAME=WLARTC23,PARENT=WLARTC11                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXBK,PROCOPT=G,KEYLEN=37,POS=S                 
         SENSEG NAME=WLXXBK01,PARENT=0                                          
         SENSEG NAME=WLXXBK11,PARENT=WLXXBK01,PROCOPT=GR                        
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W22160,CMPAT=YES                             
         END                                                                    
