*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXBJ,PROCOPT=G,KEYLEN=31,POS=S                 
         SENSEG NAME=WLXXBJ01,PARENT=0                                          
         SENSEG NAME=WLXXBJ11,PARENT=WLXXBJ01,PROCOPT=GD                        
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W22130                                       
         END                                                                    
