*                                                                               
*                                                                               
* WDG3                                                                          
         PCB   TYPE=DB,DBDNAME=WDG3,PROCOPT=G,KEYLEN=31,POS=S                   
         SENSEG NAME=WDG301,PARENT=0                                            
         SENSEG NAME=WDG303,PARENT=WDG301,PROCOPT=GI                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W22228,CMPAT=YES                             
         END                                                                    
