*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=G,KEYLEN=7,POS=S                    
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601,PROCOPT=GR                            
         SENSEG NAME=WDK626,PARENT=WDK611,PROCOPT=GRD                           
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXAD,PROCOPT=G,KEYLEN=31,POS=S                 
         SENSEG NAME=WLXXAD01,PARENT=0                                          
         SENSEG NAME=WLXXAD11,PARENT=WLXXAD01,PROCOPT=GD                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXCK,PROCOPT=G,KEYLEN=31,POS=S                 
         SENSEG NAME=WLXXCK01,PARENT=0                                          
         SENSEG NAME=WLXXCK11,PARENT=WLXXCK01,PROCOPT=GI                        
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W22220,CMPAT=YES                             
         END                                                                    
