*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
*                                                                               
*-------- PCB FÖR SUBPGM W222SEAS                                               
*                                                                               
*                                                                               
* WDL8 ORDERINGÅNGSREGISTER                                                     
         PCB   TYPE=DB,DBDNAME=WDL8,PROCOPT=GOT,KEYLEN=25,POS=S                 
         SENSEG NAME=WDL801,PARENT=0                                            
         SENSEG NAME=WDL811,PARENT=WDL801                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W22226                                       
         END                                                                    
