*                                                                               
* WDK6                                                                          
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=G,KEYLEN=9,POS=S                    
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
         SENSEG NAME=WDK626,PARENT=WDK611,PROCOPT=GIR                           
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W22227,CMPAT=YES                             
         END                                                                    
