* W222TILG - CALCULATION OF ASSETS IN CDC                                       
*                                                                               
* WDK7                                                                          
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
* WDL2                                                                          
         PCB   TYPE=DB,DBDNAME=WDL2,PROCOPT=GOT,KEYLEN=34,POS=S                 
         SENSEG NAME=WDL201,PARENT=0                                            
         SENSEG NAME=WDL211,PARENT=WDL201                                       
         SENSEG NAME=WDL221,PARENT=WDL211                                       
         SENSEG NAME=WDL231,PARENT=WDL221                                       
* WDB6                                                                          
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
* WDD9                                                                          
         PCB TYPE=DB,DBDNAME=WDD9,PROCOPT=GOT,KEYLEN=19,POS=S                   
         SENSEG NAME=WDD901,PARENT=0                                            
         SENSEG NAME=WDD902,PARENT=WDD901                                       
         SENSEG NAME=WDD905,PARENT=WDD902                                       
* WDK6                                                                          
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=10,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
* WDK9                                                                          
         PCB   TYPE=DB,DBDNAME=WDK9,PROCOPT=GOT,KEYLEN=05,POS=S                 
         SENSEG NAME=WDK901,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W22232                                       
         END                                                                    
