*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXBQ,PROCOPT=G,KEYLEN=31,POS=S                 
         SENSEG NAME=WLXXBQ01,PARENT=0                                          
         SENSEG NAME=WLXXBQ11,PARENT=WLXXBQ01,PROCOPT=GD                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXAC,PROCOPT=G,KEYLEN=31,POS=S                 
         SENSEG NAME=WLXXAC01,PARENT=0                                          
         SENSEG NAME=WLXXAC11,PARENT=WLXXAC01,PROCOPT=GD                        
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W22210                                       
         END                                                                    
