*                                                                               
         PCB   TYPE=DB,DBDNAME=WDG3,PROCOPT=G,KEYLEN=31,POS=S                   
         SENSEG NAME=WDG301,PARENT=0                                            
         SENSEG NAME=WDG302,PARENT=WDG301,PROCOPT=GI                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR4,PROCOPT=G,KEYLEN=30,POS=S                   
         SENSEG NAME=WDR401,PARENT=0                                            
         SENSEG NAME=WDR470,PARENT=WDR401,PROCOPT=GR                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W22457,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
