*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=G,KEYLEN=42,POS=S                   
         SENSEG NAME=WDR501,PARENT=0                                            
         SENSEG NAME=WDGX2248,PARENT=WDR501,PROCOPT=GI                          
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W22462,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
