*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXBJ,PROCOPT=GOT,KEYLEN=40,POS=S               
         SENSEG NAME=WLXXBJ01,PARENT=0                                          
         SENSEG NAME=WLXXBJ11,PARENT=WLXXBJ01                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W22410                                       
         END                                                                    
