*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7A,PROCOPT=GOT,KEYLEN=14,POS=S                
         SENSEG NAME=WDK7A1,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=9,POS=S                  
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK722,PARENT=WDK711                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDF1,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDF101,PARENT=0                                            
         SENSEG NAME=WDF116,PARENT=WDF101                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6A,PROCOPT=GOT,KEYLEN=10,POS=S                
         SENSEG NAME=WDK6A1,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=6,POS=S                  
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W22421                                       
         END                                                                    
