*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD9,PROCOPT=G,KEYLEN=25,POS=S                   
         SENSEG NAME=WDD901,PARENT=0                                            
         SENSEG NAME=WDD902,PARENT=WDD901                                       
         SENSEG NAME=WDD905,PARENT=WDD902,PROCOPT=D                             
         SENSEG NAME=WDD906,PARENT=WDD905,PROCOPT=D                             
         SENSEG NAME=WDD924,PARENT=WDD902,PROCOPT=RD                            
         SENSEG NAME=WDD925,PARENT=WDD902,PROCOPT=D                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR4,PROCOPT=G,KEYLEN=30,POS=S                   
         SENSEG NAME=WDR401,PARENT=0                                            
         SENSEG NAME=WDR470,PARENT=WDR401,PROCOPT=GR                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W22456,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
