*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=08,POS=S                   
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701,PROCOPT=GR                            
         SENSEG NAME=WDK722,PARENT=WDK711,PROCOPT=GR                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD9,PROCOPT=G,KEYLEN=19,POS=S                   
         SENSEG NAME=WDD901,PARENT=0,PROCOPT=GID                                
         SENSEG NAME=WDD902,PARENT=WDD901,PROCOPT=GID                           
         SENSEG NAME=WDD904,PARENT=WDD902,PROCOPT=GIRD                          
         SENSEG NAME=WDD905,PARENT=WDD902,PROCOPT=GIRD                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD6,PROCOPT=G,KEYLEN=14,POS=S                   
         SENSEG NAME=WDD601,PARENT=0,PROCOPT=GD                                 
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR4,PROCOPT=G,KEYLEN=31,POS=S                   
         SENSEG NAME=WDR401,PARENT=0                                            
         SENSEG NAME=WDR470,PARENT=WDR401,PROCOPT=GR                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W22415,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
