*                                                                               
 PCB   TYPE=DB,DBDNAME=WLARTM,PROCOPT=GOT,KEYLEN=05,POS=S                       
 SENSEG NAME=WLARTM01,PARENT=0                                                  
*                                                                               
 PSBGEN LANG=COBOL,PSBNAME=W23177                                               
 END                                                                            
