*                                                                               
         PCB   TYPE=DB,DBDNAME=WDL2,PROCOPT=GOT,KEYLEN=21,POS=S                 
         SENSEG NAME=WDL201,PARENT=0                                            
         SENSEG NAME=WDL211,PARENT=WDL201                                       
         SENSEG NAME=WDL221,PARENT=WDL211                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W23152,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
