*          DATA SET W23110PII0 AT LEVEL 004 AS OF 89/08/14                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDL2,PROCOPT=GOT,KEYLEN=213,POS=S                
         SENSEG NAME=WDL201,PARENT=0                                            
         SENSEG NAME=WDL211,PARENT=WDL201                                       
         SENSEG NAME=WDL221,PARENT=WDL211                                       
         SENSEG NAME=WDL222,PARENT=WDL211                                       
         SENSEG NAME=WDL223,PARENT=WDL211                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W23110                                       
         END                                                                    
