*                                                                               
         PCB   TYPE=DB,DBDNAME=WLOIGB,PROCOPT=G,KEYLEN=5,POS=S                  
         SENSEG NAME=WLOIGB01,PARENT=0,PROCOPT=GR                               
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W23218,CMPAT=YES                             
         END                                                                    
