*                                                                               
*        LÄSER WDD9 MED HSSR                                                    
         PCB   TYPE=DB,DBDNAME=WDD9,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDD901,PARENT=0                                            
         SENSEG NAME=WDD902,PARENT=WDD901                                       
         SENSEG NAME=WDD905,PARENT=WDD902                                       
*                                                                               
*        LÄSNING WDB6                                                           
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W23344                                       
         END                                                                    
