*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXCZ,PROCOPT=G,KEYLEN=40,POS=S                 
         SENSEG NAME=WLXXCZ01,PARENT=0                                          
         SENSEG NAME=WLXXCZ11,PARENT=WLXXCZ01,PROCOPT=GD                        
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W23432,CMPAT=YES                             
         END                                                                    
