*                                                                               
         PCB   TYPE=DB,DBDNAME=WLINLB,PROCOPT=GOT,KEYLEN=19,POS=S               
         SENSEG NAME=WLINLB01,PARENT=0                                          
         SENSEG NAME=WLINLB11,PARENT=WLINLB01                                   
         SENSEG NAME=WLINLB23,PARENT=WLINLB11                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXCZ,PROCOPT=GOT,KEYLEN=40,POS=S               
         SENSEG NAME=WLXXCZ01,PARENT=0                                          
         SENSEG NAME=WLXXCZ11,PARENT=WLXXCZ01                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W23430                                       
         END                                                                    
