*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6A,PROCOPT=GOT,KEYLEN=10,POS=S                
         SENSEG NAME=WDK6A1,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=06,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD9,PROCOPT=GOT,KEYLEN=20,POS=S                 
         SENSEG NAME=WDD901,PARENT=0                                            
         SENSEG NAME=WDD902,PARENT=WDD901                                       
         SENSEG NAME=WDD905,PARENT=WDD902                                       
         SENSEG NAME=WDD924,PARENT=WDD902                                       
         SENSEG NAME=WDD925,PARENT=WDD902                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6D1,PROCOPT=GOT,KEYLEN=08,POS=S,       *        
               PROCSEQ=W6D1H                                                    
         SENSEG NAME=W6D111,PARENT=0                                            
*                                                                               
         PCB TYPE=DB,DBDNAME=WDF5,PROCOPT=GOT,KEYLEN=12,POS=S                   
         SENSEG NAME=WDF501,PARENT=0                                            
         SENSEG NAME=WDF502,PARENT=WDF501                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W23508,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
