*                                                                               
*        LÄSNING AV WDL7 MED HSSR                                               
         PCB   TYPE=DB,DBDNAME=WDL7,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDL701,PARENT=0                                            
         SENSEG NAME=WDL711,PARENT=WDL701                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W23656                                       
         END                                                                    
