*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR3,PROCOPT=GOT,KEYLEN=27,POS=S                 
         SENSEG NAME=WDR301,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W23686                                       
         END                                                                    
