*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=G,KEYLEN=06,POS=S                   
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601,PROCOPT=R                             
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W23659,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
