*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD7A,PROCOPT=GOT,KEYLEN=12,POS=S                
         SENSEG NAME=WDD7A1,PARENT=0                                            
*                                                                               
         PCB TYPE=DB,DBDNAME=WDD2,PROCOPT=GOT,KEYLEN=05,POS=S                   
         SENSEG NAME=WDD201,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD9,PROCOPT=GOT,KEYLEN=20,POS=S                 
         SENSEG NAME=WDD901,PARENT=0                                            
         SENSEG NAME=WDD902,PARENT=WDD901                                       
         SENSEG NAME=WDD924,PARENT=WDD902                                       
         SENSEG NAME=WDD925,PARENT=WDD902                                       
*                                                                               
         PCB TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=06,POS=S                   
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
*                                                                               
         PCB TYPE=DB,DBDNAME=WDP3A,PROCOPT=GOT,KEYLEN=22,POS=S                  
         SENSEG NAME=WDP3A1,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDP3B,PROCOPT=GOT,KEYLEN=20,POS=S                
         SENSEG NAME=WDP3B1,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDP3C,PROCOPT=GOT,KEYLEN=16,POS=S                
         SENSEG NAME=WDP3C1,PARENT=0                                            
*                                                                               
         PCB  TYPE=DB,DBDNAME=WDP3,PROCOPT=GOT,KEYLEN=10,POS=S                  
         SENSEG NAME=WDP301,PARENT=0                                            
         SENSEG NAME=WDP311,PARENT=WDP301                                       
*                                                                               
         PCB     TYPE=DB,DBDNAME=WDC1,PROCOPT=GOT,KEYLEN=6,POS=S                
         SENSEG  NAME=WDC101,PARENT=0                                           
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK9,PROCOPT=GOT,KEYLEN=11,POS=S                 
         SENSEG NAME=WDK901,PARENT=0                                            
         SENSEG NAME=WDK911,PARENT=WDK901                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR2,PROCOPT=GOT,KEYLEN=40,POS=S                 
         SENSEG NAME=WDR201,PARENT=0                                            
         SENSEG NAME=WDGX2264,PARENT=WDR201                                     
         SENSEG NAME=WDGX2266,PARENT=WDGX2264                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W25212                                       
         END                                                                    
