*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=G,KEYLEN=10,POS=S                   
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601,PROCOPT=GR                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDL8,PROCOPT=GOT,KEYLEN=10,POS=S                 
         SENSEG NAME=WDL801,PARENT=0                                            
         SENSEG NAME=WDL811,PARENT=WDL801                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W26145,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
