*                                                                               
*WDK6                                                                           
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=14,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
         SENSEG NAME=WDK627,PARENT=WDK611                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDL8,PROCOPT=GOT,KEYLEN=10,POS=S                 
         SENSEG NAME=WDL801,PARENT=0                                            
         SENSEG NAME=WDL811,PARENT=WDL801                                       
*                                                                               
*WDJ1                                                                           
         PCB    TYPE=DB,DBDNAME=WDJ1,PROCOPT=GOT,KEYLEN=5,POS=S                 
         SENSEG NAME=WDJ101,PARENT=0                                            
*                                                                               
*WDC1                                                                           
         PCB     TYPE=DB,DBDNAME=WDC1,PROCOPT=GOT,KEYLEN=6,POS=S                
         SENSEG  NAME=WDC101,PARENT=0                                           
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W26123                                       
         END                                                                    
