* ARTC-                                                                         
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=G,KEYLEN=18,POS=S                   
         SENSEG NAME=WDK601                                                     
         SENSEG NAME=WDK611,PARENT=WDK601,PROCOPT=GR                            
         SENSEG NAME=WDK623,PARENT=WDK611,PROCOPT=G                             
* ZZAC-                                                                         
         PCB   TYPE=DB,DBDNAME=WLZZAC,PROCOPT=G,KEYLEN=18,POS=S                 
         SENSEG NAME=WLZZAC01,PARENT=0,PROCOPT=GI                               
* ZZAD-                                                                         
         PCB   TYPE=DB,DBDNAME=WLZZAD,PROCOPT=G,KEYLEN=09,POS=S                 
         SENSEG NAME=WLZZAD01,PARENT=0,PROCOPT=GI                               
* WDF2-                                                                         
*---DIRLEVBAS                                                                   
         PCB   TYPE=DB,DBDNAME=WDF2,PROCOPT=G,KEYLEN=20,POS=S                   
         SENSEG NAME=WDF201,PARENT=0                                            
         SENSEG NAME=WDF212,PARENT=WDF201,PROCOPT=GI                            
* ARTC2-                                                                        
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=18,POS=S                 
         SENSEG NAME=WDK601                                                     
         SENSEG NAME=WDK611,PARENT=WDK601                                       
         SENSEG NAME=WDK622,PARENT=WDK611                                       
* XXBU-2224                                                                     
         PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=G,KEYLEN=40,POS=S                   
         SENSEG NAME=WDR501,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDR550,PARENT=WDR501,PROCOPT=GIRD                          
* WDT3                                                                          
         PCB   TYPE=DB,DBDNAME=WDT3,PROCOPT=G,KEYLEN=20,POS=S                   
         SENSEG NAME=WDT301,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDT311,PARENT=WDT301,PROCOPT=GI                            
* WDR2                                                                          
         PCB   TYPE=DB,DBDNAME=WDR2,PROCOPT=GOT,KEYLEN=35,POS=S                 
         SENSEG NAME=WDR201,PARENT=0                                            
         SENSEG NAME=WDR220,PARENT=WDR201                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W26178,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
