* ALT-                                                                          
         PCB   TYPE=TP,NAME=W0T606U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
* ALT4-                                                                         
         PCB   TYPE=TP,NAME=W1T113X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
* ARTC-                                                                         
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=G,KEYLEN=18,POS=S                   
         SENSEG NAME=WDK601                                                     
         SENSEG NAME=WDK611,PARENT=WDK601,PROCOPT=GR                            
         SENSEG NAME=WDK623,PARENT=WDK611,PROCOPT=G                             
* 6321-                                                                         
         PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=G,KEYLEN=70,POS=S                   
         SENSEG NAME=WDR501,PARENT=0                                            
         SENSEG NAME=WDGX6322,PARENT=WDR501,PROCOPT=GD                          
         SENSEG NAME=WDGX6324,PARENT=WDGX6322,PROCOPT=GIRD                      
         SENSEG NAME=WDGX6326,PARENT=WDGX6324,PROCOPT=GID                       
* 6327-                                                                         
         PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=GOT,KEYLEN=45,POS=S                 
         SENSEG NAME=WDR501,PARENT=0                                            
         SENSEG NAME=WDGX6328,PARENT=WDR501                                     
* 2401-                                                                         
         PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=G,KEYLEN=35,POS=S                   
         SENSEG NAME=WDR501,PARENT=0                                            
         SENSEG NAME=WDGX2402,PARENT=WDR501,PROCOPT=GI                          
* FILC-                                                                         
         PCB   TYPE=DB,DBDNAME=WLFILC,PROCOPT=G,KEYLEN=27,POS=S                 
         SENSEG NAME=WLFILC01,PARENT=0,PROCOPT=GI                               
* WDD8-                                                                         
         PCB   TYPE=DB,DBDNAME=WDD8,PROCOPT=G,KEYLEN=22,POS=S                   
         SENSEG NAME=WDD801,PARENT=0                                            
         SENSEG NAME=WDD811,PARENT=WDD801,PROCOPT=GRD                           
* WDJ9-                                                                         
         PCB   TYPE=DB,DBDNAME=WDJ9,PROCOPT=G,KEYLEN=25,POS=S                   
         SENSEG NAME=WDJ901,PARENT=0                                            
         SENSEG NAME=WDJ911,PARENT=WDJ901,PROCOPT=GR                            
* ZZAC-                                                                         
         PCB   TYPE=DB,DBDNAME=WLZZAC,PROCOPT=G,KEYLEN=18,POS=S                 
         SENSEG NAME=WLZZAC01,PARENT=0,PROCOPT=GI                               
* XXAV-                                                                         
         PCB   TYPE=DB,DBDNAME=WLXXAV,PROCOPT=G,KEYLEN=31,POS=S                 
         SENSEG NAME=WLXXAV01,PARENT=0                                          
         SENSEG NAME=WLXXAV11,PARENT=WLXXAV01,PROCOPT=GI                        
* ZZAD-                                                                         
         PCB   TYPE=DB,DBDNAME=WLZZAD,PROCOPT=G,KEYLEN=09,POS=S                 
         SENSEG NAME=WLZZAD01,PARENT=0,PROCOPT=GI                               
* WDF2-                                                                         
*---DIRLEVBAS                                                                   
         PCB   TYPE=DB,DBDNAME=WDF2,PROCOPT=G,KEYLEN=20,POS=S                   
         SENSEG NAME=WDF201,PARENT=0                                            
         SENSEG NAME=WDF212,PARENT=WDF201,PROCOPT=GI                            
* WDT3-                                                                         
         PCB   TYPE=DB,DBDNAME=WDT3,PROCOPT=G,KEYLEN=20,POS=S                   
         SENSEG NAME=WDT301,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDT311,PARENT=WDT301,PROCOPT=GI                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W26169,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
