*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=6,POS=S                  
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDQ2,PROCOPT=GOT,KEYLEN=4,POS=S                  
         SENSEG NAME=WDQ201,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W26154                                       
         END                                                                    
