*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=211,POS=S                
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTM,PROCOPT=GOT,KEYLEN=5,POS=S                
         SENSEG NAME=WLARTM01,PARENT=0                                          
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W26110                                       
         END                                                                    
