*          DATA SET W26134PII0 AT LEVEL 004 AS OF 87/08/18                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLINLB,PROCOPT=GOT,KEYLEN=20,POS=S               
         SENSEG NAME=WLINLB01,PARENT=0                                          
         SENSEG NAME=WLINLB11,PARENT=WLINLB01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=13,POS=S,     *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD8,PROCOPT=GOT,KEYLEN=22,POS=S                 
         SENSEG NAME=WDD801,PARENT=0                                            
         SENSEG NAME=WDD811,PARENT=WDD801                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W26134                                       
         END                                                                    
