*                                                                               
         PCB   TYPE=DB,DBDNAME=WDG2,PROCOPT=GOT,KEYLEN=36,POS=S                 
         SENSEG NAME=WDG201,PARENT=0                                            
         SENSEG NAME=WDGX1144,PARENT=WDG201                                     
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W26141                                       
         END                                                                    
