*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=G,KEYLEN=10,POS=S                   
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601,PROCOPT=GR                            
         SENSEG NAME=WDK627,PARENT=WDK611,PROCOPT=GIR                           
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=10,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK9,PROCOPT=GOT,KEYLEN=11,POS=S                 
         SENSEG NAME=WDK901,PARENT=0                                            
         SENSEG NAME=WDK911,PARENT=WDK901                                       
*                                                                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=G,KEYLEN=54,POS=S                   
         SENSEG NAME=WDR501,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDGX6322,PARENT=WDR501,PROCOPT=GI                          
         SENSEG NAME=WDGX6324,PARENT=WDGX6322,PROCOPT=GI                        
         SENSEG NAME=WDGX6325,PARENT=WDGX6324,PROCOPT=GI                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=GOT,KEYLEN=45,POS=S                 
         SENSEG NAME=WDR501,PARENT=0                                            
         SENSEG NAME=WDGX6328,PARENT=WDR501                                     
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDN6,PROCOPT=GOT,KEYLEN=11,POS=S                 
         SENSEG NAME=WDN601,PARENT=0                                            
         SENSEG NAME=WDN611,PARENT=WDN601                                       
*                                                                               
*        ORDERRADSREG.                                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDQ4B,PROCOPT=GOT,KEYLEN=37,POS=S                
         SENSEG NAME=WDQ4B1,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDQ4,PROCOPT=GOT,KEYLEN=20,POS=S                 
         SENSEG NAME=WDQ401,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDL8,PROCOPT=GOT,KEYLEN=10,POS=S                 
         SENSEG NAME=WDL801,PARENT=0                                            
         SENSEG NAME=WDL811,PARENT=WDL801                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD7,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDD701,PARENT=0                                            
         SENSEG NAME=WDD702,PARENT=WDD701                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR2,PROCOPT=GOT,KEYLEN=32,POS=S                 
         SENSEG NAME=WDR201,PARENT=0                                            
         SENSEG NAME=WDGX2244,PARENT=WDR201                                     
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDJ1,PROCOPT=GOTP,KEYLEN=45,POS=S,      *        
               PROCSEQ=WDJ1C                                                    
         SENSEG NAME=WDJ111,PARENT=0                                            
         SENSEG NAME=WDJ101,PARENT=WDJ111                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD9,PROCOPT=GOT,KEYLEN=12,POS=S                 
         SENSEG NAME=WDD901,PARENT=0                                            
         SENSEG NAME=WDD902,PARENT=WDD901                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD3,PROCOPT=GOT,KEYLEN=13,POS=S,       *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WDD301,PARENT=0                                            
         SENSEG NAME=WDD311,PARENT=WDD301                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W26176,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
