*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=08,POS=S                   
         SENSEG NAME=WDK701                                                     
         SENSEG NAME=WDK711,PARENT=WDK701,PROCOPT=GR                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=08,POS=S                   
         SENSEG NAME=WDK701                                                     
         SENSEG NAME=WDK711,PARENT=WDK701,PROCOPT=G                             
         SENSEG NAME=WDK722,PARENT=WDK711,PROCOPT=GR                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W27131,CMPAT=YES                             
         END                                                                    
