*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE3,PROCOPT=G,KEYLEN=13,POS=S                   
         SENSEG NAME=WDE301,PARENT=0,PROCOPT=GD                                 
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=07,POS=S                   
         SENSEG NAME=WDK701,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDK711,PARENT=WDK701,PROCOPT=GIR                           
         SENSEG NAME=WDK712,PARENT=WDK701,PROCOPT=GI                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDL7,PROCOPT=G,KEYLEN=07,POS=S                   
         SENSEG NAME=WDL701,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDL711,PARENT=WDL701,PROCOPT=GI                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=02,POS=S                 
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=06,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W27146,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
