*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=07,POS=S                   
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701,PROCOPT=GR                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W2712F,CMPAT=YES                             
         END                                                                    
