*                                                                               
         PCB   TYPE=DB,DBDNAME=WDF1,PROCOPT=GOT,KEYLEN=11,POS=S                 
         SENSEG NAME=WDF101,PARENT=0                                            
         SENSEG NAME=WDF116,PARENT=WDF101                                       
*                                                                               
*****************************************************************               
*-------- PCB FÖR SUBPGM W271REFL                                               
*****************************************************************               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WL2501,PROCOPT=GOT,KEYLEN=31,POS=S               
         SENSEG NAME=WL250101,PARENT=0                                          
         SENSEG NAME=WL250111,PARENT=WL250101                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=4,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB616,PARENT=WDB601                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDN6,PROCOPT=GOT,KEYLEN=14,POS=S                 
         SENSEG NAME=WDN601,PARENT=0                                            
         SENSEG NAME=WDN611,PARENT=WDN601                                       
         SENSEG NAME=WDN621,PARENT=WDN611                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK712,PARENT=WDK701                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=8,POS=S                  
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK727,PARENT=WDK711                                       
*                                                                               
* REFL-UTIL-WDK6-PCB                                                            
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOTP,KEYLEN=8,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
         SENSEG NAME=WDK626,PARENT=WDK611                                       
         SENSEG NAME=WDK629,PARENT=WDK611                                       
*                                                                               
* REFL-UTIL-WDK7-PCB                                                            
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=19,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK727,PARENT=WDK711                                       
*                                                                               
* REFL-UTIL-WDB6-PCB                                                            
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=4,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB616,PARENT=WDB601                                       
*                                                                               
***************************************************************                 
*------ PCB FÖR SUBPGM W271UTUP                                                 
***************************************************************                 
*                                                                               
* UTUP1-WDK7-PCB                                                                
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=19,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
*                                                                               
* UTUP1-WDB6-PCB                                                                
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=4,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB616,PARENT=WDB601                                       
*                                                                               
* UTUP1-UTIL-WDK6-PCB                                                           
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOTP,KEYLEN=8,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
         SENSEG NAME=WDK626,PARENT=WDK611                                       
         SENSEG NAME=WDK629,PARENT=WDK611                                       
*                                                                               
* UTUP1-UTIL-WDK7-PCB                                                           
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=19,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK727,PARENT=WDK711                                       
*                                                                               
* UTUP1-UTIL-WDB6-PCB                                                           
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=4,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB616,PARENT=WDB601                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W27127                                       
         END                                                                    
