*                                                                               
*        WDK7                                                                   
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=08,POS=S                   
         SENSEG NAME=WDK701,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDK711,PARENT=WDK701,PROCOPT=GIR                           
         SENSEG NAME=WDK727,PARENT=WDK711,PROCOPT=GIRD                          
         SENSEG NAME=WDK712,PARENT=WDK701,PROCOPT=GI                            
*                                                                               
*        WDL7                                                                   
         PCB   TYPE=DB,DBDNAME=WLOIGA,PROCOPT=G,KEYLEN=07,POS=S                 
         SENSEG NAME=WLOIGA01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLOIGA11,PARENT=WLOIGA01,PROCOPT=GIR                       
*                                                                               
*        WDD7                                                                   
         PCB   TYPE=DB,DBDNAME=WLERSA,PROCOPT=GOT,KEYLEN=07,POS=S               
         SENSEG NAME=WLERSA01,PARENT=0                                          
         SENSEG NAME=WLERSA11,PARENT=WLERSA01                                   
*                                                                               
*        WDK6                                                                   
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=G,KEYLEN=06,POS=S                 
         SENSEG NAME=WLARTC01,PARENT=0,PROCOPT=G                                
         SENSEG NAME=WLARTC11,PARENT=WLARTC01,PROCOPT=GR                        
*                                                                               
*        WDR5 RESTART                                                           
         PCB   TYPE=DB,DBDNAME=WLCKPA,PROCOPT=G,KEYLEN=31,POS=S                 
         SENSEG NAME=WLCKPA01,PARENT=0,PROCOPT=GIR                              
         SENSEG NAME=WLCKPA11,PARENT=WLCKPA01,PROCOPT=GIR                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W27136,CMPAT=YES                             
         END                                                                    
