*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
*        WDK6                                                                   
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=06,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
*        WDK7                                                                   
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
*                                                                               
*        LÄSNING WDK7 DLI                                                       
         PCB   TYPE=DB,DBDNAME=WLARTS,PROCOPT=GOT,KEYLEN=07,POS=S               
         SENSEG NAME=WLARTS01,PARENT=0                                          
         SENSEG NAME=WLARTS11,PARENT=WLARTS01                                   
*                                                                               
*        WDL7                                                                   
         PCB   TYPE=DB,DBDNAME=WDL7,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDL701,PARENT=0                                            
         SENSEG NAME=WDL711,PARENT=WDL701                                       
*                                                                               
*        LÄSNING WDD9 DLI                                                       
         PCB   TYPE=DB,DBDNAME=WDD9,PROCOPT=GOT,KEYLEN=19,POS=S                 
         SENSEG NAME=WDD901,PARENT=0                                            
         SENSEG NAME=WDD902,PARENT=WDD901                                       
         SENSEG NAME=WDD905,PARENT=WDD902                                       
*                                                                               
*        WDK6                                                                   
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=06,POS=S               
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
*                                                                               
*        WDD7                                                                   
         PCB   TYPE=DB,DBDNAME=WDD7,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDD701,PARENT=0                                            
         SENSEG NAME=WDD702,PARENT=WDD701                                       
*                                                                               
*        WDQ4B1 - ORDERRADSREGISTER                                             
         PCB   TYPE=DB,DBDNAME=WDQ4B,PROCOPT=GOT,KEYLEN=37,POS=S                
         SENSEG NAME=WDQ4B1,PARENT=0                                            
*                                                                               
*        LÄSNING WDK7 DLI                                                       
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=08,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK722,PARENT=WDK711                                       
         SENSEG NAME=WDK712,PARENT=WDK701                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK712,PARENT=WDK701                                       
*                                                                               
*        INLEVERANS HISTORIK SDC                                                
         PCB   TYPE=DB,DBDNAME=WDL6,PROCOPT=GOT,KEYLEN=21,POS=S                 
         SENSEG NAME=WDL601,PARENT=0                                            
         SENSEG NAME=WDL611,PARENT=WDL601                                       
*                                                                               
*------ PCB FÖR SUBPGM W271UTIL                                                 
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=6,POS=S                  
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
         SENSEG NAME=WDK626,PARENT=WDK611                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=19,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK727,PARENT=WDK711                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W2712C                                       
         END                                                                    
