*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTS,PROCOPT=G,KEYLEN=07,POS=S                 
         SENSEG NAME=WLARTS01                                                   
         SENSEG NAME=WLARTS11,PARENT=WLARTS01,PROCOPT=GR                        
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W2713C,CMPAT=YES                             
         END                                                                    
