*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7B,PROCOPT=GOT,KEYLEN=09,POS=S                
         SENSEG NAME=WDK7B1,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=02,POS=S                 
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W27144                                       
         END                                                                    
