*                                                                               
         PCB   TYPE=DB,DBDNAME=WDL7,PROCOPT=G,KEYLEN=07,POS=S                   
         SENSEG NAME=WDL701,PARENT=0                                            
         SENSEG NAME=WDL711,PARENT=WDL701,PROCOPT=GR                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDL4,PROCOPT=G,KEYLEN=07,POS=S                   
         SENSEG NAME=WDL401,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDL411,PARENT=WDL401,PROCOPT=GIR                           
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W27145,CMPAT=YES                             
         END                                                                    
