*                                                                               
         PCB   TYPE=DB,DBDNAME=WLLEVA,PROCOPT=GIR,KEYLEN=6,POS=S                
         SENSEG NAME=WLLEVA01,PARENT=0                                          
         SENSEG NAME=WLLEVA17,PARENT=WLLEVA01                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W27122                                       
         END                                                                    
