*                                                                               
*        LÄSNING AV WDK7 HSSR                                                   
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
*                                                                               
*        LÄSNING WDK6 DLI                                                       
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=19,POS=S               
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
         SENSEG NAME=WLARTC21,PARENT=WLARTC11                                   
         SENSEG NAME=WLARTC24,PARENT=WLARTC11                                   
         SENSEG NAME=WLARTC26,PARENT=WLARTC11                                   
*                                                                               
*        LÄSNING WDL7 DLI                                                       
         PCB   TYPE=DB,DBDNAME=WLOIGA,PROCOPT=GOT,KEYLEN=07,POS=S               
         SENSEG NAME=WLOIGA01,PARENT=0                                          
         SENSEG NAME=WLOIGA11,PARENT=WLOIGA01                                   
*                                                                               
*        LÄSNING WDK9 DLI                                                       
         PCB   TYPE=DB,DBDNAME=WLARTM,PROCOPT=GOT,KEYLEN=11,POS=S               
         SENSEG NAME=WLARTM01,PARENT=0                                          
         SENSEG NAME=WLARTM11,PARENT=WLARTM01                                   
*                                                                               
*        LÄSNING WDE3 DLI                                                       
         PCB   TYPE=DB,DBDNAME=WLORDL,PROCOPT=GOT,KEYLEN=14,POS=S               
         SENSEG NAME=WLORDL01,PARENT=0                                          
*                                                                               
*        LÄSNING WDD7 DLI                                                       
         PCB   TYPE=DB,DBDNAME=WLERSA,PROCOPT=GOT,KEYLEN=13,POS=S               
         SENSEG NAME=WLERSA01,PARENT=0                                          
         SENSEG NAME=WLERSA13,PARENT=WLERSA01                                   
*                                                                               
*        LÄSNING WDD9 DLI                                                       
         PCB   TYPE=DB,DBDNAME=WLINLB,PROCOPT=GOT,KEYLEN=19,POS=S               
         SENSEG NAME=WLINLB01,PARENT=0                                          
         SENSEG NAME=WLINLB11,PARENT=WLINLB01                                   
         SENSEG NAME=WLINLB23,PARENT=WLINLB11                                   
*                                                                               
*        LÄSNING WDK7 DLI (TRANSFER)                                            
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK712,PARENT=WDK701                                       
*                                                                               
*        LÄSNING WDK7 DLI (ERSATT)                                              
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
*                                                                               
*        LÄSNING WDL6 DLI                                                       
         PCB   TYPE=DB,DBDNAME=WLINLC,PROCOPT=GOT,KEYLEN=21,POS=S               
         SENSEG NAME=WLINLC01,PARENT=0                                          
         SENSEG NAME=WLINLC11,PARENT=WLINLC01                                   
*                                                                               
*        LÄSNING WDK6 DLI LÄSA ERSATT                                           
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=09,POS=S               
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
*                                                                               
*        WDD7A1                                                                 
         PCB   TYPE=DB,DBDNAME=WLERSB,PROCOPT=GOT,KEYLEN=12,POS=S               
         SENSEG NAME=WLERSB01,PARENT=0                                          
                                                                                
*        WDA5D1                                                                 
         PCB   TYPE=DB,DBDNAME=WLORDT,PROCOPT=GOT,KEYLEN=24,POS=S               
         SENSEG NAME=WLORDT01,PARENT=0                                          
*                                                                               
*        WDA501                                                                 
         PCB   TYPE=DB,DBDNAME=WLORDP,PROCOPT=GOT,KEYLEN=24,POS=S               
         SENSEG NAME=WLORDP01,PARENT=0                                          
*                                                                               
*        WDF1                                                                   
         PCB   TYPE=DB,DBDNAME=WLLEVA,PROCOPT=GOT,KEYLEN=07,POS=S               
         SENSEG NAME=WLLEVA01,PARENT=0                                          
         SENSEG NAME=WLLEVA16,PARENT=WLLEVA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE4,PROCOPT=GOT,KEYLEN=37,POS=S,       *        
               PROCSEQ=WDE4C                                                    
         SENSEG NAME=WDE411,PARENT=0                                            
         SENSEG NAME=WDE401,PARENT=WDE411                                       
         SENSEG NAME=WDE421,PARENT=WDE411                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE6,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDE601,PARENT=0                                            
         SENSEG NAME=WDE611,PARENT=WDE601                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDQ4B,PROCOPT=GOT,KEYLEN=37,POS=S                
         SENSEG NAME=WDQ4B1,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDQ2,PROCOPT=GOT,KEYLEN=6,POS=S                  
         SENSEG NAME=WDQ201,PARENT=0                                            
         SENSEG NAME=WDQ212,PARENT=WDQ201                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=4,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB616,PARENT=WDB601                                       
*                                                                               
*        LÄSNING WDK7 DLI                                                       
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=20,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK724,PARENT=WDK711                                       
         SENSEG NAME=WDK727,PARENT=WDK711                                       
*                                                                               
*        LÄSNING WDK7 DLI                                                       
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=08,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK722,PARENT=WDK711                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=09,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
         SENSEG NAME=WDK629,PARENT=WDK611                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W27110                                       
         END                                                                    
