*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE3,PROCOPT=G,KEYLEN=14,POS=S                   
         SENSEG NAME=WDE301,PARENT=0,PROCOPT=GD                                 
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=09,POS=S                   
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701,PROCOPT=GR                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W271G2                                       
         END                                                                    
