*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=6,POS=S                  
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDL7,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDL701,PARENT=0                                            
         SENSEG NAME=WDL711,PARENT=WDL701                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W2711E                                       
         END                                                                    
