*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=09,POS=S,       *        
               PROCSEQ=WDK6H                                                    
         SENSEG NAME=WDK629,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK629                                       
         SENSEG NAME=WDK601,PARENT=WDK611                                       
*                                                                               
*        LÄSNING WDK9 DLI                                                       
         PCB   TYPE=DB,DBDNAME=WDK9,PROCOPT=GOT,KEYLEN=05,POS=S                 
         SENSEG NAME=WDK901,PARENT=0                                            
*                                                                               
*        LÄSNING WDE3 DLI                                                       
         PCB   TYPE=DB,DBDNAME=WDE3,PROCOPT=GOT,KEYLEN=14,POS=S                 
         SENSEG NAME=WDE301,PARENT=0                                            
*                                                                               
*        LÄSNING WDD7 DLI                                                       
         PCB   TYPE=DB,DBDNAME=WDD7,PROCOPT=GOT,KEYLEN=13,POS=S                 
         SENSEG NAME=WDD701,PARENT=0                                            
         SENSEG NAME=WDD704,PARENT=WDD701                                       
*                                                                               
*        LÄSNING WDD9 DLI                                                       
         PCB   TYPE=DB,DBDNAME=WLINLB,PROCOPT=GOT,KEYLEN=19,POS=S               
         SENSEG NAME=WLINLB01,PARENT=0                                          
         SENSEG NAME=WLINLB11,PARENT=WLINLB01                                   
         SENSEG NAME=WLINLB23,PARENT=WLINLB11                                   
*                                                                               
*        LÄSNING WDK7 DLI                                                       
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=08,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK722,PARENT=WDK711                                       
*                                                                               
*        LÄSNING WDL6 DLI                                                       
         PCB   TYPE=DB,DBDNAME=WLINLC,PROCOPT=GOT,KEYLEN=21,POS=S               
         SENSEG NAME=WLINLC01,PARENT=0                                          
         SENSEG NAME=WLINLC11,PARENT=WLINLC01                                   
*                                                                               
*        WDA5D1                                                                 
         PCB   TYPE=DB,DBDNAME=WLORDT,PROCOPT=GOT,KEYLEN=24,POS=S               
         SENSEG NAME=WLORDT01,PARENT=0                                          
*                                                                               
*        WDA501                                                                 
         PCB   TYPE=DB,DBDNAME=WLORDP,PROCOPT=GOT,KEYLEN=24,POS=S               
         SENSEG NAME=WLORDP01,PARENT=0                                          
*                                                                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=4,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB616,PARENT=WDB601                                       
*                                                                               
*        LÄSNING WDK7 DLI                                                       
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK712,PARENT=WDK701                                       
*                                                                               
* ETA-WDB6-PCB - DC-REGISTER  WDB6                                              
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=4,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB616,PARENT=WDB601                                       
*                                                                               
* W271UTIL - PCB FÖR SUB-PGM W271UTIL                                           
*UTIL-WDK6                                                                      
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOTP,KEYLEN=8,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
         SENSEG NAME=WDK626,PARENT=WDK611                                       
         SENSEG NAME=WDK629,PARENT=WDK611                                       
*UTIL-WDK7                                                                      
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=19,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK727,PARENT=WDK711                                       
*UTIL-WDB6                                                                      
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=4,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB616,PARENT=WDB601                                       
*                                                                               
* END-UTIL-PCBS                                                                 
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE4,PROCOPT=GOT,KEYLEN=37,POS=S,       *        
               PROCSEQ=WDE4C                                                    
         SENSEG NAME=WDE411,PARENT=0                                            
         SENSEG NAME=WDE401,PARENT=WDE411                                       
         SENSEG NAME=WDE421,PARENT=WDE411                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE6,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDE601,PARENT=0                                            
         SENSEG NAME=WDE611,PARENT=WDE601                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDQ4B,PROCOPT=GOT,KEYLEN=37,POS=S                
         SENSEG NAME=WDQ4B1,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDQ2,PROCOPT=GOT,KEYLEN=6,POS=S                  
         SENSEG NAME=WDQ201,PARENT=0                                            
         SENSEG NAME=WDQ212,PARENT=WDQ201                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W27210                                       
         END                                                                    
