* WDK7                                                                          
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=07,POS=S                   
         SENSEG NAME=WDK701,PARENT=0,PROCOPT=GIR                                
         SENSEG NAME=WDK711,PARENT=WDK701,PROCOPT=GIR                           
         SENSEG NAME=WDK712,PARENT=WDK701,PROCOPT=GIR                           
* WDK6                                                                          
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=06,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
* WDB6                                                                          
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
* WDL7                                                                          
         PCB   TYPE=DB,DBDNAME=WDL7,PROCOPT=G,KEYLEN=07,POS=S                   
         SENSEG NAME=WDL701,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDL711,PARENT=WDL701,PROCOPT=GIR                           
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W27201                                       
         END                                                                    
