*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE3,PROCOPT=G,KEYLEN=14,POS=S                   
         SENSEG NAME=WDE301,PARENT=0,PROCOPT=GD                                 
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=G,KEYLEN=09,POS=S                   
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601,PROCOPT=GR                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W272G2                                       
         END                                                                    
