*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
*-- THE FOLLOWING PCBS ARE USED BY SUBPGM W271BUYR                              
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=4,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB619,PARENT=WDB601                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDL7,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDL701,PARENT=0                                            
         SENSEG NAME=WDL711,PARENT=WDL701                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDL8,PROCOPT=GOT,KEYLEN=25,POS=S                 
         SENSEG NAME=WDL801,PARENT=0                                            
         SENSEG NAME=WDL811,PARENT=WDL801                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W27279                                       
         END                                                                    
