*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=09,POS=S,       *        
               PROCSEQ=WDK6H                                                    
         SENSEG NAME=WDK629,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK629                                       
         SENSEG NAME=WDK601,PARENT=WDK611                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDL6,PROCOPT=GOT,KEYLEN=21,POS=S                 
         SENSEG NAME=WDL601,PARENT=0                                            
         SENSEG NAME=WDL611,PARENT=WDL601                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=25,POS=S                 
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB613,PARENT=WDB601                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W27242,CMPAT=YES                             
         END                                                                    
