*---USERDB                                                                      
         PCB    TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                 
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
*---RADIOTYP                                                                    
         PCB   TYPE=DB,DBDNAME=WL3111,PROCOPT=G,KEYLEN=40,POS=S                 
         SENSEG NAME=WL311101,PARENT=0                                          
         SENSEG NAME=WL311111,PARENT=WL311101,PROCOPT=GIR                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W30112                                       
         END                                                                    
