*                                                                               
         PCB    TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                 
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDM6E,PROCOPT=GOT,KEYLEN=15,POS=S                
         SENSEG NAME=WDM6E1,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDM6,PROCOPT=GOTP,KEYLEN=11,POS=S                
         SENSEG NAME=WDM601,PARENT=0                                            
         SENSEG NAME=WDM611,PARENT=WDM601                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD3,PROCOPT=GOT,KEYLEN=08,POS=S,       *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WDD301,PARENT=0                                            
         SENSEG NAME=WDD311,PARENT=WDD301                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=06,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR1,PROCOPT=G,KEYLEN=35,POS=S                   
         SENSEG NAME=WDR101,PARENT=0                                            
         SENSEG NAME=WDGX3158,PARENT=WDR101,PROCOPT=GIRD                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR4,PROCOPT=GOT,KEYLEN=42,POS=S                 
         SENSEG NAME=WDR401,PARENT=0                                            
         SENSEG NAME=WDGX3172,PARENT=WDR401                                     
         SENSEG NAME=WDGX3174,PARENT=WDGX3172                                   
         SENSEG NAME=WDGX3176,PARENT=WDGX3174                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W30164                                       
         END                                                                    
