*                                                                               
         PCB    TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                 
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA9,PROCOPT=GOT,KEYLEN=14,POS=S                 
         SENSEG NAME=WDA901,PARENT=0                                            
         SENSEG NAME=WDA911,PARENT=WDA901                                       
         SENSEG NAME=WDA921,PARENT=WDA911                                       
         SENSEG NAME=WDA912,PARENT=WDA901                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA9,PROCOPT=GOT,KEYLEN=14,POS=S,       *        
               PROCSEQ=WDA9B                                                    
         SENSEG NAME=WDA901,PARENT=0                                            
         SENSEG NAME=WDA911,PARENT=WDA901                                       
         SENSEG NAME=WDA921,PARENT=WDA911                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD3,PROCOPT=GOT,KEYLEN=08,POS=S,       *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WDD301,PARENT=0                                            
         SENSEG NAME=WDD311,PARENT=WDD301                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=05,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDL8,PROCOPT=GOT,KEYLEN=09,POS=S                 
         SENSEG NAME=WDL801,PARENT=0                                            
         SENSEG NAME=WDL811,PARENT=WDL801                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W30168                                       
         END                                                                    
