         PCB    TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                 
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR1,PROCOPT=G,KEYLEN=33,POS=S                   
         SENSEG NAME=WDR101,PARENT=0                                            
         SENSEG NAME=WDGX3160,PARENT=WDR101,PROCOPT=GIRD                        
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W30125                                       
         END                                                                    
