         PCB   TYPE=TP,NAME=W0T606U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*        TRANS TO DISTRIBUTION & PRINT                                          
DISTRDOC PCB   TYPE=TP,NAME=WZ0420X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB    TYPE=DB,DBDNAME=WDP7,PROCOPT=G,KEYLEN=8,POS=S                   
         SENSEG NAME=WDP701,PARENT=0,PROCOPT=GIR                                
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=6,POS=S                  
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=7,POS=S                    
         SENSEG NAME=WDK701,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDK711,PARENT=WDK701,PROCOPT=GIR                           
         SENSEG NAME=WDK712,PARENT=WDK701,PROCOPT=GI                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD3,PROCOPT=GOT,KEYLEN=8,POS=S,        *        
               PROCSEQ=WDD3B                                                    
         SENSEG  NAME=WDD301,PARENT=0                                           
         SENSEG  NAME=WDD311,PARENT=WDD301                                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR4,PROCOPT=G,KEYLEN=42,POS=S                   
         SENSEG NAME=WDR401,PARENT=0                                            
         SENSEG NAME=WDGX3172,PARENT=WDR401,PROCOPT=GR                          
         SENSEG NAME=WDGX3174,PARENT=WDGX3172,PROCOPT=GIR                       
         SENSEG NAME=WDGX3176,PARENT=WDGX3174,PROCOPT=GIRD                      
*                                                                               
*    SALDOFÖRÄNDRINGAR                                                          
         PCB     TYPE=DB,DBDNAME=WDL9,PROCOPT=G,KEYLEN=20,POS=S                 
         SENSEG  NAME=WDL901,PARENT=0,PROCOPT=GI                                
*                                                                               
*    WDR901, EKONOMITRANS                                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR9,PROCOPT=G,KEYLEN=31,POS=S                   
         SENSEG NAME=WDR901,PARENT=0,PROCOPT=GI                                 
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W30184                                       
         END                                                                    
