*  BYTES IDENTIFIERING                                                          
*                                                                               
         PCB   TYPE=TP,NAME=W3T172,MODIFY=NO                                    
*                                                                               
*        TRANS TO DISTRIBUTION & PRINT                                          
DISTRDOC PCB   TYPE=TP,NAME=WZ0420X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB    TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                 
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=8,POS=S,      *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=6,POS=S                
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
*                                                                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W30173                                       
         END                                                                    
