*                                                                               
         PCB   TYPE=TP,NAME=W3T172,MODIFY=NO                                    
*                                                                               
         PCB    TYPE=DB,DBDNAME=WDP7,PROCOPT=G,KEYLEN=8,POS=S                   
         SENSEG NAME=WDP701,PARENT=0,PROCOPT=GIR                                
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDM6,PROCOPT=G,KEYLEN=11,POS=S                   
         SENSEG NAME=WDM601,PARENT=0,PROCOPT=GR                                 
         SENSEG NAME=WDM611,PARENT=WDM601                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDM6,PROCOPT=G,KEYLEN=18,POS=S,         *        
               PROCSEQ=WDM6A                                                    
         SENSEG NAME=WDM601,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDM6,PROCOPT=G,KEYLEN=18,POS=S,         *        
               PROCSEQ=WDM6B                                                    
         SENSEG NAME=WDM601,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDM6C,PROCOPT=G,KEYLEN=18,POS=S                  
         SENSEG NAME=WDM6C1,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDM6D,PROCOPT=G,KEYLEN=18,POS=S                  
         SENSEG NAME=WDM6D1,PARENT=0                                            
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
* WDK7 ARTIKELREGISTER SDC                                                      
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=7,POS=S                    
         SENSEG NAME=WDK701,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDK711,PARENT=WDK701,PROCOPT=GI                            
         SENSEG NAME=WDK712,PARENT=WDK701,PROCOPT=GI                            
*                                                                               
* ARTIKELINFORMATION WDK6                                                       
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=6,POS=S                  
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W30171                                       
         END                                                                    
