*                                                                               
         PCB    TYPE=DB,DBDNAME=WDP7,PROCOPT=G,KEYLEN=8,POS=S                   
         SENSEG NAME=WDP701,PARENT=0,PROCOPT=GIR                                
*                                                                               
         PCB    TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=6,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
         PCB    TYPE=DB,DBDNAME=WDM6,PROCOPT=G,KEYLEN=10,POS=S                  
         SENSEG NAME=WDM601,PARENT=0,PROCOPT=GIR                                
         SENSEG NAME=WDM611,PARENT=WDM601,PROCOPT=GIR                           
*                                                                               
         PCB    TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=7,POS=S                 
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W30176                                       
         END                                                                    
