*                                                                               
*                                                                               
         PCB   TYPE=TP,NAME=W3T155,MODIFY=NO                                    
*                                                                               
         PCB    TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                 
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W30154                                       
         END                                                                    
