*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=08,POS=S                 
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA7,PROCOPT=GOT,KEYLEN=11,POS=S,       *        
               PROCSEQ=WDA7A                                                    
         SENSEG NAME=WDA701,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA7,PROCOPT=G,KEYLEN=18,POS=S                   
         SENSEG NAME=WDA701,PARENT=0,PROCOPT=GIRD                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W30123                                       
         END                                                                    
