*                                                                               
* ARTIKELSTATISTIKJUSTERINGSREGISTER - WDG2                                     
         PCB   TYPE=DB,DBDNAME=WL3131,PROCOPT=G,KEYLEN=44,POS=S                 
         SENSEG NAME=WL313101,PARENT=0,PROCOPT=GIRD                             
         SENSEG NAME=WL313111,PARENT=WL313101,PROCOPT=GIRD                      
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W30211                                       
         END                                                                    
