*          DATA SET W30203PII0 AT LEVEL 001 AS OF 89/11/01                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLFSGA,PROCOPT=G,KEYLEN=25,POS=S                 
         SENSEG NAME=WLFSGA01,PARENT=0,PROCOPT=GID                              
         SENSEG NAME=WLFSGA13,PARENT=WLFSGA01,PROCOPT=GI                        
         SENSEG NAME=WLFSGA14,PARENT=WLFSGA01,PROCOPT=GID                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLFSGA,PROCOPT=G,KEYLEN=25,POS=S                 
         SENSEG NAME=WLFSGA01,PARENT=0,PROCOPT=GD                               
         SENSEG NAME=WLFSGA14,PARENT=WLFSGA01,PROCOPT=G                         
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLFSGB,PROCOPT=GOT,KEYLEN=32,POS=S               
         SENSEG NAME=WLFSGB01,PARENT=0                                          
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W30203                                       
         END                                                                    
