*          DATA SET W30213PII0 AT LEVEL 001 AS OF 89/09/19                      
*                                                                               
*                                                                               
*        IDSKURVA                                                               
         PCB   TYPE=DB,DBDNAME=WLXXCH,PROCOPT=G,KEYLEN=45,POS=S                 
         SENSEG NAME=WLXXCH01,PARENT=0,PROCOPT=G                                
         SENSEG NAME=WLXXCH11,PARENT=WLXXCH01,PROCOPT=GIRD                      
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W30213                                       
*                                                                               
         END                                                                    
