*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR4,PROCOPT=G,KEYLEN=55,POS=S                   
         SENSEG NAME=WDR401,PARENT=0,PROCOPT=GID                                
         SENSEG NAME=WDGX3102,PARENT=WDR401,PROCOPT=GIRD                        
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W30307                                       
         END                                                                    
