*                                                                               
         PCB    TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                 
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB     TYPE=DB,DBDNAME=WLPRIB,PROCOPT=G,KEYLEN=16,POS=S               
         SENSEG  NAME=WLPRIB01,PARENT=0,PROCOPT=GI                              
         SENSEG  NAME=WLPRIB13,PARENT=WLPRIB01,PROCOPT=GIR                      
*                                                                               
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W30318                                       
         END                                                                    
