*                                                                               
*                                                                               
         PCB     TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GIR,KEYLEN=08,POS=S             
         SENSEG  NAME=WLUSEA01,PARENT=0                                         
*                                                                               
         PCB     TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=6,POS=S                
         SENSEG  NAME=WDK601,PARENT=0                                           
         SENSEG  NAME=WDK611,PARENT=WDK601                                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD3,PROCOPT=GOT,KEYLEN=8,POS=S,        *        
               PROCSEQ=WDD3B                                                    
         SENSEG  NAME=WDD301,PARENT=0                                           
         SENSEG  NAME=WDD311,PARENT=WDD301                                      
*                                                                               
         PCB     TYPE=DB,DBDNAME=WLXXCJ,PROCOPT=GOT,KEYLEN=31,POS=S             
         SENSEG  NAME=WLXXCJ01,PARENT=0                                         
         SENSEG  NAME=WLXXCJ11,PARENT=WLXXCJ01                                  
*                                                                               
         PCB     TYPE=DB,DBDNAME=WDC1,PROCOPT=GOT,KEYLEN=6,POS=S                
         SENSEG  NAME=WDC101,PARENT=0                                           
*                                                                               
         PCB     TYPE=DB,DBDNAME=WDC2,PROCOPT=GOT,KEYLEN=16,POS=S               
         SENSEG  NAME=WDC201,PARENT=0                                           
         SENSEG  NAME=WDC211,PARENT=WDC201                                      
         SENSEG  NAME=WDC212,PARENT=WDC201                                      
         SENSEG  NAME=WDC213,PARENT=WDC201                                      
*                                                                               
         PCB     TYPE=DB,DBDNAME=WDB1,PROCOPT=GOT,KEYLEN=11,POS=S               
         SENSEG  NAME=WDB101,PARENT=0                                           
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=19,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK723,PARENT=WDK711                                       
*                                                                               
*                                                                               
********** SUBMODUL W335COST**************************************              
*                                                                               
* COST-WDK6-PCB - ARTIKELINFORMATION WDK6                                       
         PCB     TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=19,POS=S               
         SENSEG  NAME=WDK601,PARENT=0                                           
         SENSEG  NAME=WDK611,PARENT=WDK601                                      
         SENSEG  NAME=WDK621,PARENT=WDK611                                      
*                                                                               
* COST-WDK7-PCB - ARTIKELINFORMATION WDK7                                       
         PCB     TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG  NAME=WDK701,PARENT=0                                           
         SENSEG  NAME=WDK711,PARENT=WDK701                                      
*                                                                               
* COST-WDF1-PCB - LEVERANTÖRSINFO WDF1                                          
         PCB     TYPE=DB,DBDNAME=WDF1,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG  NAME=WDF101,PARENT=0                                           
         SENSEG  NAME=WDF102,PARENT=WDF101                                      
*                                                                               
* COST-WDG2-PCB - VALUTAINFORMATION WDG2                                        
         PCB   TYPE=DB,DBDNAME=WDG2,PROCOPT=GOT,KEYLEN=37,POS=S                 
         SENSEG NAME=WDG201,PARENT=0                                            
         SENSEG NAME=WDGX9306,PARENT=WDG201                                     
         SENSEG NAME=WDGX9308,PARENT=WDGX9306                                   
*                                                                               
* COST-WDK72-PCB ARTIKELREGISTER DC                                             
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=20,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK724,PARENT=WDK711                                       
*                                                                               
* COST-WDB6-PCB - DC-REGISTER  WDB6                                             
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=3,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB617,PARENT=WDB601                                       
*                                                                               
         PSBGEN  LANG=COBOL,PSBNAME=W30304                                      
         END                                                                    
