* WZ01-PCB, PRISSVAR   TILL DISCREPANCY , PGM W4079800                          
CREPRICE PCB   TYPE=TP,NAME=W40798X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* WZ01-PCB, PRISSVAR   TILL PROFORMA    , PGM W4029100                          
PROFORMA PCB   TYPE=TP,NAME=W40291X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* WZ01-PCB, PRISSVAR   TILL LTDCUST     , PGM W4029000                          
LTDCUST  PCB   TYPE=TP,NAME=W40290X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB    TYPE=DB,DBDNAME=WDP7,PROCOPT=G,KEYLEN=8,POS=S                   
         SENSEG NAME=WDP701,PARENT=0,PROCOPT=GIR                                
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDC7A,PROCOPT=GOT,KEYLEN=43,POS=S                
         SENSEG NAME=WDC7A1,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDC7B,PROCOPT=GOT,KEYLEN=43,POS=S                
         SENSEG NAME=WDC7B1,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDC7,PROCOPT=GP,KEYLEN=33,POS=S                  
         SENSEG NAME=WDC701,PARENT=0                                            
         SENSEG NAME=WDC711,PARENT=WDC701,PROCOPT=GR                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W30306                                       
         END                                                                    
