*                                                                               
         PCB   TYPE=DB,DBDNAME=WDC2,PROCOPT=G,KEYLEN=3,POS=S                    
         SENSEG NAME=WDC201,PARENT=0,PROCOPT=GR                                 
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB1,PROCOPT=GOT,KEYLEN=21,POS=S,       *        
               PROCSEQ=WDB1A                                                    
         SENSEG NAME=WDB101,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W30312                                       
         END                                                                    
