*                                                                               
*  ARTIKELSTATISTIKJUSTERINGSREGISTER WDG2                                      
         PCB   TYPE=DB,DBDNAME=WL3131,PROCOPT=G,KEYLEN=44,POS=S                 
         SENSEG NAME=WL313101,PARENT=0                                          
         SENSEG NAME=WL313111,PARENT=WL313101,PROCOPT=GD                        
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W33008,CMPAT=YES                             
         END                                                                    
