*          DATA SET W33017PII0 AT LEVEL 001 AS OF 90/03/29                      
*                                                                               
*        ARTIKELBENÄMNINGSREGISTER WDD3                                         
         PCB   TYPE=DB,DBDNAME=WDD3,PROCOPT=GOT,KEYLEN=207,POS=S                
         SENSEG NAME=WDD301,PARENT=0                                            
         SENSEG NAME=WDD311,PARENT=WDD301                                       
         SENSEG NAME=WDD312,PARENT=WDD301                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W33017                                       
         END                                                                    
