*          DATA SET W33030PII0 AT LEVEL 001 AS OF 90/03/29                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLFSGA,PROCOPT=G,KEYLEN=26,POS=S                 
         SENSEG NAME=WLFSGA01,PARENT=0,PROCOPT=GRD                              
         SENSEG NAME=WLFSGA11,PARENT=WLFSGA01                                   
         SENSEG NAME=WLFSGA12,PARENT=WLFSGA01                                   
         SENSEG NAME=WLFSGA13,PARENT=WLFSGA01                                   
         SENSEG NAME=WLFSGA14,PARENT=WLFSGA01                                   
         SENSEG NAME=WLFSGA15,PARENT=WLFSGA01                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W33030,CMPAT=YES                             
         END                                                                    
