*          DATA SET W33044PII0 AT LEVEL 001 AS OF 90/02/07                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXCH,PROCOPT=GOT,KEYLEN=45,POS=S               
         SENSEG NAME=WLXXCH01,PARENT=0                                          
         SENSEG NAME=WLXXCH11,PARENT=WLXXCH01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXCI,PROCOPT=GOT,KEYLEN=39,POS=S               
         SENSEG NAME=WLXXCI01,PARENT=0                                          
         SENSEG NAME=WLXXCI11,PARENT=WLXXCI01                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W33044                                       
         END                                                                    
