*                                                                               
         PCB   TYPE=DB,DBDNAME=WDC7,PROCOPT=G,KEYLEN=33,POS=S                   
         SENSEG NAME=WDC701,PARENT=0,PROCOPT=GD                                 
         SENSEG NAME=WDC711,PARENT=WDC701,PROCOPT=GD                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W33598,CMPAT=YES,LOCKMAX=4                   
         END                                                                    
