*        PRISFRÅGA DDI                                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDC7,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDC701,PARENT=0                                            
         SENSEG NAME=WDC711,PARENT=WDC701                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDQ2C,PROCOPT=GOT,KEYLEN=17,POS=S                
         SENSEG NAME=WDQ2C1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W33590                                       
         END                                                                    
