*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD3,PROCOPT=GOT,KEYLEN=230,POS=S                
         SENSEG NAME=WDD301,PARENT=0                                            
         SENSEG NAME=WDD311,PARENT=WDD301                                       
         SENSEG NAME=WDD312,PARENT=WDD301                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=5,POS=S                  
         SENSEG NAME=WDK601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W33581                                       
         END                                                                    
