*                                                                               
         PCB   TYPE=DB,DBDNAME=WDC7,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDC701,PARENT=0                                            
         SENSEG NAME=WDC711,PARENT=WDC701                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W3359C                                       
         END                                                                    
