*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD7,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDD701,PARENT=0                                            
         SENSEG NAME=WDD702,PARENT=WDD701                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W33538                                       
         END                                                                    
