*                                                                               
         PCB   TYPE=DB,DBDNAME=WDC2,PROCOPT=G,KEYLEN=11,POS=S                   
         SENSEG NAME=WDC201,PARENT=0,PROCOPT=GD                                 
         SENSEG NAME=WDC213,PARENT=WDC201,PROCOPT=GD                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB1A,PROCOPT=GOT,KEYLEN=14,POS=S                
         SENSEG NAME=WDB1A1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W33512,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
