*                                                                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLERSA,PROCOPT=GOT,KEYLEN=08,POS=S               
         SENSEG  NAME=WLERSA01,PARENT=0                                         
         SENSEG  NAME=WLERSA11,PARENT=WLERSA01                                  
         SENSEG  NAME=WLERSA13,PARENT=WLERSA01                                  
*                                                                               
*ARTIKELREG - WDK6                                                              
         PCB     TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=6,POS=S                
         SENSEG  NAME=WDK601,PARENT=0                                           
         SENSEG  NAME=WDK611,PARENT=WDK601                                      
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W33552                                       
         END                                                                    
