*                                                                               
         PCB   TYPE=DB,DBDNAME=WLPRIB,PROCOPT=G,KEYLEN=16,POS=S                 
         SENSEG NAME=WLPRIB01,PARENT=0                                          
         SENSEG NAME=WLPRIB11,PARENT=WLPRIB01,PROCOPT=GD                        
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W33531,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
