*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB1,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDB101,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W33570                                       
         END                                                                    
