*                                                                               
         PCB   TYPE=DB,DBDNAME=WLKATN,PROCOPT=GOT,KEYLEN=11,POS=S               
         SENSEG NAME=WLKATN01,PARENT=0                                          
         SENSEG NAME=WLKATN11,PARENT=WLKATN01                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W33540                                       
         END                                                                    
