*                                                                               
         PCB   TYPE=DB,DBDNAME=WDM6E,PROCOPT=GOT,KEYLEN=15,POS=S                
         SENSEG NAME=WDM6E1,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDM6,PROCOPT=GOT,KEYLEN=10,POS=S                 
         SENSEG NAME=WDM601,PARENT=0                                            
         SENSEG NAME=WDM611,PARENT=WDM601                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=05,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
*                                                                               
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W37188                                       
         END                                                                    
