*        HSSR LÄSNING WDM6                                                      
         PCB   TYPE=DB,DBDNAME=WDM6,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDM601,PARENT=0                                            
         SENSEG NAME=WDM611,PARENT=WDM601                                       
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W37146                                       
         END                                                                    
