*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR2,PROCOPT=G,KEYLEN=41,POS=S                   
         SENSEG NAME=WDR201,PARENT=0                                            
         SENSEG NAME=WDGX3152,PARENT=WDR201,PROCOPT=GD                          
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W37192,CMPAT=YES                             
         END                                                                    
