*                                                                               
*                     *** POÄNGPARM - BYTES  ***                                
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR1,PROCOPT=GOT,KEYLEN=31,POS=S                 
         SENSEG NAME=WDR101,PARENT=0                                            
         SENSEG NAME=WDGX3156,PARENT=WDR101                                     
*                                                                               
*                     *** ARTIKELREG         ***                                
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=6,POS=S                  
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
*                     *** BENÄMNINGSREG      ***                                
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD3,PROCOPT=GOT,KEYLEN=11,POS=S,       *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WDD301,PARENT=0                                            
         SENSEG NAME=WDD311,PARENT=WDD301                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W37163                                       
         END                                                                    
