*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA7,PROCOPT=G,KEYLEN=18,POS=S                   
         SENSEG NAME=WDA701,PARENT=0,PROCOPT=GI                                 
*                                                                               
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W37168,CMPAT=YES                             
         END                                                                    
