*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXCP,PROCOPT=GOT,KEYLEN=40,POS=S               
         SENSEG NAME=WLXXCP01,PARENT=0                                          
         SENSEG NAME=WLXXCP11,PARENT=WLXXCP01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=8,POS=S,      *        
               PROCSEQ=WDD3B                                                    
         SENSEG  NAME=WLBENA01,PARENT=0                                         
         SENSEG  NAME=WLBENA11,PARENT=WLBENA01                                  
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=5,POS=S                
         SENSEG NAME=WLARTC01,PARENT=0                                          
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W37134                                       
         END                                                                    
