*                                                                               
         PCB   TYPE=DB,DBDNAME=WLBYTF,PROCOPT=G,KEYLEN=10,POS=S                 
         SENSEG NAME=WLBYTF01,PARENT=0,PROCOPT=GD                               
         SENSEG NAME=WLBYTF11,PARENT=WLBYTF01                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W37124,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
