*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR2,PROCOPT=GOT,KEYLEN=46,POS=S                 
         SENSEG NAME=WDR201,PARENT=0                                            
         SENSEG NAME=WDGX3152,PARENT=WDR201                                     
         SENSEG NAME=WDGX3154,PARENT=WDGX3152                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W37190                                       
         END                                                                    
