*                                                                               
* DISPATCHER                                                                    
         PCB   TYPE=TP,NAME=W0T693X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* KOMMUNIKATIONS DB                                                             
         PCB   TYPE=DB,DBDNAME=WLKOMA,PROCOPT=G,KEYLEN=28,POS=S                 
         SENSEG NAME=WLKOMA01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLKOMA11,PARENT=WLKOMA01,PROCOPT=GI                        
*                                                                               
*        ***   ÅTERSTARTSBAS                                                    
         PCB   TYPE=DB,DBDNAME=WLXXCU,PROCOPT=G,KEYLEN=30,POS=S                 
         SENSEG NAME=WLXXCU01,PARENT=0                                          
         SENSEG NAME=WLXXCU11,PARENT=WLXXCU01,PROCOPT=GIR                       
*                                                                               
*        ***   USER DATABASEN                                                   
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GOT,KEYLEN=8,POS=S                
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
* ARTIKELINFORMATION WDK6                                                       
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=G,KEYLEN=6,POS=S                  
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01,PROCOPT=GR                        
*                                                                               
* ARTIKELINFORMATION WDK7                                                       
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=7,POS=S                    
         SENSEG NAME=WDK701,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDK711,PARENT=WDK701,PROCOPT=GIR                           
         SENSEG NAME=WDK712,PARENT=WDK701,PROCOPT=GI                            
*                                                                               
* GODSMOTTAGARE     WDB2                                                        
         PCB     TYPE=DB,DBDNAME=WLGMTA,PROCOPT=GOT,KEYLEN=07,POS=S             
         SENSEG  NAME=WLGMTA01                                                  
*                                                                               
* BETALAREREGISTRET WDB1                                                        
         PCB     TYPE=DB,DBDNAME=WLBETC,PROCOPT=GOT,KEYLEN=11,POS=S             
         SENSEG  NAME=WLBETC01                                                  
*                                                                               
* PRISREGISTRET WDC1                                                            
         PCB     TYPE=DB,DBDNAME=WLPRIA,PROCOPT=GOT,KEYLEN=06,POS=S             
         SENSEG  NAME=WLPRIA01                                                  
*                                                                               
* PRIS RABATT REGISTER WDC2                                                     
         PCB     TYPE=DB,DBDNAME=WLPRIB,PROCOPT=GOT,KEYLEN=16,POS=S             
         SENSEG  NAME=WLPRIB01,PARENT=0                                         
         SENSEG  NAME=WLPRIB11,PARENT=WLPRIB01                                  
         SENSEG  NAME=WLPRIB12,PARENT=WLPRIB01                                  
         SENSEG  NAME=WLPRIB13,PARENT=WLPRIB01                                  
*                                                                               
* SALDOFÖRÄNDRINGAR WDL9                                                        
         PCB     TYPE=DB,DBDNAME=WLLOGA,PROCOPT=GI,KEYLEN=20,POS=S              
         SENSEG  NAME=WLLOGA01,PARENT=0                                         
*                                                                               
* DATABASE WDR8 - LAB TRANSACTIONS TO BATCH                                     
         PCB   TYPE=DB,DBDNAME=WDR8,PROCOPT=G,KEYLEN=27,POS=S                   
         SENSEG NAME=WDR801,PARENT=0,PROCOPT=GIR                                
*                                                                               
* DATABASE WDR9 - SAP-R3 TRANSACTIONS TO BATCH                                  
         PCB   TYPE=DB,DBDNAME=WDR9,PROCOPT=G,KEYLEN=31,POS=S                   
         SENSEG NAME=WDR901,PARENT=0,PROCOPT=GI                                 
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR1,PROCOPT=G,KEYLEN=30,POS=S                   
         SENSEG NAME=WDR101,PARENT=0                                            
         SENSEG NAME=WDGX4112,PARENT=WDR101,PROCOPT=GR                          
*                                                                               
* WDG2-PCB/9305-PCB                                                             
         PCB   TYPE=DB,DBDNAME=WDG2,PROCOPT=GOT,KEYLEN=37,POS=S                 
         SENSEG NAME=WDG201,PARENT=0                                            
         SENSEG NAME=WDGX9306,PARENT=WDG201                                     
         SENSEG NAME=WDGX9308,PARENT=WDGX9306                                   
*                                                                               
* BETALARREG  - WDB1 ***                                                        
         PCB   TYPE=DB,DBDNAME=WLBETC,PROCOPT=GOT,KEYLEN=11,POS=S               
         SENSEG NAME=WLBETC01,PARENT=0                                          
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W37123,CMPAT=YES                             
         END                                                                    
