*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=G,KEYLEN=30,POS=S                   
         SENSEG NAME=WDR501,PARENT=0                                            
         SENSEG NAME=WDR540,PARENT=WDR501,PROCOPT=GIR                           
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA9,PROCOPT=G,KEYLEN=11,POS=S                   
         SENSEG NAME=WDA901,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDA912,PARENT=WDA901,PROCOPT=GIR                           
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W37189,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
