*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR4,PROCOPT=GOT,KEYLEN=42,POS=S                 
         SENSEG NAME=WDR401,PARENT=0                                            
         SENSEG NAME=WDGX3172,PARENT=WDR401                                     
         SENSEG NAME=WDGX3174,PARENT=WDGX3172                                   
         SENSEG NAME=WDGX3176,PARENT=WDGX3174                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W37104                                       
         END                                                                    
