*                                                                               
         PCB   TYPE=DB,DBDNAME=WLBYTF,PROCOPT=G,KEYLEN=10,POS=S                 
         SENSEG NAME=WLBYTF01,PARENT=0,PROCOPT=GR                               
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W37159,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
