*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXCQ,PROCOPT=G,KEYLEN=30,POS=S                 
         SENSEG NAME=WLXXCQ01,PARENT=0                                          
         SENSEG NAME=WLXXCQ11,PARENT=WLXXCQ01,PROCOPT=GIR                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLBYTF,PROCOPT=G,KEYLEN=10,POS=S                 
         SENSEG NAME=WLBYTF01,PARENT=0,PROCOPT=GIR                              
         SENSEG NAME=WLBYTF11,PARENT=WLBYTF01,PROCOPT=GI                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=6,POS=S                
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W37116,CMPAT=YES                             
         END                                                                    
