*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR2,PROCOPT=G,KEYLEN=42,POS=S                   
         SENSEG NAME=WDR201,PARENT=0                                            
         SENSEG NAME=WDGX3148,PARENT=WDR201,PROCOPT=GD                          
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W37155,CMPAT=YES                             
         END                                                                    
