*                                                                               
*                     *** POÄNGPARM - BYTES  ***                                
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR1,PROCOPT=GOT,KEYLEN=31,POS=S                 
         SENSEG NAME=WDR101,PARENT=0                                            
         SENSEG NAME=WDGX3156,PARENT=WDR101                                     
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W37162                                       
         END                                                                    
