*                                                                               
         PCB   TYPE=DB,DBDNAME=WL3171,PROCOPT=G,KEYLEN=42,POS=S                 
         SENSEG NAME=WL317101,PARENT=0                                          
         SENSEG NAME=WL317111,PARENT=WL317101,PROCOPT=GIRD                      
         SENSEG NAME=WL317121,PARENT=WL317111,PROCOPT=GIRD                      
         SENSEG NAME=WL317131,PARENT=WL317121,PROCOPT=GIRD                      
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W37179,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
