*                                                                               
* PRIS-ARTC-PCB - ARTIKELINFORMATION  WDK6                                      
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=06,POS=S               
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
*                                                                               
* PRIS-ARTS-PCB - LAGERINFORMATION  WDK7                                        
         PCB   TYPE=DB,DBDNAME=WLARTS,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG NAME=WLARTS01,PARENT=0                                          
         SENSEG NAME=WLARTS11,PARENT=WLARTS01                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W37149                                       
         END                                                                    
