*                                                                               
         PCB   TYPE=DB,DBDNAME=WLBYTF,PROCOPT=G,KEYLEN=7,POS=S                  
         SENSEG NAME=WLBYTF01,PARENT=0,PROCOPT=GRD                              
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W37137,CMPAT=YES,LOCKMAX=5                   
         END                                                                    
