         PCB   TYPE=DB,DBDNAME=WDR1,PROCOPT=G,KEYLEN=35,POS=S                   
         SENSEG NAME=WDR101,PARENT=0                                            
         SENSEG NAME=WDGX3158,PARENT=WDR101,PROCOPT=GIR                         
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W37144,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
