*                                                                               
         PCB   TYPE=DB,DBDNAME=WDM6,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDM601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W37140                                       
         END                                                                    
*********************************************                                   
