*                                                                               
         PCB   TYPE=DB,DBDNAME=WDM6,PROCOPT=GOT,KEYLEN=21,POS=S,       *        
               PROCSEQ=WDM6A                                                    
         SENSEG NAME=WDM601,PARENT=0                                            
         SENSEG NAME=WDM611,PARENT=WDM601                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W37122                                       
         END                                                                    
