*                                                                               
*                     *** STYRREGISTER KUND - BYTES    ***                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR1,PROCOPT=GOT,KEYLEN=35,POS=S                 
         SENSEG NAME=WDR101,PARENT=0                                            
         SENSEG NAME=WDGX3158,PARENT=WDR101                                     
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W37121                                       
         END                                                                    
