         PCB   TYPE=DB,DBDNAME=WDA7,PROCOPT=GOT,KEYLEN=18,POS=S                 
         SENSEG NAME=WDA701,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W37114                                       
         END                                                                    
