*                                                                               
         PCB   TYPE=TP,NAME=W0T606U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=8,POS=S,      *        
               PROCSEQ=WDD3B                                                    
         SENSEG  NAME=WLBENA01,PARENT=0                                         
         SENSEG  NAME=WLBENA11,PARENT=WLBENA01                                  
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXLD,PROCOPT=G,KEYLEN=31,POS=S                 
         SENSEG NAME=WLXXLD01,PARENT=0                                          
         SENSEG NAME=WLXXLD11,PARENT=WLXXLD01,PROCOPT=GR                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTS,PROCOPT=G,KEYLEN=7,POS=S                  
         SENSEG NAME=WLARTS01,PARENT=0                                          
         SENSEG NAME=WLARTS11,PARENT=WLARTS01,PROCOPT=GR                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WL3165,PROCOPT=G,KEYLEN=43,POS=S                 
         SENSEG NAME=WL316501,PARENT=0                                          
         SENSEG NAME=WL316511,PARENT=WL316501,PROCOPT=GIR                       
         SENSEG NAME=WL316521,PARENT=WL316511,PROCOPT=GIRD                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLLOGA,PROCOPT=G,KEYLEN=20,POS=S                 
         SENSEG NAME=WLLOGA01,PARENT=0,PROCOPT=GI                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=6,POS=S                
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
*                                                                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
                                                                                
         PSBGEN LANG=COBOL,PSBNAME=W3W183                                       
         END                                                                    
