*                                                                               
         PCB   TYPE=TP,NAME=W0T606U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=G,KEYLEN=6,POS=S                  
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01,PROCOPT=GR                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=7,POS=S                    
         SENSEG NAME=WDK701,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDK711,PARENT=WDK701,PROCOPT=GIR                           
         SENSEG NAME=WDK712,PARENT=WDK701,PROCOPT=GI                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=8,POS=S,      *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WL3171,PROCOPT=G,KEYLEN=42,POS=S                 
         SENSEG NAME=WL317101,PARENT=0                                          
         SENSEG NAME=WL317111,PARENT=WL317101,PROCOPT=GIRD                      
         SENSEG NAME=WL317121,PARENT=WL317111,PROCOPT=GIRD                      
         SENSEG NAME=WL317131,PARENT=WL317121,PROCOPT=GIRD                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXLD,PROCOPT=G,KEYLEN=31,POS=S                 
         SENSEG NAME=WLXXLD01,PARENT=0                                          
         SENSEG NAME=WLXXLD11,PARENT=WLXXLD01,PROCOPT=GR                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLLOGA,PROCOPT=G,KEYLEN=20,POS=S                 
         SENSEG NAME=WLLOGA01,PARENT=0,PROCOPT=GI                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WL3169,PROCOPT=G,KEYLEN=32,POS=S                 
         SENSEG NAME=WL316901,PARENT=0                                          
         SENSEG NAME=WL316911,PARENT=WL316901,PROCOPT=GIRD                      
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
        PSBGEN LANG=COBOL,PSBNAME=W3W182                                        
        END                                                                     
