*                                                                               
*        W6H6 LAGERKONTROLL                                                     
         PCB   TYPE=DB,DBDNAME=W6KVAB,KEYLEN=22,POS=S                           
         SENSEG NAME=W6KVAB01,PARENT=0,PROCOPT=G                                
         SENSEG NAME=W6KVAB11,PARENT=W6KVAB01,PROCOPT=GIRD                      
*                                                                               
*        WDR1 KVALITET FELKOD  IDHTYP=4821                                      
         PCB   TYPE=DB,DBDNAME=WLXXJY,KEYLEN=35,POS=S,PROCOPT=GOT               
         SENSEG NAME=WLXXJY01,PARENT=0                                          
         SENSEG NAME=WLXXJY11,PARENT=WLXXJY01                                   
*                                                                               
*        W6H5 LAGERINDELNING                                                    
         PCB  TYPE=DB,DBDNAME=W6KVAA,KEYLEN=15,PROCOPT=GOT,POS=S                
         SENSEG NAME=W6KVAA01,PARENT=0                                          
*                                                                               
*        ARTIKELREGISTRET                                                       
         PCB  TYPE=DB,DBDNAME=WLARTC,KEYLEN=6,PROCOPT=GOT,POS=S                 
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GOT,KEYLEN=8,POS=S                
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40123                                       
         END                                                                    
