*                                                                               
*        WDR1 FELKOD KONTROLLRAPPORT IDHTYP 4825/4826                           
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXLA,PROCOPT=G,KEYLEN=40,POS=S                 
         SENSEG NAME=WLXXLA01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLXXLA11,PARENT=WLXXLA01,PROCOPT=GIRD                      
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40116                                       
         END                                                                    
