*          DATA SET W40115PII0 AT LEVEL 001 AS OF 90/06/06                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXJY,KEYLEN=35,POS=S                           
         SENSEG NAME=WLXXJY01,PARENT=0,PROCOPT=G                                
         SENSEG NAME=WLXXJY11,PARENT=WLXXJY01,PROCOPT=GIRD                      
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40115                                       
         END                                                                    
