*          DATA SET W40102PII0 AT LEVEL 007 AS OF 87/08/25                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
*********BENÄMNINGSREG WDD3                                                     
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=8,POS=S,      *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
*********ARTIKELREG WDK6                                                        
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=19,POS=S               
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
         SENSEG NAME=WLARTC21,PARENT=WLARTC11                                   
*                                                                               
*********ARTIKELREG WDK7                                                        
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
*                                                                               
*********LEVERANTÖRSREG WDD9                                                    
         PCB   TYPE=DB,DBDNAME=WLINLB,PROCOPT=GOT,KEYLEN=12,POS=S               
         SENSEG NAME=WLINLB01,PARENT=0                                          
         SENSEG NAME=WLINLB11,PARENT=WLINLB01                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40102                                       
         END                                                                    
