*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
*********ERSÄTTNINGSREG WDD7                                                    
         PCB   TYPE=DB,DBDNAME=WLERSA,PROCOPT=GOT,KEYLEN=10,POS=S               
         SENSEG NAME=WLERSA01,PARENT=0                                          
         SENSEG NAME=WLERSA11,PARENT=WLERSA01                                   
*                                                                               
*********ARTIKELREGISTER WDK6                                                   
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=6,POS=S                
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
*                                                                               
*********ARTIKELREGISTER WDK7                                                   
         PCB   TYPE=DB,DBDNAME=WLARTS,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG NAME=WLARTS01,PARENT=0                                          
         SENSEG NAME=WLARTS11,PARENT=WLARTS01                                   
*                                                                               
*********BENÄMNINGSREG WDD3                                                     
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=11,POS=S,     *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
*********ARTREG-ORDER ENTRY WDK9                                                
         PCB   TYPE=DB,DBDNAME=WLARTM,PROCOPT=GOT,KEYLEN=5,POS=S                
         SENSEG NAME=WLARTM01,PARENT=0                                          
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40103                                       
         END                                                                    
