*                                                                               
*        TRANS TILL PGM W40695    FÖR DIREKT LEVERANSORDER                      
         PCB   TYPE=TP,NAME=W4T695X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GOT,KEYLEN=8,POS=S                
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
*        ORDERHUVUD DIREKTNYCKEL                                                
*        ORDERKÖN     ORDERDELAR                                                
         PCB   TYPE=DB,DBDNAME=WLORQA,PROCOPT=GOT,KEYLEN=12,POS=S               
         SENSEG NAME=WLORQA01,PARENT=0                                          
*                                                                               
*        ORDERKÖN     ORDERHUVUD                                                
         PCB   TYPE=DB,DBDNAME=WDQ2,PROCOPT=G,KEYLEN=11,POS=S                   
         SENSEG NAME=WDQ201,PARENT=0,PROCOPT=GRP                                
         SENSEG NAME=WDQ211,PARENT=WDQ201                                       
         SENSEG NAME=WDQ212,PARENT=WDQ201,PROCOPT=GR                            
         SENSEG NAME=WDQ221,PARENT=WDQ212                                       
*                                                                               
*        ORDERKÖN     ORDERHUVUD  SEKUNDÄR INDEX                                
         PCB   TYPE=DB,DBDNAME=WLORQK,PROCOPT=GOT,KEYLEN=22,POS=S               
         SENSEG NAME=WLORQK01,PARENT=0                                          
*                                                                               
*        ORDERKÖN     ORDERHUVUD  VIA SEKUNDÄR INDEX                            
         PCB   TYPE=DB,DBDNAME=WDQ2,PROCOPT=GOTP,KEYLEN=19,POS=S,      *        
               PROCSEQ=WDQ2C                                                    
         SENSEG NAME=WDQ201,PARENT=0                                            
         SENSEG NAME=WDQ212,PARENT=WDQ201                                       
*                                                                               
*        KUNDREG    WDB2                                                        
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
*        BETALARREG WDB1                                                        
         PCB   TYPE=DB,DBDNAME=WDB1,PROCOPT=GOT,KEYLEN=11,POS=S                 
         SENSEG NAME=WDB101,PARENT=0                                            
*                                                                               
* WDG2-PCB/9305-PCB  - W510CURR                                                 
         PCB   TYPE=DB,DBDNAME=WDG2,PROCOPT=GOT,KEYLEN=37,POS=S                 
         SENSEG NAME=WDG201,PARENT=0                                            
         SENSEG NAME=WDGX9306,PARENT=WDG201                                     
         SENSEG NAME=WDGX9308,PARENT=WDGX9306                                   
*                                                                               
*   PSB  FÖR  SUBMODUL W413AVSO                                                 
*                                                                               
*        ORDERDEL   WDE6                                                        
         PCB   TYPE=DB,DBDNAME=WDE6,PROCOPT=G,KEYLEN=4,POS=S                    
         SENSEG NAME=WDE601,PARENT=0,PROCOPT=GR                                 
*                                                                               
*        ORDERDEL   WDQ3                                                        
         PCB   TYPE=DB,DBDNAME=WLORQA,PROCOPT=G,KEYLEN=12,POS=S                 
         SENSEG NAME=WLORQA01,PARENT=0,PROCOPT=GIRD                             
*                                                                               
*        ORDERHUVUD WDQ2                                                        
         PCB   TYPE=DB,DBDNAME=WDQ2,PROCOPT=G,KEYLEN=11,POS=S                   
         SENSEG NAME=WDQ201,PARENT=0                                            
         SENSEG NAME=WDQ211,PARENT=WDQ201                                       
         SENSEG NAME=WDQ212,PARENT=WDQ201,PROCOPT=GR                            
         SENSEG NAME=WDQ221,PARENT=WDQ212,PROCOPT=GRD                           
*                                                                               
*        KUNDREG    WDB3                                                        
         PCB   TYPE=DB,DBDNAME=WDB3,PROCOPT=GOT,KEYLEN=9,POS=S                  
         SENSEG NAME=WDB301,PARENT=0                                            
*                                                                               
*        TRPTABELL  WDR1                                                        
         PCB   TYPE=DB,DBDNAME=WLXXKA,PROCOPT=GOT,KEYLEN=35,POS=S               
         SENSEG NAME=WLXXKA01,PARENT=0                                          
         SENSEG NAME=WLXXKA11,PARENT=WLXXKA01                                   
*                                                                               
*        ARBTIDTAB  WDR1                                                        
         PCB   TYPE=DB,DBDNAME=WL4437,PROCOPT=GOT,KEYLEN=38,POS=S               
         SENSEG NAME=WL443701,PARENT=0                                          
         SENSEG NAME=WL443711,PARENT=WL443701                                   
*                                                                               
*        HLOTABELL  WDR1                                                        
         PCB   TYPE=DB,DBDNAME=WLXXKE,PROCOPT=GOT,KEYLEN=40,POS=S               
         SENSEG NAME=WLXXKE01,PARENT=0                                          
         SENSEG NAME=WLXXKE11,PARENT=WLXXKE01                                   
*                                                                               
*        PKLTABELL  WDR1                                                        
         PCB   TYPE=DB,DBDNAME=WLXXKF,PROCOPT=GOT,KEYLEN=35,POS=S               
         SENSEG NAME=WLXXKF01,PARENT=0                                          
         SENSEG NAME=WLXXKF11,PARENT=WLXXKF01                                   
*                                                                               
*        PRCSTYRTAB WDR1                                                        
         PCB   TYPE=DB,DBDNAME=WLXXKG,PROCOPT=GOT,KEYLEN=35,POS=S               
         SENSEG NAME=WLXXKG01,PARENT=0                                          
         SENSEG NAME=WLXXKG11,PARENT=WLXXKG01                                   
*                                                                               
*        PRCTABELL  WDR1                                                        
         PCB   TYPE=DB,DBDNAME=WLXXKH,PROCOPT=GOT,KEYLEN=35,POS=S               
         SENSEG NAME=WLXXKH01,PARENT=0                                          
         SENSEG NAME=WLXXKH11,PARENT=WLXXKH01                                   
*                                                                               
*        PTIDTABELL WDR1                                                        
         PCB   TYPE=DB,DBDNAME=WLXXKI,PROCOPT=GOT,KEYLEN=31,POS=S               
         SENSEG NAME=WLXXKI01,PARENT=0                                          
         SENSEG NAME=WLXXKI11,PARENT=WLXXKI01                                   
*                                                                               
*        PRODNUMMER WDR1                                                        
         PCB   TYPE=DB,DBDNAME=WLXXKP,PROCOPT=G,KEYLEN=35,POS=S                 
         SENSEG NAME=WLXXKP01,PARENT=0                                          
         SENSEG NAME=WLXXKP11,PARENT=WLXXKP01,PROCOPT=GR                        
*                                                                               
* WDB2-PCB - KUNDREGISTER GODSMOTTAGARE WDB2                                    
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
* WDB6-PCB - DC-REGISTER WDB6                                                   
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
* TRAN-XXKB-PCB - TRANSPORTAVGÅNGAR  WDR1  IDHTYP=4433, 4434                    
*                                          WDR130                               
         PCB   TYPE=DB,DBDNAME=WLXXKB,PROCOPT=GOT,KEYLEN=40,POS=S               
         SENSEG NAME=WLXXKB01,PARENT=0                                          
         SENSEG NAME=WLXXKB11,PARENT=WLXXKB01                                   
*                                                                               
* ORDN-ORQL-PCB - ORDERHUVUD WDQ2C                                              
         PCB   TYPE=DB,DBDNAME=WLORQL,PROCOPT=GOT,KEYLEN=17,POS=S               
         SENSEG NAME=WLORQL01,PARENT=0                                          
*                                                                               
* ORDN-PROC-PCB - PROFORMA ORDERHUVUD WDE8                                      
         PCB   TYPE=DB,DBDNAME=WLPROC,PROCOPT=GOT,KEYLEN=17,POS=S               
         SENSEG NAME=WLPROC01,PARENT=0                                          
*                                                                               
* ORDN-ORQI-PCB - ORDERHUVUD WDQ2                                               
         PCB   TYPE=DB,DBDNAME=WLORQI,PROCOPT=GOT,KEYLEN=04,POS=S               
         SENSEG NAME=WLORQI01,PARENT=0                                          
*                                                                               
* ORDN-WDQ3-PCB - ORDERDELAR KÖ                                                 
         PCB   TYPE=DB,DBDNAME=WDQ3D,PROCOPT=GOT,KEYLEN=12,POS=S                
         SENSEG NAME=WDQ3D1,PARENT=0                                            
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40205                                       
         END                                                                    
