*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
* ORDM-PCB - HISTORIKREGISTER  WDL1                                             
         PCB   TYPE=DB,DBDNAME=WLORDM,PROCOPT=GOT,KEYLEN=27,POS=S               
         SENSEG NAME=WLORDM01,PARENT=0                                          
         SENSEG NAME=WLORDM12,PARENT=WLORDM01                                   
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40284                                       
         END                                                                    
