*                                                                               
******** TRANS TILL PGM W4029600 PRISOMRÄKNING                                  
*                                                                               
         PCB   TYPE=TP,NAME=W4T296X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
******** HUVUDMODUL  W4026400 ÄNDRING/BORTTAG PROFORMA-ORDERHUVUD               
*                                                                               
* PROC-PCB - PROFORMA-ORDERHUVUDSREGISTER      WDE8                             
         PCB   TYPE=DB,DBDNAME=WLPROC,PROCOPT=G,KEYLEN=17,POS=S                 
         SENSEG NAME=WLPROC01,PARENT=0,PROCOPT=GR                               
*                                                                               
******** SUBMODUL    W411OHLK  LOGISKA KONTROLLER   ********                    
*                                                                               
* KAMPANJREGISTER WDM2                                                          
         PCB    TYPE=DB,DBDNAME=WDM2,PROCOPT=GOT,KEYLEN=6,POS=S                 
         SENSEG NAME=WDM201,PARENT=0                                            
*                                                                               
* OHLK-XXKP-PCB - AUTOMATISKA ORDERNUMMER WDR1  IDHTYP=4525                     
         PCB   TYPE=DB,DBDNAME=WLXXKP,PROCOPT=G,KEYLEN=35,POS=S                 
         SENSEG NAME=WLXXKP01,PARENT=0                                          
         SENSEG NAME=WLXXKP11,PARENT=WLXXKP01,PROCOPT=GR                        
*                                                                               
******** SUBMODUL    W411KREG  LÄSNING KUNDREGISTER ********                    
*                                                                               
* KREG-GMTA-PCB - KUNDREGISTRET  WDB2                                           
         PCB   TYPE=DB,DBDNAME=WLGMTA,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG NAME=WLGMTA01,PARENT=0                                          
*                                                                               
* KREG-GMTB-PCB - DC-REGISTRET  WDB3                                            
         PCB   TYPE=DB,DBDNAME=WLGMTB,PROCOPT=GOT,KEYLEN=9,POS=S                
         SENSEG NAME=WLGMTB01,PARENT=0                                          
*                                                                               
* KREG-GMTC-PCB - FRAKTKOD-REGISTRET  WDB5                                      
         PCB   TYPE=DB,DBDNAME=WLGMTC,PROCOPT=GOT,KEYLEN=11,POS=S               
         SENSEG NAME=WLGMTC01,PARENT=0                                          
*                                                                               
* KREG-BETC-PCB - BETALARE-REGISTER WDB1                                        
         PCB   TYPE=DB,DBDNAME=WLBETC,PROCOPT=GOT,KEYLEN=11,POS=S               
         SENSEG NAME=WLBETC01,PARENT=0                                          
*                                                                               
* OHLK-SAPC-PCB - KONTROLLREGISTER KONTERINGAR WDH3                             
         PCB   TYPE=DB,DBDNAME=WLSAPC,PROCOPT=GOT,KEYLEN=17,POS=S               
         SENSEG NAME=WLSAPC01,PARENT=0                                          
*                                                                               
* OHLK-WDB6-PCB - DC-REGISTER  WDB6                                             
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40264                                       
         END                                                                    
