*                                                                               
*        PCB FÖR PRINTERN                                                       
         PCB   TYPE=TP,LTERM=,ALTRESP=NO,SAMETRM=NO,                   *        
               MODIFY=YES,EXPRESS=NO                                            
*                                                                               
*        ORDERBEKRÄFTELSER DIREKTNYCKEL                                         
         PCB   TYPE=DB,DBDNAME=WLORQM,PROCOPT=GOT,KEYLEN=17,POS=S               
         SENSEG NAME=WLORQM01,PARENT=0                                          
*                                                                               
*        ORDERHUVUD DIREKTNYCKEL                                                
         PCB   TYPE=DB,DBDNAME=WLORQI,PROCOPT=GOT,KEYLEN=6,POS=S                
         SENSEG NAME=WLORQI01,PARENT=0                                          
         SENSEG NAME=WLORQI12,PARENT=WLORQI01                                   
*                                                                               
*        ARTIKELBENÄMNING VIA SEK.NYCKEL                                        
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=8,POS=S,      *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
*        FRAKTTEXT               WDGX HTYP=4732                                 
         PCB   TYPE=DB,DBDNAME=WL4732,PROCOPT=GOT,KEYLEN=31,POS=S               
         SENSEG NAME=WL473201,PARENT=0                                          
         SENSEG NAME=WL473211,PARENT=WL473201                                   
*                                                                               
*        SATSREGISTER                                                           
         PCB   TYPE=DB,DBDNAME=WLSATB,PROCOPT=GOTP,KEYLEN=45,POS=S,    *        
               PROCSEQ=WDJ1C                                                    
         SENSEG NAME=WLSATB11,PARENT=0                                          
         SENSEG NAME=WLSATB01,PARENT=WLSATB11                                   
*                                                                               
*        PROFORMAHUVUD DIREKTNYCKEL     WDE8                                    
         PCB   TYPE=DB,DBDNAME=WLPROC,PROCOPT=GOT,KEYLEN=17,POS=S               
         SENSEG NAME=WLPROC01,PARENT=0                                          
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40294                                       
         END                                                                    
