*                                                                               
******* HUVUDMODUL  W4020300 *********************                              
*                                                                               
* AVSR-ALT-PCB                                                                  
         PCB   TYPE=TP,NAME=,ALTRESP=NO,SAMETRM=NO,                    *        
               MODIFY=YES,EXPRESS=NO                                            
* 4202-MSG-PCB - OM-START AV 4202                                               
         PCB   TYPE=TP,NAME=W4T202U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* 4203-MSG-PCB - OM-START AV 4203                                               
         PCB   TYPE=TP,NAME=W4T203V,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* 4244-MSG-PCB - OM-START AV 4244                                               
         PCB   TYPE=TP,NAME=W4T244U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* 4298-MSG-PCB - START AV 4298-ORDERAVSLUT                                      
         PCB   TYPE=TP,NAME=W4T298X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* ALT-PCB TRANS TILL PGM W2010900                                               
         PCB   TYPE=TP,NAME=W2T109X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*        TRANS TILL PGM W20191    FÖR LARM VOR                                  
         PCB   TYPE=TP,NAME=W2T191X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* ALT-PCB TRANS TILL PGM W3039100                                               
PRQRY    PCB   TYPE=TP,NAME=W30391X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* USEA-PCB                                                                      
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GOT,KEYLEN=8,POS=S                
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
* SATB-PCB - SATSSTRUKTUWREGISTER  WDJ1                                         
         PCB   TYPE=DB,DBDNAME=WLSATB,PROCOPT=GOTP,KEYLEN=45,POS=S,    *        
               PROCSEQ=WDJ1C                                                    
         SENSEG NAME=WLSATB11,PARENT=0                                          
         SENSEG NAME=WLSATB01,PARENT=WLSATB11                                   
*                                                                               
* ARTM-PCB - ARTIKELREGISTER ORDER ENTRY   WDK9                                 
         PCB   TYPE=DB,DBDNAME=WDK9,PROCOPT=G,KEYLEN=05,POS=S                   
         SENSEG NAME=WDK901,PARENT=0,PROCOPT=GR                                 
*                                                                               
* WDK7-PCB - ARTIKELREGISTER WDK7                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=08,POS=S                   
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701,PROCOPT=GR                            
         SENSEG NAME=WDK722,PARENT=WDK711                                       
         SENSEG NAME=WDK712,PARENT=WDK701                                       
*                                                                               
* BENA-PCB - BENÄMNINGSREGISTER WDD3                                            
         PCB   TYPE=DB,DBDNAME=WDD3,PROCOPT=GOT,KEYLEN=8,POS=S,        *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WDD301,PARENT=0                                            
         SENSEG NAME=WDD311,PARENT=WDD301                                       
*                                                                               
* ORQF-PCB - ORDERRADSREGISTER KÖ  WDQ4                                         
         PCB   TYPE=DB,DBDNAME=WDQ4,PROCOPT=G,KEYLEN=20,POS=S                   
         SENSEG NAME=WDQ401,PARENT=0,PROCOPT=GI                                 
*                                                                               
* ORQI-PCB - ORDERHUVUDSREGISTER KÖ SEQ. INDEX WDQ2C                            
         PCB   TYPE=DB,DBDNAME=WLORQI,PROCOPT=GOT,KEYLEN=21,POS=S,     *        
               PROCSEQ=WDQ2C                                                    
         SENSEG NAME=WLORQI01,PARENT=0                                          
         SENSEG NAME=WLORQI12,PARENT=WLORQI01                                   
*                                                                               
* ORQM-PCB - ORDERBEKRÄFTELSEREGISTER WDQ1                                      
         PCB   TYPE=DB,DBDNAME=WLORQM,PROCOPT=G,KEYLEN=17,POS=S                 
         SENSEG NAME=WLORQM01,PARENT=0,PROCOPT=GIRD                             
*                                                                               
* 4541-PCB - VOR-KÖN  WDR4  HTYP=4541                                           
         PCB   TYPE=DB,DBDNAME=WDR4,PROCOPT=G,KEYLEN=46,POS=S                   
         SENSEG NAME=WDR401,PARENT=0                                            
         SENSEG NAME=WDGX4542,PARENT=WDR401,PROCOPT=GI                          
*                                                                               
* ARTC-PCB - ARTIKELINFORMATION  WDK6                                           
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=06,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
*                                                                               
******** SUBMODUL   W411AREG  LÄSNING ARTIKELREGISTER ********                  
*                                                                               
* AREG-WDK6-PCB - ARTIKELINFORMATION  WDK6                                      
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=06,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
* AREG-WDK7-PCB - ARTIKELINFORMATION  WDK7                                      
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=08,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK722,PARENT=WDK711                                       
*                                                                               
******** SUBMODUL    W411TPO2  KONTROLL TPO2 ********                           
*                                                                               
* TPO2-ORDP-PCB - ORDERRADSREGISTER   WDA5                                      
         PCB   TYPE=DB,DBDNAME=WLORDP,PROCOPT=G,KEYLEN=24,POS=S                 
         SENSEG NAME=WLORDP01,PARENT=0,PROCOPT=GI                               
*                                                                               
* TPO2-XXBU-PCB - LARMKÖ   WDR5  IDHTYP=2223                                    
         PCB   TYPE=DB,DBDNAME=WLXXBU,PROCOPT=G,KEYLEN=40,POS=S                 
         SENSEG NAME=WLXXBU01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLXXBU11,PARENT=WLXXBU01,PROCOPT=GI                        
*                                                                               
* TPO2-XXBV-PCB - TIDSBEKRÄFTELSE TPO  WDR2  IDHTYP=2225                        
         PCB   TYPE=DB,DBDNAME=WLXXBV,PROCOPT=GOT,KEYLEN=31,POS=S               
         SENSEG NAME=WLXXBV01,PARENT=0                                          
         SENSEG NAME=WLXXBV11,PARENT=WLXXBV01                                   
*                                                                               
* TPO2-ARTM-PCB - ARTIKELREGISTER ORDER ENTRY   WDK9                            
         PCB   TYPE=DB,DBDNAME=WLARTM,PROCOPT=G,KEYLEN=11,POS=S                 
         SENSEG NAME=WLARTM01,PARENT=0,PROCOPT=GR                               
         SENSEG NAME=WLARTM11,PARENT=WLARTM01,PROCOPT=GR                        
*                                                                               
* TPO2-FILA-PCB - RECORD TILL KONTR.LISTAN & SEKV.FILER  WDG6                   
         PCB   TYPE=DB,DBDNAME=WLFILA,PROCOPT=G,KEYLEN=27,POS=S                 
         SENSEG NAME=WLFILA01,PARENT=0,PROCOPT=GI                               
*                                                                               
* TPO2-XXBX-PCB - ÖVERSÄTTNING ANSK-LARM  WDR2  IDHTYP=2231                     
         PCB   TYPE=DB,DBDNAME=WLXXBX,PROCOPT=GOT,KEYLEN=35,POS=S               
         SENSEG NAME=WLXXBX01,PARENT=0                                          
         SENSEG NAME=WLXXBX11,PARENT=WLXXBX01                                   
*                                                                               
******** SUBMODUL    W411TPO6  KONTROLL TPO6 ********                           
*                                                                               
* TPO6-ORDP-PCB - ORDERRADSREGISTER   WDA5                                      
         PCB   TYPE=DB,DBDNAME=WLORDP,PROCOPT=G,KEYLEN=24,POS=S                 
         SENSEG NAME=WLORDP01,PARENT=0,PROCOPT=GI                               
*                                                                               
* TPO6-XXBU-PCB - LARMKÖ   WDR5  IDHTYP=2223                                    
         PCB   TYPE=DB,DBDNAME=WLXXBU,PROCOPT=G,KEYLEN=40,POS=S                 
         SENSEG NAME=WLXXBU01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLXXBU11,PARENT=WLXXBU01,PROCOPT=GI                        
*                                                                               
* TPO6-XXBV-PCB - TIDSBEKRÄFTELSE TPO  WDR2  IDHTYP=2225                        
         PCB   TYPE=DB,DBDNAME=WLXXBV,PROCOPT=GOT,KEYLEN=31,POS=S               
         SENSEG NAME=WLXXBV01,PARENT=0                                          
         SENSEG NAME=WLXXBV11,PARENT=WLXXBV01                                   
*                                                                               
* TPO6-XXBX-PCB - ÖVERSÄTTNING ANSK-LARM  WDR2  IDHTYP=2231                     
         PCB   TYPE=DB,DBDNAME=WLXXBX,PROCOPT=GOT,KEYLEN=35,POS=S               
         SENSEG NAME=WLXXBX01,PARENT=0                                          
         SENSEG NAME=WLXXBX11,PARENT=WLXXBX01                                   
*                                                                               
* TPO6-ARTS-PCB - ARTIKELREGISTER WDK7                                          
         PCB   TYPE=DB,DBDNAME=WLARTS,PROCOPT=GOT,KEYLEN=07,POS=S               
         SENSEG NAME=WLARTS01,PARENT=0                                          
         SENSEG NAME=WLARTS11,PARENT=WLARTS01                                   
*                                                                               
******** SUBMODUL    W411TIME  BERÄKNING TRANSPORTAVG. TID ******               
*                                                                               
* TIME-4437-PCB - ARBETSTIDS-KALENDER   WDR1  IDHTYP=4437                       
         PCB   TYPE=DB,DBDNAME=WL4437,PROCOPT=GOT,KEYLEN=38,POS=S               
         SENSEG NAME=WL443701,PARENT=0                                          
         SENSEG NAME=WL443711,PARENT=WL443701                                   
*                                                                               
*                                                                               
******** SUBMODUL    W413AVSR  WOPS RADBEHANDLING ********                      
*                                                                               
* AVSR-ORQI-PCB - ORDERHUVUD WDQ2                                               
         PCB    TYPE=DB,DBDNAME=WLORQI,PROCOPT=G,KEYLEN=11,POS=S                
         SENSEG NAME=WLORQI01,PARENT=0                                          
         SENSEG NAME=WLORQI11,PARENT=WLORQI01,PROCOPT=GIRD                      
         SENSEG NAME=WLORQI12,PARENT=WLORQI01,PROCOPT=GIR                       
         SENSEG NAME=WLORQI21,PARENT=WLORQI12,PROCOPT=GIRD                      
*                                                                               
* AVSR-GMTB-PCB - DC-REGISTER WDB3                                              
         PCB    TYPE=DB,DBDNAME=WLGMTB,PROCOPT=GOT,KEYLEN=9,POS=S               
         SENSEG NAME=WLGMTB01,PARENT=0                                          
*                                                                               
* AVSR-GMTC-PCB - FK-REGISTER WDB5                                              
         PCB    TYPE=DB,DBDNAME=WLGMTC,PROCOPT=GOT,KEYLEN=11,POS=S              
         SENSEG NAME=WLGMTC01,PARENT=0                                          
*                                                                               
* AVSR-WDB2-PCB                                                                 
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
* AVSR-WDB6-PCB - DC-REGISTER  WDB6                                             
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
******** SUBMODUL    W411TRAN  BERÄKNING TRANSPORTAVG. TID ********             
*                                                                               
* TRAN-XXKB-PCB - TRANSPORTAVGÅNGAR WDR1 IDHTYP=4433                            
         PCB    TYPE=DB,DBDNAME=WLXXKB,PROCOPT=GOT,KEYLEN=40,POS=S              
         SENSEG NAME=WLXXKB01,PARENT=0                                          
         SENSEG NAME=WLXXKB11,PARENT=WLXXKB01                                   
*                                                                               
******** SUBMODUL   W335PRQU  UPPDATERA PRISFRÅGA ********                      
*                                                                               
* PRQU-WDG2-PCB - VALUTAREGISTER  WDG2                                          
         PCB   TYPE=DB,DBDNAME=WDG2,PROCOPT=GOT,KEYLEN=37,POS=S                 
         SENSEG NAME=WDG201,PARENT=0                                            
         SENSEG NAME=WDGX9306,PARENT=WDG201                                     
         SENSEG NAME=WDGX9308,PARENT=WDGX9306                                   
*                                                                               
* PRQU-WDC7-PCB - UPPDATERA PRISFRÅGA WDC7                                      
         PCB   TYPE=DB,DBDNAME=WDC7,PROCOPT=G,KEYLEN=33,POS=S                   
         SENSEG NAME=WDC701,PARENT=0,PROCOPT=GIRD                               
         SENSEG NAME=WDC711,PARENT=WDC701,PROCOPT=GIRD                          
*                                                                               
* PRQU-SJKO-WDK6-PCB - ARTIKELINFORMATION  WDK6                                 
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=06,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
******** SUBMODUL   W335PRNO  PRISFRÅGENUMMER ***********                       
*                                                                               
* PRNO-3107-PCB - PRISFRÅGENUMMER       WDR1  IDHTYP=3107                       
         PCB   TYPE=DB,DBDNAME=WDR1,PROCOPT=G,KEYLEN=31,POS=S                   
         SENSEG NAME=WDR101,PARENT=0                                            
         SENSEG NAME=WDGX3108,PARENT=WDR101,PROCOPT=GR                          
*                                                                               
*                                                                               
*                                                                               
        PSBGEN LANG=COBOL,PSBNAME=W40203                                        
        END                                                                     
