*                                                                               
* 4221-MSG-PCB - START AV BILD 4221-ORDERHUVUD FORBI/VOR                        
         PCB   TYPE=TP,NAME=W4T221,ALTRESP=NO,SAMETRM=NO,              *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* 4231-MSG-PCB - START AV BILD 4231-ORDERHUVUD FORBI/VOR                        
         PCB   TYPE=TP,NAME=W4T231,ALTRESP=NO,SAMETRM=NO,              *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WL4541,PROCOPT=G,KEYLEN=46,POS=S                 
         SENSEG NAME=WL454101,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WL454111,PARENT=WL454101,PROCOPT=GIRD                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTM,PROCOPT=G,KEYLEN=5,POS=S                  
         SENSEG NAME=WLARTM01,PARENT=0,PROCOPT=GR                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLFILA,PROCOPT=G,KEYLEN=27,POS=S                 
         SENSEG NAME=WLFILA01,PARENT=0,PROCOPT=GI                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=G,KEYLEN=6,POS=S                    
         SENSEG NAME=WDK601,PARENT=0,PROCOPT=G                                  
         SENSEG NAME=WDK611,PARENT=WDK601,PROCOPT=G                             
*                                                                               
* ARTS-PCB - ARTIKELREGISTER WDK7                                               
         PCB   TYPE=DB,DBDNAME=WLARTS,PROCOPT=G,KEYLEN=07,POS=S                 
         SENSEG NAME=WLARTS01,PARENT=0                                          
         SENSEG NAME=WLARTS11,PARENT=WLARTS01,PROCOPT=GR                        
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40224                                       
         END                                                                    
