*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
*        PROFORMAREG-HUVUD WDE8                                                 
         PCB   TYPE=DB,DBDNAME=WLPROC,PROCOPT=G,KEYLEN=17,POS=S                 
         SENSEG NAME=WLPROC01,PARENT=0,PROCOPT=GR                               
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40268                                       
         END                                                                    
