*          DATA SET W40261PII0 AT LEVEL 003 AS OF 91/04/24                      
*                                                                               
******** HUVUDMODUL  W4026100 PROFORMA-ORDERHUVUD   ********                    
*                                                                               
* DISP-MSG-PCB - FEL/KLAR MEDDELANDE TILL DISPATCHERN                           
         PCB   TYPE=TP,NAME=W0T693X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* PROC-PCB - PROFORMA-ORDERHUVUDSREGISTER      WDE8                             
         PCB   TYPE=DB,DBDNAME=WLPROC,PROCOPT=G,KEYLEN=17,POS=S                 
         SENSEG NAME=WLPROC01,PARENT=0,PROCOPT=GI                               
*                                                                               
* WDG2-PCB/9305-PCB                                                             
         PCB   TYPE=DB,DBDNAME=WDG2,PROCOPT=GOT,KEYLEN=37,POS=S                 
         SENSEG NAME=WDG201,PARENT=0                                            
         SENSEG NAME=WDGX9306,PARENT=WDG201                                     
         SENSEG NAME=WDGX9308,PARENT=WDGX9306                                   
*                                                                               
******** SUBMODUL    W411KREG  LÄSNING KUNDREGISTER ********                    
*                                                                               
* KREG-GMTA-PCB - KUNDREGISTRET  WDB2                                           
         PCB   TYPE=DB,DBDNAME=WLGMTA,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG NAME=WLGMTA01,PARENT=0                                          
*                                                                               
* KREG-GMTB-PCB - DC-REGISTRET  WDB3                                            
         PCB   TYPE=DB,DBDNAME=WLGMTB,PROCOPT=GOT,KEYLEN=9,POS=S                
         SENSEG NAME=WLGMTB01,PARENT=0                                          
*                                                                               
* KREG-GMTC-PCB - FRAKTKOD-REGISTRET  WDB5                                      
         PCB   TYPE=DB,DBDNAME=WLGMTC,PROCOPT=GOT,KEYLEN=11,POS=S               
         SENSEG NAME=WLGMTC01,PARENT=0                                          
*                                                                               
* KREG-BETC-PCB - BETALARE-REGISTER WDB1                                        
         PCB   TYPE=DB,DBDNAME=WLBETC,PROCOPT=GOT,KEYLEN=11,POS=S               
         SENSEG NAME=WLBETC01,PARENT=0                                          
*                                                                               
*                                                                               
******** SUBMODUL    W411OHLK  LOGISK KONTROLL ORDERHUVUD ********              
*                                                                               
* KAMPANJREGISTER WDM2                                                          
         PCB    TYPE=DB,DBDNAME=WDM2,PROCOPT=GOT,KEYLEN=6,POS=S                 
         SENSEG NAME=WDM201,PARENT=0                                            
*                                                                               
* OHLK-WDB6-PCB - DC-REGISTER  WDB6                                             
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
******** SUBMODUL    W411ORDN  UTTAG AUT. ORDERNUMMER ********                  
*                                                                               
* ORDN-XXKP-PCB - AUTOMATISKA ORDERNUMMER WDR1  IDHTYP=4525                     
         PCB   TYPE=DB,DBDNAME=WLXXKP,PROCOPT=G,KEYLEN=35,POS=S                 
         SENSEG NAME=WLXXKP01,PARENT=0                                          
         SENSEG NAME=WLXXKP11,PARENT=WLXXKP01,PROCOPT=GR                        
*                                                                               
* ORDN-ORQL-PCB - ORDERHUVUDSREG KÖ (WDQ2C)-SEK.INDEX                           
         PCB   TYPE=DB,DBDNAME=WLORQL,PROCOPT=GOT,KEYLEN=17,POS=S               
         SENSEG NAME=WLORQL01,PARENT=0                                          
*                                                                               
* ORDN-PROC-PCB - PROFORMAHUVUDREG    WDE8                                      
         PCB   TYPE=DB,DBDNAME=WLPROC,PROCOPT=GOT,KEYLEN=17,POS=S               
         SENSEG NAME=WLPROC01,PARENT=0                                          
*                                                                               
******** SUBMODUL    W411OHLK  LOGISK KONTROLL ORDERHUVUD ********              
*                                                                               
* OHLK-SAPC-PCB - KONTROLLREGISTER KONTERINGAR WDH3                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLSAPC,PROCOPT=GOT,KEYLEN=17,POS=S               
         SENSEG NAME=WLSAPC01,PARENT=0                                          
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40261                                       
         END                                                                    
