*                                                                               
*        TRANS TILL PGM W4029500 - PROFORMA UTSKRIFT                            
         PCB   TYPE=TP,NAME=W4T295X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*        TRANS TILL PGM W4026900 - PROFORMA RELEASE                             
         PCB   TYPE=TP,NAME=W4T269X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
*        PROFORMAREG-HUVUD WDE8                                                 
         PCB   TYPE=DB,DBDNAME=WLPROC,PROCOPT=G,KEYLEN=17,POS=S                 
         SENSEG NAME=WLPROC01,PARENT=0,PROCOPT=GIRD                             
*                                                                               
*        PROFORMAREG-RADER WDE9                                                 
         PCB   TYPE=DB,DBDNAME=WLPROD,PROCOPT=GOT,KEYLEN=12,POS=S               
         SENSEG NAME=WLPROD01,PARENT=0                                          
*                                                                               
*        ARTIKELREGISTER WDK6                                                   
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=10,POS=S               
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
*                                                                               
*        LEVVILLKORSTABELL WDR1 HTYP=473E (4735)                                
         PCB   TYPE=DB,DBDNAME=WL4735,PROCOPT=GOT,KEYLEN=35,POS=S               
         SENSEG NAME=WL473501,PARENT=0                                          
         SENSEG NAME=WL473511,PARENT=WL473501                                   
*                                                                               
*        ORDERBEKRÄFTELSE WDQ1                                                  
         PCB   TYPE=DB,DBDNAME=WLORQM,PROCOPT=GOT,KEYLEN=17,POS=S               
         SENSEG NAME=WLORQM01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB1,PROCOPT=GOT,KEYLEN=11,POS=S                 
         SENSEG NAME=WDB101,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
******** SUBMODUL    W411KREG  LÄSNING KUNDREGISTER ********                    
*                                                                               
* KREG-GMTA-PCB - KUNDREGISTRET  WDB2                                           
         PCB   TYPE=DB,DBDNAME=WLGMTA,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG NAME=WLGMTA01,PARENT=0                                          
*                                                                               
* KREG-GMTB-PCB - DC-REGISTRET  WDB3                                            
         PCB   TYPE=DB,DBDNAME=WLGMTB,PROCOPT=GOT,KEYLEN=9,POS=S                
         SENSEG NAME=WLGMTB01,PARENT=0                                          
*                                                                               
* KREG-GMTC-PCB - FRAKTKOD-REGISTRET  WDB5                                      
         PCB   TYPE=DB,DBDNAME=WLGMTC,PROCOPT=GOT,KEYLEN=11,POS=S               
         SENSEG NAME=WLGMTC01,PARENT=0                                          
*                                                                               
* KREG-BETC-PCB - BETALARE-REGISTER WDB1                                        
         PCB   TYPE=DB,DBDNAME=WLBETC,PROCOPT=GOT,KEYLEN=11,POS=S               
         SENSEG NAME=WLBETC01,PARENT=0                                          
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40266                                       
         END                                                                    
