*                                                                               
* DISP-PCB - FEL/KLAR MEDDELANDE TILL DISPATCHER                                
         PCB   TYPE=TP,NAME=W0T693X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* 4298-MSG-PCB - START AV 4298-ORDERAVSLUT WOPS                                 
         PCB   TYPE=TP,NAME=W4T298X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* 4299-MSG-PCB - START AV 4298-BIPACKNING RO/TPO                                
         PCB   TYPE=TP,NAME=W4T299X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* AVSR-LIST-PCB                                                                 
         PCB   TYPE=TP,NAME=,ALTRESP=NO,SAMETRM=NO,                    *        
               MODIFY=YES,EXPRESS=NO                                            
*                                                                               
* ALT-PCB TRANS TILL PGM W2010900                                               
         PCB   TYPE=TP,NAME=W2T109X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* ALT-PCB TRANS TILL PGM W20191    FÖR LARM VOR                                 
         PCB   TYPE=TP,NAME=W2T191X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* ALT-PCB TRANS TILL PGM W3039100                                               
PRQRY    PCB   TYPE=TP,NAME=W30391X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* WZ01-PCB, STARTAR   PGM W40257-DLEV                                           
DLEVRAD  PCB   TYPE=TP,NAME=W4T257X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*                                                                               
* USEA-PCB                                                                      
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GOT,KEYLEN=8,POS=S                
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
* ORQF-PCB - ORDERRADSREGISTER KÖ WDQ4                                          
         PCB   TYPE=DB,DBDNAME=WLORQF,PROCOPT=G,KEYLEN=20,POS=S                 
         SENSEG NAME=WLORQF01,PARENT=0,PROCOPT=GI                               
*                                                                               
* ORQI-PCB - ORDERHUVUDSREGISTER KÖ SEK.INDEX  WDQ2C                            
         PCB   TYPE=DB,DBDNAME=WLORQI,PROCOPT=G,KEYLEN=19,POS=S,       *        
               PROCSEQ=WDQ2C                                                    
         SENSEG NAME=WLORQI01,PARENT=0,PROCOPT=GR                               
         SENSEG NAME=WLORQI12,PARENT=WLORQI01                                   
*                                                                               
* ORQM-PCB - ORDERBEKRÄFTELSEREGISTER   WDQ1                                    
         PCB   TYPE=DB,DBDNAME=WLORQM,PROCOPT=G,KEYLEN=17,POS=S                 
         SENSEG NAME=WLORQM01,PARENT=0,PROCOPT=GI                               
*                                                                               
* ARTM-PCB - ARTIKELREGISTER ORDER ENTRY   WDK9                                 
         PCB   TYPE=DB,DBDNAME=WLARTM,PROCOPT=G,KEYLEN=05,POS=S                 
         SENSEG NAME=WLARTM01,PARENT=0,PROCOPT=GR                               
*                                                                               
* 4541-PCB - VOR-KÖN  WDR4  HTYP=4541                                           
         PCB   TYPE=DB,DBDNAME=WDR4,PROCOPT=G,KEYLEN=46,POS=S                   
         SENSEG NAME=WDR401,PARENT=0                                            
         SENSEG NAME=WDGX4542,PARENT=WDR401,PROCOPT=GI                          
*                                                                               
* WDK7-PCB - ARTIKELREGISTER  WDK7                                              
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=08,POS=S                   
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701,PROCOPT=GR                            
         SENSEG NAME=WDK722,PARENT=WDK711                                       
*                                                                               
* WDK6-PCB - ARTIKELREGISTER  WDK6                                              
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=G,KEYLEN=06,POS=S                   
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601,PROCOPT=GR                            
*                                                                               
* WDB2-PCB - KUNDREGISTER GODSMOTTAGARE WDB2                                    
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
* WDB1-PCB - KUNDREGISTER BETAL WDB1                                            
         PCB   TYPE=DB,DBDNAME=WDB1,PROCOPT=GOT,KEYLEN=11,POS=S                 
         SENSEG NAME=WDB101,PARENT=0                                            
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
                                                                                
*                                                                               
* WDA5-PCB - RESTORDER/TPO                                                      
          PCB   TYPE=DB,DBDNAME=WDA5,PROCOPT=G,KEYLEN=24,POS=S                  
          SENSEG NAME=WDA501,PARENT=0,PROCOPT=GI                                
*                                                                               
*    STYRREG RADPRIORITET                                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXJN,PROCOPT=GOT,KEYLEN=40,POS=S               
         SENSEG NAME=WLXXJN01,PARENT=0                                          
         SENSEG NAME=WLXXJN11,PARENT=WLXXJN01                                   
*                                                                               
* FILA-PCB      - RECORD TILL KONTR.LISTAN & SEKV.FILER  WDR6                   
         PCB   TYPE=DB,DBDNAME=WLFILA,PROCOPT=G,KEYLEN=27,POS=S                 
         SENSEG NAME=WLFILA01,PARENT=0,PROCOPT=GI                               
*                                                                               
* WDB3-PCB - KUNDREGISTRET  WDB3                                                
         PCB   TYPE=DB,DBDNAME=WDB3,PROCOPT=GOT,KEYLEN=9,POS=S                  
         SENSEG NAME=WDB301,PARENT=0                                            
*                                                                               
* 4251/4252 DLEVRADER FRÅN W40252                                               
         PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=GI,KEYLEN=41,POS=S                  
         SENSEG NAME=WDR501,PARENT=0                                            
         SENSEG NAME=WDGX4252,PARENT=WDR501                                     
*                                                                               
* WDR6-PCB - LOG-TRANS TO BATCH                                                 
         PCB    TYPE=DB,DBDNAME=WDR6,PROCOPT=G,KEYLEN=27,POS=S                  
         SENSEG NAME=WDR601,PARENT=0,PROCOPT=GI                                 
*                                                                               
******** SUBMODUL   W335PRIS  PRISTILLÄMPNING ********                          
*                                                                               
* PRIS-ARTC-PCB - ARTIKELINFORMATION                                            
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=19,POS=S               
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
         SENSEG NAME=WLARTC21,PARENT=WLARTC11                                   
*                                                                               
* PRIS-WDK7-PCB - ARTIKELINFO                                                   
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=20,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK724,PARENT=WDK711                                       
         SENSEG NAME=WDK712,PARENT=WDK701                                       
*                                                                               
* PRIS-GMTA-PCB - GODSMOTTAGARE  WDB2                                           
         PCB   TYPE=DB,DBDNAME=WLGMTA,PROCOPT=GOT,KEYLEN=07,POS=S               
         SENSEG NAME=WLGMTA01,PARENT=0                                          
*                                                                               
* PRIS-BETA-PCB - BETALARREGISTER WGD1                                          
*                                                                               
         PCB     TYPE=DB,DBDNAME=WLBETC,PROCOPT=GOT,KEYLEN=11,POS=S             
         SENSEG  NAME=WLBETC01                                                  
*                                                                               
* PRIS-PRIA-PCB - ARTIKEL/PRIS   WDC1                                           
         PCB     TYPE=DB,DBDNAME=WLPRIA,PROCOPT=GOT,KEYLEN=06,POS=S             
         SENSEG  NAME=WLPRIA01                                                  
*                                                                               
* PRIS-PRIB-PCB - PRIS RABATTREG WDC2                                           
         PCB     TYPE=DB,DBDNAME=WLPRIB,PROCOPT=GOT,KEYLEN=16,POS=S             
         SENSEG  NAME=WLPRIB01,PARENT=0                                         
         SENSEG  NAME=WLPRIB11,PARENT=WLPRIB01                                  
         SENSEG  NAME=WLPRIB12,PARENT=WLPRIB01                                  
         SENSEG  NAME=WLPRIB13,PARENT=WLPRIB01                                  
*                                                                               
* PRIS-COST-WDK6-PCB - ARTIKELINFORMATION WDK6                                  
         PCB     TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=19,POS=S               
         SENSEG  NAME=WDK601,PARENT=0                                           
         SENSEG  NAME=WDK611,PARENT=WDK601                                      
         SENSEG  NAME=WDK621,PARENT=WDK611                                      
*                                                                               
* PRIS-COST-WDK7-PCB - ARTIKELINFORMATION WDK7                                  
         PCB     TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG  NAME=WDK701,PARENT=0                                           
         SENSEG  NAME=WDK711,PARENT=WDK701                                      
*                                                                               
* PRIS-COST-WDF1-PCB - LEVERANTÖRSINFO WDF1                                     
         PCB     TYPE=DB,DBDNAME=WDF1,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG  NAME=WDF101,PARENT=0                                           
         SENSEG  NAME=WDF102,PARENT=WDF101                                      
*                                                                               
* PRIS-COST-WDG2-PCB - VALUTAINFORMATION WDG2                                   
         PCB   TYPE=DB,DBDNAME=WDG2,PROCOPT=GOT,KEYLEN=37,POS=S                 
         SENSEG NAME=WDG201,PARENT=0                                            
         SENSEG NAME=WDGX9306,PARENT=WDG201                                     
         SENSEG NAME=WDGX9308,PARENT=WDGX9306                                   
*                                                                               
* PRIS-COST-WDK72-PCB - ARTIKELREGISTER DC                                      
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=20,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK724,PARENT=WDK711                                       
*                                                                               
* PRIS-COST-WDB6-PCB - DC-REGISTER  WDB6                                        
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=3,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB617,PARENT=WDB601                                       
*                                                                               
******** SUBMODUL   W335PRNO  PRISFRÅGENUMMER ***********                       
*                                                                               
* PRNO-3107-PCB - PRISFRÅGENUMMER       WDR1  IDHTYP=3107                       
         PCB   TYPE=DB,DBDNAME=WDR1,PROCOPT=G,KEYLEN=31,POS=S                   
         SENSEG NAME=WDR101,PARENT=0                                            
         SENSEG NAME=WDGX3108,PARENT=WDR101,PROCOPT=GR                          
*                                                                               
*                                                                               
******** SUBMODUL   W335PRQU  UPPDATERA PRISFRÅGA ********                      
*                                                                               
* PRQU-WDG2-PCB - VALUTAREGISTER  WDG2                                          
         PCB   TYPE=DB,DBDNAME=WDG2,PROCOPT=GOT,KEYLEN=37,POS=S                 
         SENSEG NAME=WDG201,PARENT=0                                            
         SENSEG NAME=WDGX9306,PARENT=WDG201                                     
         SENSEG NAME=WDGX9308,PARENT=WDGX9306                                   
*                                                                               
* PRQU-WDC7-PCB - UPPDATERA PRISFRÅGA WDC7                                      
         PCB   TYPE=DB,DBDNAME=WDC7,PROCOPT=G,KEYLEN=33,POS=S                   
         SENSEG NAME=WDC701,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDC711,PARENT=WDC701,PROCOPT=GIRD                          
*                                                                               
* PRQU-SJKO-WDK6-PCB - ARTIKELINFORMATION  WDK6                                 
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=06,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
******** SUBMODUL   W411AREG  LÄSNING ARTIKELREGISTER ********                  
*                                                                               
* AREG-WDK6-PCB - ARTIKELINFORMATION  WDK6                                      
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=06,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
* AREG-WDK7-PCB - ARTIKELINFORMATION  WDK7                                      
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=08,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK722,PARENT=WDK711                                       
*                                                                               
*                                                                               
*                                                                               
******** SUBMODUL   W411ARTM  INSERT NY ARTIKEL MED TOM ROT****                 
*                                                                               
* ARTM-ARTM-PCB - ARTIKELREGISTER ORDER ENTRY   WDK9                            
         PCB   TYPE=DB,DBDNAME=WLARTM,PROCOPT=G,KEYLEN=05,POS=S                 
         SENSEG NAME=WLARTM01,PARENT=0,PROCOPT=GI                               
*                                                                               
*                                                                               
******** SUBMODUL   W411DLEV  KONTROLL DIREKTLEVERANS ********                  
*                                                                               
* DLEV-LEVF-PCB - DIREKTLEVERANSREGISTRET   WDF2                                
         PCB   TYPE=DB,DBDNAME=WLLEVF,PROCOPT=GOT,KEYLEN=29,POS=S               
         SENSEG NAME=WLLEVF01,PARENT=0                                          
         SENSEG NAME=WLLEVF11,PARENT=WLLEVF01                                   
*                                                                               
* DLEV-LEVG-PCB - DIREKTLEVERANSREGISTRET VIA ASEQ   WDF2                       
         PCB   TYPE=DB,DBDNAME=WLLEVG,PROCOPT=GOT,KEYLEN=10,POS=S               
         SENSEG NAME=WLLEVG01,PARENT=0                                          
*                                                                               
* DLEV-LEVA-PCB - LEVERANTÖRSREGISTRET      WDF1                                
         PCB   TYPE=DB,DBDNAME=WLLEVA,PROCOPT=GOT,KEYLEN=13,POS=S               
         SENSEG NAME=WLLEVA01,PARENT=0                                          
         SENSEG NAME=WLLEVA18,PARENT=WLLEVA01                                   
*                                                                               
* DLEV-ARTS-PCB - ARTIKELREGISTER  WDK7                                         
         PCB   TYPE=DB,DBDNAME=WLARTS,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG NAME=WLARTS01,PARENT=0                                          
         SENSEG NAME=WLARTS11,PARENT=WLARTS01                                   
*                                                                               
* DLEV-WDB6-PCB - DC-REGISTER WDB6                                              
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
*                                                                               
******** SUBMODUL   W411SPAR  KONTROLL DIV SPÄRRAR    ********                  
*                                                                               
* SPAR-WDF8-PCB SPÄRREGLER                                                      
         PCB   TYPE=DB,DBDNAME=WDF8,PROCOPT=GOT,KEYLEN=24,POS=S                 
         SENSEG NAME=WDF801,PARENT=0                                            
         SENSEG NAME=WDF811,PARENT=WDF801                                       
         SENSEG NAME=WDF812,PARENT=WDF801                                       
         SENSEG NAME=WDF813,PARENT=WDF801                                       
         SENSEG NAME=WDF814,PARENT=WDF801                                       
         SENSEG NAME=WDF815,PARENT=WDF801                                       
*                                                                               
* SPAR-WDF8A-PCB SPÄRREGLER (SEKUNDÄRINDEX DISTR/KUND INGÅNG)                   
         PCB   TYPE=DB,DBDNAME=WDF8A,PROCOPT=GOT,KEYLEN=24,POS=S                
         SENSEG NAME=WDF8A1,PARENT=0                                            
*                                                                               
* SPAR-WDK6-PCB - ARTIKELREGISTER                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=11,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
*                                                                               
******** SUBMODUL   W411DNOT  DATA TILL DELIVERY NOTE ********                  
* DNOT-ORQP-PCB - DELIVERY NOTEREGISTER    WDQ5                                 
         PCB   TYPE=DB,DBDNAME=WLORQP,PROCOPT=G,KEYLEN=17,POS=S                 
         SENSEG NAME=WLORQP01,PARENT=0,PROCOPT=GIRD                             
*                                                                               
* DNOT-ORQP2-PCB - DELIVERY NOTEREGISTER    WDQ5                                
         PCB   TYPE=DB,DBDNAME=WLORQP,PROCOPT=G,KEYLEN=17,POS=S                 
         SENSEG NAME=WLORQP01,PARENT=0,PROCOPT=GIR                              
*                                                                               
* DNOT-ORQP3-PCB - DELIVERY NOTEREGISTER    WDQ5                                
         PCB   TYPE=DB,DBDNAME=WLORQP,PROCOPT=G,KEYLEN=17,POS=S                 
         SENSEG NAME=WLORQP01,PARENT=0,PROCOPT=GIR                              
*                                                                               
* DNOT-4013-PCB - WDR4  HTYP=4013 VIPSORDERBEKR                                 
         PCB   TYPE=DB,DBDNAME=WL4013,PROCOPT=G,KEYLEN=58,POS=S                 
         SENSEG NAME=WL401301,PARENT=0,PROCOPT=GID                              
         SENSEG NAME=WL401311,PARENT=WL401301,PROCOPT=GID                       
         SENSEG NAME=WL401321,PARENT=WL401311,PROCOPT=GID                       
*                                                                               
* DNOT-BENA-PCB  BENÄMNINGSREGISTER                                             
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=13,POS=S,     *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
*                                                                               
******* SUBMODUL   W411KAMP  KONTROLL TPO4-KAMPANJ ********                     
*                                                                               
* KAMP-ORDP-PCB - ORDERRADSREGISTER   WDA5                                      
         PCB   TYPE=DB,DBDNAME=WLORDP,PROCOPT=G,KEYLEN=24,POS=S                 
         SENSEG NAME=WLORDP01,PARENT=0,PROCOPT=GI                               
*                                                                               
* KAMP-ZZAC-PCB - RECORD TILL KONTR.LISTAN & SEKV.FILER  WDG6                   
         PCB   TYPE=DB,DBDNAME=WLZZAC,PROCOPT=G,KEYLEN=18,POS=S                 
         SENSEG NAME=WLZZAC01,PARENT=0,PROCOPT=GI                               
*                                                                               
* KAMPANJREGISTER WDM2                                                          
         PCB    TYPE=DB,DBDNAME=WDM2,PROCOPT=G,KEYLEN=25,POS=S                  
         SENSEG NAME=WDM201,PARENT=0,PROCOPT=G                                  
         SENSEG NAME=WDM211,PARENT=WDM201,PROCOPT=GR                            
         SENSEG NAME=WDM221,PARENT=WDM211,PROCOPT=GR                            
*                                                                               
*                                                                               
******* SUBMODUL   W411KERS  KONTROLL ERSÄTTNINGAR ********                     
*                                                                               
* KERS-ARTC-PCB - ARTIKELINFORMATION  WDK6                                      
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=06,POS=S               
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
*                                                                               
* KERS-ERSA-PCB - INFO OM ERSATT ARTIKEL  WDD7                                  
         PCB   TYPE=DB,DBDNAME=WLERSA,PROCOPT=GOT,KEYLEN=07,POS=S               
         SENSEG NAME=WLERSA01,PARENT=0                                          
         SENSEG NAME=WLERSA11,PARENT=WLERSA01                                   
*                                                                               
*                                                                               
******* SUBMODUL   W411NDCA  KONTROLL PRELIMINÄR AVBOKNING ********             
*                                                                               
* NDCA-USEA-PCB - USER INFO WDP7                                                
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GOT,KEYLEN=8,POS=S                
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
* NDCA-WDK7-PCB - ARTIKELINFORMATION  WDK7                                      
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=08,POS=S                   
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701,PROCOPT=GR                            
         SENSEG NAME=WDK722,PARENT=WDK711                                       
         SENSEG NAME=WDK712,PARENT=WDK701,PROCOPT=GR                            
*                                                                               
* NDCA-WDL6-PCB - ARTIKELREGISTER INFO WDL6                                     
         PCB   TYPE=DB,DBDNAME=WDL6,PROCOPT=GOT,KEYLEN=21,POS=S                 
         SENSEG NAME=WDL601,PARENT=0                                            
         SENSEG NAME=WDL611,PARENT=WDL601                                       
*                                                                               
* NDCA-WDB6-PCB - DC-REGISTER INFO WDB6                                         
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=02,POS=S                 
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
*                                                                               
*                                                                               
******* SUBMODUL   W411SDCA  KONTROLL PRELIMINÄR AVBOKNING ********             
*                                                                               
* SDCA-ARTS-PCB - ARTIKELREGISTER  WDK7                                         
         PCB   TYPE=DB,DBDNAME=WLARTS,PROCOPT=G,KEYLEN=07,POS=S                 
         SENSEG NAME=WLARTS01,PARENT=0                                          
         SENSEG NAME=WLARTS11,PARENT=WLARTS01,PROCOPT=GR                        
*                                                                               
* SDCA-WDB6-PCB - DC-REGISTER WDB6                                              
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=4,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB616,PARENT=WDB601                                       
*                                                                               
* SDCA-WDK9-PCB - DC-REGISTER WDK9                                              
         PCB   TYPE=DB,DBDNAME=WDK9,PROCOPT=GOT,KEYLEN=5,POS=S                  
         SENSEG NAME=WDK901,PARENT=0                                            
*                                                                               
* SDCA-WDR6-PCB - LOG-TRANS TO BATCH                                            
         PCB    TYPE=DB,DBDNAME=WDR6,PROCOPT=G,KEYLEN=27,POS=S                  
         SENSEG NAME=WDR601,PARENT=0,PROCOPT=GI                                 
*                                                                               
* SDCA-WDK6-PCB - ARTIKELINFORMATION WDK6                                       
         PCB    TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=6,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
* SDCA-WDQ4B-PCB   ORDERRAD ARTIKEL                                             
         PCB   TYPE=DB,DBDNAME=WDQ4B,PROCOPT=GOT,KEYLEN=37,POS=S                
         SENSEG NAME=WDQ4B1,PARENT=0                                            
*                                                                               
* SDCA-WDQ2-PCB   ORDERHUVUD WDQ2                                               
         PCB    TYPE=DB,DBDNAME=WDQ2,PROCOPT=GOT,KEYLEN=4,POS=S                 
         SENSEG NAME=WDQ201,PARENT=0                                            
*                                                                               
* SDCA-WDQ4-PCB   ORDERRAD   WDQ4                                               
         PCB    TYPE=DB,DBDNAME=WDQ4,PROCOPT=GOT,KEYLEN=20,POS=S                
         SENSEG NAME=WDQ401,PARENT=0                                            
*                                                                               
******* SUBMODULE W005WDK7 ADDING WDK711 FOR SDCA ****                          
*                                                                               
* SDCA-WDB6-2-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
* SDCA-WDK6-2-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=6,POS=S                  
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
* SDCA-WDK7-2-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=7,POS=S                    
         SENSEG NAME=WDK701,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDK711,PARENT=WDK701,PROCOPT=GI                            
         SENSEG NAME=WDK712,PARENT=WDK701,PROCOPT=GI                            
*                                                                               
* SDCA-WDK7-3-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=08,POS=S                   
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK721,PARENT=WDK711,PROCOPT=GI                            
*                                                                               
*                                                                               
******* SUBMODUL   W411CDCA  KONTROLL PRELIMINÄR AVBOKNING ********             
*                                                                               
* CDCA-ARTM-PCB - ARTIKELREGISTER ORDER ENTRY   WDK9                            
         PCB   TYPE=DB,DBDNAME=WLARTM,PROCOPT=G,KEYLEN=05,POS=S                 
         SENSEG NAME=WLARTM01,PARENT=0,PROCOPT=GIR                              
*                                                                               
* CDCA-INLB-PCB - ARTIKELREGISTER INFO WDD9                                     
         PCB   TYPE=DB,DBDNAME=WLINLB,PROCOPT=GOT,KEYLEN=12,POS=S               
         SENSEG NAME=WLINLB01,PARENT=0                                          
         SENSEG NAME=WLINLB11,PARENT=WLINLB01                                   
*                                                                               
* CDCA-WDB2-PCB - KUNDREGISTER WDB2                                             
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
* CDCA-WDC1-PCB - RETAILREGISTRET WDC1                                          
         PCB     TYPE=DB,DBDNAME=WDC1,PROCOPT=GOT,KEYLEN=6,POS=S                
         SENSEG  NAME=WDC101,PARENT=0                                           
*                                                                               
*                                                                               
******** SUBMODUL  W411RANS  BERÄKNA RANSONERING ********                       
*                                                                               
* RANS-XXKM-PCB - RANSONERINGSTABELL    WDR1  HTYP=4455                         
         PCB   TYPE=DB,DBDNAME=WLXXKM,PROCOPT=GOT,KEYLEN=40,POS=S               
         SENSEG NAME=WLXXKM01,PARENT=0                                          
         SENSEG NAME=WLXXKM11,PARENT=WLXXKM01                                   
*                                                                               
* RANS-ARTM-PCB - ARTIKELREGISTER ORDER ENTRY   WDK9                            
         PCB   TYPE=DB,DBDNAME=WLARTM,PROCOPT=GOT,KEYLEN=11,POS=S               
         SENSEG NAME=WLARTM01,PARENT=0                                          
         SENSEG NAME=WLARTM11,PARENT=WLARTM01                                   
*                                                                               
* RANS-ARTS-PCB - ARTIKELINFORMATION  WDK7                                      
         PCB   TYPE=DB,DBDNAME=WLARTS,PROCOPT=GOT,KEYLEN=07,POS=S               
         SENSEG NAME=WLARTS01,PARENT=0                                          
         SENSEG NAME=WLARTS11,PARENT=WLARTS01                                   
*                                                                               
******** SUBMODUL    W411TPO1  KONTROLL TPO1 ********                           
*                                                                               
* TPO1-ORDP-PCB - ORDERRADSREGISTER   WDA5                                      
         PCB   TYPE=DB,DBDNAME=WLORDP,PROCOPT=G,KEYLEN=24,POS=S                 
         SENSEG NAME=WLORDP01,PARENT=0,PROCOPT=GIRD                             
*                                                                               
* TPO1-ARTM-PCB - ARTIKELREGISTER ORDER ENTRY   WDK9                            
         PCB   TYPE=DB,DBDNAME=WLARTM,PROCOPT=G,KEYLEN=11,POS=S                 
         SENSEG NAME=WLARTM01,PARENT=0,PROCOPT=GR                               
         SENSEG NAME=WLARTM11,PARENT=WLARTM01,PROCOPT=GIRD                      
*                                                                               
* TPO1-ZZAC-PCB - RECORD TILL KONTR.LISTAN & SEKV.FILER  WDG6                   
         PCB   TYPE=DB,DBDNAME=WLZZAC,PROCOPT=G,KEYLEN=18,POS=S                 
         SENSEG NAME=WLZZAC01,PARENT=0,PROCOPT=GI                               
*                                                                               
*                                                                               
******** SUBMODUL    W411TPO2  KONTROLL TPO2 ********                           
*                                                                               
* TPO2-ORDP-PCB - ORDERRADSREGISTER   WDA5                                      
         PCB   TYPE=DB,DBDNAME=WLORDP,PROCOPT=G,KEYLEN=24,POS=S                 
         SENSEG NAME=WLORDP01,PARENT=0,PROCOPT=GI                               
*                                                                               
* TPO2-XXBU-PCB - LARMKÖ   WDR5  IDHTYP=2223                                    
         PCB   TYPE=DB,DBDNAME=WLXXBU,PROCOPT=G,KEYLEN=40,POS=S                 
         SENSEG NAME=WLXXBU01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLXXBU11,PARENT=WLXXBU01,PROCOPT=GI                        
*                                                                               
* TPO2-XXBV-PCB - TIDSBEKRÄFTELSE TPO  WDR2  IDHTYP=2225                        
         PCB   TYPE=DB,DBDNAME=WLXXBV,PROCOPT=GOT,KEYLEN=31,POS=S               
         SENSEG NAME=WLXXBV01,PARENT=0                                          
         SENSEG NAME=WLXXBV11,PARENT=WLXXBV01                                   
*                                                                               
* TPO2-ARTM-PCB - ARTIKELREGISTER ORDER ENTRY   WDK9                            
         PCB   TYPE=DB,DBDNAME=WLARTM,PROCOPT=G,KEYLEN=11,POS=S                 
         SENSEG NAME=WLARTM01,PARENT=0,PROCOPT=GR                               
         SENSEG NAME=WLARTM11,PARENT=WLARTM01,PROCOPT=GIR                       
*                                                                               
* TPO2-FILA-PCB - RECORD TILL KONTR.LISTAN & SEKV.FILER  WDR6                   
         PCB   TYPE=DB,DBDNAME=WLFILA,PROCOPT=G,KEYLEN=27,POS=S                 
         SENSEG NAME=WLFILA01,PARENT=0,PROCOPT=GI                               
*                                                                               
* TPO2-XXBX-PCB - ÖVERSÄTTNING ANSK-LARM WDR2  IDHTYP=2231                      
         PCB   TYPE=DB,DBDNAME=WLXXBX,PROCOPT=GOT,KEYLEN=35,POS=S               
         SENSEG NAME=WLXXBX01,PARENT=0                                          
         SENSEG NAME=WLXXBX11,PARENT=WLXXBX01                                   
*                                                                               
******** SUBMODUL    W411RELS  KONTROLL REL. SP *****                           
*                                                                               
* RELS-ORDP-PCB - ORDERRADSREGISTER   WDA5                                      
         PCB   TYPE=DB,DBDNAME=WLORDP,PROCOPT=G,KEYLEN=24,POS=S                 
         SENSEG NAME=WLORDP01,PARENT=0,PROCOPT=GI                               
*                                                                               
*                                                                               
* RELS-FILA-PCB - RECORD TILL KONTR.LISTAN & SEKV.FILER  WDG6                   
         PCB   TYPE=DB,DBDNAME=WLFILA,PROCOPT=G,KEYLEN=27,POS=S                 
         SENSEG NAME=WLFILA01,PARENT=0,PROCOPT=GI                               
*                                                                               
*                                                                               
* RELS-ARTM-PCB - ARTIKELREGISTER ORDER ENTRY   WDK9                            
         PCB   TYPE=DB,DBDNAME=WLARTM,PROCOPT=G,KEYLEN=11,POS=S                 
         SENSEG NAME=WLARTM01,PARENT=0,PROCOPT=GR                               
         SENSEG NAME=WLARTM11,PARENT=WLARTM01,PROCOPT=GIR                       
*                                                                               
******** SUBMODUL    W411TPO3  KONTROLL TPO3 ********                           
*                                                                               
* TPO3-ORDP-PCB - ORDERRADSREGISTER   WDA5                                      
         PCB   TYPE=DB,DBDNAME=WLORDP,PROCOPT=G,KEYLEN=24,POS=S                 
         SENSEG NAME=WLORDP01,PARENT=0,PROCOPT=GI                               
*                                                                               
* TPO3-ZZAC-PCB - RECORD TILL KONTR.LISTAN & SEKV.FILER  WDG6                   
         PCB   TYPE=DB,DBDNAME=WLZZAC,PROCOPT=G,KEYLEN=18,POS=S                 
         SENSEG NAME=WLZZAC01,PARENT=0,PROCOPT=GI                               
*                                                                               
*                                                                               
******** SUBMODUL    W411TPO5  KONTROLL PROFORMOR ***                           
*                                                                               
* TPO5-ORDP-PCB - ORDERRADSREGISTER   WDA5                                      
         PCB   TYPE=DB,DBDNAME=WLORDP,PROCOPT=G,KEYLEN=24,POS=S                 
         SENSEG NAME=WLORDP01,PARENT=0,PROCOPT=GIRD                             
*                                                                               
* TPO5-ARTM-PCB - ARTIKELREGISTER ORDER ENTRY   WDK9                            
         PCB   TYPE=DB,DBDNAME=WLARTM,PROCOPT=G,KEYLEN=11,POS=S                 
         SENSEG NAME=WLARTM01,PARENT=0,PROCOPT=GR                               
         SENSEG NAME=WLARTM11,PARENT=WLARTM01,PROCOPT=GIR                       
*                                                                               
*                                                                               
******** SUBMODUL    W411TPO6  KONTROLL TPO6 ********                           
*                                                                               
* TPO6-ORDP-PCB - ORDERRADSREGISTER   WDA5                                      
         PCB   TYPE=DB,DBDNAME=WLORDP,PROCOPT=G,KEYLEN=24,POS=S                 
         SENSEG NAME=WLORDP01,PARENT=0,PROCOPT=GI                               
*                                                                               
* TPO6-XXBU-PCB - LARMKÖ   WDR5  IDHTYP=2223                                    
         PCB   TYPE=DB,DBDNAME=WLXXBU,PROCOPT=G,KEYLEN=40,POS=S                 
         SENSEG NAME=WLXXBU01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLXXBU11,PARENT=WLXXBU01,PROCOPT=GI                        
*                                                                               
* TPO6-XXBV-PCB - TIDSBEKRÄFTELSE TPO  WDR2  IDHTYP=2225                        
         PCB   TYPE=DB,DBDNAME=WLXXBV,PROCOPT=GOT,KEYLEN=31,POS=S               
         SENSEG NAME=WLXXBV01,PARENT=0                                          
         SENSEG NAME=WLXXBV11,PARENT=WLXXBV01                                   
*                                                                               
* TPO6-XXBX-PCB - ÖVERSÄTTNING ANSK-LARM WDR2  IDHTYP=2231                      
         PCB   TYPE=DB,DBDNAME=WLXXBX,PROCOPT=GOT,KEYLEN=35,POS=S               
         SENSEG NAME=WLXXBX01,PARENT=0                                          
         SENSEG NAME=WLXXBX11,PARENT=WLXXBX01                                   
*                                                                               
* TPO6-ARTS-PCB - ARTIKELREGISTER WDK7                                          
         PCB   TYPE=DB,DBDNAME=WLARTS,PROCOPT=GOT,KEYLEN=07,POS=S               
         SENSEG NAME=WLARTS01,PARENT=0                                          
         SENSEG NAME=WLARTS11,PARENT=WLARTS01                                   
*                                                                               
*                                                                               
******** SUBMODUL    W411TIME  BERÄKNING TRANSPORTAVG. TID ******               
*                                                                               
* TIME-4437-PCB - ARBETSTIDS-KALENDER   WDR1  IDHTYP=4437                       
         PCB   TYPE=DB,DBDNAME=WL4437,PROCOPT=GOT,KEYLEN=38,POS=S               
         SENSEG NAME=WL443701,PARENT=0                                          
         SENSEG NAME=WL443711,PARENT=WL443701                                   
*                                                                               
*                                                                               
******** SUBMODUL    W413AVSR  WOPS RADBEHANDLING ********                      
*                                                                               
* AVSR-ORQI-PCB - ORDERHUVUDSREGISTER KÖ   WDQ2                                 
         PCB    TYPE=DB,DBDNAME=WLORQI,PROCOPT=G,KEYLEN=11,POS=S                
         SENSEG NAME=WLORQI01,PARENT=0                                          
         SENSEG NAME=WLORQI11,PARENT=WLORQI01,PROCOPT=GIRD                      
         SENSEG NAME=WLORQI12,PARENT=WLORQI01,PROCOPT=GIR                       
         SENSEG NAME=WLORQI21,PARENT=WLORQI12,PROCOPT=GIRD                      
*                                                                               
* AVSR-GMTB-PCB - DC-REGISTER WDB3                                              
         PCB    TYPE=DB,DBDNAME=WLGMTB,PROCOPT=GOT,KEYLEN=9,POS=S               
         SENSEG NAME=WLGMTB01,PARENT=0                                          
*                                                                               
* AVSR-GMTC-PCB - FK-REGISTER WDB5                                              
         PCB    TYPE=DB,DBDNAME=WLGMTC,PROCOPT=GOT,KEYLEN=11,POS=S              
         SENSEG NAME=WLGMTC01,PARENT=0                                          
*                                                                               
* AVSR-WDB2-PCB KUNDREGISTER                                                    
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
* AVSR-WDB6-PCB - DC-REGISTER  WDB6                                             
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
******** SUBMODUL    W411TRAN  BERÄKNING TRANSPORTAVG. TID ********             
*                                                                               
*TRAN-XXKB-PCB - TRANSPORTAVGÅNGAR WDR1 IDHTYP=4433                             
         PCB    TYPE=DB,DBDNAME=WLXXKB,PROCOPT=GOT,KEYLEN=40,POS=S              
         SENSEG NAME=WLXXKB01,PARENT=0                                          
         SENSEG NAME=WLXXKB11,PARENT=WLXXKB01                                   
*                                                                               
******** SUBMODUL    W411KVAN                                                   
* KVAN-WDB2-PCB                                                                 
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
* KVAN-WDC1-PCB - RETAILREGISTRET WDC1                                          
         PCB     TYPE=DB,DBDNAME=WDC1,PROCOPT=GOT,KEYLEN=6,POS=S                
         SENSEG  NAME=WDC101,PARENT=0                                           
*                                                                               
******* SUBMODUL   W411XDCA  KONTROLL PRELIMINÄR AVBOKNING TEST ***             
*                                                                               
* XDCA-USEA-PCB - USER INFO WDP7                                                
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GOT,KEYLEN=8,POS=S                
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
* XDCA-WDB6-PCB - DC-REGISTER INFO WDB6                                         
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=09,POS=S                 
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB616,PARENT=WDB601                                       
*                                                                               
* XDCA-WDK6-PCB - PART INFO                                                     
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=6,POS=S                  
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
* XDCA-WDK7-PCB - PART INFO                                                     
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=08,POS=S                   
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701,PROCOPT=GR                            
         SENSEG NAME=WDK722,PARENT=WDK711                                       
         SENSEG NAME=WDK712,PARENT=WDK701                                       
*                                                                               
* XDCA-WDK9-PCB PART INFO ORDER ENTRY                                           
         PCB   TYPE=DB,DBDNAME=WDK9,PROCOPT=GOT,KEYLEN=05,POS=S                 
         SENSEG NAME=WDK901,PARENT=0                                            
*                                                                               
* XDCA-WDL6-PCB - PART INFO                                                     
         PCB   TYPE=DB,DBDNAME=WDL6,PROCOPT=GOT,KEYLEN=21,POS=S                 
         SENSEG NAME=WDL601,PARENT=0                                            
         SENSEG NAME=WDL611,PARENT=WDL601                                       
*                                                                               
* XDCA-WDQ4B-PCB   ORDER LINE PART                                              
         PCB   TYPE=DB,DBDNAME=WDQ4B,PROCOPT=GOT,KEYLEN=37,POS=S                
         SENSEG NAME=WDQ4B1,PARENT=0                                            
*                                                                               
* XDCA-WDQ2-PCB   ORDER HEAD                                                    
         PCB    TYPE=DB,DBDNAME=WDQ2,PROCOPT=GOT,KEYLEN=4,POS=S                 
         SENSEG NAME=WDQ201,PARENT=0                                            
*                                                                               
* XDCA-WDQ4-PCB   ORDERRAD   WDQ4                                               
         PCB    TYPE=DB,DBDNAME=WDQ4,PROCOPT=GOT,KEYLEN=20,POS=S                
         SENSEG NAME=WDQ401,PARENT=0                                            
*                                                                               
* XDCA-WDR6-PCB - LOG-TRANS TO BATCH                                            
         PCB    TYPE=DB,DBDNAME=WDR6,PROCOPT=G,KEYLEN=27,POS=S                  
         SENSEG NAME=WDR601,PARENT=0,PROCOPT=GI                                 
*                                                                               
******* SUBMODULE W005WDK7 ADDING WDK711 ***                                    
*                                                                               
* XDCA-WDB6-2-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
* XDCA-WDK6-2-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=6,POS=S                  
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
* XDCA-WDK7-2-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=7,POS=S                    
         SENSEG NAME=WDK701,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDK711,PARENT=WDK701,PROCOPT=GI                            
         SENSEG NAME=WDK712,PARENT=WDK701,PROCOPT=GI                            
*                                                                               
* XDCA-WDK7-3-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=08,POS=S                   
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK721,PARENT=WDK711,PROCOPT=GI                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40252                                       
         END                                                                    
