*                                                                               
* ALT-PCB TRANS TILL PGM W4029200                                               
         PCB   TYPE=TP,NAME=W4T292X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* ALT-PCB TRANS TILL PGM W2010900                                               
         PCB   TYPE=TP,NAME=W2T109X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* 4680-PCB EDI-TRANS                                                            
         PCB   TYPE=TP,NAME=W4T680X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* 4360-PCB EDI-TRANS                                                            
         PCB   TYPE=TP,NAME=W4T360X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* AVSR                                                                          
         PCB   TYPE=TP,NAME=,ALTRESP=NO,SAMETRM=NO,                    *        
               MODIFY=YES,EXPRESS=NO                                            
*                                                                               
*----->PCB TILL HUVUDPROGRAM                                                    
*                                                                               
* USEA-PCB                                                                      
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
* ORQI-PCB - ORDERHUVUDKÖ WDQ2 (SEK.)                                           
         PCB   TYPE=DB,DBDNAME=WLORQI,PROCOPT=G,KEYLEN=24,POS=S,       *        
               PROCSEQ=WDQ2C                                                    
         SENSEG NAME=WLORQI01,PARENT=0,PROCOPT=GR                               
         SENSEG NAME=WLORQI11,PARENT=WLORQI01                                   
         SENSEG NAME=WLORQI12,PARENT=WLORQI01,PROCOPT=GR                        
         SENSEG NAME=WLORQI21,PARENT=WLORQI12                                   
*                                                                               
* ORQA-PCB - ORDERDELSKÖ WDQ3                                                   
         PCB   TYPE=DB,DBDNAME=WLORQA,PROCOPT=GOT,KEYLEN=12,POS=S               
         SENSEG NAME=WLORQA01,PARENT=0                                          
*                                                                               
* ORQF-PCB - ORDERRADSKÖ WDQ4                                                   
         PCB   TYPE=DB,DBDNAME=WLORQF,PROCOPT=G,KEYLEN=20,POS=S                 
         SENSEG NAME=WLORQF01,PARENT=0,PROCOPT=GRD                              
*                                                                               
* BENA-PCB - BENÄMNINGSREGISTER WDD3                                            
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=8,POS=S,      *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
* ARTC-PCB - ARTIKELREGISTER WDK6                                               
          PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=G,KEYLEN=6,POS=S                 
          SENSEG NAME=WLARTC01,PARENT=0                                         
          SENSEG NAME=WLARTC11,PARENT=WLARTC01,PROCOPT=GR                       
*                                                                               
* ARTS-PCB - ARTIKELREGISTER WDK7                                               
         PCB   TYPE=DB,DBDNAME=WLARTS,PROCOPT=G,KEYLEN=07,POS=S                 
         SENSEG NAME=WLARTS01,PARENT=0                                          
         SENSEG NAME=WLARTS11,PARENT=WLARTS01,PROCOPT=GR                        
*                                                                               
* ARTM-PCB - ARTIKELREGISTER-ONLINE WDK9                                        
         PCB   TYPE=DB,DBDNAME=WLARTM,PROCOPT=G,KEYLEN=5,POS=S                  
         SENSEG NAME=WLARTM01,PARENT=0,PROCOPT=GR                               
*                                                                               
* ZZAC-PCB - TRANSAKTIONSBAS WDG6                                               
          PCB   TYPE=DB,DBDNAME=WLZZAC,PROCOPT=G,KEYLEN=105,POS=S               
          SENSEG NAME=WLZZAC01,PARENT=0,PROCOPT=GI                              
*                                                                               
* ORQM-PCB - ORDERBEKRÄFTELSER WDQ1                                             
          PCB   TYPE=DB,DBDNAME=WLORQM,PROCOPT=G,KEYLEN=17,POS=S                
          SENSEG NAME=WLORQM01,PARENT=0,PROCOPT=GI                              
*                                                                               
* ORDP-PCB - RESTORDER/TPO WDA5                                                 
          PCB   TYPE=DB,DBDNAME=WLORDP,PROCOPT=G,KEYLEN=24,POS=S                
          SENSEG NAME=WLORDP01,PARENT=0,PROCOPT=GIR                             
*                                                                               
* KAMPANJREGISTER WDM2                                                          
         PCB    TYPE=DB,DBDNAME=WDM2,PROCOPT=G,KEYLEN=25,POS=S                  
         SENSEG NAME=WDM201,PARENT=0                                            
         SENSEG NAME=WDM211,PARENT=WDM201,PROCOPT=GR                            
         SENSEG NAME=WDM221,PARENT=WDM211,PROCOPT=GR                            
*                                                                               
* WDE4-PCB - WDE4                                                               
         PCB TYPE=DB,DBDNAME=WDE4,PROCOPT=G,KEYLEN=26,POS=S                     
         SENSEG NAME=WDE401,PARENT=0,PROCOPT=GR                                 
         SENSEG NAME=WDE411,PARENT=WDE401,PROCOPT=GR                            
*                                                                               
* WDA6-PCB VOR REGISTER NYTT                                                    
         PCB   TYPE=DB,DBDNAME=WDA6,PROCOPT=G,KEYLEN=40,POS=S,         *        
               PROCSEQ=WDA6B                                                    
         SENSEG NAME=WDA601,PARENT=0,PROCOPT=GR                                 
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
* WDF6-PCB - DDGS REGISTER                                                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDF6,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDF601,PARENT=0                                            
         SENSEG NAME=WDF611,PARENT=WDF601                                       
*                                                                               
*---->  PCB TILL SUBPROGRAM W413AVSR                                            
* AVSR-ORQI-PCB - ORDERHUVUD WDQ2                                               
         PCB    TYPE=DB,DBDNAME=WLORQI,PROCOPT=G,KEYLEN=11,POS=S                
         SENSEG NAME=WLORQI01,PARENT=0                                          
         SENSEG NAME=WLORQI11,PARENT=WLORQI01,PROCOPT=GIRD                      
         SENSEG NAME=WLORQI12,PARENT=WLORQI01,PROCOPT=GIR                       
         SENSEG NAME=WLORQI21,PARENT=WLORQI12,PROCOPT=GIRD                      
*                                                                               
* AVSR-GMTB-PCB - DC-REGISTER WDB3                                              
         PCB    TYPE=DB,DBDNAME=WLGMTB,PROCOPT=GOT,KEYLEN=9,POS=S               
         SENSEG NAME=WLGMTB01,PARENT=0                                          
*                                                                               
* AVSR-GMTC-PCB - FK-REGISTER WDB5                                              
         PCB    TYPE=DB,DBDNAME=WLGMTC,PROCOPT=GOT,KEYLEN=11,POS=S              
         SENSEG NAME=WLGMTC01,PARENT=0                                          
*                                                                               
* AVSR-WDB2-PCB   KUNDREGISTER                                                  
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
* AVSR-WDB6-PCB - DC-REGISTER  WDB6                                             
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
*---->  PCB TILL SUBPROGRAM W413AVSO                                            
* WDE6-PCB - KOLLIREGISTER WDE6                                                 
         PCB   TYPE=DB,DBDNAME=WDE6,PROCOPT=G,KEYLEN=4,POS=S                    
         SENSEG NAME=WDE601,PARENT=0,PROCOPT=GR                                 
*                                                                               
* ORQA-PCB - ORDERDELAR   WDQ3                                                  
         PCB   TYPE=DB,DBDNAME=WLORQA,PROCOPT=G,KEYLEN=12,POS=S                 
         SENSEG NAME=WLORQA01,PARENT=0,PROCOPT=GIRD                             
*                                                                               
* WDQ2-PCB - ORDERHUVUDKÖ WDQ2                                                  
         PCB   TYPE=DB,DBDNAME=WDQ2,PROCOPT=G,KEYLEN=11,POS=S                   
         SENSEG NAME=WDQ201,PARENT=0,PROCOPT=GR                                 
         SENSEG NAME=WDQ211,PARENT=WDQ201,PROCOPT=GR                            
         SENSEG NAME=WDQ212,PARENT=WDQ201,PROCOPT=GR                            
         SENSEG NAME=WDQ221,PARENT=WDQ212,PROCOPT=GRD                           
*                                                                               
* GMTB-PCB - KUNDREGISTRETS DC-SEGM. WDB3                                       
         PCB   TYPE=DB,DBDNAME=WDB3,PROCOPT=GOT,KEYLEN=9,POS=S                  
         SENSEG NAME=WDB301,PARENT=0                                            
*                                                                               
* XXKA-PCB - LAST/ADM TID (HTR4432)                                             
         PCB   TYPE=DB,DBDNAME=WLXXKA,PROCOPT=GOT,KEYLEN=35,POS=S               
         SENSEG NAME=WLXXKA01,PARENT=0                                          
         SENSEG NAME=WLXXKA11,PARENT=WLXXKA01                                   
*                                                                               
* 4437-PCB - ARBETSTID-KALENDER (HTR4437)                                       
         PCB   TYPE=DB,DBDNAME=WL4437,PROCOPT=GOT,KEYLEN=38,POS=S               
         SENSEG NAME=WL443701,PARENT=0                                          
         SENSEG NAME=WL443711,PARENT=WL443701                                   
*                                                                               
* XXKE-PCB - HLO-TABELL (HTR4441)                                               
         PCB   TYPE=DB,DBDNAME=WLXXKE,PROCOPT=GOT,KEYLEN=40,POS=S               
         SENSEG NAME=WLXXKE01,PARENT=0                                          
         SENSEG NAME=WLXXKE11,PARENT=WLXXKE01                                   
*                                                                               
* XXKF-PCB - P-KLASS TABELL (HTR4443)                                           
         PCB   TYPE=DB,DBDNAME=WLXXKF,PROCOPT=GOT,KEYLEN=37,POS=S               
         SENSEG NAME=WLXXKF01,PARENT=0                                          
         SENSEG NAME=WLXXKF11,PARENT=WLXXKF01                                   
*                                                                               
* XXKG-PCB - PRC-STYR-TABELL (HTR4445)                                          
         PCB   TYPE=DB,DBDNAME=WLXXKG,PROCOPT=GOT,KEYLEN=37,POS=S               
         SENSEG NAME=WLXXKG01,PARENT=0                                          
         SENSEG NAME=WLXXKG11,PARENT=WLXXKG01                                   
*                                                                               
* XXKH-PCB - PRC TABELL (HTR4447)                                               
         PCB   TYPE=DB,DBDNAME=WLXXKH,PROCOPT=GOT,KEYLEN=35,POS=S               
         SENSEG NAME=WLXXKH01,PARENT=0                                          
         SENSEG NAME=WLXXKH11,PARENT=WLXXKH01                                   
*                                                                               
* XXKI-PCB - PTID TABELL (HTR4451)                                              
         PCB   TYPE=DB,DBDNAME=WLXXKI,PROCOPT=GOT,KEYLEN=31,POS=S               
         SENSEG NAME=WLXXKI01,PARENT=0                                          
         SENSEG NAME=WLXXKI11,PARENT=WLXXKI01                                   
*                                                                               
* XXKP-PCB - PRODUKTIONSNR (HTR4525)                                            
         PCB   TYPE=DB,DBDNAME=WLXXKP,PROCOPT=G,KEYLEN=35,POS=S                 
         SENSEG NAME=WLXXKP01,PARENT=0,PROCOPT=GR                               
         SENSEG NAME=WLXXKP11,PARENT=WLXXKP01,PROCOPT=GR                        
*                                                                               
* WDB2-PCB - KUNDREGISTER GODSMOTTAGARE WDB2                                    
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
* WDB6-PCB - DC-REGISTER WDB6                                                   
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
* AVSO-WDP7-PCB - USERBAS                                                       
         PCB   TYPE=DB,DBDNAME=WDP7,PROCOPT=G,KEYLEN=08,POS=S                   
         SENSEG NAME=WDP701,PARENT=0,PROCOPT=GR                                 
*                                                                               
******** SUBMODUL    W411TRAN  BERÄKNING TRANSPORTAVG. TID ********             
*                                                                               
* TRAN-XXKB-PCB - TRANSPORTAVGÅNGAR WDR1 IDHTYP=4433                            
         PCB    TYPE=DB,DBDNAME=WLXXKB,PROCOPT=GOT,KEYLEN=40,POS=S              
         SENSEG NAME=WLXXKB01,PARENT=0                                          
         SENSEG NAME=WLXXKB11,PARENT=WLXXKB01                                   
*                                                                               
* ORDN-ORQL-PCB - ORDERHUVUD WDQ2C                                              
         PCB   TYPE=DB,DBDNAME=WLORQL,PROCOPT=GOT,KEYLEN=17,POS=S               
         SENSEG NAME=WLORQL01,PARENT=0                                          
*                                                                               
* ORDN-PROC-PCB - PROFORMA ORDERHUVUD WDE8                                      
         PCB   TYPE=DB,DBDNAME=WLPROC,PROCOPT=GOT,KEYLEN=17,POS=S               
         SENSEG NAME=WLPROC01,PARENT=0                                          
*                                                                               
* ORDN-ORQI-PCB - ORDERHUVUD WDQ2                                               
         PCB   TYPE=DB,DBDNAME=WLORQI,PROCOPT=GOT,KEYLEN=04,POS=S               
         SENSEG NAME=WLORQI01,PARENT=0                                          
*                                                                               
* ORDN-WDQ3-PCB - ORDERDELAR KÖ                                                 
         PCB   TYPE=DB,DBDNAME=WDQ3D,PROCOPT=GOT,KEYLEN=12,POS=S                
         SENSEG NAME=WDQ3D1,PARENT=0                                            
*                                                                               
******** SUBMODUL   W335PRQU  UPPDATERA PRISFRÅGA ********                      
*                                                                               
* PRQU-WDG2-PCB - VALUTAREGISTER  WDG2                                          
         PCB   TYPE=DB,DBDNAME=WDG2,PROCOPT=GOT,KEYLEN=37,POS=S                 
         SENSEG NAME=WDG201,PARENT=0                                            
         SENSEG NAME=WDGX9306,PARENT=WDG201                                     
         SENSEG NAME=WDGX9308,PARENT=WDGX9306                                   
*                                                                               
* PRQU-WDC7-PCB - UPPDATERA PRISFRÅGA WDC7                                      
         PCB   TYPE=DB,DBDNAME=WDC7,PROCOPT=G,KEYLEN=33,POS=S                   
         SENSEG NAME=WDC701,PARENT=0,PROCOPT=GIRD                               
         SENSEG NAME=WDC711,PARENT=WDC701,PROCOPT=GIRD                          
*                                                                               
* PRQU-SJKO-WDK6-PCB - ARTIKELINFORMATION  WDK6                                 
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=06,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
        PSBGEN LANG=COBOL,PSBNAME=W40245                                        
        END                                                                     
