*                                                                               
* DISP-PCB - START AV DISPATCHER-PGM W0069300 *******************               
         PCB   TYPE=TP,NAME=W0T693X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* KOMA-PCB - KOMMUNIKATIONS DB  WDP8 ****************************               
         PCB   TYPE=DB,DBDNAME=WLKOMA,PROCOPT=G,KEYLEN=28,POS=S                 
         SENSEG NAME=WLKOMA01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLKOMA11,PARENT=WLKOMA01,PROCOPT=GI                        
*                                                                               
* WDGX DLEVRADER FRÅN W40252                                                    
         PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=GD,KEYLEN=41,POS=S                  
         SENSEG NAME=WDR501,PARENT=0                                            
         SENSEG NAME=WDGX4252,PARENT=WDR501                                     
*                                                                               
* ORQI-PCB - ORDERHUVUDSREGISTER KÖ SEK.INDEX  WDQ2C                            
         PCB   TYPE=DB,DBDNAME=WDQ2,PROCOPT=GR,KEYLEN=19,POS=S,        *        
               PROCSEQ=WDQ2C                                                    
         SENSEG NAME=WDQ201,PARENT=0                                            
         SENSEG NAME=WDQ212,PARENT=WDQ201                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40257                                       
         END                                                                    
