*                                                                               
         PCB   TYPE=TP,NAME=W4T277,ALTRESP=NO,SAMETRM=NO,              *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB    TYPE=DB,DBDNAME=WDP7,PROCOPT=G,KEYLEN=8,POS=S                   
         SENSEG NAME=WDP701,PARENT=0,PROCOPT=GIR                                
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA6,PROCOPT=GOT,KEYLEN=41,POS=S                 
         SENSEG NAME=WDA601,PARENT=0                                            
         SENSEG NAME=WDA611,PARENT=WDA601                                       
         SENSEG NAME=WDA612,PARENT=WDA601                                       
         SENSEG NAME=WDA613,PARENT=WDA601                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA6,PROCOPT=GOT,KEYLEN=16,POS=S,       *        
               PROCSEQ=WDA6I                                                    
         SENSEG NAME=WDA601,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA6,PROCOPT=GOT,KEYLEN=16,POS=S,       *        
               PROCSEQ=WDA6J                                                    
         SENSEG NAME=WDA601,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA6,PROCOPT=GOT,KEYLEN=16,POS=S,       *        
               PROCSEQ=WDA6K                                                    
         SENSEG NAME=WDA601,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA6,PROCOPT=G,KEYLEN=16,POS=S,         *        
               PROCSEQ=WDA6L                                                    
         SENSEG NAME=WDA601,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDP5,PROCOPT=GOT,KEYLEN=21,POS=S                 
         SENSEG NAME=WDP501,PARENT=0                                            
         SENSEG NAME=WDP512,PARENT=WDP501                                       
*                                                                               
* WDD9-PCB - DC-REGISTER  WDD9                                                  
         PCB   TYPE=DB,DBDNAME=WDD9,PROCOPT=GOT,KEYLEN=20,POS=S                 
         SENSEG NAME=WDD901,PARENT=0                                            
         SENSEG NAME=WDD902,PARENT=WDD901                                       
         SENSEG NAME=WDD924,PARENT=WDD902                                       
         SENSEG NAME=WDD925,PARENT=WDD902                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40227                                       
         END                                                                    
