*                                                                               
         PCB   TYPE=DB,DBDNAME=WDC7,PROCOPT=G,KEYLEN=33,POS=S                   
         SENSEG NAME=WDC701,PARENT=0,PROCOPT=G                                  
         SENSEG NAME=WDC711,PARENT=WDC701,PROCOPT=GRD                           
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE8,PROCOPT=G,KEYLEN=17,POS=S                   
         SENSEG NAME=WDE801,PARENT=0,PROCOPT=GR                                 
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE9,PROCOPT=G,KEYLEN=11,POS=S                   
         SENSEG NAME=WDE901,PARENT=0,PROCOPT=GR                                 
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40291                                       
         END                                                                    
