*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
* ORQM-PCB - ORDERBEKRÄFTELSEREGISTER  WDQ1                                     
         PCB   TYPE=DB,DBDNAME=WLORQM,PROCOPT=GOT,KEYLEN=17,POS=S               
         SENSEG NAME=WLORQM01,PARENT=0                                          
*                                                                               
* ORQN-PCB - ORDERBEKRÄFTELSEREGISTER SEK.INDEX. WDQ1A.                         
         PCB   TYPE=DB,DBDNAME=WLORQN,PROCOPT=GOT,KEYLEN=39,POS=S               
         SENSEG NAME=WLORQN01,PARENT=0                                          
*                                                                               
* SATB-PCB - SATSSTRUKTURREGISTER WDJ1                                          
         PCB   TYPE=DB,DBDNAME=WLSATB,PROCOPT=GOTP,KEYLEN=45,POS=S,    *        
               PROCSEQ=WDJ1C                                                    
         SENSEG NAME=WLSATB11,PARENT=0                                          
         SENSEG NAME=WLSATB01,PARENT=WLSATB11                                   
*                                                                               
* ARTC-PCB - ARTIKELINFORMATION WDK6                                            
        PCB TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=6,POS=S                   
        SENSEG NAME=WLARTC01,PARENT=0                                           
        SENSEG NAME=WLARTC11,PARENT=WLARTC01                                    
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
******** SUBMODUL    W218ETA   HÄMTA TIBERANK FÖR NDC:ER ***                    
*                                                                               
* ETA-ARTS-PCB - ARTIKELREGISTRET WDK7                                          
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK712,PARENT=WDK701                                       
*                                                                               
* ETA-INLC-PCB - INLEV-HISTORIKREGISTRET WDL6                                   
         PCB   TYPE=DB,DBDNAME=WLINLC,PROCOPT=GOT,KEYLEN=21,POS=S               
         SENSEG NAME=WLINLC01,PARENT=0                                          
         SENSEG NAME=WLINLC11,PARENT=WLINLC01                                   
         SENSEG NAME=WLINLC12,PARENT=WLINLC01                                   
*                                                                               
* ETA-WDB6-PCB - DC-REGISTER  WDB6                                              
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=4,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB616,PARENT=WDB601                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD9,PROCOPT=GOT,KEYLEN=20,POS=S                 
         SENSEG NAME=WDD901,PARENT=0                                            
         SENSEG NAME=WDD902,PARENT=WDD901                                       
         SENSEG NAME=WDD905,PARENT=WDD902                                       
         SENSEG NAME=WDD924,PARENT=WDD902                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40283                                       
         END                                                                    
