*                                                                               
* DISP-MSG-PCB - FEL/KLAR MEDDELANDE TILL DISPATCHERN                           
         PCB   TYPE=TP,NAME=W0T693X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* 4262-MSG-PCB - START AV RADBEHNDLING                                          
         PCB   TYPE=TP,NAME=W4T262U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* 4263-MSG-PCB - OMSKEDULERING                                                  
         PCB   TYPE=TP,NAME=W4T263V,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* SATB-PCB - SATSSTRUKTUWREGISTER  WDJ1                                         
         PCB   TYPE=DB,DBDNAME=WLSATB,PROCOPT=GOTP,KEYLEN=45,POS=S,    *        
               PROCSEQ=WDJ1C                                                    
         SENSEG NAME=WLSATB11,PARENT=0                                          
         SENSEG NAME=WLSATB01,PARENT=WLSATB11                                   
*                                                                               
* ARTM-PCB - ARTIKELREGISTER ORDER ENTRY   WDK9                                 
         PCB   TYPE=DB,DBDNAME=WLARTM,PROCOPT=G,KEYLEN=05,POS=S                 
         SENSEG NAME=WLARTM01,PARENT=0,PROCOPT=GR                               
*                                                                               
* BENA-PCB - BENÄMNINGSREGISTER WDD3                                            
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=8,POS=S,      *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
* PROC-PCB - PROFORMAHUVUDREGISTER WDE8                                         
         PCB   TYPE=DB,DBDNAME=WLPROC,PROCOPT=G,KEYLEN=17,POS=S                 
         SENSEG NAME=WLPROC01,PARENT=0,PROCOPT=GR                               
*                                                                               
* PROD-PCB - PROFORMARADREGISTER   WDE9                                         
         PCB   TYPE=DB,DBDNAME=WLPROD,PROCOPT=G,KEYLEN=12,POS=S                 
         SENSEG NAME=WLPROD01,PARENT=0,PROCOPT=GI                               
*                                                                               
* ORQM-PCB - ORDERBEKRÄFTELSEREGISTER WDQ1                                      
         PCB   TYPE=DB,DBDNAME=WLORQM,PROCOPT=G,KEYLEN=17,POS=S                 
         SENSEG NAME=WLORQM01,PARENT=0,PROCOPT=GIRD                             
*                                                                               
* XXBU-PCB - LARMKÖ   WDR5  IDHTYP=2223                                         
         PCB   TYPE=DB,DBDNAME=WLXXBU,PROCOPT=G,KEYLEN=40,POS=S                 
         SENSEG NAME=WLXXBU01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLXXBU11,PARENT=WLXXBU01,PROCOPT=GI                        
*                                                                               
* XXBV-PCB - TIDSBEKRÄFTELSE TPO  WDR2  IDHTYP=2225                             
         PCB   TYPE=DB,DBDNAME=WLXXBV,PROCOPT=GOT,KEYLEN=31,POS=S               
         SENSEG NAME=WLXXBV01,PARENT=0                                          
         SENSEG NAME=WLXXBV11,PARENT=WLXXBV01                                   
*                                                                               
* XXBX-PCB - ÖVERSÄTTNING ANSK-LARM  WDR2  IDHTYP=2231                          
         PCB   TYPE=DB,DBDNAME=WLXXBX,PROCOPT=GOT,KEYLEN=35,POS=S               
         SENSEG NAME=WLXXBX01,PARENT=0                                          
         SENSEG NAME=WLXXBX11,PARENT=WLXXBX01                                   
*                                                                               
*                                                                               
******** SUBMODUL   W411AREG  LÄSNING ARTIKELREGISTER ********                  
*                                                                               
* AREG-WDK6-PCB - ARTIKELINFORMATION  WDK6                                      
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=06,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
* AREG-WDK7-PCB - ARTIKELINFORMATION  WDK7                                      
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=08,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK722,PARENT=WDK711                                       
*                                                                               
*                                                                               
*                                                                               
******** SUBMODUL    W411TIME  BERÄKNING TRANSPORTAVG. TID ******               
*                                                                               
* TIME-4437-PCB - ARBETSTIDS-KALENDER   WDR1  IDHTYP=4437                       
         PCB   TYPE=DB,DBDNAME=WL4437,PROCOPT=GOT,KEYLEN=38,POS=S               
         SENSEG NAME=WL443701,PARENT=0                                          
         SENSEG NAME=WL443711,PARENT=WL443701                                   
*                                                                               
*                                                                               
        PSBGEN LANG=COBOL,PSBNAME=W40263                                        
        END                                                                     
