*                                                                               
******** HUVUDMODUL  W4024100 ORDERHUVUD-EXTERN****                             
*                                                                               
* USEA-PCB - USER INFO WDP7                                                     
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
* ORQL-PCB -ORDERHUVUDSREG KÖ(WDQ2C)-SEK.INDEX TILL WDQ201                      
         PCB   TYPE=DB,DBDNAME=WLORQI,PROCOPT=GOT,KEYLEN=17,POS=S,     *        
               PROCSEQ=WDQ2C                                                    
         SENSEG NAME=WLORQI01,PARENT=0                                          
*                                                                               
* ORQI-PCB - ORDERHUVUDSREG KÖ (WDQ201)                                         
         PCB   TYPE=DB,DBDNAME=WLORQI,PROCOPT=G,KEYLEN=6,POS=S                  
         SENSEG NAME=WLORQI01,PARENT=0,PROCOPT=GIR                              
         SENSEG NAME=WLORQI12,PARENT=WLORQI01,PROCOPT=GI                        
*                                                                               
* WDB2-PCB - KUNDREGISTER GODSMOTTAGARE WDB2                                    
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
* WDB3-PCB - KUNDREGISTER DC WDB3                                               
         PCB   TYPE=DB,DBDNAME=WDB3,PROCOPT=GOT,KEYLEN=9,POS=S                  
         SENSEG NAME=WDB301,PARENT=0                                            
*                                                                               
******** SUBMODUL    W411KREG  LÄSNING KUNDREGISTER ********                    
*                                                                               
* KREG-GMTA-PCB - KUNDREGISTRET  WDB2                                           
         PCB   TYPE=DB,DBDNAME=WLGMTA,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG NAME=WLGMTA01,PARENT=0                                          
*                                                                               
* KREG-GMTB-PCB - DC-REGISTRET  WDB3                                            
         PCB   TYPE=DB,DBDNAME=WLGMTB,PROCOPT=GOT,KEYLEN=9,POS=S                
         SENSEG NAME=WLGMTB01,PARENT=0                                          
*                                                                               
* KREG-GMTC-PCB - FRAKTKOD-REGISTRET  WDB5                                      
         PCB   TYPE=DB,DBDNAME=WLGMTC,PROCOPT=GOT,KEYLEN=11,POS=S               
         SENSEG NAME=WLGMTC01,PARENT=0                                          
*                                                                               
* KREG-BETC-PCB - BETALARE-REGISTER WDB1                                        
         PCB   TYPE=DB,DBDNAME=WLBETC,PROCOPT=GOT,KEYLEN=11,POS=S               
         SENSEG NAME=WLBETC01,PARENT=0                                          
*                                                                               
******** SUBMODUL    W411OHLK  LOGISK KONTROLL ORDERHUVUD ********              
*                                                                               
* KAMPANJREGISTER WDM2                                                          
         PCB    TYPE=DB,DBDNAME=WDM2,PROCOPT=GOT,KEYLEN=6,POS=S                 
         SENSEG NAME=WDM201,PARENT=0                                            
*                                                                               
* OHLK-WDB6-PCB - DC-REGISTER  WDB6                                             
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
*                                                                               
******** SUBMODUL    W411ORDN  UTTAG AUT. ORDERNUMMER ********                  
*                                                                               
* ORDN-XXKP-PCB - AUTOMATISKA ORDERNUMMER WDR1  IDHTYP=4525                     
         PCB   TYPE=DB,DBDNAME=WLXXKP,PROCOPT=G,KEYLEN=35,POS=S                 
         SENSEG NAME=WLXXKP01,PARENT=0                                          
         SENSEG NAME=WLXXKP11,PARENT=WLXXKP01,PROCOPT=GR                        
*                                                                               
* ORDN-ORQL-PCB - ORDERHUVUDSREG KÖ (WDQ2C)-SEK.INDEX                           
         PCB   TYPE=DB,DBDNAME=WLORQL,PROCOPT=GOT,KEYLEN=17,POS=S               
         SENSEG NAME=WLORQL01,PARENT=0                                          
*                                                                               
* ORDN-PROC-PCB - PROFORMAHUVUDREG    WDE8                                      
         PCB   TYPE=DB,DBDNAME=WLPROC,PROCOPT=GOT,KEYLEN=17,POS=S               
         SENSEG NAME=WLPROC01,PARENT=0                                          
*                                                                               
* ORDN-ORQI-PCB - ORDERHUVUDSREG KÖ (WDQ201)                                    
         PCB   TYPE=DB,DBDNAME=WLORQI,PROCOPT=GOT,KEYLEN=04,POS=S               
         SENSEG NAME=WLORQI01,PARENT=0                                          
*                                                                               
******** SUBMODUL    W411TRAN  BERÄKNING TRANSPORTAVG. TID ********             
*                                                                               
* TRAN-XXKB-PCB - TRANSPORTAVGÅNGAR  WDR1  IDHTYP=4433                          
         PCB   TYPE=DB,DBDNAME=WLXXKB,PROCOPT=GOT,KEYLEN=40,POS=S               
         SENSEG NAME=WLXXKB01,PARENT=0                                          
         SENSEG NAME=WLXXKB11,PARENT=WLXXKB01                                   
*                                                                               
******** SUBMODUL    W411OHLK  LOGISK KONTROLL ORDERHUVUD ********              
*                                                                               
* OHLK-SAPC-PCB - KONTROLLREGISTER KONTERINGAR WDH3                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLSAPC,PROCOPT=GOT,KEYLEN=17,POS=S               
         SENSEG NAME=WLSAPC01,PARENT=0                                          
*                                                                               
******** SUBMODUL    W411OHKK  KONSOLIDERINGSKONTROLL     ********              
* OHKK-WDQ2-PCB - ORDERHUVUDSREG KÖ                                             
         PCB   TYPE=DB,DBDNAME=WDQ2,PROCOPT=GOT,KEYLEN=10,POS=S,       *        
               PROCSEQ=WDQ2E                                                    
         SENSEG NAME=WDQ201,PARENT=0                                            
         SENSEG NAME=WDQ212,PARENT=WDQ201                                       
*                                                                               
* OHKK-WDQ2-UPD-PCB - ORDERHUVUDSREG KÖ                                         
         PCB   TYPE=DB,DBDNAME=WDQ2,PROCOPT=G,KEYLEN=6,POS=S                    
         SENSEG NAME=WDQ201,PARENT=0,PROCOPT=GR                                 
         SENSEG NAME=WDQ212,PARENT=WDQ201,PROCOPT=GR                            
*                                                                               
* OHKK-WDQ2C-PCB    - ORDERHUVUDSREG KÖ                                         
         PCB   TYPE=DB,DBDNAME=WDQ2C,PROCOPT=GOT,KEYLEN=21,POS=S                
         SENSEG NAME=WDQ2C1,PARENT=0                                            
*                                                                               
* OHKK-GMTA-PCB - KUNDREGISTRET  WDB2                                           
         PCB   TYPE=DB,DBDNAME=WLGMTA,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG NAME=WLGMTA01,PARENT=0                                          
*                                                                               
* OHKK-GMTB-PCB - DC-REGISTRET  WDB3                                            
         PCB   TYPE=DB,DBDNAME=WLGMTB,PROCOPT=GOT,KEYLEN=9,POS=S                
         SENSEG NAME=WLGMTB01,PARENT=0                                          
*                                                                               
* OHKK-GMTC-PCB - FRAKTKOD-REGISTRET  WDB5                                      
         PCB   TYPE=DB,DBDNAME=WLGMTC,PROCOPT=GOT,KEYLEN=11,POS=S               
         SENSEG NAME=WLGMTC01,PARENT=0                                          
*                                                                               
* OHKK-BETC-PCB - BETALARE-REGISTER WDB1                                        
         PCB   TYPE=DB,DBDNAME=WLBETC,PROCOPT=GOT,KEYLEN=11,POS=S               
         SENSEG NAME=WLBETC01,PARENT=0                                          
*                                                                               
* OHKK-WDB2-PCB - KUNDREGISTRET                                                 
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
* OHKK-WDB3-PCB - DC-REGISTRET                                                  
         PCB   TYPE=DB,DBDNAME=WDB3,PROCOPT=GOT,KEYLEN=9,POS=S                  
         SENSEG NAME=WDB301,PARENT=0                                            
*                                                                               
* OHKK-WDB5-PCB - FRAKTKOD-REGISTRET                                            
         PCB   TYPE=DB,DBDNAME=WDB5,PROCOPT=GOT,KEYLEN=11,POS=S                 
         SENSEG NAME=WDB501,PARENT=0                                            
*                                                                               
* OHKK-WDP7-PCB - USER INFO                                                     
         PCB   TYPE=DB,DBDNAME=WDP7,PROCOPT=GOT,KEYLEN=8,POS=S                  
         SENSEG NAME=WDP701,PARENT=0                                            
*                                                                               
* OHKK-XXKB-PCB - TRANSPORTAVGÅNGAR  WDR1  IDHTYP=4433                          
         PCB   TYPE=DB,DBDNAME=WLXXKB,PROCOPT=GOT,KEYLEN=40,POS=S               
         SENSEG NAME=WLXXKB01,PARENT=0                                          
         SENSEG NAME=WLXXKB11,PARENT=WLXXKB01                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40241                                       
         END                                                                    
