*                                                                               
* AVSR-ALT-PCB                                                                  
         PCB   TYPE=TP,NAME=,ALTRESP=NO,SAMETRM=NO,                    *        
               MODIFY=YES,EXPRESS=NO                                            
*                                                                               
* ALT-PCB TRANS TILL PGM W3039100                                               
PRQRY    PCB   TYPE=TP,NAME=W30391X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*                                                                               
******** HUVUDMODUL  W4023200 *********                                         
*                                                                               
* 4233-MSG-PCB - START AV BILD 4233-SVARSBILD                                   
         PCB   TYPE=TP,NAME=W4T233,ALTRESP=NO,SAMETRM=NO,              *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* USEA-PCB                                                                      
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GOT,KEYLEN=8,POS=S                
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
* ORQM-PCB - ORDERBEKRÄFTELSEREGISTER   WDQ1                                    
         PCB   TYPE=DB,DBDNAME=WLORQM,PROCOPT=G,KEYLEN=17,POS=S                 
         SENSEG NAME=WLORQM01,PARENT=0,PROCOPT=GI                               
*                                                                               
* ORQI-PCB - ORDERHUVUDSREGISTER KÖ SEK.INDEX  WDQ2C                            
         PCB   TYPE=DB,DBDNAME=WLORQI,PROCOPT=GOT,KEYLEN=23,POS=S,     *        
               PROCSEQ=WDQ2C                                                    
         SENSEG NAME=WLORQI01,PARENT=0                                          
         SENSEG NAME=WLORQI12,PARENT=WLORQI01                                   
*                                                                               
* ORQF-PCB - ORDERRADSREGISTER KÖ WDQ4                                          
         PCB   TYPE=DB,DBDNAME=WLORQF,PROCOPT=G,KEYLEN=20,POS=S                 
         SENSEG NAME=WLORQF01,PARENT=0,PROCOPT=GI                               
*                                                                               
* ARTM-PCB - ARTIKELREGISTER ORDER ENTRY   WDK9                                 
         PCB   TYPE=DB,DBDNAME=WLARTM,PROCOPT=G,KEYLEN=05,POS=S                 
         SENSEG NAME=WLARTM01,PARENT=0,PROCOPT=GR                               
*                                                                               
* WDK7-PCB - ARTIKELREGISTER WDK7                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=07,POS=S                   
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701,PROCOPT=GR                            
*                                                                               
* 4541-PCB - ORDERRADER VORKÖN        WDR4                                      
         PCB    TYPE=DB,DBDNAME=WDR4,PROCOPT=G,KEYLEN=46,POS=S                  
         SENSEG NAME=WDR401,PARENT=0                                            
         SENSEG NAME=WDGX4542,PARENT=WDR401,PROCOPT=GR                          
*                                                                               
* WDB2-PCB - KUNDREGISTER GODSMOTTAGARE WDB2                                    
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
* WDB1-PCB - KUNDREGISTER BETAL WDB1                                            
         PCB   TYPE=DB,DBDNAME=WDB1,PROCOPT=GOT,KEYLEN=11,POS=S                 
         SENSEG NAME=WDB101,PARENT=0                                            
*                                                                               
* WDB6-PCB - DC-REGISTER WDB6                                                   
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
* WDK6-PCB - ARTIKELREGISTER WDK6                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=G,KEYLEN=19,POS=S                   
         SENSEG NAME=WDK601,PARENT=0,PROCOPT=G                                  
         SENSEG NAME=WDK611,PARENT=WDK601,PROCOPT=GR                            
         SENSEG NAME=WDK621,PARENT=WDK611,PROCOPT=G                             
*                                                                               
* WDA6F1-PCB - VOR REGISTER NYTT SEKF WDA6F1                                    
         PCB   TYPE=DB,DBDNAME=WDA6F,PROCOPT=GOT,KEYLEN=16,POS=S                
         SENSEG NAME=WDA6F1,PARENT=0                                            
*                                                                               
* WDA6F-PCB -  VOR REGISTER NYTT WDA6                                           
         PCB   TYPE=DB,DBDNAME=WDA6,PROCOPT=G,KEYLEN=16,POS=S,         *        
               PROCSEQ=WDA6F                                                    
         SENSEG NAME=WDA601,PARENT=0,PROCOPT=GR                                 
*                                                                               
* WDR6-PCB - LOG-TRANS TO BATCH                                                 
         PCB    TYPE=DB,DBDNAME=WDR6,PROCOPT=G,KEYLEN=27,POS=S                  
         SENSEG NAME=WDR601,PARENT=0,PROCOPT=GI                                 
*                                                                               
*                                                                               
******** SUBMODUL   W335PRIS  PRISTILLÄMPNING ********                          
*                                                                               
* PRIS-ARTC-PCB - ARTIKELINFORMATION  WDK6                                      
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=19,POS=S               
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
         SENSEG NAME=WLARTC21,PARENT=WLARTC11                                   
*                                                                               
* PRIS-WDK7-PCB - ARTIKELINFO                                                   
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=20,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK724,PARENT=WDK711                                       
         SENSEG NAME=WDK712,PARENT=WDK701                                       
*                                                                               
* PRIS-GMTA-PCB - KUNDREGISTER GODSMOTTAGARE WDB2                               
         PCB   TYPE=DB,DBDNAME=WLGMTA,PROCOPT=GOT,KEYLEN=07,POS=S               
         SENSEG NAME=WLGMTA01,PARENT=0                                          
*                                                                               
* PRIS-BETA-PCB - BETALARREGISTRET WDB1                                         
         PCB   TYPE=DB,DBDNAME=WLBETC,PROCOPT=GOT,KEYLEN=11,POS=S               
         SENSEG  NAME=WLBETC01,PARENT=0                                         
*                                                                               
* PRIS-PRIA-PCB - RETAILREGISTRET WDC1                                          
         PCB     TYPE=DB,DBDNAME=WLPRIA,PROCOPT=GOT,KEYLEN=6,POS=S              
         SENSEG  NAME=WLPRIA01,PARENT=0                                         
*                                                                               
* PRIS-PRIB-PCB - PRIS / RABATTREGISTER WDC2                                    
         PCB     TYPE=DB,DBDNAME=WLPRIB,PROCOPT=GOT,KEYLEN=16,POS=S             
         SENSEG  NAME=WLPRIB01,PARENT=0                                         
         SENSEG  NAME=WLPRIB11,PARENT=WLPRIB01                                  
         SENSEG  NAME=WLPRIB12,PARENT=WLPRIB01                                  
         SENSEG  NAME=WLPRIB13,PARENT=WLPRIB01                                  
*                                                                               
* PRIS-COST-WDK6-PCB - ARTIKELINFORMATION WDK6                                  
         PCB     TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=19,POS=S               
         SENSEG  NAME=WDK601,PARENT=0                                           
         SENSEG  NAME=WDK611,PARENT=WDK601                                      
         SENSEG  NAME=WDK621,PARENT=WDK611                                      
*                                                                               
* PRIS-COST-WDK7-PCB - ARTIKELINFORMATION WDK7                                  
         PCB     TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG  NAME=WDK701,PARENT=0                                           
         SENSEG  NAME=WDK711,PARENT=WDK701                                      
*                                                                               
* PRIS-COST-WDF1-PCB - LEVERANTÖRSINFO WDF1                                     
         PCB     TYPE=DB,DBDNAME=WDF1,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG  NAME=WDF101,PARENT=0                                           
         SENSEG  NAME=WDF102,PARENT=WDF101                                      
*                                                                               
* PRIS-COST-WDG2-PCB - VALUTAINFORMATION WDG2                                   
         PCB   TYPE=DB,DBDNAME=WDG2,PROCOPT=GOT,KEYLEN=37,POS=S                 
         SENSEG NAME=WDG201,PARENT=0                                            
         SENSEG NAME=WDGX9306,PARENT=WDG201                                     
         SENSEG NAME=WDGX9308,PARENT=WDGX9306                                   
*                                                                               
* PRIS-COST-WDK72-PCB - ARTIKELREGISTER DC                                      
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=20,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK724,PARENT=WDK711                                       
*                                                                               
* PRIS-COST-WDB6-PCB - DC-REGISTER  WDB6                                        
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=3,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB617,PARENT=WDB601                                       
*                                                                               
******** SUBMODUL   W335PRNO  PRISFRÅGENUMMER ***********                       
*                                                                               
* PRNO-3107-PCB - PRISFRÅGENUMMER       WDR1  IDHTYP=3107                       
         PCB   TYPE=DB,DBDNAME=WDR1,PROCOPT=G,KEYLEN=31,POS=S                   
         SENSEG NAME=WDR101,PARENT=0                                            
         SENSEG NAME=WDGX3108,PARENT=WDR101,PROCOPT=GR                          
*                                                                               
*                                                                               
******** SUBMODUL   W335PRQU  UPPDATERA PRISFRÅGA ********                      
*                                                                               
* PRQU-WDG2-PCB - VALUTAREGISTER  WDG2                                          
         PCB   TYPE=DB,DBDNAME=WDG2,PROCOPT=GOT,KEYLEN=37,POS=S                 
         SENSEG NAME=WDG201,PARENT=0                                            
         SENSEG NAME=WDGX9306,PARENT=WDG201                                     
         SENSEG NAME=WDGX9308,PARENT=WDGX9306                                   
*                                                                               
* PRQU-WDC7-PCB - UPPDATERA PRISFRÅGA WDC7                                      
         PCB   TYPE=DB,DBDNAME=WDC7,PROCOPT=G,KEYLEN=33,POS=S                   
         SENSEG NAME=WDC701,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDC711,PARENT=WDC701,PROCOPT=GIRD                          
*                                                                               
* PRQU-SJKO-WDK6-PCB - ARTIKELINFORMATION  WDK6                                 
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=06,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
******** SUBMODUL   W411AREG  LÄSNING ARTIKELREGISTER ********                  
*                                                                               
* AREG-WDK6-PCB - ARTIKELINFORMATION  WDK6                                      
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=06,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
* AREG-WDK7-PCB - ARTIKELINFORMATION  WDK7                                      
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=08,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK722,PARENT=WDK711                                       
*                                                                               
*                                                                               
******* SUBMODUL   W411NDCA  KONTROLL PRELIMINÄR AVBOKNING ********             
*                                                                               
* NDCA-USEA-PCB - USER INFO WDP7                                                
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GOT,KEYLEN=8,POS=S                
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
* NDCA-WDK7-PCB - ARTIKELINFORMATION  WDK7                                      
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=08,POS=S                   
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701,PROCOPT=GR                            
         SENSEG NAME=WDK722,PARENT=WDK711                                       
         SENSEG NAME=WDK712,PARENT=WDK701,PROCOPT=GR                            
*                                                                               
* NDCA-WDL6-PCB - ARTIKELREGISTER INFO WDL6                                     
         PCB   TYPE=DB,DBDNAME=WDL6,PROCOPT=GOT,KEYLEN=21,POS=S                 
         SENSEG NAME=WDL601,PARENT=0                                            
         SENSEG NAME=WDL611,PARENT=WDL601                                       
*                                                                               
* NDCA-WDB6-PCB - DC-REGISTER INFO WDB6                                         
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=02,POS=S                 
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
*                                                                               
*                                                                               
******** SUBMODUL   W411SDCA  LÄSNING ARTIKELREGISTER ********                  
*                                                                               
* SDCA-ARTS-PCB - ARTIKELINFORMATION  WDK7                                      
         PCB   TYPE=DB,DBDNAME=WLARTS,PROCOPT=G,KEYLEN=07,POS=S                 
         SENSEG NAME=WLARTS01,PARENT=0                                          
         SENSEG NAME=WLARTS11,PARENT=WLARTS01,PROCOPT=GR                        
*                                                                               
* SDCA-WDB6-PCB - DC-REGISTER WDB6                                              
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=4,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB616,PARENT=WDB601                                       
*                                                                               
* SDCA-WDK9-PCB - DC-REGISTER WDK9                                              
         PCB   TYPE=DB,DBDNAME=WDK9,PROCOPT=GOT,KEYLEN=5,POS=S                  
         SENSEG NAME=WDK901,PARENT=0                                            
*                                                                               
* SDCA-WDR6-PCB - LOG-TRANS TO BATCH                                            
         PCB    TYPE=DB,DBDNAME=WDR6,PROCOPT=G,KEYLEN=27,POS=S                  
         SENSEG NAME=WDR601,PARENT=0,PROCOPT=GI                                 
*                                                                               
* SDCA-WDK6-PCB - ARTIKELINFORMATION WDK6                                       
         PCB    TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=6,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
* SDCA-WDQ4B-PCB   ORDERRAD ARTIKEL                                             
         PCB   TYPE=DB,DBDNAME=WDQ4B,PROCOPT=GOT,KEYLEN=37,POS=S                
         SENSEG NAME=WDQ4B1,PARENT=0                                            
*                                                                               
* SDCA-WDQ2-PCB   ORDERHUVUD WDQ2                                               
         PCB    TYPE=DB,DBDNAME=WDQ2,PROCOPT=GOT,KEYLEN=4,POS=S                 
         SENSEG NAME=WDQ201,PARENT=0                                            
*                                                                               
* SDCA-WDQ4-PCB   ORDERRAD   WDQ4                                               
         PCB    TYPE=DB,DBDNAME=WDQ4,PROCOPT=GOT,KEYLEN=20,POS=S                
         SENSEG NAME=WDQ401,PARENT=0                                            
*                                                                               
*                                                                               
******* SUBMODULE W005WDK7 ADDING WDK711 FOR SDCA ****                          
*                                                                               
* SDCA-WDB6-2-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
* SDCA-WDK6-2-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=6,POS=S                  
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
* SDCA-WDK7-2-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=7,POS=S                    
         SENSEG NAME=WDK701,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDK711,PARENT=WDK701,PROCOPT=GI                            
         SENSEG NAME=WDK712,PARENT=WDK701,PROCOPT=GI                            
*                                                                               
* SDCA-WDK7-3-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=08,POS=S                   
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK721,PARENT=WDK711,PROCOPT=GI                            
*                                                                               
*                                                                               
******** SUBMODUL    W413AVSR  WOPS RADBEHANDLING ********                      
*                                                                               
* AVSR-ORQI-PCB - ORDERHUVUD WDQ2                                               
         PCB    TYPE=DB,DBDNAME=WLORQI,PROCOPT=G,KEYLEN=11,POS=S                
         SENSEG NAME=WLORQI01,PARENT=0                                          
         SENSEG NAME=WLORQI11,PARENT=WLORQI01,PROCOPT=GIRD                      
         SENSEG NAME=WLORQI12,PARENT=WLORQI01,PROCOPT=GIR                       
         SENSEG NAME=WLORQI21,PARENT=WLORQI12,PROCOPT=GIRD                      
*                                                                               
* AVSR-GMTB-PCB - DC-REGISTER WDB3                                              
         PCB    TYPE=DB,DBDNAME=WLGMTB,PROCOPT=GOT,KEYLEN=9,POS=S               
         SENSEG NAME=WLGMTB01,PARENT=0                                          
*                                                                               
* AVSR-GMTC-PCB - FK-REGISTER WDB5                                              
         PCB    TYPE=DB,DBDNAME=WLGMTC,PROCOPT=GOT,KEYLEN=11,POS=S              
         SENSEG NAME=WLGMTC01,PARENT=0                                          
*                                                                               
* AVSR-WDB2-PCB                                                                 
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
******** SUBMODUL    W411TRAN  BERÄKNING TRANSPORTAVG. TID ********             
*                                                                               
* TRAN-XXKB-PCB - TRANSPORTAVGÅNGAR WDR1 IDHTYP=4433                            
         PCB    TYPE=DB,DBDNAME=WLXXKB,PROCOPT=GOT,KEYLEN=40,POS=S              
         SENSEG NAME=WLXXKB01,PARENT=0                                          
         SENSEG NAME=WLXXKB11,PARENT=WLXXKB01                                   
*                                                                               
******** SUBMODUL   W411SPAR  KONTROLL DIV SPÄRRAR    ********                  
*                                                                               
* SPAR-WDF8-PCB SPÄRREGLER                                                      
         PCB   TYPE=DB,DBDNAME=WDF8,PROCOPT=GOT,KEYLEN=24,POS=S                 
         SENSEG NAME=WDF801,PARENT=0                                            
         SENSEG NAME=WDF811,PARENT=WDF801                                       
         SENSEG NAME=WDF812,PARENT=WDF801                                       
         SENSEG NAME=WDF813,PARENT=WDF801                                       
         SENSEG NAME=WDF814,PARENT=WDF801                                       
         SENSEG NAME=WDF815,PARENT=WDF801                                       
*                                                                               
* SPAR-WDF8A-PCB SPÄRREGLER (SEKUNDÄRINDEX DISTR/KUND INGÅNG)                   
         PCB   TYPE=DB,DBDNAME=WDF8A,PROCOPT=GOT,KEYLEN=24,POS=S                
         SENSEG NAME=WDF8A1,PARENT=0                                            
*                                                                               
* SPAR-WDK6-PCB - ARTIKELREGISTER                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=11,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
******* SUBMODUL   W411XDCA  KONTROLL PRELIMINÄR AVBOKNING TEST ***             
*                                                                               
* XDCA-USEA-PCB - USER INFO WDP7                                                
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GOT,KEYLEN=8,POS=S                
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
* XDCA-WDB6-PCB - DC-REGISTER INFO WDB6                                         
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=09,POS=S                 
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB616,PARENT=WDB601                                       
*                                                                               
* XDCA-WDK6-PCB - PART INFO                                                     
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=6,POS=S                  
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
* XDCA-WDK7-PCB - PART INFO                                                     
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=08,POS=S                   
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701,PROCOPT=GR                            
         SENSEG NAME=WDK722,PARENT=WDK711                                       
         SENSEG NAME=WDK712,PARENT=WDK701                                       
*                                                                               
* XDCA-WDK9-PCB PART INFO ORDER ENTRY                                           
         PCB   TYPE=DB,DBDNAME=WDK9,PROCOPT=GOT,KEYLEN=05,POS=S                 
         SENSEG NAME=WDK901,PARENT=0                                            
*                                                                               
* XDCA-WDL6-PCB - PART INFO                                                     
         PCB   TYPE=DB,DBDNAME=WDL6,PROCOPT=GOT,KEYLEN=21,POS=S                 
         SENSEG NAME=WDL601,PARENT=0                                            
         SENSEG NAME=WDL611,PARENT=WDL601                                       
*                                                                               
* XDCA-WDQ4B-PCB   ORDER LINE PART                                              
         PCB   TYPE=DB,DBDNAME=WDQ4B,PROCOPT=GOT,KEYLEN=37,POS=S                
         SENSEG NAME=WDQ4B1,PARENT=0                                            
*                                                                               
* XDCA-WDQ2-PCB   ORDER HEAD                                                    
         PCB    TYPE=DB,DBDNAME=WDQ2,PROCOPT=GOT,KEYLEN=4,POS=S                 
         SENSEG NAME=WDQ201,PARENT=0                                            
*                                                                               
* XDCA-WDQ4-PCB   ORDERRAD   WDQ4                                               
         PCB    TYPE=DB,DBDNAME=WDQ4,PROCOPT=GOT,KEYLEN=20,POS=S                
         SENSEG NAME=WDQ401,PARENT=0                                            
*                                                                               
* XDCA-WDR6-PCB - LOG-TRANS TO BATCH                                            
         PCB    TYPE=DB,DBDNAME=WDR6,PROCOPT=G,KEYLEN=27,POS=S                  
         SENSEG NAME=WDR601,PARENT=0,PROCOPT=GI                                 
*                                                                               
*                                                                               
******* SUBMODULE W005WDK7 ADDING WDK711 ***                                    
*                                                                               
* XDCA-WDB6-2-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
* XDCA-WDK6-2-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=6,POS=S                  
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
* XDCA-WDK7-2-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=7,POS=S                    
         SENSEG NAME=WDK701,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDK711,PARENT=WDK701,PROCOPT=GI                            
         SENSEG NAME=WDK712,PARENT=WDK701,PROCOPT=GI                            
*                                                                               
* XDCA-WDK7-3-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=08,POS=S                   
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK721,PARENT=WDK711,PROCOPT=GI                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40232                                       
         END                                                                    
