*                                                                               
*                                                                               
* ALT-PCB - START AV 4293-TRANSSKAPARE                                          
         PCB   TYPE=TP,NAME=W4T293X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
* WDQ2-PCB                                                                      
         PCB   TYPE=DB,DBDNAME=WDQ2,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDQ201,PARENT=0                                            
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
******** SUBMODUL    W413AVSO  WOPS ORDERAVSLUT **********                      
*                                                                               
* AVSO-WDE6-PCB - ORDERDEL    WDE6                                              
         PCB   TYPE=DB,DBDNAME=WDE6,PROCOPT=G,KEYLEN=04,POS=S                   
         SENSEG NAME=WDE601,PARENT=0,PROCOPT=GR                                 
*                                                                               
* AVSO-ORQA-PCB - ORDERDELSREGISTER KÖ   WDQ3                                   
         PCB   TYPE=DB,DBDNAME=WLORQA,PROCOPT=G,KEYLEN=12,POS=S                 
         SENSEG NAME=WLORQA01,PARENT=0,PROCOPT=GIRD                             
*                                                                               
* AVSO-WDQ2-PCB - ORDERHUVUDSREGISTER KÖ   WDQ2                                 
         PCB   TYPE=DB,DBDNAME=WDQ2,PROCOPT=G,KEYLEN=11,POS=S                   
         SENSEG NAME=WDQ201,PARENT=0                                            
         SENSEG NAME=WDQ211,PARENT=WDQ201                                       
         SENSEG NAME=WDQ212,PARENT=WDQ201,PROCOPT=GR                            
         SENSEG NAME=WDQ221,PARENT=WDQ212,PROCOPT=GRD                           
*                                                                               
* AVSO-GMTB-PCB - KUNDREGISTER  WDB3                                            
         PCB   TYPE=DB,DBDNAME=WDB3,PROCOPT=GOT,KEYLEN=09,POS=S                 
         SENSEG NAME=WDB301,PARENT=0                                            
*                                                                               
* AVSO-XXKA-PCB - TRANSPORTTABELL   WDR1   HTYP=4431                            
         PCB   TYPE=DB,DBDNAME=WLXXKA,PROCOPT=GOT,KEYLEN=35,POS=S               
         SENSEG NAME=WLXXKA01,PARENT=0                                          
         SENSEG NAME=WLXXKA11,PARENT=WLXXKA01                                   
*                                                                               
* AVSO-4437-PCB - ARBETSTIDS-KALENDER   WDR1  IDHTYP=4437                       
         PCB   TYPE=DB,DBDNAME=WL4437,PROCOPT=GOT,KEYLEN=38,POS=S               
         SENSEG NAME=WL443701,PARENT=0                                          
         SENSEG NAME=WL443711,PARENT=WL443701                                   
*                                                                               
* AVSO-XXKE-PCB - HUVUDLAGEROMRÅDESTABELL  WDR1   HTYP=4441                     
         PCB   TYPE=DB,DBDNAME=WLXXKE,PROCOPT=GOT,KEYLEN=40,POS=S               
         SENSEG NAME=WLXXKE01,PARENT=0                                          
         SENSEG NAME=WLXXKE11,PARENT=WLXXKE01                                   
*                                                                               
* AVSO-XXKF-PCB - PRODUKTIONSKLASSTABELL  WDR1  HTYP=4443                       
         PCB   TYPE=DB,DBDNAME=WLXXKF,PROCOPT=GOT,KEYLEN=35,POS=S               
         SENSEG NAME=WLXXKF01,PARENT=0                                          
         SENSEG NAME=WLXXKF11,PARENT=WLXXKF01                                   
*                                                                               
* AVSO-XXKG-PCB - PROD.KANALSSTYRTABELL  WDR1  HTYP=4445                        
         PCB   TYPE=DB,DBDNAME=WLXXKG,PROCOPT=GOT,KEYLEN=35,POS=S               
         SENSEG NAME=WLXXKG01,PARENT=0                                          
         SENSEG NAME=WLXXKG11,PARENT=WLXXKG01                                   
*                                                                               
* AVSO-XXKH-PCB - PRODUKTIONSKANALSTABELL  WDR1  HTYP=4447                      
         PCB   TYPE=DB,DBDNAME=WLXXKH,PROCOPT=GOT,KEYLEN=35,POS=S               
         SENSEG NAME=WLXXKH01,PARENT=0                                          
         SENSEG NAME=WLXXKH11,PARENT=WLXXKH01                                   
*                                                                               
* AVSO-XXKI-PCB - PRODUKTIONSTIDTABELL  WDR1  HTYP=4451                         
         PCB   TYPE=DB,DBDNAME=WLXXKI,PROCOPT=GOT,KEYLEN=31,POS=S               
         SENSEG NAME=WLXXKI01,PARENT=0                                          
         SENSEG NAME=WLXXKI11,PARENT=WLXXKI01                                   
*                                                                               
* AVSO-XXKP-PCB - ORDER&PRODUKTIONSNUMMER  WDR1  HTYP=4525                      
         PCB   TYPE=DB,DBDNAME=WLXXKP,PROCOPT=G,KEYLEN=35,POS=S                 
         SENSEG NAME=WLXXKP01,PARENT=0                                          
         SENSEG NAME=WLXXKP11,PARENT=WLXXKP01,PROCOPT=GR                        
*                                                                               
* AVSO-WDB2-PCB - KUNDREGISTER GODSMOTTAGARE WDB2                               
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
* AVSO-WDB6-PCB - DC-REGISTER WDB6                                              
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
* AVSO-WDP7                                                                     
         PCB   TYPE=DB,DBDNAME=WDP7,PROCOPT=GOT,KEYLEN=8,POS=S                  
         SENSEG NAME=WDP701,PARENT=0                                            
*                                                                               
* TRAN-XXKB-PCB - TRANSPORTAVGÅNGAR  WDR1  IDHTYP=4433, 4434                    
*                                          WDR130                               
         PCB   TYPE=DB,DBDNAME=WLXXKB,PROCOPT=GOT,KEYLEN=40,POS=S               
         SENSEG NAME=WLXXKB01,PARENT=0                                          
         SENSEG NAME=WLXXKB11,PARENT=WLXXKB01                                   
*                                                                               
* ORDN-ORQL-PCB - ORDERHUVUD WDQ2C                                              
         PCB   TYPE=DB,DBDNAME=WLORQL,PROCOPT=GOT,KEYLEN=17,POS=S               
         SENSEG NAME=WLORQL01,PARENT=0                                          
*                                                                               
* ORDN-PROC-PCB - PROFORMA ORDERHUVUD WDE8                                      
         PCB   TYPE=DB,DBDNAME=WLPROC,PROCOPT=GOT,KEYLEN=17,POS=S               
         SENSEG NAME=WLPROC01,PARENT=0                                          
*                                                                               
* ORDN-ORQI-PCB - ORDERHUVUD WDQ2                                               
         PCB   TYPE=DB,DBDNAME=WLORQI,PROCOPT=GOT,KEYLEN=04,POS=S               
         SENSEG NAME=WLORQI01,PARENT=0                                          
*                                                                               
* ORDN-WDQ3-PCB - ORDERDELAR KÖ                                                 
         PCB   TYPE=DB,DBDNAME=WDQ3D,PROCOPT=GOT,KEYLEN=12,POS=S                
         SENSEG NAME=WDQ3D1,PARENT=0                                            
*                                                                               
        PSBGEN LANG=COBOL,PSBNAME=W40298                                        
        END                                                                     
