*                                                                               
*        PCB FÖR PRINTERN                                                       
         PCB   TYPE=TP,LTERM=,ALTRESP=NO,SAMETRM=NO,                   *        
               MODIFY=YES,EXPRESS=NO                                            
*                                                                               
*------  NEDANSTÅENDE ÄR FÖR WZ04DAP  ---------------                           
*                                                                               
*        ONE PCB FOR EACH OUTPUT CHANNEL 1-15                                   
*        CHANNEL 0 IS FOR INTERNAL ERROR SIGNALLING                             
*                                                                               
OUT0     PCB   TYPE=TP,LTERM=,ALTRESP=NO,SAMETRM=NO,                   *        
               MODIFY=YES,EXPRESS=NO                                            
*                                                                               
OUT01    PCB   TYPE=TP,LTERM=,ALTRESP=NO,SAMETRM=NO,                   *        
               MODIFY=YES,EXPRESS=NO                                            
*                                                                               
OUT02    PCB   TYPE=TP,LTERM=,ALTRESP=NO,SAMETRM=NO,                   *        
               MODIFY=YES,EXPRESS=NO                                            
*                                                                               
OUT03    PCB   TYPE=TP,LTERM=,ALTRESP=NO,SAMETRM=NO,                   *        
               MODIFY=YES,EXPRESS=NO                                            
*                                                                               
OUT04    PCB   TYPE=TP,LTERM=,ALTRESP=NO,SAMETRM=NO,                   *        
               MODIFY=YES,EXPRESS=NO                                            
*                                                                               
OUT05    PCB   TYPE=TP,LTERM=,ALTRESP=NO,SAMETRM=NO,                   *        
               MODIFY=YES,EXPRESS=NO                                            
*                                                                               
OUT06    PCB   TYPE=TP,LTERM=,ALTRESP=NO,SAMETRM=NO,                   *        
               MODIFY=YES,EXPRESS=NO                                            
*                                                                               
OUT07    PCB   TYPE=TP,LTERM=,ALTRESP=NO,SAMETRM=NO,                   *        
               MODIFY=YES,EXPRESS=NO                                            
*                                                                               
OUT08    PCB   TYPE=TP,LTERM=,ALTRESP=NO,SAMETRM=NO,                   *        
               MODIFY=YES,EXPRESS=NO                                            
*                                                                               
OUT09    PCB   TYPE=TP,LTERM=,ALTRESP=NO,SAMETRM=NO,                   *        
               MODIFY=YES,EXPRESS=NO                                            
*                                                                               
OUT10    PCB   TYPE=TP,LTERM=,ALTRESP=NO,SAMETRM=NO,                   *        
               MODIFY=YES,EXPRESS=NO                                            
*                                                                               
OUT11    PCB   TYPE=TP,LTERM=,ALTRESP=NO,SAMETRM=NO,                   *        
               MODIFY=YES,EXPRESS=NO                                            
*                                                                               
OUT12    PCB   TYPE=TP,LTERM=,ALTRESP=NO,SAMETRM=NO,                   *        
               MODIFY=YES,EXPRESS=NO                                            
*                                                                               
OUT13    PCB   TYPE=TP,LTERM=,ALTRESP=NO,SAMETRM=NO,                   *        
               MODIFY=YES,EXPRESS=NO                                            
*                                                                               
OUT14    PCB   TYPE=TP,LTERM=,ALTRESP=NO,SAMETRM=NO,                   *        
               MODIFY=YES,EXPRESS=NO                                            
*                                                                               
OUT15    PCB   TYPE=TP,LTERM=,ALTRESP=NO,SAMETRM=NO,                   *        
               MODIFY=YES,EXPRESS=NO                                            
*                                                                               
*        -- PCB FOR ERROR SIGNAL USING D&P RULE                                 
DISTRDOC PCB   TYPE=TP,NAME=WZ0420X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*                                                                               
*                                                                               
* PROC-PCB - ORDERHUVUDSREGISTER KÖ   WDE8                                      
         PCB   TYPE=DB,DBDNAME=WLPROC,PROCOPT=GR,KEYLEN=17,POS=S                
         SENSEG NAME=WLPROC01,PARENT=0                                          
*                                                                               
* PROD-PCB - ORDERRADSREGISTER KÖ WDE9                                          
         PCB   TYPE=DB,DBDNAME=WLPROD,PROCOPT=GR,KEYLEN=12,POS=S                
         SENSEG NAME=WLPROD01,PARENT=0                                          
*                                                                               
* BENA-PCB - BENÄMNINGSREGISTER WDD3                                            
         PCB  TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=8,POS=S,       *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
* GMTA-PCB - KUNDREGISTRET  WDB2                                                
         PCB   TYPE=DB,DBDNAME=WLGMTA,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG NAME=WLGMTA01,PARENT=0                                          
*                                                                               
* GMTB-PCB - KUNDREGISTRET  WDB3                                                
         PCB   TYPE=DB,DBDNAME=WLGMTB,PROCOPT=GOT,KEYLEN=9,POS=S                
         SENSEG NAME=WLGMTB01,PARENT=0                                          
*                                                                               
* ARTC-PCB - ARTIKELINFORMATION  WDK6                                           
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=06,POS=S               
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
*                                                                               
* XXDE-PCB - FRAKTTEXT WDG7 HTYP=4732                                           
         PCB    TYPE=DB,DBDNAME=WL4732,PROCOPT=GOT,KEYLEN=31,POS=S              
         SENSEG NAME=WL473201,PARENT=0                                          
         SENSEG NAME=WL473211,PARENT=WL473201                                   
*                                                                               
* XXJJ-PCB - LEVERANSTEXT WDG7 HTYP=4735                                        
         PCB    TYPE=DB,DBDNAME=WL4735,PROCOPT=GOT,KEYLEN=31,POS=S              
         SENSEG NAME=WL473501,PARENT=0                                          
         SENSEG NAME=WL473511,PARENT=WL473501                                   
*                                                                               
* ORQISEQ-PCB - ORDERHUVUD WDQ2 VIA SEK INDEX                                   
         PCB    TYPE=DB,DBDNAME=WLORQI,PROCOPT=GOT,KEYLEN=21,POS=S,    *        
               PROCSEQ=WDQ2C                                                    
         SENSEG NAME=WLORQI01,PARENT=0                                          
         SENSEG NAME=WLORQI12,PARENT=WLORQI01                                   
         SENSEG NAME=WLORQI21,PARENT=WLORQI12                                   
*                                                                               
* ORQF-PCB - ORDERRADER WDQ4                                                    
         PCB    TYPE=DB,DBDNAME=WLORQF,PROCOPT=GOT,KEYLEN=20,POS=S              
         SENSEG NAME=WLORQF01,PARENT=0                                          
*                                                                               
* WDB1-PCB - BETALARREGISTER                                                    
         PCB   TYPE=DB,DBDNAME=WDB1,PROCOPT=GOT,KEYLEN=11,POS=S                 
         SENSEG NAME=WDB101,PARENT=0                                            
*                                                                               
* XXDB-PCB - FÖRSÄKRANSTEXTER WDG7 HTYP=4731                                    
         PCB    TYPE=DB,DBDNAME=WLXXDB,PROCOPT=GOT,KEYLEN=31,POS=S              
         SENSEG NAME=WLXXDB01,PARENT=0                                          
         SENSEG NAME=WLXXDB11,PARENT=WLXXDB01                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40295                                       
         END                                                                    
