*                                                                               
         PCB   TYPE=TP,NAME=W0T501,ALTRESP=NO,SAMETRM=NO,              *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=TP,NAME=W2T106,ALTRESP=NO,SAMETRM=NO,              *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA6,PROCOPT=GOT,KEYLEN=41,POS=S                 
         SENSEG NAME=WDA601,PARENT=0                                            
         SENSEG NAME=WDA611,PARENT=WDA601                                       
         SENSEG NAME=WDA612,PARENT=WDA601                                       
         SENSEG NAME=WDA613,PARENT=WDA601                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDP5,PROCOPT=G,KEYLEN=21,POS=S                   
         SENSEG NAME=WDP501,PARENT=0,PROCOPT=GIRD                               
         SENSEG NAME=WDP512,PARENT=WDP501,PROCOPT=GIRD                          
*                                                                               
* WDD9-PCB - DC-REGISTER  WDD9                                                  
         PCB   TYPE=DB,DBDNAME=WDD9,PROCOPT=GOT,KEYLEN=13,POS=S                 
         SENSEG NAME=WDD901,PARENT=0                                            
         SENSEG NAME=WDD902,PARENT=WDD901                                       
         SENSEG NAME=WDD925,PARENT=WDD902                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40277                                       
         END                                                                    
