*                                                                               
*                                                                               
******************************************* DISPATCHER                          
         PCB   TYPE=TP,NAME=W0T693X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*        TRANS TILL DISTRIBUTION & PRINT                                        
DISTRDOC PCB   TYPE=TP,NAME=WZ0420X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*        TRANS TILL PGM W40293    ÅTERSTART                                     
         PCB   TYPE=TP,NAME=W4T293X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*        TRANS TILL PGM W40353    FÖR UDDA ORDER                                
         PCB   TYPE=TP,NAME=W4T353X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*        TRANS TILL PGM W40695    FÖR DIREKT LEVERANSORDER                      
         PCB   TYPE=TP,NAME=W4T695X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*        TRANS TILL PGM W20109    FÖR ORDERINGÅNG                               
         PCB   TYPE=TP,NAME=W2T109X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*        TRANS TILL PGM W20191    FÖR LARM VOR                                  
         PCB   TYPE=TP,NAME=W2T191X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*        USEA-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GOT,KEYLEN=8,POS=S                
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
* WDQ2  ORDER HEAD                                                              
        PCB    TYPE=DB,DBDNAME=WDQ2,PROCOPT=GOT,KEYLEN=24,POS=S,       *        
               PROCSEQ=WDQ2C                                                    
        SENSEG NAME=WDQ201,PARENT=0                                             
*                                                                               
*        ORDERHUVUD DIREKTNYCKEL                                                
         PCB   TYPE=DB,DBDNAME=WLORQI,PROCOPT=G,KEYLEN=11,POS=S                 
         SENSEG NAME=WLORQI01,PARENT=0,PROCOPT=GR                               
         SENSEG NAME=WLORQI11,PARENT=WLORQI01                                   
         SENSEG NAME=WLORQI12,PARENT=WLORQI01,PROCOPT=GR                        
*                                                                               
*        ORDERRAD   DIREKTNYCKEL                                                
         PCB   TYPE=DB,DBDNAME=WLORQF,PROCOPT=G,KEYLEN=20,POS=S                 
         SENSEG NAME=WLORQF01,PARENT=0,PROCOPT=GR                               
*                                                                               
*        ORDERBEKRÄFTELSERAD DIREKTNYCKEL                                       
         PCB   TYPE=DB,DBDNAME=WLORQM,PROCOPT=G,KEYLEN=17,POS=S                 
         SENSEG NAME=WLORQM01,PARENT=0,PROCOPT=GR                               
*                                                                               
*        TRANSAKTIONS REGISTER                                                  
         PCB   TYPE=DB,DBDNAME=WLFILA,PROCOPT=G,KEYLEN=27,POS=S                 
         SENSEG NAME=WLFILA01,PARENT=0,PROCOPT=GI                               
*                                                                               
*        VOR REGISTER NYTT                                                      
         PCB   TYPE=DB,DBDNAME=WDA6,PROCOPT=G,KEYLEN=40,POS=S                   
         SENSEG NAME=WDA601,PARENT=0,PROCOPT=GI                                 
*                                                                               
*        VOR REGISTER NYTT                                                      
         PCB   TYPE=DB,DBDNAME=WDA6,PROCOPT=G,KEYLEN=40,POS=S,         *        
               PROCSEQ=WDA6B                                                    
         SENSEG NAME=WDA601,PARENT=0,PROCOPT=GR                                 
*                                                                               
*        ARTIKELREGISTER WDK6                                                   
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=G,KEYLEN=6,POS=S                    
         SENSEG NAME=WDK601,PARENT=0,PROCOPT=G                                  
         SENSEG NAME=WDK611,PARENT=WDK601,PROCOPT=GR                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
*WDP4A                                                                          
         PCB   TYPE=DB,DBDNAME=WDP4A,PROCOPT=GOT,KEYLEN=11,POS=S                
         SENSEG NAME=WDP4A1,PARENT=0                                            
*                                                                               
*        BETALAREGISTER                                                         
         PCB   TYPE=DB,DBDNAME=WDB1,PROCOPT=GOT,KEYLEN=11,POS=S                 
         SENSEG NAME=WDB101,PARENT=0                                            
*                                                                               
* MIC WHITE LIST                                                                
         PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=GOT,KEYLEN=35,POS=S                 
         SENSEG NAME=WDR501,PARENT=0                                            
         SENSEG NAME=WDGX4254,PARENT=WDR501                                     
*                                                                               
******************************************* KOMMUNIKATIONS DB                   
         PCB   TYPE=DB,DBDNAME=WLKOMA,PROCOPT=G,KEYLEN=28,POS=S                 
         SENSEG NAME=WLKOMA01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLKOMA11,PARENT=WLKOMA01,PROCOPT=GI                        
*                                                                               
* WDA5   BACK ORDER                                                             
         PCB   TYPE=DB,DBDNAME=WDA5,PROCOPT=GOT,KEYLEN=24,POS=S                 
         SENSEG NAME=WDA501,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40293                                       
         END                                                                    
