*                                                                               
         PCB TYPE=DB,DBDNAME=WDQ3H,PROCOPT=G,KEYLEN=26,POS=S                    
         SENSEG NAME=WDQ3H1,PARENT=0                                            
*                                                                               
         PCB TYPE=DB,DBDNAME=WDQ3J,PROCOPT=G,KEYLEN=26,POS=S                    
         SENSEG NAME=WDQ3J1,PARENT=0                                            
*                                                                               
         PCB TYPE=DB,DBDNAME=WDQ3,PROCOPT=G,KEYLEN=12,POS=S                     
         SENSEG NAME=WDQ301,PARENT=0,PROCOPT=GR                                 
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR1,PROCOPT=GOT,KEYLEN=35,POS=S                 
         SENSEG NAME=WDR101,PARENT=0                                            
         SENSEG NAME=WDR160,PARENT=WDR101                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR4,PROCOPT=G,KEYLEN=53,POS=S                   
         SENSEG NAME=WDR401,PARENT=0                                            
         SENSEG NAME=WDGX4488,PARENT=WDR401                                     
         SENSEG NAME=WDGX4490,PARENT=WDGX4488,PROCOPT=GR                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE4,PROCOPT=G,KEYLEN=23,POS=S                   
         SENSEG NAME=WDE401,PARENT=0,PROCOPT=GR                                 
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE4,PROCOPT=GOT,KEYLEN=26,POS=S                 
         SENSEG NAME=WDE401,PARENT=0                                            
         SENSEG NAME=WDE411,PARENT=WDE401                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40320                                       
         END                                                                    
