*                                                                               
*        TRANS TILL PGM W4037700                                                
         PCB   TYPE=TP,NAME=W4T377X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*        TRANS TILL PGM W4037800                                                
         PCB   TYPE=TP,NAME=W4T378X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*        PCB FÖR PRINTERN                                                       
         PCB   TYPE=TP,LTERM=,ALTRESP=NO,SAMETRM=NO,                   *        
               MODIFY=YES,EXPRESS=NO                                            
*                                                                               
*        MPP-USER-INIT-REGISTER - WDP7                                          
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GOT,KEYLEN=8,POS=S                
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
*        ÅTERSTART PLOCKLISTA                                                   
         PCB    TYPE=DB,DBDNAME=WLLISB,PROCOPT=G,KEYLEN=19,POS=S                
         SENSEG NAME=WLLISB01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLLISB11,PARENT=WLLISB01,PROCOPT=GI                        
*                                                                               
*        PLOCKSATS PU            WDGX HTYP=4007                                 
         PCB    TYPE=DB,DBDNAME=WL4007,PROCOPT=G,KEYLEN=53,POS=S                
         SENSEG NAME=WL400701,PARENT=0                                          
         SENSEG NAME=WL400711,PARENT=WL400701,PROCOPT=GR                        
         SENSEG NAME=WL400721,PARENT=WL400711                                   
*                                                                               
*        ORDERHUVUD ARBETSTABELL                                                
         PCB    TYPE=DB,DBDNAME=WLORQI,PROCOPT=GOTP,KEYLEN=6,POS=S              
         SENSEG NAME=WLORQI01,PARENT=0                                          
         SENSEG NAME=WLORQI12,PARENT=WLORQI01                                   
*                                                                               
*        ORDERDEL DIREKTNYCKEL                                                  
         PCB    TYPE=DB,DBDNAME=WLORQA,PROCOPT=GOT,KEYLEN=12,POS=S              
         SENSEG NAME=WLORQA01,PARENT=0                                          
*                                                                               
*        PRODUKTIONSKANALSTABELL WDGX HTYP=4447                                 
         PCB    TYPE=DB,DBDNAME=WLXXKH,PROCOPT=GOT,KEYLEN=35,POS=S              
         SENSEG NAME=WLXXKH01,PARENT=0                                          
         SENSEG NAME=WLXXKH11,PARENT=WLXXKH01                                   
*                                                                               
*        FÖRRÅDSDATATEXT         WDGX HTYP=4535                                 
         PCB    TYPE=DB,DBDNAME=WLXXKU,PROCOPT=GOT,KEYLEN=35,POS=S              
         SENSEG NAME=WLXXKU01,PARENT=0                                          
         SENSEG NAME=WLXXKU11,PARENT=WLXXKU01                                   
*                                                                               
*        FRAKTTEXT               WDGX HTYP=4732                                 
         PCB    TYPE=DB,DBDNAME=WL4732,PROCOPT=GOT,KEYLEN=31,POS=S              
         SENSEG NAME=WL473201,PARENT=0                                          
         SENSEG NAME=WL473211,PARENT=WL473201                                   
*                                                                               
*        TRANSPORTTEXT NDC                                                      
         PCB    TYPE=DB,DBDNAME=WLXXKB,PROCOPT=GOT,KEYLEN=40,POS=S              
         SENSEG NAME=WLXXKB01,PARENT=0                                          
         SENSEG NAME=WLXXKB11,PARENT=WLXXKB01                                   
*                                                                               
*        KUNDREGISTER                                                           
         PCB   TYPE=DB,DBDNAME=WLGMTA,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG NAME=WLGMTA01,PARENT=0                                          
*                                                                               
*    WDR401,    WDGX=4017, 4018                                                 
*                                                                               
         PCB    TYPE=DB,DBDNAME=WDR4,PROCOPT=G,KEYLEN=31,POS=S                  
         SENSEG NAME=WDR401,PARENT=0,PROCOPT=GID                                
         SENSEG NAME=WDGX4018,PARENT=WDR401,PROCOPT=GIR                         
*                                                                               
*    WDB6,      DC REGISTER                                                     
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
*WDF5-PCB                                                                       
         PCB   TYPE=DB,DBDNAME=WDF5,PROCOPT=GOT,KEYLEN=11,POS=S                 
         SENSEG NAME=WDF501,PARENT=0                                            
         SENSEG NAME=WDF502,PARENT=WDF501                                       
*                                                                               
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40377                                       
         END                                                                    
