*                                                                               
*        TRANS TILL PGM W4037100                                                
         PCB    TYPE=TP,NAME=W4T371X,ALTRESP=NO,SAMETRM=NO,            *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*        TRANS TILL PGM W2019100                                                
         PCB   TYPE=TP,NAME=W2T191X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*        SATSORDERKÖN DIREKTNYCKEL                                              
         PCB   TYPE=DB,DBDNAME=WLSATG,PROCOPT=G,KEYLEN=9,POS=S                  
         SENSEG NAME=WLSATG01,PARENT=0,PROCOPT=GR                               
         SENSEG NAME=WLSATG11,PARENT=WLSATG01,PROCOPT=GR                        
*                                                                               
*        SATSORDERKÖN SEKUNDÄWINDEX                                             
         PCB   TYPE=DB,DBDNAME=WLSATG,PROCOPT=GOT,KEYLEN=28,POS=S,     *        
               PROCSEQ=WDJ2A                                                    
         SENSEG NAME=WLSATG01,PARENT=0                                          
*                                                                               
*        ARTIKELREGISTER                                                        
         PCB    TYPE=DB,DBDNAME=WLARTC,PROCOPT=G,KEYLEN=6,POS=S                 
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01,PROCOPT=GR                        
*                                                                               
*        RESTORDER                                                              
         PCB    TYPE=DB,DBDNAME=WLORDP,PROCOPT=G,KEYLEN=24,POS=S                
         SENSEG NAME=WLORDP01,PARENT=0,PROCOPT=GI                               
*                                                                               
*        STYRREG RADPRIORITET                                                   
         PCB    TYPE=DB,DBDNAME=WLXXJN,PROCOPT=GOT,KEYLEN=40,POS=S              
         SENSEG NAME=WLXXJN01,PARENT=0                                          
         SENSEG NAME=WLXXJN11,PARENT=WLXXJN01                                   
*                                                                               
* ORDN-XXKP-PCB - AUTOMATISK ORDERNR, PRODNR                                    
         PCB    TYPE=DB,DBDNAME=WLXXKP,PROCOPT=G,KEYLEN=35,POS=S                
         SENSEG NAME=WLXXKP01,PARENT=0                                          
         SENSEG NAME=WLXXKP11,PARENT=WLXXKP01,PROCOPT=GR                        
*                                                                               
* ORDN-ORQL-PCB - ORDERHUVUD WDQ2C                                              
         PCB   TYPE=DB,DBDNAME=WLORQL,PROCOPT=GOT,KEYLEN=17,POS=S               
         SENSEG NAME=WLORQL01,PARENT=0                                          
*                                                                               
* ORDN-PROC-PCB - PROFORMA ORDERHUVUD WDE8                                      
         PCB   TYPE=DB,DBDNAME=WLPROC,PROCOPT=GOT,KEYLEN=17,POS=S               
         SENSEG NAME=WLPROC01,PARENT=0                                          
*                                                                               
* ORDN-ORQI-PCB - ORDERHUVUD WDQ2                                               
         PCB   TYPE=DB,DBDNAME=WLORQI,PROCOPT=GOT,KEYLEN=04,POS=S               
         SENSEG NAME=WLORQI01,PARENT=0                                          
*                                                                               
* ORDN-WDQ3-PCB - ORDERDELAR KÖ                                                 
         PCB   TYPE=DB,DBDNAME=WDQ3D,PROCOPT=GOT,KEYLEN=12,POS=S                
         SENSEG NAME=WDQ3D1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40354                                       
         END                                                                    
