*          DATA SET W40353PII0 AT LEVEL 045 AS OF 91/04/30                      
*                                                                               
*        TRANS TILL PGM W4037500                                                
         PCB   TYPE=TP,NAME=W4T375Y,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*        TRANS TILL PGM W4035300                                                
         PCB   TYPE=TP,NAME=W4T353U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*        MPP-USER-INIT-REGISTER - WDP7                                          
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
*        ORDERDELSKÖN DIREKTNYCKEL                                              
         PCB   TYPE=DB,DBDNAME=WLORQA,PROCOPT=G,KEYLEN=12,POS=S                 
         SENSEG NAME=WLORQA01,PARENT=0,PROCOPT=GR                               
*                                                                               
*        ORDERDELSKÖN SEKUNDÄWINDEX TRP-ID                                      
         PCB   TYPE=DB,DBDNAME=WLORQA,PROCOPT=G,KEYLEN=46,POS=S,       *        
               PROCSEQ=WDQ3A                                                    
         SENSEG NAME=WLORQA01,PARENT=0,PROCOPT=GR                               
*                                                                               
*        ORDERDELSKÖN SEKUNDÄWINDEX PRC                                         
         PCB   TYPE=DB,DBDNAME=WLORQA,PROCOPT=G,KEYLEN=42,POS=S,       *        
               PROCSEQ=WDQ3B                                                    
         SENSEG NAME=WLORQA01,PARENT=0,PROCOPT=GR                               
*                                                                               
*        ORDERHUVUD SEKUNDÄWINDEX DISTR-KUNDNR-KUNDRF                           
         PCB   TYPE=DB,DBDNAME=WLORQI,PROCOPT=GP,KEYLEN=19,POS=S,      *        
               PROCSEQ=WDQ2C                                                    
         SENSEG NAME=WLORQI01,PARENT=0                                          
         SENSEG NAME=WLORQI12,PARENT=WLORQI01,PROCOPT=GPR                       
*                                                                               
*        PRODUKTIONSKANALSTABELL WDGX HTYP=4447                                 
         PCB    TYPE=DB,DBDNAME=WLXXKH,PROCOPT=GOT,KEYLEN=35,POS=S              
         SENSEG NAME=WLXXKH01,PARENT=0                                          
         SENSEG NAME=WLXXKH11,PARENT=WLXXKH01                                   
*                                                                               
*        PLOCKSATSKÖN            WDGX HTYP=4001                                 
         PCB    TYPE=DB,DBDNAME=WL4001,PROCOPT=G,KEYLEN=31,POS=S                
         SENSEG NAME=WL400101,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WL400111,PARENT=WL400101,PROCOPT=GI                        
*                                                                               
*        LÖPNR PLOCKSATS         WDGX HTYP=4461                                 
         PCB    TYPE=DB,DBDNAME=WLXXKO,PROCOPT=G,KEYLEN=35,POS=S                
         SENSEG NAME=WLXXKO01,PARENT=0                                          
         SENSEG NAME=WLXXKO11,PARENT=WLXXKO01,PROCOPT=GR                        
*                                                                               
*        ORDERHUVUD DIREKTNYCKEL                                                
         PCB    TYPE=DB,DBDNAME=WLORQI,PROCOPT=GP,KEYLEN=6,POS=S                
         SENSEG NAME=WLORQI01,PARENT=0                                          
         SENSEG NAME=WLORQI12,PARENT=WLORQI01,PROCOPT=GPR                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40353                                       
         END                                                                    
