* ALT-PCB                                                                       
*                                                                               
         PCB   TYPE=TP,NAME=W0T606U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GOT,KEYLEN=8,POS=S                
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
*        PRODUKTIONSKANALSTABELL WDGX HTYP=4447                                 
         PCB    TYPE=DB,DBDNAME=WLXXKH,PROCOPT=G,KEYLEN=35,POS=S                
         SENSEG NAME=WLXXKH01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLXXKH11,PARENT=WLXXKH01,PROCOPT=GIRD                      
*                                                                               
*        PRODUKTIONSKANALSTABELL WDGX HTYP=4445                                 
         PCB    TYPE=DB,DBDNAME=WLXXKG,PROCOPT=GOT,KEYLEN=35,POS=S              
         SENSEG NAME=WLXXKG01,PARENT=0                                          
         SENSEG NAME=WLXXKG11,PARENT=WLXXKG01                                   
*                                                                               
*        PRINTERTABELL WDGX HTYP=4453                                           
         PCB    TYPE=DB,DBDNAME=WLXXKL,PROCOPT=G,KEYLEN=35,POS=S                
         SENSEG NAME=WLXXKL01,PARENT=0,PROCOPT=GID                              
         SENSEG NAME=WLXXKL11,PARENT=WLXXKL01,PROCOPT=GI                        
*                                                                               
*        PLOCKSATSTABELL WDGX HTYP=4461                                         
         PCB    TYPE=DB,DBDNAME=WLXXKO,PROCOPT=G,KEYLEN=35,POS=S                
         SENSEG NAME=WLXXKO01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLXXKO11,PARENT=WLXXKO01,PROCOPT=GI                        
*                                                                               
*        PRC UTSKRIFT    WDQ3C1                                                 
         PCB    TYPE=DB,DBDNAME=WLORQD,PROCOPT=GOT,KEYLEN=40,POS=S              
         SENSEG NAME=WLORQD01,PARENT=0                                          
*                                                                               
*        AVTALSENLIGA ARBETSTIDER                                               
         PCB    TYPE=DB,DBDNAME=WLXXKC,PROCOPT=G,KEYLEN=40,POS=S                
         SENSEG NAME=WLXXKC01,PARENT=0,PROCOPT=G                                
         SENSEG NAME=WLXXKC11,PARENT=WLXXKC01,PROCOPT=GID                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40364                                       
         END                                                                    
