*                                                                               
*        TRANS TILL PGM W4037800                                                
         PCB   TYPE=TP,NAME=W4T378X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*        PLOCKSATSKÖ PU   HTYP=4007                                             
         PCB   TYPE=DB,DBDNAME=WL4007,PROCOPT=G,KEYLEN=53,POS=S                 
         SENSEG NAME=WL400701,PARENT=0,PROCOPT=GD                               
         SENSEG NAME=WL400711,PARENT=WL400701                                   
         SENSEG NAME=WL400721,PARENT=WL400711,PROCOPT=GD                        
*                                                                               
*        ORDERHUVUDSREGISTER WDQ2                                               
         PCB   TYPE=DB,DBDNAME=WLORQI,PROCOPT=G,KEYLEN=6,POS=S                  
         SENSEG NAME=WLORQI01,PARENT=0                                          
         SENSEG NAME=WLORQI12,PARENT=WLORQI01,PROCOPT=GR                        
*                                                                               
* WDQ2 - ORDERHUVUD                                                             
         PCB   TYPE=DB,DBDNAME=WDQ2,PROCOPT=GOT,KEYLEN=17,POS=S,       *        
               PROCSEQ=WDQ2C                                                    
         SENSEG NAME=WDQ201,PARENT=0                                            
*                                                                               
*        ORDERDELSKÖ WDQ3                                                       
         PCB   TYPE=DB,DBDNAME=WLORQA,PROCOPT=G,KEYLEN=12,POS=S                 
         SENSEG NAME=WLORQA01,PARENT=0,PROCOPT=GR                               
*                                                                               
*        KUNDORDERREGISTER WDE4                                                 
         PCB   TYPE=DB,DBDNAME=WDE4,PROCOPT=G,KEYLEN=33,POS=S                   
         SENSEG NAME=WDE401,PARENT=0,PROCOPT=GIR                                
         SENSEG NAME=WDE411,PARENT=WDE401,PROCOPT=GI                            
         SENSEG NAME=WDE421,PARENT=WDE411,PROCOPT=GI                            
*                                                                               
*        KOLLIREGISTER WDE6                                                     
         PCB   TYPE=DB,DBDNAME=WDE6,PROCOPT=G,KEYLEN=7,POS=S                    
         SENSEG NAME=WDE601,PARENT=0,PROCOPT=GIR                                
         SENSEG NAME=WDE611,PARENT=WDE601,PROCOPT=GIR                           
*                                                                               
*        RECORD TILL KONTROLLLISTAN OCH ANDRA SEKV.FILER WDG6                   
         PCB   TYPE=DB,DBDNAME=WLZZAC,PROCOPT=G,KEYLEN=18,POS=S                 
         SENSEG NAME=WLZZAC01,PARENT=0,PROCOPT=GI                               
*                                                                               
*        PRODUKTIONSKANALSTABEL WDR1 - HTYP 4447                                
         PCB   TYPE=DB,DBDNAME=WLXXKH,PROCOPT=GOT,KEYLEN=35,POS=S               
         SENSEG NAME=WLXXKH01,PARENT=0                                          
         SENSEG NAME=WLXXKH11,PARENT=WLXXKH01                                   
*                                                                               
*        ORDERPLANNERING/LAGRET WDR4 - HTYP 4487                                
         PCB   TYPE=DB,DBDNAME=WDR4,PROCOPT=G,KEYLEN=53,POS=S                   
         SENSEG NAME=WDR401,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDGX4488,PARENT=WDR401,PROCOPT=GI                          
         SENSEG NAME=WDGX4490,PARENT=WDGX4488,PROCOPT=GI                        
*                                                                               
*        AUTOMATFAKTURERING WDG7 - HTYP 4726                                    
         PCB   TYPE=DB,DBDNAME=WLXXDV,PROCOPT=G,KEYLEN=44,POS=S                 
         SENSEG NAME=WLXXDV01,PARENT=0                                          
         SENSEG NAME=WLXXDV11,PARENT=WLXXDV01,PROCOPT=GI                        
         SENSEG NAME=WLXXDV21,PARENT=WLXXDV11,PROCOPT=GI                        
*                                                                               
*        DC  WDB6                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
*        VOR REGISTER NYTT WDA6                                                 
         PCB   TYPE=DB,DBDNAME=WDA6,PROCOPT=G,KEYLEN=40,POS=S,         *        
               PROCSEQ=WDA6B                                                    
         SENSEG NAME=WDA601,PARENT=0,PROCOPT=GR                                 
*                                                                               
******** SUBMODUL   W411DNOT  DATA TILL DELIVERY NOTE ********                  
* DNOT-ORQP-PCB - DELIVERY NOTEREGISTER    WDQ5                                 
         PCB   TYPE=DB,DBDNAME=WLORQP,PROCOPT=G,KEYLEN=17,POS=S                 
         SENSEG NAME=WLORQP01,PARENT=0,PROCOPT=GIRD                             
*                                                                               
* DNOT-ORQP2-PCB - DELIVERY NOTEREGISTER    WDQ5                                
         PCB   TYPE=DB,DBDNAME=WLORQP,PROCOPT=G,KEYLEN=17,POS=S                 
         SENSEG NAME=WLORQP01,PARENT=0,PROCOPT=GIR                              
*                                                                               
* DNOT-ORQP3-PCB - DELIVERY NOTEREGISTER    WDQ5                                
         PCB   TYPE=DB,DBDNAME=WLORQP,PROCOPT=G,KEYLEN=17,POS=S                 
         SENSEG NAME=WLORQP01,PARENT=0,PROCOPT=GIR                              
*                                                                               
* DNOT-4013-PCB - WDR4  HTYP=4013 VIPSORDERBEKR                                 
         PCB   TYPE=DB,DBDNAME=WL4013,PROCOPT=G,KEYLEN=58,POS=S                 
         SENSEG NAME=WL401301,PARENT=0,PROCOPT=GID                              
         SENSEG NAME=WL401311,PARENT=WL401301,PROCOPT=GID                       
         SENSEG NAME=WL401321,PARENT=WL401311,PROCOPT=GID                       
*                                                                               
* DNOT-BENA-PCB  BENÄMNINGSREGISTER                                             
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=13,POS=S,     *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40378                                       
         END                                                                    
