*          DATA SET W40363PII0 AT LEVEL 005 AS OF 91/02/04                      
*          DATA SET W40363PII0 AT LEVEL 001 AS OF 90/03/12                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB    TYPE=DB,DBDNAME=WLXXKI,PROCOPT=G,KEYLEN=40,POS=S                
         SENSEG NAME=WLXXKI01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLXXKI11,PARENT=WLXXKI01,PROCOPT=GIRD                      
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40363                                       
         END                                                                    
