*                                                                               
* WZ01-PCB, START     PGM W4063600                                              
ADDIT    PCB   TYPE=TP,NAME=W40636X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*WDP8 DISP-MSG-PCB - FEL/KLAR MEDDELANDE TILL DISPATCHERN                       
         PCB   TYPE=TP,NAME=W0T693X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*WDP7-     USER-DB                                                              
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GOT,KEYLEN=8,POS=S                
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
*OGAE-PCB - KOLLIREGISTER WDE401/E420                                           
         PCB TYPE=DB,DBDNAME=WDE4,PROCOPT=G,KEYLEN=26,POS=S                     
         SENSEG NAME=WDE401,PARENT=0,PROCOPT=GR                                 
         SENSEG NAME=WDE411,PARENT=WDE401,PROCOPT=GR                            
*                                                                               
*ORDB-PCB -          WDE401/E420/E421                                           
         PCB TYPE=DB,DBDNAME=WDE4,PROCOPT=G,KEYLEN=33,POS=S                     
         SENSEG NAME=WDE401,PARENT=0                                            
         SENSEG NAME=WDE411,PARENT=WDE401,PROCOPT=GR                            
         SENSEG NAME=WDE421,PARENT=WDE411,PROCOPT=GIR                           
*                                                                               
*ORQA-PCB             WDQ301                                                    
         PCB TYPE=DB,DBDNAME=WLORQA,PROCOPT=G,KEYLEN=12,POS=S                   
         SENSEG NAME=WLORQA01,PARENT=0,PROCOPT=GR                               
*                                                                               
*ORQA2-PCB - ORDERDELSREGISTER KÖ       WDQ301                                  
         PCB   TYPE=DB,DBDNAME=WLORQA,PROCOPT=GOT,KEYLEN=12,POS=S               
         SENSEG NAME=WLORQA01,PARENT=0                                          
*                                                                               
*ORQI-PCB - ORDERHUVUDSREGISTER KÖ      WDQ201/Q212                             
         PCB   TYPE=DB,DBDNAME=WLORQI,PROCOPT=G,KEYLEN=6,POS=S                  
         SENSEG NAME=WLORQI01,PARENT=0                                          
         SENSEG NAME=WLORQI12,PARENT=WLORQI01,PROCOPT=GR                        
*                                                                               
*ORDD-PCB - ORDERDEL       WDE601/E610/E612                                     
         PCB TYPE=DB,DBDNAME=WDE6,PROCOPT=G,KEYLEN=33,POS=S                     
         SENSEG NAME=WDE601,PARENT=0,PROCOPT=GR                                 
         SENSEG NAME=WDE611,PARENT=WDE601,PROCOPT=GIR                           
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXKH,PROCOPT=GOT,KEYLEN=35,POS=S               
         SENSEG NAME=WLXXKH01,PARENT=0                                          
         SENSEG NAME=WLXXKH11,PARENT=WLXXKH01                                   
*                                                                               
*ARTC-PCB -              WDK601/K611                                            
         PCB TYPE=DB,DBDNAME=WLARTC,PROCOPT=G,KEYLEN=7,POS=S                    
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01,PROCOPT=GR                        
*                                                                               
*ARTS-PCB -              WDK701/K711                                            
         PCB TYPE=DB,DBDNAME=WLARTS,PROCOPT=G,KEYLEN=7,POS=S                    
         SENSEG NAME=WLARTS01,PARENT=0                                          
         SENSEG NAME=WLARTS11,PARENT=WLARTS01,PROCOPT=GR                        
*                                                                               
*WDR401/R420                                                                    
         PCB TYPE=DB,DBDNAME=WDR4,PROCOPT=G,KEYLEN=53,POS=S                     
         SENSEG NAME=WDR401,PARENT=0                                            
         SENSEG NAME=WDGX4488,PARENT=WDR401                                     
         SENSEG NAME=WDGX4490,PARENT=WDGX4488,PROCOPT=GD                        
*                                                                               
*WDB201 - KUNDREG. GODSMOTTAGARE.                                               
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
*  TRANSPORT RELEASE REGISTER - BILL IT                                         
         PCB   TYPE=DB,DBDNAME=WDE2,PROCOPT=G,KEYLEN=21,POS=S                   
         SENSEG NAME=WDE201,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDE211,PARENT=WDE201,PROCOPT=GI                            
         SENSEG NAME=WDE221,PARENT=WDE211,PROCOPT=GI                            
*                                                                               
*  DDI - SHIPPING INFO                                                          
         PCB   TYPE=DB,DBDNAME=WDE1,PROCOPT=G,KEYLEN=21,POS=S                   
         SENSEG NAME=WDE101,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDE111,PARENT=WDE101,PROCOPT=GI                            
         SENSEG NAME=WDE121,PARENT=WDE111,PROCOPT=GI                            
*                                                                               
*  HÄNDELSE SHIPM NUMMER                                                        
         PCB   TYPE=DB,DBDNAME=WDR1,PROCOPT=G,KEYLEN=31,POS=S                   
         SENSEG NAME=WDR101,PARENT=0                                            
         SENSEG NAME=WDGX4518,PARENT=WDR101,PROCOPT=GIR                         
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40399                                       
         END                                                                    
