*          DATA SET W40337PII0 AT LEVEL 003 AS OF 87/11/13                      
*                                                                               
         PCB   TYPE=TP,NAME=W4T342U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=TP,NAME=W4T333,ALTRESP=NO,SAMETRM=NO,              *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE6,PROCOPT=G,KEYLEN=7,POS=S                    
         SENSEG NAME=WDE601,PARENT=0,PROCOPT=GR                                 
         SENSEG NAME=WDE611,PARENT=WDE601,PROCOPT=GR                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40337                                       
         END                                                                    
