*                                                                               
* ALT-PCB - OMSTART AV 4313                                                     
         PCB   TYPE=TP,NAME=W4T313,ALTRESP=NO,SAMETRM=NO,              *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* ALT-PCB - START AV 4317-EV UPPDATERA URSPRUNG                                 
         PCB   TYPE=TP,NAME=W4T317,ALTRESP=NO,SAMETRM=NO,              *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* ALT-PCB - START AV 4333-SKRIV KOLLIFLAGGA                                     
         PCB   TYPE=TP,NAME=W4T333,ALTRESP=NO,SAMETRM=NO,              *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* ALT-PCB - START AV 4341-SKRIV FÖLJESSEDEL                                     
         PCB   TYPE=TP,NAME=W4T341U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* AVSP-4342-PCB - START AV 4342-SKRIV PACKADE RADER                             
         PCB   TYPE=TP,NAME=W4T342U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* AVSP-2191PCB - START AV 2191-LARM ANSKAFFNING                                 
         PCB   TYPE=TP,NAME=W2T191X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* AVSP-4349PCB - START AV 4349-UTSKRIFT DEL NOTE NYA                            
         PCB   TYPE=TP,NAME=W4T349X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*SEND-MAIL-PCB                                                                  
         PCB   TYPE=TP,NAME=W0T541X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*        TRANS TILL DISTRIBUTION & PRINT                                        
DISTRDOC PCB   TYPE=TP,NAME=WZ0420X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*TMS ECOM                                                                       
*        TRANS TILL DISTRIBUTION & PRINT                                        
CREATEPA PCB   TYPE=TP,NAME=WZ0440X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*        TRANS TILL DISTRIBUTION & PRINT                                        
DELETEPA PCB   TYPE=TP,NAME=WZ0440X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* EVENT DB FOR API CALLS                                                        
ATAB     PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=GOT,KEYLEN=80,POS=S                 
         SENSEG NAME=WDR501,PARENT=0                                            
         SENSEG NAME=WDGX0104,PARENT=WDR501                                     
*                                                                               
*WDP7                                                                           
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLEMBB,PROCOPT=GOT,KEYLEN=8,POS=S                
         SENSEG NAME=WLEMBB01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE6,PROCOPT=GOT,KEYLEN=27,POS=S                 
         SENSEG NAME=WDE601,PARENT=0                                            
         SENSEG NAME=WDE611,PARENT=WDE601                                       
*                                                                               
         PCB TYPE=DB,DBDNAME=WLORQA,PROCOPT=GOT,KEYLEN=11,POS=S,       *        
               PROCSEQ=WDQ3D                                                    
         SENSEG NAME=WLORQA01,PARENT=0                                          
*                                                                               
         PCB TYPE=DB,DBDNAME=WDE4,PROCOPT=GP,KEYLEN=33,POS=S                    
         SENSEG NAME=WDE401,PARENT=0                                            
         SENSEG NAME=WDE411,PARENT=WDE401,PROCOPT=GP                            
         SENSEG NAME=WDE421,PARENT=WDE411                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
*WDE4A                                                                          
         PCB TYPE=DB,DBDNAME=WDE4,PROCOPT=GOT,KEYLEN=23,POS=S,         *        
               PROCSEQ=WDE4A                                                    
         SENSEG NAME=WDE401,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=06,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
*                                                                               
*                                                                               
******** SUBMODULE   W403AVSP  FINISH-PACKING **********                        
*                                                                               
*AVSP-WDP7                                                                      
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GOT,KEYLEN=8,POS=S                
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
*AVSP-OGAE-PCB - KOLLIREGISTER                                                  
         PCB TYPE=DB,DBDNAME=WDE4,PROCOPT=G,KEYLEN=26,POS=S                     
         SENSEG NAME=WDE401,PARENT=0,PROCOPT=GR                                 
         SENSEG NAME=WDE411,PARENT=WDE401,PROCOPT=GR                            
*                                                                               
*AVSP-OGAE2-PCB                                                                 
         PCB TYPE=DB,DBDNAME=WDE4,PROCOPT=GOT,KEYLEN=23,POS=S,         *        
               PROCSEQ=WDE4A                                                    
         SENSEG NAME=WDE401,PARENT=0                                            
*                                                                               
*AVSP-ORDB-PCB -                                                                
         PCB TYPE=DB,DBDNAME=WDE4,PROCOPT=GP,KEYLEN=33,POS=S                    
         SENSEG NAME=WDE401,PARENT=0,PROCOPT=GPR                                
         SENSEG NAME=WDE411,PARENT=WDE401,PROCOPT=GPR                           
         SENSEG NAME=WDE421,PARENT=WDE411,PROCOPT=GIR                           
*AVSP-ORDB2-PCB                                                                 
         PCB TYPE=DB,DBDNAME=WDE4,PROCOPT=GOTP,KEYLEN=30,POS=S,        *        
               PROCSEQ=WDE4B                                                    
         SENSEG NAME=WDE411,PARENT=0                                            
         SENSEG NAME=WDE401,PARENT=WDE411                                       
*                                                                               
*AVSP-ORDB3-PCB                                                                 
         PCB TYPE=DB,DBDNAME=WDE4,PROCOPT=GOTP,KEYLEN=4,POS=S,         *        
               PROCSEQ=WDE4E                                                    
         SENSEG NAME=WDE401,PARENT=0                                            
*                                                                               
*AVSP-ORDD-PCB - ORDERDEL    WDE6                                               
         PCB TYPE=DB,DBDNAME=WDE6,PROCOPT=G,KEYLEN=08,POS=S                     
         SENSEG NAME=WDE601,PARENT=0,PROCOPT=GR                                 
         SENSEG NAME=WDE611,PARENT=WDE601,PROCOPT=GIR                           
         SENSEG NAME=WDE621,PARENT=WDE611,PROCOPT=GI                            
*                                                                               
*AVSP-XXDV-PCB - AUTOMATFAKTURERING   WDG7   HTYP=4726                          
         PCB TYPE=DB,DBDNAME=WLXXDV,PROCOPT=G,KEYLEN=54,POS=S                   
         SENSEG NAME=WLXXDV01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLXXDV11,PARENT=WLXXDV01,PROCOPT=GI                        
         SENSEG NAME=WLXXDV21,PARENT=WLXXDV11,PROCOPT=GI                        
*                                                                               
*AVSP-ORQA-PCB                                                                  
         PCB TYPE=DB,DBDNAME=WLORQA,PROCOPT=G,KEYLEN=12,POS=S                   
         SENSEG NAME=WLORQA01,PARENT=0,PROCOPT=GR                               
*                                                                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXKW,PROCOPT=G,KEYLEN=31,POS=S                 
         SENSEG NAME=WLXXKW01,PARENT=0                                          
         SENSEG NAME=WLXXKW11,PARENT=WLXXKW01,PROCOPT=GR                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXLB,PROCOPT=GOT,KEYLEN=40,POS=S               
         SENSEG NAME=WLXXLB01,PARENT=0                                          
         SENSEG NAME=WLXXLB11,PARENT=WLXXLB01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXJK,PROCOPT=G,KEYLEN=30,POS=S                 
         SENSEG NAME=WLXXJK01,PARENT=0                                          
         SENSEG NAME=WLXXJK11,PARENT=WLXXJK01,PROCOPT=GI                        
*                                                                               
         PCB TYPE=DB,DBDNAME=WLZZAC,PROCOPT=G,KEYLEN=18,POS=S                   
         SENSEG NAME=WLZZAC01,PARENT=0,PROCOPT=GI                               
*                                                                               
*WDQ2 - ORDERHUVUD                                                              
*AVSP-ORQI-PCB - ORDERHUVUDSREGISTER KÖ   WDQ2                                  
         PCB   TYPE=DB,DBDNAME=WLORQI,PROCOPT=G,KEYLEN=6,POS=S                  
         SENSEG NAME=WLORQI01,PARENT=0                                          
         SENSEG NAME=WLORQI12,PARENT=WLORQI01,PROCOPT=GR                        
*                                                                               
*AVSP-ORQL-PCB                                                                  
*        ORDERKÖN     WDQ2C, ORDERHUVUD  VIA SEKUNDÄR INDEX                     
         PCB   TYPE=DB,DBDNAME=WLORQI,PROCOPT=GOT,KEYLEN=34,POS=S,     *        
               PROCSEQ=WDQ2C                                                    
         SENSEG NAME=WLORQI01,PARENT=0                                          
*                                                                               
*        KOLLIREGISTER,                 SEK. INDEX                              
         PCB   TYPE=DB,DBDNAME=WDE6E,PROCOPT=GOT,KEYLEN=12,POS=S                
         SENSEG NAME=WDE6E1,PARENT=0                                            
*                                                                               
*AVSP-OGAG-PCB -             WDE6                                               
         PCB   TYPE=DB,DBDNAME=WDE6,PROCOPT=GOT,KEYLEN=27,POS=S                 
         SENSEG NAME=WDE601,PARENT=0                                            
*                                                                               
*WDQ2 - ORDERHUVUD C INDEX                                                      
*AVSP-ORQICSQ-PCB - ORDERHUVUDSREGISTER KÖ   WDQ2                               
         PCB   TYPE=DB,DBDNAME=WLORQI,PROCOPT=GOT,KEYLEN=21,POS=S,     *        
               PROCSEQ=WDQ2C                                                    
         SENSEG NAME=WLORQI01,PARENT=0                                          
*                                                                               
*AVSP-ORQM-PCB - ORDERHUVUDSREGISTER KÖ   WDQ2                                  
         PCB TYPE=DB,DBDNAME=WLORQM,PROCOPT=G,KEYLEN=17,POS=S                   
         SENSEG NAME=WLORQM01,PARENT=0,PROCOPT=GI                               
*                                                                               
*AVSP-ORDB3-PCB -                                                               
         PCB   TYPE=DB,DBDNAME=WDE4,PROCOPT=GOT,KEYLEN=23,POS=S,       *        
               PROCSEQ=WDE4A                                                    
         SENSEG NAME=WDE401,PARENT=0                                            
*                                                                               
* KAMPANJREGISTER WDM2                                                          
         PCB    TYPE=DB,DBDNAME=WDM2,PROCOPT=G,KEYLEN=25,POS=S                  
         SENSEG NAME=WDM201,PARENT=0                                            
         SENSEG NAME=WDM211,PARENT=WDM201,PROCOPT=GR                            
         SENSEG NAME=WDM221,PARENT=WDM211,PROCOPT=GR                            
*                                                                               
*AVSP-ORQA2-PCB - ORDERDELSREGISTER KÖ   WDQ3                                   
         PCB   TYPE=DB,DBDNAME=WLORQA,PROCOPT=GOT,KEYLEN=12,POS=S               
         SENSEG NAME=WLORQA01,PARENT=0                                          
*                                                                               
*AVSP-ORDP1-PCB                                                                 
         PCB TYPE=DB,DBDNAME=WLORDP,PROCOPT=G,KEYLEN=24,POS=S                   
         SENSEG NAME=WLORDP01,PARENT=0,PROCOPT=GIRD                             
*                                                                               
*AVSP-ORDP2-PCB                                                                 
         PCB TYPE=DB,DBDNAME=WLORDP,PROCOPT=G,KEYLEN=24,POS=S                   
         SENSEG NAME=WLORDP01,PARENT=0,PROCOPT=GR                               
*                                                                               
*AVSP-XXJN-PCB  - WDG2                                                          
         PCB TYPE=DB,DBDNAME=WLXXJN,PROCOPT=GOT,KEYLEN=40,POS=S                 
         SENSEG NAME=WLXXJN01,PARENT=0                                          
         SENSEG NAME=WLXXJN11,PARENT=WLXXJN01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXKH,PROCOPT=GOT,KEYLEN=35,POS=S               
         SENSEG NAME=WLXXKH01,PARENT=0                                          
         SENSEG NAME=WLXXKH11,PARENT=WLXXKH01                                   
*                                                                               
*AVSP-ARTC-PCB -                                                                
         PCB TYPE=DB,DBDNAME=WLARTC,PROCOPT=G,KEYLEN=7,POS=S                    
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01,PROCOPT=GR                        
*                                                                               
*AVSP-ARTS-PCB -                                                                
         PCB TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=8,POS=S                      
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701,PROCOPT=GR                            
         SENSEG NAME=WDK722,PARENT=WDK711                                       
         SENSEG NAME=WDK712,PARENT=WDK701                                       
*                                                                               
*AVSP-ARTM-PCB -                                                                
         PCB TYPE=DB,DBDNAME=WLARTM,PROCOPT=G,KEYLEN=05,POS=S                   
         SENSEG NAME=WLARTM01,PARENT=0,PROCOPT=GRI                              
*                                                                               
*AVSP-AUTF-PCB                                                                  
         PCB TYPE=DB,DBDNAME=WLXXDV,PROCOPT=G,KEYLEN=54,POS=S                   
         SENSEG NAME=WLXXDV01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLXXDV11,PARENT=WLXXDV01,PROCOPT=GI                        
         SENSEG NAME=WLXXDV21,PARENT=WLXXDV11,PROCOPT=GI                        
*                                                                               
         PCB TYPE=DB,DBDNAME=WDR4,PROCOPT=G,KEYLEN=53,POS=S                     
         SENSEG NAME=WDR401,PARENT=0                                            
         SENSEG NAME=WDGX4488,PARENT=WDR401                                     
         SENSEG NAME=WDGX4490,PARENT=WDGX4488,PROCOPT=GD                        
*                                                                               
         PCB TYPE=DB,DBDNAME=WL4541,PROCOPT=G,KEYLEN=50,POS=S                   
         SENSEG NAME=WL454101,PARENT=0                                          
         SENSEG NAME=WL454111,PARENT=WL454101,PROCOPT=GI                        
*                                                                               
         PCB TYPE=DB,DBDNAME=WLLOGA,PROCOPT=G,KEYLEN=20,POS=S                   
         SENSEG NAME=WLLOGA01,PARENT=0,PROCOPT=GI                               
*                                                                               
*        ARTIKELREGISTER WDK6                                                   
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=G,KEYLEN=6,POS=S                    
         SENSEG NAME=WDK601,PARENT=0,PROCOPT=G                                  
         SENSEG NAME=WDK611,PARENT=WDK601,PROCOPT=GR                            
*                                                                               
*        VOR REGISTER NYTT                                                      
         PCB   TYPE=DB,DBDNAME=WDA6,PROCOPT=G,KEYLEN=40,POS=S,         *        
               PROCSEQ=WDA6B                                                    
         SENSEG NAME=WDA601,PARENT=0,PROCOPT=GR                                 
*                                                                               
*        VOR REGISTER NYTT                                                      
         PCB   TYPE=DB,DBDNAME=WDA6,PROCOPT=G,KEYLEN=40,POS=S                   
         SENSEG NAME=WDA601,PARENT=0,PROCOPT=GI                                 
*                                                                               
*AVSP WDP4A PCB                                                                 
         PCB   TYPE=DB,DBDNAME=WDP4A,PROCOPT=GOT,KEYLEN=11,POS=S                
         SENSEG NAME=WDP4A1,PARENT=0                                            
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
***SLUT* SUBMODULE   W403AVSP  AVSLUT-PACKNING **********                       
*- - - PLATSMODULENS BASER (W403PLAT)                                           
* AVSP-PLATS-                                                                   
         PCB   TYPE=DB,DBDNAME=WLXXDM,PROCOPT=GOT,KEYLEN=50,POS=S               
         SENSEG NAME=WLXXDM01,PARENT=0                                          
         SENSEG NAME=WLXXDM11,PARENT=WLXXDM01                                   
* AVSP-PLATS-                                                                   
         PCB   TYPE=DB,DBDNAME=WLXXDN,PROCOPT=GOT,KEYLEN=50,POS=S               
         SENSEG NAME=WLXXDN01,PARENT=0                                          
         SENSEG NAME=WLXXDN11,PARENT=WLXXDN01                                   
         SENSEG NAME=WLXXDN21,PARENT=WLXXDN11                                   
* AVSP-PLATS-                                                                   
         PCB   TYPE=DB,DBDNAME=WLXXDP,PROCOPT=G,KEYLEN=50,POS=S                 
         SENSEG NAME=WLXXDP01,PARENT=0,PROCOPT=GIRD                             
         SENSEG NAME=WLXXDP11,PARENT=WLXXDP01,PROCOPT=GIRD                      
         SENSEG NAME=WLXXDP21,PARENT=WLXXDP11,PROCOPT=GIRD                      
* AVSP-PLATS-                                                                   
         PCB   TYPE=DB,DBDNAME=WLXXDO,PROCOPT=G,KEYLEN=50,POS=S                 
         SENSEG NAME=WLXXDO01,PARENT=0,PROCOPT=GIRD                             
         SENSEG NAME=WLXXDO11,PARENT=WLXXDO01,PROCOPT=GIRD                      
         SENSEG NAME=WLXXDO21,PARENT=WLXXDO11,PROCOPT=GIRD                      
* AVSP-PLATS-                                                                   
         PCB   TYPE=DB,DBDNAME=WDE6C,PROCOPT=GOT,KEYLEN=42,POS=S                
         SENSEG NAME=WDE6C1,PARENT=0                                            
* AVSP-PLATS-                                                                   
         PCB   TYPE=DB,DBDNAME=WLGMTC,PROCOPT=GOT,KEYLEN=11,POS=S               
         SENSEG NAME=WLGMTC01,PARENT=0                                          
* AVSP-PLATS-                                                                   
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
*- - - SLUT PLATSMODULENS BASER                                                 
*                                                                               
* PCB'ER TILL W411DNOT VID ANROP FRÅN W403AVSP                                  
* AVSP-DNOT-ORQP-PCB - DELIVERY NOTEREGISTER    WDQ5                            
         PCB   TYPE=DB,DBDNAME=WLORQP,PROCOPT=G,KEYLEN=17,POS=S                 
         SENSEG NAME=WLORQP01,PARENT=0,PROCOPT=GIRD                             
*                                                                               
* AVSP-DNOT-ORQP2-PCB - DELIVERY NOTEREGISTER    WDQ5                           
         PCB   TYPE=DB,DBDNAME=WLORQP,PROCOPT=G,KEYLEN=17,POS=S                 
         SENSEG NAME=WLORQP01,PARENT=0,PROCOPT=GIR                              
*                                                                               
* AVSP-DNOT-ORQP3-PCB - DELIVERY NOTEREGISTER    WDQ5                           
         PCB   TYPE=DB,DBDNAME=WLORQP,PROCOPT=G,KEYLEN=17,POS=S                 
         SENSEG NAME=WLORQP01,PARENT=0,PROCOPT=GIR                              
*                                                                               
* AVSP-DNOT-4013-PCB - WDR4  HTYP=4013 VIPSORDERBEKR                            
         PCB   TYPE=DB,DBDNAME=WL4013,PROCOPT=G,KEYLEN=58,POS=S                 
         SENSEG NAME=WL401301,PARENT=0,PROCOPT=GID                              
         SENSEG NAME=WL401311,PARENT=WL401301,PROCOPT=GID                       
         SENSEG NAME=WL401321,PARENT=WL401311,PROCOPT=GID                       
*                                                                               
* AVSP-DNOT-BENA-PCB  BENÄMNINGSREGISTER                                        
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=13,POS=S,     *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
******** SUBMODULE  W335PRQU  UPPDATERA PRISFRÅGA ********                      
*                                                                               
* AVSP-PRQU-WDG2-PCB - VALUTAREGISTER  WDG2                                     
         PCB   TYPE=DB,DBDNAME=WDG2,PROCOPT=GOT,KEYLEN=37,POS=S                 
         SENSEG NAME=WDG201,PARENT=0                                            
         SENSEG NAME=WDGX9306,PARENT=WDG201                                     
         SENSEG NAME=WDGX9308,PARENT=WDGX9306                                   
*                                                                               
* AVSP-PRQU-WDC7-PCB - UPPDATERA PRISFRÅGA WDC7                                 
         PCB   TYPE=DB,DBDNAME=WDC7,PROCOPT=G,KEYLEN=33,POS=S                   
         SENSEG NAME=WDC701,PARENT=0,PROCOPT=GIRD                               
         SENSEG NAME=WDC711,PARENT=WDC701,PROCOPT=GIRD                          
*                                                                               
* AVSP-PRQU-SJKO-WDK6-PCB - ARTIKELINFORMATION  WDK6                            
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=06,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
                                                                                
******** SUBMODULE  W335PRNO  PRISFRÅGENUMMER ************                      
*                                                                               
* AVSP-PRNO-3107-PCB - PRISFRÅGENUMMER       WDR1  IDHTYP=3107                  
         PCB   TYPE=DB,DBDNAME=WDR1,PROCOPT=G,KEYLEN=31,POS=S                   
         SENSEG NAME=WDR101,PARENT=0                                            
         SENSEG NAME=WDGX3108,PARENT=WDR101,PROCOPT=GR                          
*************************************                                           
******** SUBMODULE  W403TMS SEND TMS EVENT    ************                      
*AVSP-TMS-1165-PCB                                                              
         PCB   TYPE=DB,DBDNAME=WL1165,PROCOPT=GOT,KEYLEN=32,POS=S               
         SENSEG NAME=WL116501,PARENT=0                                          
         SENSEG NAME=WL116511,PARENT=WL116501                                   
         SENSEG NAME=WL116512,PARENT=WL116501                                   
*                                                                               
*AVSP-TMS-4141-PCB                                                              
         PCB   TYPE=DB,DBDNAME=WDR2,PROCOPT=GOT,KEYLEN=46,POS=S                 
         SENSEG NAME=WDR201,PARENT=0                                            
         SENSEG NAME=WDGX4142,PARENT=WDR201                                     
*                                                                               
*AVSP-TMS-WDB2-PCB                                                              
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
*AVSP-TMS-WDB6-PCB - DC-REGISTER  WDB6                                          
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
*AVSP-TMS-WDD3-PCB  DESCRIPTION DB                                              
         PCB   TYPE=DB,DBDNAME=WDD3,PROCOPT=GOT,KEYLEN=8,POS=S,        *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WDD301,PARENT=0                                            
         SENSEG NAME=WDD311,PARENT=WDD301                                       
*                                                                               
*AVSP-TMS-WDB1-PCB  KUNDREGISTER BETAL WDB1                                     
         PCB   TYPE=DB,DBDNAME=WDB1,PROCOPT=GOT,KEYLEN=11,POS=S                 
         SENSEG NAME=WDB101,PARENT=0                                            
*                                                                               
*TMS-WDE4A-PCB CC                                                               
        PCB TYPE=DB,DBDNAME=WDE4,PROCOPT=GOT,KEYLEN=17,POS=S,          *        
               PROCSEQ=WDE4A                                                    
        SENSEG NAME=WDE401,PARENT=0                                             
*                                                                               
*TMS-WDE4F-PCB                                                                  
        PCB TYPE=DB,DBDNAME=WDE4,PROCOPT=GOTP,KEYLEN=30,POS=S,         *        
               PROCSEQ=WDE4F                                                    
        SENSEG NAME=WDE411,PARENT=0                                             
        SENSEG NAME=WDE401,PARENT=WDE411                                        
        SENSEG NAME=WDE421,PARENT=WDE411                                        
*                                                                               
*TMS-WDQ2-PCB                                                                   
        PCB   TYPE=DB,DBDNAME=WDQ2,PROCOPT=GOT,KEYLEN=4,POS=S                   
        SENSEG NAME=WDQ201,PARENT=0                                             
*                                                                               
*TMS-WDQ3-PCB                                                                   
        PCB   TYPE=DB,DBDNAME=WDQ3,PROCOPT=GOT,KEYLEN=12,POS=S                  
        SENSEG NAME=WDQ301,PARENT=0                                             
*                                                                               
*TMS-WDK6-PCB                                                                   
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=06,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
*TMS-WDE6-PCB                                                                   
         PCB   TYPE=DB,DBDNAME=WDE6,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDE601,PARENT=0                                            
         SENSEG NAME=WDE611,PARENT=WDE601                                       
*                                                                               
*TMS-WDK5-PCB                                                                   
        PCB   TYPE=DB,DBDNAME=WDK5,PROCOPT=GOT,KEYLEN=08,POS=S                  
        SENSEG NAME=WDK501,PARENT=0                                             
*                                                                               
*TMS-WDQ2C-PCB                                                                  
         PCB   TYPE=DB,DBDNAME=WDQ2,PROCOPT=GOT,KEYLEN=21,POS=S,       *        
               PROCSEQ=WDQ2C                                                    
         SENSEG NAME=WDQ201,PARENT=0                                            
*                                                                               
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40313                                       
         END                                                                    
