*                                                                               
         PCB   TYPE=TP,NAME=W4T396U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXDK,PROCOPT=G,KEYLEN=50,POS=S                 
         SENSEG NAME=WLXXDK01,PARENT=0                                          
         SENSEG NAME=WLXXDK11,PARENT=WLXXDK01,PROCOPT=GR                        
         SENSEG NAME=WLXXDK21,PARENT=WLXXDK11,PROCOPT=GR                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXDL,PROCOPT=G,KEYLEN=50,POS=S                 
         SENSEG NAME=WLXXDL01,PARENT=0                                          
         SENSEG NAME=WLXXDL11,PARENT=WLXXDL01,PROCOPT=GIR                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40395                                       
         END                                                                    
