*                                                                               
         PCB   TYPE=TP,NAME=W0T605U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=TP,NAME=W4T391U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=TP,NAME=W4T396U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXDJ,PROCOPT=G,KEYLEN=50,POS=S                 
         SENSEG NAME=WLXXDJ01,PARENT=0                                          
         SENSEG NAME=WLXXDJ11,PARENT=WLXXDJ01,PROCOPT=GIR                       
         SENSEG NAME=WLXXDJ21,PARENT=WLXXDJ11                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXDK,PROCOPT=G,KEYLEN=40,POS=S                 
         SENSEG NAME=WLXXDK01,PARENT=0                                          
         SENSEG NAME=WLXXDK11,PARENT=WLXXDK01,PROCOPT=A                         
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXDL,PROCOPT=G,KEYLEN=50,POS=S                 
         SENSEG NAME=WLXXDL01,PARENT=0                                          
         SENSEG NAME=WLXXDL11,PARENT=WLXXDL01,PROCOPT=GIR                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLEMBB,PROCOPT=GOT,KEYLEN=8,POS=S                
         SENSEG NAME=WLEMBB01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE6,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDE601,PARENT=0                                            
*                                                                               
         PCB TYPE=DB,DBDNAME=WLORQA,PROCOPT=GOT,KEYLEN=11,POS=S,       *        
               PROCSEQ=WDQ3D                                                    
         SENSEG NAME=WLORQA01,PARENT=0                                          
*                                                                               
         PCB TYPE=DB,DBDNAME=WDE4E,PROCOPT=GOT,KEYLEN=23,POS=S                  
         SENSEG NAME=WDE4E1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40302                                       
         END                                                                    
