*          DATA SET W40361PII0 AT LEVEL 007 AS OF 90/10/16                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB    TYPE=DB,DBDNAME=WLXXKF,PROCOPT=G,KEYLEN=40,POS=S                
         SENSEG NAME=WLXXKF01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLXXKF11,PARENT=WLXXKF01,PROCOPT=GIRD                      
*                                                                               
         PCB    TYPE=DB,DBDNAME=WLXXKE,PROCOPT=GOT,KEYLEN=40,POS=S              
         SENSEG NAME=WLXXKE01,PARENT=0                                          
         SENSEG NAME=WLXXKE11,PARENT=WLXXKE01                                   
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40361                                       
         END                                                                    
