*                                                                               
         PCB   TYPE=TP,NAME=W0T605U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=TP,NAME=W4T391U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=TP,NAME=W4T396U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXDJ,PROCOPT=G,KEYLEN=50,POS=S                 
         SENSEG NAME=WLXXDJ01,PARENT=0                                          
         SENSEG NAME=WLXXDJ11,PARENT=WLXXDJ01,PROCOPT=GR                        
         SENSEG NAME=WLXXDJ21,PARENT=WLXXDJ11                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXDK,PROCOPT=G,KEYLEN=40,POS=S                 
         SENSEG NAME=WLXXDK01,PARENT=0                                          
         SENSEG NAME=WLXXDK11,PARENT=WLXXDK01,PROCOPT=GDR                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXDL,PROCOPT=G,KEYLEN=50,POS=S                 
         SENSEG NAME=WLXXDL01,PARENT=0                                          
         SENSEG NAME=WLXXDL11,PARENT=WLXXDL01,PROCOPT=GIRD                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE4,PROCOPT=GOT,KEYLEN=7,POS=S,        *        
               PROCSEQ=WDE4B                                                    
         SENSEG NAME=WDE411,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40394                                       
         END                                                                    
