*                                                                               
*        TRANS TILL PGM W4037200                                                
         PCB    TYPE=TP,NAME=W4T372X,ALTRESP=NO,SAMETRM=NO,            *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*        SATSORDERKÖN DIREKTNYCKEL                                              
         PCB   TYPE=DB,DBDNAME=WLSATG,PROCOPT=G,KEYLEN=9,POS=S                  
         SENSEG NAME=WLSATG01,PARENT=0,PROCOPT=GR                               
         SENSEG NAME=WLSATG11,PARENT=WLSATG01,PROCOPT=GR                        
*                                                                               
*        SATSORDERKÖN DIREKTNYCKEL                                              
         PCB   TYPE=DB,DBDNAME=WLSATG,PROCOPT=G,KEYLEN=17,POS=S                 
         SENSEG NAME=WLSATG01,PARENT=0                                          
         SENSEG NAME=WLSATG12,PARENT=WLSATG01,PROCOPT=I                         
*                                                                               
*        ARTIKELREGISTER                                                        
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=G,KEYLEN=6,POS=S                  
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01,PROCOPT=GR                        
*                                                                               
*        BENÄMNINGSREGISTER                                                     
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=8,POS=S,      *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
*WDL901                                                                         
         PCB   TYPE=DB,DBDNAME=WLLOGA,PROCOPT=G,KEYLEN=20,POS=S                 
         SENSEG NAME=WLLOGA01,PARENT=0,PROCOPT=GI                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD8,PROCOPT=GOT,KEYLEN=22,POS=S                 
         SENSEG NAME=WDD801,PARENT=0                                            
         SENSEG NAME=WDD811,PARENT=WDD801                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40371                                       
         END                                                                    
