*                                                                               
*        TRANS TILL PGM W4037500                                                
         PCB    TYPE=TP,NAME=W4T375U,ALTRESP=NO,SAMETRM=NO,            *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*        MPP-USER-INIT-REGISTER - WDP7                                          
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GOT,KEYLEN=8,POS=S                
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
*        ORDERDELSKÖN DIREKTNYCKEL                                              
         PCB   TYPE=DB,DBDNAME=WLORQA,PROCOPT=G,KEYLEN=12,POS=S                 
         SENSEG NAME=WLORQA01,PARENT=0,PROCOPT=GR                               
*                                                                               
*        ORDERDELSKÖN SEKUNDÄWINDEX PRC                                         
         PCB   TYPE=DB,DBDNAME=WLORQA,PROCOPT=G,KEYLEN=42,POS=S,       *        
               PROCSEQ=WDQ3B                                                    
         SENSEG NAME=WLORQA01,PARENT=0,PROCOPT=GR                               
*                                                                               
*        PRODUKTIONSKANALSTABELL WDGX HTYP=4447                                 
         PCB    TYPE=DB,DBDNAME=WLXXKH,PROCOPT=GOT,KEYLEN=35,POS=S              
         SENSEG NAME=WLXXKH01,PARENT=0                                          
         SENSEG NAME=WLXXKH11,PARENT=WLXXKH01                                   
*                                                                               
*        PLOCKSATSKÖN            WDGX HTYP=4001                                 
         PCB    TYPE=DB,DBDNAME=WL4001,PROCOPT=G,KEYLEN=31,POS=S                
         SENSEG NAME=WL400101,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WL400111,PARENT=WL400101,PROCOPT=GI                        
*                                                                               
*        FÖRÅDSDATATEXT          WDGX HTYP=4535                                 
         PCB    TYPE=DB,DBDNAME=WLXXKU,PROCOPT=GOT,KEYLEN=35,POS=S              
         SENSEG NAME=WLXXKU01,PARENT=0                                          
         SENSEG NAME=WLXXKU11,PARENT=WLXXKU01                                   
*                                                                               
*        LÖPNR PLOCKSATS         WDGX HTYP=4461                                 
         PCB    TYPE=DB,DBDNAME=WLXXKO,PROCOPT=G,KEYLEN=35,POS=S                
         SENSEG NAME=WLXXKO01,PARENT=0                                          
         SENSEG NAME=WLXXKO11,PARENT=WLXXKO01,PROCOPT=GR                        
*                                                                               
*        ORDERHUVUD DIREKTNYCKEL                                                
         PCB    TYPE=DB,DBDNAME=WLORQI,PROCOPT=GP,KEYLEN=6,POS=S                
         SENSEG NAME=WLORQI01,PARENT=0                                          
         SENSEG NAME=WLORQI12,PARENT=WLORQI01,PROCOPT=GPR                       
*                                                                               
*        ORDERDELSKÖN SEKUNDÄWINDEX PRC                                         
         PCB   TYPE=DB,DBDNAME=WDQ3B,PROCOPT=GOT,KEYLEN=52,POS=S                
         SENSEG NAME=WDQ3B1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W4035B                                       
         END                                                                    
