*                                                                               
*ALT-PCB                                                                        
         PCB   TYPE=TP,NAME=,ALTRESP=NO,SAMETRM=NO,                    *        
               MODIFY=YES,EXPRESS=NO                                            
*4397                                                                           
         PCB   TYPE=TP,NAME=W4T397X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*2109                                                                           
* ALT-PCB TRANS TILL PGM W2010900                                               
         PCB   TYPE=TP,NAME=W2T109X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*WDP7                                                                           
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GOT,KEYLEN=8,POS=S                
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*WDE4                                                                           
         PCB TYPE=DB,DBDNAME=WDE4,PROCOPT=GP,KEYLEN=33,POS=S                    
         SENSEG NAME=WDE401,PARENT=0,PROCOPT=GPR                                
         SENSEG NAME=WDE411,PARENT=WDE401,PROCOPT=GPR                           
         SENSEG NAME=WDE421,PARENT=WDE411,PROCOPT=GIRD                          
*WDE4E                                                                          
         PCB TYPE=DB,DBDNAME=WDE4E,PROCOPT=G,KEYLEN=23,POS=S                    
         SENSEG NAME=WDE4E1,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE4F,PROCOPT=GOT,KEYLEN=29,POS=S                
         SENSEG NAME=WDE4F1,PARENT=0                                            
*                                                                               
*WDE6                                                                           
         PCB TYPE=DB,DBDNAME=WDE6,PROCOPT=G,KEYLEN=7,POS=S                      
         SENSEG NAME=WDE601,PARENT=0,PROCOPT=GR                                 
         SENSEG NAME=WDE611,PARENT=WDE601,PROCOPT=GD                            
*WDG6                                                                           
         PCB TYPE=DB,DBDNAME=WLZZAC,PROCOPT=G,KEYLEN=18,POS=S                   
         SENSEG NAME=WLZZAC01,PARENT=0,PROCOPT=GI                               
*                                                                               
* ORQI-PCB                                                                      
* WDQ2 - ORDERHUVUD                                                             
         PCB   TYPE=DB,DBDNAME=WLORQI,PROCOPT=GOT,KEYLEN=4,POS=S                
         SENSEG NAME=WLORQI01,PARENT=0                                          
*WDK6                                                                           
         PCB TYPE=DB,DBDNAME=WLARTC,PROCOPT=G,KEYLEN=10,POS=S                   
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01,PROCOPT=GR                        
*WDR4                                                                           
         PCB TYPE=DB,DBDNAME=WLXXDJ,PROCOPT=G,KEYLEN=50,POS=S                   
         SENSEG NAME=WLXXDJ01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLXXDJ11,PARENT=WLXXDJ01,PROCOPT=GIRD                      
         SENSEG NAME=WLXXDJ21,PARENT=WLXXDJ11,PROCOPT=GIRD                      
*WDG7 -  AUTF-PSB                                                               
         PCB TYPE=DB,DBDNAME=WLXXDV,PROCOPT=G,KEYLEN=50,POS=S                   
         SENSEG NAME=WLXXDV01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLXXDV11,PARENT=WLXXDV01,PROCOPT=GI                        
         SENSEG NAME=WLXXDV21,PARENT=WLXXDV11,PROCOPT=GI                        
*                                                                               
*WDR401- WDGX4505-06, FD. XXJO.                                                 
         PCB TYPE=DB,DBDNAME=WL4505,PROCOPT=G,KEYLEN=35,POS=S                   
         SENSEG NAME=WL450501,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WL450511,PARENT=WL450501,PROCOPT=I                         
*WDA5                                                                           
         PCB TYPE=DB,DBDNAME=WLORDP,PROCOPT=G,KEYLEN=24,POS=S                   
         SENSEG NAME=WLORDP01,PARENT=0                                          
*WDQ1                                                                           
         PCB TYPE=DB,DBDNAME=WLORQM,PROCOPT=G,KEYLEN=17,POS=S                   
         SENSEG NAME=WLORQM01,PARENT=0,PROCOPT=I                                
*WDK9                                                                           
         PCB TYPE=DB,DBDNAME=WLARTM,PROCOPT=G,KEYLEN=5,POS=S                    
         SENSEG NAME=WLARTM01,PARENT=0,PROCOPT=GR                               
*WDM2                                                                           
         PCB    TYPE=DB,DBDNAME=WDM2,PROCOPT=G,KEYLEN=25,POS=S                  
         SENSEG NAME=WDM201,PARENT=0                                            
         SENSEG NAME=WDM211,PARENT=WDM201,PROCOPT=GR                            
         SENSEG NAME=WDM221,PARENT=WDM211,PROCOPT=GR                            
*WDQ3                                                                           
         PCB   TYPE=DB,DBDNAME=WLORQA,PROCOPT=GOT,KEYLEN=12,POS=S               
         SENSEG NAME=WLORQA01,PARENT=0                                          
*WDK7                                                                           
         PCB TYPE=DB,DBDNAME=WLARTS,PROCOPT=G,KEYLEN=10,POS=S                   
         SENSEG NAME=WLARTS01,PARENT=0                                          
         SENSEG NAME=WLARTS11,PARENT=WLARTS01,PROCOPT=GR                        
*                                                                               
*WDL901                                                                         
         PCB   TYPE=DB,DBDNAME=WLLOGA,PROCOPT=G,KEYLEN=20,POS=S                 
         SENSEG NAME=WLLOGA01,PARENT=0,PROCOPT=GI                               
*                                                                               
* WDA6-PCB VOR REGISTER NYTT                                                    
         PCB   TYPE=DB,DBDNAME=WDA6,PROCOPT=G,KEYLEN=40,POS=S,         *        
               PROCSEQ=WDA6B                                                    
         SENSEG NAME=WDA601,PARENT=0,PROCOPT=GR                                 
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
******** SUBMODUL   W411DNOT  DATA TILL DELIVERY NOTE ********                  
* DNOT-ORQP-PCB - DELIVERY NOTEREGISTER    WDQ5                                 
         PCB   TYPE=DB,DBDNAME=WLORQP,PROCOPT=G,KEYLEN=17,POS=S                 
         SENSEG NAME=WLORQP01,PARENT=0,PROCOPT=GIRD                             
*                                                                               
* DNOT-ORQP2-PCB - DELIVERY NOTEREGISTER    WDQ5                                
         PCB   TYPE=DB,DBDNAME=WLORQP,PROCOPT=G,KEYLEN=17,POS=S                 
         SENSEG NAME=WLORQP01,PARENT=0,PROCOPT=GIR                              
*                                                                               
* DNOT-ORQP3-PCB - DELIVERY NOTEREGISTER    WDQ5                                
         PCB   TYPE=DB,DBDNAME=WLORQP,PROCOPT=G,KEYLEN=17,POS=S                 
         SENSEG NAME=WLORQP01,PARENT=0,PROCOPT=GIR                              
*WDR4                                                                           
* DNOT-4013-PCB - WDR4  HTYP=4013 VIPSORDERBEKR                                 
         PCB   TYPE=DB,DBDNAME=WL4013,PROCOPT=G,KEYLEN=58,POS=S                 
         SENSEG NAME=WL401301,PARENT=0,PROCOPT=GID                              
         SENSEG NAME=WL401311,PARENT=WL401301,PROCOPT=GID                       
         SENSEG NAME=WL401321,PARENT=WL401311,PROCOPT=GID                       
*                                                                               
* DNOT-BENA-PCB  BENÄMNINGSREGISTER                                             
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=13,POS=S,     *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40359                                       
         END                                                                    
