*          DATA SET W40369PII0 AT LEVEL 007 AS OF 90/10/16                      
*          DATA SET W40369PII0 AT LEVEL 009 AS OF 90/07/31                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GOT,KEYLEN=8,POS=S                
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
         PCB    TYPE=DB,DBDNAME=WL4437,PROCOPT=G,KEYLEN=38,POS=S                
         SENSEG NAME=WL443701,PARENT=0,PROCOPT=GR                               
         SENSEG NAME=WL443711,PARENT=WL443701,PROCOPT=GR                        
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40369                                       
         END                                                                    
