*                                                                               
* DISP MPP                                                                      
         PCB   TYPE=TP,NAME=W0T693X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=TP,NAME=W0T605U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=TP,NAME=W2T191X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=TP,NAME=W4T342U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*SEND-MAIL-PCB                                                                  
         PCB   TYPE=TP,NAME=W0T541X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*        TRANS TILL DISTRIBUTION & PRINT                                        
DISTRDOC PCB   TYPE=TP,NAME=WZ0420X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GOT,KEYLEN=8,POS=S                
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
*WDE41-PCB                                                                      
         PCB TYPE=DB,DBDNAME=WDE4,PROCOPT=G,KEYLEN=17,POS=S,           *        
               PROCSEQ=WDE4A                                                    
         SENSEG NAME=WDE401,PARENT=0,PROCOPT=GR                                 
*WDE42-PCB                                                                      
         PCB TYPE=DB,DBDNAME=WDE4,PROCOPT=G,KEYLEN=30,POS=S,           *        
               PROCSEQ=WDE4B                                                    
         SENSEG NAME=WDE411,PARENT=0,PROCOPT=GR                                 
         SENSEG NAME=WDE401,PARENT=WDE411,PROCOPT=GR                            
*WDE43-PCB                                                                      
         PCB TYPE=DB,DBDNAME=WDE4,PROCOPT=G,KEYLEN=23,POS=S                     
         SENSEG NAME=WDE401,PARENT=0,PROCOPT=GR                                 
*                                                                               
         PCB TYPE=DB,DBDNAME=WDE6,PROCOPT=G,KEYLEN=07,POS=S                     
         SENSEG NAME=WDE601,PARENT=0,PROCOPT=GR                                 
         SENSEG NAME=WDE611,PARENT=WDE601,PROCOPT=G                             
*                                                                               
         PCB TYPE=DB,DBDNAME=WLZZAC,PROCOPT=G,KEYLEN=18,POS=S                   
         SENSEG NAME=WLZZAC01,PARENT=0,PROCOPT=GI                               
*                                                                               
         PCB TYPE=DB,DBDNAME=WLARTC,PROCOPT=G,KEYLEN=7,POS=S                    
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01,PROCOPT=GR                        
*                                                                               
         PCB TYPE=DB,DBDNAME=WLXXDJ,PROCOPT=G,KEYLEN=50,POS=S                   
         SENSEG NAME=WLXXDJ01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLXXDJ11,PARENT=WLXXDJ01,PROCOPT=GD                        
         SENSEG NAME=WLXXDJ21,PARENT=WLXXDJ11                                   
*AUTF-PCB                                                                       
         PCB TYPE=DB,DBDNAME=WLXXDV,PROCOPT=G,KEYLEN=50,POS=S                   
         SENSEG NAME=WLXXDV01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLXXDV11,PARENT=WLXXDV01,PROCOPT=GI                        
         SENSEG NAME=WLXXDV21,PARENT=WLXXDV11,PROCOPT=GI                        
*                                                                               
         PCB TYPE=DB,DBDNAME=WLXXJD,PROCOPT=G,KEYLEN=50,POS=S                   
         SENSEG NAME=WLXXJD01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLXXJD11,PARENT=WLXXJD01,PROCOPT=GIR                       
*ORDP1-PCB                                                                      
         PCB TYPE=DB,DBDNAME=WLORDP,PROCOPT=G,KEYLEN=24,POS=S                   
         SENSEG NAME=WLORDP01,PARENT=0,PROCOPT=GIRD                             
*ORDP2-PCB                                                                      
         PCB TYPE=DB,DBDNAME=WLORDP,PROCOPT=G,KEYLEN=24,POS=S                   
         SENSEG NAME=WLORDP01,PARENT=0,PROCOPT=GR                               
*                                                                               
         PCB TYPE=DB,DBDNAME=WLXXJN,PROCOPT=GOT,KEYLEN=40,POS=S                 
         SENSEG NAME=WLXXJN01,PARENT=0                                          
         SENSEG NAME=WLXXJN11,PARENT=WLXXJN01                                   
*                                                                               
         PCB TYPE=DB,DBDNAME=WLORQA,PROCOPT=G,KEYLEN=12,POS=S                   
         SENSEG NAME=WLORQA01,PARENT=0,PROCOPT=GR                               
*                                                                               
         PCB TYPE=DB,DBDNAME=WLORQM,PROCOPT=G,KEYLEN=17,POS=S                   
         SENSEG NAME=WLORQM01,PARENT=0,PROCOPT=GI                               
*                                                                               
         PCB TYPE=DB,DBDNAME=WLARTM,PROCOPT=G,KEYLEN=5,POS=S                    
         SENSEG NAME=WLARTM01,PARENT=0,PROCOPT=GRI                              
*VOR-KÖ                                                                         
         PCB TYPE=DB,DBDNAME=WDR4,PROCOPT=G,KEYLEN=46,POS=S                     
         SENSEG NAME=WDR401,PARENT=0                                            
         SENSEG NAME=WDGX4542,PARENT=WDR401,PROCOPT=GI                          
*                                                                               
         PCB TYPE=DB,DBDNAME=WDR4,PROCOPT=G,KEYLEN=53,POS=S                     
         SENSEG NAME=WDR401,PARENT=0                                            
         SENSEG NAME=WDGX4488,PARENT=WDR401                                     
         SENSEG NAME=WDGX4490,PARENT=WDGX4488,PROCOPT=GD                        
*                                                                               
         PCB TYPE=DB,DBDNAME=WLXXKW,PROCOPT=G,KEYLEN=31,POS=S                   
         SENSEG NAME=WLXXKW01,PARENT=0                                          
         SENSEG NAME=WLXXKW11,PARENT=WLXXKW01,PROCOPT=GR                        
*                                                                               
         PCB TYPE=DB,DBDNAME=WLXXLB,PROCOPT=GOT,KEYLEN=40,POS=S                 
         SENSEG NAME=WLXXLB01,PARENT=0                                          
         SENSEG NAME=WLXXLB11,PARENT=WLXXLB01                                   
*                                                                               
* KAMPANJREGISTER WDM2                                                          
         PCB    TYPE=DB,DBDNAME=WDM2,PROCOPT=G,KEYLEN=25,POS=S                  
         SENSEG NAME=WDM201,PARENT=0                                            
         SENSEG NAME=WDM211,PARENT=WDM201,PROCOPT=GR                            
         SENSEG NAME=WDM221,PARENT=WDM211,PROCOPT=GR                            
*                                                                               
* ORQI-PCB                                                                      
* WDQ2 - ORDERHUVUD                                                             
         PCB   TYPE=DB,DBDNAME=WLORQI,PROCOPT=G,KEYLEN=6,POS=S                  
         SENSEG NAME=WLORQI01,PARENT=0                                          
         SENSEG NAME=WLORQI12,PARENT=WLORQI01,PROCOPT=GR                        
* ORQICSQ-PCB                                                                   
* WDQ2 - ORDERHUVUD C INDEX                                                     
         PCB   TYPE=DB,DBDNAME=WLORQI,PROCOPT=GOT,KEYLEN=21,POS=S,     *        
               PROCSEQ=WDQ2C                                                    
         SENSEG NAME=WLORQI01,PARENT=0                                          
*                                                                               
         PCB TYPE=DB,DBDNAME=WLXXKH,PROCOPT=GOT,KEYLEN=35,POS=S                 
         SENSEG NAME=WLXXKH01,PARENT=0                                          
         SENSEG NAME=WLXXKH11,PARENT=WLXXKH01                                   
*                                                                               
         PCB TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=8,POS=S                      
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701,PROCOPT=GR                            
         SENSEG NAME=WDK722,PARENT=WDK711                                       
         SENSEG NAME=WDK712,PARENT=WDK701                                       
*                                                                               
*    WDL9, SALDOFÖRÄNDRINGAR                                                    
*                                                                               
         PCB    TYPE=DB,DBDNAME=WLLOGA,PROCOPT=GI,KEYLEN=20,POS=S               
         SENSEG NAME=WLLOGA01,PARENT=0                                          
*                                                                               
*        ARTIKELREGISTER WDK6                                                   
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=G,KEYLEN=6,POS=S                    
         SENSEG NAME=WDK601,PARENT=0,PROCOPT=G                                  
         SENSEG NAME=WDK611,PARENT=WDK601,PROCOPT=GR                            
*                                                                               
*        VOR REGISTER NYTT                                                      
         PCB   TYPE=DB,DBDNAME=WDA6,PROCOPT=G,KEYLEN=40,POS=S,         *        
               PROCSEQ=WDA6B                                                    
         SENSEG NAME=WDA601,PARENT=0,PROCOPT=GR                                 
*                                                                               
*        VOR REGISTER NYTT                                                      
         PCB   TYPE=DB,DBDNAME=WDA6,PROCOPT=G,KEYLEN=40,POS=S                   
         SENSEG NAME=WDA601,PARENT=0,PROCOPT=GI                                 
*                                                                               
*        DC-REGISTER   WDB6                                                     
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
*        KUNDREGISTER  WDB2                                                     
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
*        ROLL WDP4A                                                             
         PCB   TYPE=DB,DBDNAME=WDP4A,PROCOPT=GOT,KEYLEN=11,POS=S                
         SENSEG NAME=WDP4A1,PARENT=0                                            
*                                                                               
* KOMA-PCB - KOMMUNIKATIONS DB  WDP8 ****************************               
         PCB   TYPE=DB,DBDNAME=WLKOMA,PROCOPT=G,KEYLEN=28,POS=S                 
         SENSEG NAME=WLKOMA01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLKOMA11,PARENT=WLKOMA01,PROCOPT=GI                        
*                                                                               
******** SUBMODUL   W335PRQU  UPPDATERA PRISFRÅGA ********                      
*                                                                               
* PRQU-WDG2-PCB - VALUTAREGISTER  WDG2                                          
         PCB   TYPE=DB,DBDNAME=WDG2,PROCOPT=GOT,KEYLEN=37,POS=S                 
         SENSEG NAME=WDG201,PARENT=0                                            
         SENSEG NAME=WDGX9306,PARENT=WDG201                                     
         SENSEG NAME=WDGX9308,PARENT=WDGX9306                                   
*                                                                               
* PRQU-WDC7-PCB - UPPDATERA PRISFRÅGA WDC7                                      
         PCB   TYPE=DB,DBDNAME=WDC7,PROCOPT=G,KEYLEN=33,POS=S                   
         SENSEG NAME=WDC701,PARENT=0,PROCOPT=GIRD                               
         SENSEG NAME=WDC711,PARENT=WDC701,PROCOPT=GIRD                          
*                                                                               
* PRQU-SJKO-WDK6-PCB - ARTIKELINFORMATION  WDK6                                 
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=06,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
******** SUBMODUL   W335PRNO  PRISFRÅGENUMMER ************                      
*                                                                               
* PRNO-3107-PCB - PRISFRÅGENUMMER       WDR1  IDHTYP=3107                       
         PCB   TYPE=DB,DBDNAME=WDR1,PROCOPT=G,KEYLEN=31,POS=S                   
         SENSEG NAME=WDR101,PARENT=0                                            
         SENSEG NAME=WDGX3108,PARENT=WDR101,PROCOPT=GR                          
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40398                                       
         END                                                                    
