*          DATA SET W40392PII0 AT LEVEL 002 AS OF 91/03/03                      
*                                                                               
         PCB   TYPE=TP,NAME=W0T605U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=TP,NAME=W4T391U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXDJ,PROCOPT=G,KEYLEN=50,POS=S                 
         SENSEG NAME=WLXXDJ01,PARENT=0                                          
         SENSEG NAME=WLXXDJ11,PARENT=WLXXDJ01,PROCOPT=GR                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXDK,PROCOPT=G,KEYLEN=40,POS=S                 
         SENSEG NAME=WLXXDK01,PARENT=0                                          
         SENSEG NAME=WLXXDK11,PARENT=WLXXDK01,PROCOPT=GRD                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXDL,PROCOPT=G,KEYLEN=50,POS=S                 
         SENSEG NAME=WLXXDL01,PARENT=0                                          
         SENSEG NAME=WLXXDL11,PARENT=WLXXDL01,PROCOPT=GRI                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLEMBB,PROCOPT=GOT,KEYLEN=8,POS=S                
         SENSEG NAME=WLEMBB01,PARENT=0                                          
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40392                                       
         END                                                                    
