*                                                                               
         PCB   TYPE=TP,NAME=,ALTRESP=NO,SAMETRM=NO,                    *        
               MODIFY=YES,EXPRESS=NO                                            
*                                                                               
         PCB TYPE=DB,DBDNAME=WDE6,PROCOPT=GOT,KEYLEN=7,POS=S                    
         SENSEG NAME=WDE601,PARENT=0                                            
         SENSEG NAME=WDE611,PARENT=WDE601                                       
*                                                                               
         PCB TYPE=DB,DBDNAME=WDE4F,PROCOPT=GOT,KEYLEN=29,POS=S                  
         SENSEG NAME=WDE4F1,PARENT=0                                            
                                                                                
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40342                                       
         END                                                                    
