*ALT1                                                                           
*        TRANS TILL PGM W4037600                                                
         PCB   TYPE=TP,NAME=W4T376X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*ALT2                                                                           
*        PCB FOR PLE PRINTERN                                                   
         PCB   TYPE=TP,LTERM=,ALTRESP=NO,SAMETRM=NO,                   *        
               MODIFY=YES,EXPRESS=NO                                            
*                                                                               
*MRP-LABEL                                                                      
*        TRANS TILL DISTRIBUTION & PRINT                                        
DISTRDOC PCB   TYPE=TP,NAME=WZ0420X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*MRP-KIT-LABEL                                                                  
*        TRANS TILL DISTRIBUTION & PRINT                                        
DISTRDO2 PCB   TYPE=TP,NAME=WZ0420X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* SYNQ                                                                          
*        TRANSACTION TO DISTRIBUTION & PRINT                                    
ORDERCRE PCB   TYPE=TP,NAME=WZ0440X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*USEA                                                                           
*        MPP-USER-INIT-REGISTER - WDP7                                          
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GOT,KEYLEN=8,POS=S                
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*LISB                                                                           
*        ÅTERSTART PLOCKETIKETT                                                 
         PCB   TYPE=DB,DBDNAME=WLLISB,PROCOPT=G,KEYLEN=19,POS=S                 
         SENSEG NAME=WLLISB01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLLISB11,PARENT=WLLISB01,PROCOPT=GI                        
*4003                                                                           
*        PLOCKSATS ETIKETT       WDGX HTYP=4003                                 
         PCB   TYPE=DB,DBDNAME=WL4003,PROCOPT=G,KEYLEN=49,POS=S                 
         SENSEG NAME=WL400301,PARENT=0,PROCOPT=GD                               
         SENSEG NAME=WL400311,PARENT=WL400301,PROCOPT=GR                        
         SENSEG NAME=WL400321,PARENT=WL400311                                   
                                                                                
*WDB6-PCB - DC-REGISTER  WDB6                                                   
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
*WDC3-PCB - SUGGESTED RETAIL PRICES                                             
         PCB   TYPE=DB,DBDNAME=WDC3,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDC301,PARENT=0                                            
         SENSEG NAME=WDC311,PARENT=WDC301                                       
*                                                                               
*WDD3B-PCB  ARTIKELREGISTER SEKUNDÄRINDEX ARTIKELNR                             
         PCB   TYPE=DB,DBDNAME=WDD3,PROCOPT=GOT,KEYLEN=08,POS=S,       *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WDD301,PARENT=0                                            
         SENSEG NAME=WDD311,PARENT=WDD301                                       
*                                                                               
*WDD3A-PCB  ARTIKELREGISTER SEKUNDÄRINDEX ARTIKELNR                             
         PCB   TYPE=DB,DBDNAME=WDD3,PROCOPT=GOT,KEYLEN=34,POS=S,       *        
               PROCSEQ=WDD3A                                                    
         SENSEG NAME=WDD301,PARENT=0                                            
         SENSEG NAME=WDD311,PARENT=WDD301                                       
*                                                                               
*WDK6-PCB                                                                       
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=11,POS=S               
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
*                                                                               
* WDG2-PCB/9305-PCB                                                             
         PCB   TYPE=DB,DBDNAME=WDG2,PROCOPT=GOT,KEYLEN=37,POS=S                 
         SENSEG NAME=WDG201,PARENT=0                                            
         SENSEG NAME=WDGX9306,PARENT=WDG201                                     
         SENSEG NAME=WDGX9308,PARENT=WDGX9306                                   
*                                                                               
*WDJ1-PCB                                                                       
         PCB   TYPE=DB,DBDNAME=WDJ1,PROCOPT=GOT,KEYLEN=10,POS=S                 
         SENSEG NAME=WDJ101,PARENT=0                                            
         SENSEG NAME=WDJ111,PARENT=WDJ101                                       
         SENSEG NAME=WDJ122,PARENT=WDJ111                                       
*                                                                               
*WDJ4-PCB                                                                       
      PCB   TYPE=DB,DBDNAME=WDJ4,PROCOPT=GOT,KEYLEN=10,POS=S                    
      SENSEG NAME=WDJ401,PARENT=0                                               
      SENSEG NAME=WDJ411,PARENT=WDJ401                                          
*                                                                               
*WDF5-PCB                                                                       
         PCB   TYPE=DB,DBDNAME=WDF5,PROCOPT=GOT,KEYLEN=11,POS=S                 
         SENSEG NAME=WDF501,PARENT=0                                            
         SENSEG NAME=WDF502,PARENT=WDF501                                       
*                                                                               
******** SUBMODULE  W488ORCR SEND SYNQ EVENT    ************                    
*                                                                               
* SYNQ-ATAB-PCB                                                                 
* EVENT DB FOR API CALLS                                                        
         PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=GOT,KEYLEN=80,POS=S                 
         SENSEG NAME=WDR501,PARENT=0                                            
         SENSEG NAME=WDGX0104,PARENT=WDR501                                     
*                                                                               
*        ORDERDELSKÖN SEKUNDÄWINDEX PRODNR-PLOCKLISTNR                          
         PCB   TYPE=DB,DBDNAME=WDQ3,PROCOPT=GOT,KEYLEN=6,POS=S,        *        
               PROCSEQ=WDQ3D                                                    
         SENSEG NAME=WDQ301,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40376                                       
         END                                                                    
