***********************************************************                     
*        PSB  W40344    VISA SAMLINGSKOLLI                                      
*                                                                               
***********************************************************                     
*                                                                               
         PCB    TYPE=DB,DBDNAME=WDP7,PROCOPT=G,KEYLEN=8,POS=S                   
         SENSEG NAME=WDP701,PARENT=0,PROCOPT=GIR                                
*                                                                               
*        SAMLINGSKOLLI SEQ-INDEX WDE7A                                          
         PCB   TYPE=DB,DBDNAME=WDE7,PROCOPT=GOT,KEYLEN=22,POS=S,       *        
               PROCSEQ=WDE7A                                                    
         SENSEG NAME=WDE711,PARENT=0                                            
         SENSEG NAME=WDE721,PARENT=WDE711                                       
*                                                                               
*        SAMLINGSKOLLI SEQ-INDEX WDE7B                                          
         PCB   TYPE=DB,DBDNAME=WDE7B,PROCOPT=GOT,KEYLEN=17,POS=S                
         SENSEG NAME=WDE7B1,PARENT=0                                            
*                                                                               
*        SAMLINGSKOLLI SEQ-INDEX WDE7C - SKOLLIN I R-STATUS                     
         PCB   TYPE=DB,DBDNAME=WDE7C,PROCOPT=GOT,KEYLEN=11,POS=S                
         SENSEG NAME=WDE7C1,PARENT=0                                            
*                                                                               
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40344                                       
         END                                                                    
