*                                                                               
        PCB TYPE=DB,DBDNAME=WDE4,PROCOPT=G,KEYLEN=23,POS=S                      
        SENSEG NAME=WDE401,PARENT=0,PROCOPT=GR                                  
*                                                                               
        PCB TYPE=DB,DBDNAME=WDE4A,PROCOPT=GOT,KEYLEN=23,POS=S                   
        SENSEG NAME=WDE4A1,PARENT=0                                             
*                                                                               
        PCB TYPE=DB,DBDNAME=WDE4,PROCOPT=G,KEYLEN=20,POS=S,            *        
               PROCSEQ=WDE4A                                                    
        SENSEG NAME=WDE401,PARENT=0,PROCOPT=GR                                  
        SENSEG NAME=WDE411,PARENT=WDE401                                        
*                                                                               
        PCB TYPE=DB,DBDNAME=WDE6,PROCOPT=GOT,KEYLEN=7,POS=S                     
        SENSEG NAME=WDE601,PARENT=0                                             
*                                                                               
*       --- TILL WDQ301                                                         
        PCB TYPE=DB,DBDNAME=WLORQA,PROCOPT=G,KEYLEN=12,POS=S                    
        SENSEG NAME=WLORQA01,PARENT=0,PROCOPT=GR                                
*                                                                               
*       --- TILL WDR4  ORDERPLANERINGSREGISTER FÖR LAGRET                       
        PCB TYPE=DB,DBDNAME=WDR4,PROCOPT=G,KEYLEN=53,POS=S                      
        SENSEG NAME=WDR401,PARENT=0                                             
        SENSEG NAME=WDGX4488,PARENT=WDR401                                      
        SENSEG NAME=WDGX4490,PARENT=WDGX4488,PROCOPT=GR                         
*                                                                               
*       --- TILL WDR1  PRODUKTIONSKANALSTABELL                                  
        PCB TYPE=DB,DBDNAME=WLXXKH,PROCOPT=GOT,KEYLEN=35,POS=S                  
        SENSEG NAME=WLXXKH01,PARENT=0                                           
        SENSEG NAME=WLXXKH11,PARENT=WLXXKH01                                    
*                                                                               
*       --- TILL WDG2  LÅSNINGSREGISTER                                         
        PCB TYPE=DB,DBDNAME=WLXXDJ,PROCOPT=G,KEYLEN=40,POS=S                    
        SENSEG NAME=WLXXDJ01,PARENT=0                                           
        SENSEG NAME=WLXXDJ11,PARENT=WLXXDJ01,PROCOPT=GIR                        
*                                                                               
        PSBGEN LANG=COBOL,PSBNAME=W40311                                        
        END                                                                     
