*          DATA SET W40384PII0 AT LEVEL 004 AS OF 90/03/02                      
*                                                                               
*        PRC-TABLE    RGDX 4447-4448                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB    TYPE=DB,DBDNAME=WLXXKH,PROCOPT=G,KEYLEN=35,POS=S                
         SENSEG NAME=WLXXKH01,PARENT=0                                          
         SENSEG NAME=WLXXKH11,PARENT=WLXXKH01,PROCOPT=GR                        
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40384                                       
         END                                                                    
