*          DATA SET W40379PII0 AT LEVEL 004 AS OF 91/03/06                      
*                                                                               
*        SATSORDERKÖN DIREKTNYCKEL WDJ2                                         
         PCB   TYPE=DB,DBDNAME=WLSATG,PROCOPT=G,KEYLEN=17,POS=S                 
         SENSEG NAME=WLSATG01,PARENT=0,PROCOPT=GR                               
         SENSEG NAME=WLSATG12,PARENT=WLSATG01,PROCOPT=GD                        
*                                                                               
*        SATSORDERKÖN DIREKTNYCKEL WDJ2                                         
         PCB   TYPE=DB,DBDNAME=WLSATG,PROCOPT=G,KEYLEN=9,POS=S                  
         SENSEG NAME=WLSATG01,PARENT=0                                          
         SENSEG NAME=WLSATG11,PARENT=WLSATG01,PROCOPT=GR                        
*                                                                               
*        KUNDORDERREGISTER WDE4                                                 
         PCB   TYPE=DB,DBDNAME=WDE4,PROCOPT=G,KEYLEN=27,POS=S                   
         SENSEG NAME=WDE401,PARENT=0,PROCOPT=GRD                                
         SENSEG NAME=WDE411,PARENT=WDE401,PROCOPT=GID                           
*                                                                               
*        KOLLIREGISTER     WDE6                                                 
         PCB   TYPE=DB,DBDNAME=WDE6,PROCOPT=G,KEYLEN=4,POS=S                    
         SENSEG NAME=WDE601,PARENT=0,PROCOPT=GRD                                
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40379                                       
         END                                                                    
