*          DATA SET W40362PII0 AT LEVEL 009 AS OF 90/10/16                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB    TYPE=DB,DBDNAME=WLXXKE,PROCOPT=G,KEYLEN=40,POS=S                
         SENSEG NAME=WLXXKE01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLXXKE11,PARENT=WLXXKE01,PROCOPT=GIR                       
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40362                                       
         END                                                                    
