*W4032700                                                                       
*        TRANS TILL DISTRIBUTION & PRINT                                        
DISTRDOC PCB   TYPE=TP,NAME=WZ0420X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*TMS ECOM                                                                       
*        TRANS TILL DISTRIBUTION & PRINT                                        
CREATEPA PCB   TYPE=TP,NAME=WZ0440X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*        TRANS TILL DISTRIBUTION & PRINT                                        
DELETEPA PCB   TYPE=TP,NAME=WZ0440X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=TP,NAME=W4T333,ALTRESP=NO,SAMETRM=NO,              *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=TP,NAME=W4T341,ALTRESP=NO,SAMETRM=NO,              *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* EVENT DB FOR API CALLS                                                        
ATAB     PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=GOT,KEYLEN=80,POS=S                 
         SENSEG NAME=WDR501,PARENT=0                                            
         SENSEG NAME=WDGX0104,PARENT=WDR501                                     
*                                                                               
*WDK5-PCB                                                                       
         PCB   TYPE=DB,DBDNAME=WDK5,PROCOPT=GOT,KEYLEN=8,POS=S                  
         SENSEG NAME=WDK501,PARENT=0                                            
*                                                                               
*WDE6-PCB - ORDERDEL         WDE6                                               
         PCB TYPE=DB,DBDNAME=WDE6,PROCOPT=G,KEYLEN=27,POS=S                     
         SENSEG NAME=WDE601,PARENT=0,PROCOPT=GR                                 
         SENSEG NAME=WDE611,PARENT=WDE601,PROCOPT=GRID                          
*                                                                               
*WDE4-PCB                                                                       
         PCB TYPE=DB,DBDNAME=WDE4,PROCOPT=G,KEYLEN=33,POS=S                     
         SENSEG NAME=WDE401,PARENT=0                                            
         SENSEG NAME=WDE411,PARENT=WDE401                                       
         SENSEG NAME=WDE421,PARENT=WDE411,PROCOPT=GID                           
*                                                                               
*WDE4F-PCB                                                                      
        PCB TYPE=DB,DBDNAME=WDE4,PROCOPT=GOT,KEYLEN=30,POS=S,          *        
               PROCSEQ=WDE4F                                                    
        SENSEG NAME=WDE411,PARENT=0                                             
        SENSEG NAME=WDE401,PARENT=WDE411                                        
        SENSEG NAME=WDE421,PARENT=WDE411                                        
*                                                                               
*XXJK-PCB                                                                       
         PCB   TYPE=DB,DBDNAME=WLXXJK,PROCOPT=G,KEYLEN=30,POS=S                 
         SENSEG NAME=WLXXJK01,PARENT=0                                          
         SENSEG NAME=WLXXJK11,PARENT=WLXXJK01,PROCOPT=GI                        
*                                                                               
*WDB6-PCB  - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
*WDQ3I-PCB - ORDERHUVUDSREGISTER KÖ   WDQ301                                    
         PCB TYPE=DB,DBDNAME=WDQ3,PROCOPT=GOT,KEYLEN=14,POS=S,         *        
               PROCSEQ=WDQ3I                                                    
         SENSEG NAME=WDQ301,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=06,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
*                                                                               
******** SUBMODULE  W403TMS SEND TMS EVENT    ************                      
*TMS-1165-PCB                                                                   
         PCB   TYPE=DB,DBDNAME=WL1165,PROCOPT=GOT,KEYLEN=32,POS=S               
         SENSEG NAME=WL116501,PARENT=0                                          
         SENSEG NAME=WL116511,PARENT=WL116501                                   
         SENSEG NAME=WL116512,PARENT=WL116501                                   
*                                                                               
*TMS-4141-PCB                                                                   
         PCB   TYPE=DB,DBDNAME=WDR2,PROCOPT=GOT,KEYLEN=46,POS=S                 
         SENSEG NAME=WDR201,PARENT=0                                            
         SENSEG NAME=WDGX4142,PARENT=WDR201                                     
*                                                                               
*TMS-WDB2-PCB                                                                   
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
*TMS-WDB6-PCB - DC-REGISTER  WDB6                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
*TMS-WDD3-PCB  DESCRIPTION DB                                                   
         PCB   TYPE=DB,DBDNAME=WDD3,PROCOPT=GOT,KEYLEN=8,POS=S,        *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WDD301,PARENT=0                                            
         SENSEG NAME=WDD311,PARENT=WDD301                                       
*                                                                               
*TMS-WDB1-PCB  KUNDREGISTER BETAL WDB1                                          
         PCB   TYPE=DB,DBDNAME=WDB1,PROCOPT=GOT,KEYLEN=11,POS=S                 
         SENSEG NAME=WDB101,PARENT=0                                            
*                                                                               
*TMS-WDE4A-PCB                                                                  
        PCB TYPE=DB,DBDNAME=WDE4,PROCOPT=GOT,KEYLEN=17,POS=S,          *        
               PROCSEQ=WDE4A                                                    
        SENSEG NAME=WDE401,PARENT=0                                             
*                                                                               
*TMS-WDE4F-PCB                                                                  
        PCB TYPE=DB,DBDNAME=WDE4,PROCOPT=GOTP,KEYLEN=30,POS=S,         *        
               PROCSEQ=WDE4F                                                    
        SENSEG NAME=WDE411,PARENT=0                                             
        SENSEG NAME=WDE401,PARENT=WDE411                                        
        SENSEG NAME=WDE421,PARENT=WDE411                                        
*                                                                               
*TMS-WDQ2-PCB                                                                   
        PCB   TYPE=DB,DBDNAME=WDQ2,PROCOPT=GOT,KEYLEN=4,POS=S                   
        SENSEG NAME=WDQ201,PARENT=0                                             
*                                                                               
*TMS-WDQ3-PCB                                                                   
        PCB   TYPE=DB,DBDNAME=WDQ3,PROCOPT=GOT,KEYLEN=12,POS=S                  
        SENSEG NAME=WDQ301,PARENT=0                                             
*                                                                               
*TMS-WDK6-PCB                                                                   
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=06,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
*TMS-WDE6-PCB                                                                   
         PCB   TYPE=DB,DBDNAME=WDE6,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDE601,PARENT=0                                            
         SENSEG NAME=WDE611,PARENT=WDE601                                       
*                                                                               
*TMS-WDK5-PCB                                                                   
        PCB   TYPE=DB,DBDNAME=WDK5,PROCOPT=GOT,KEYLEN=08,POS=S                  
        SENSEG NAME=WDK501,PARENT=0                                             
*                                                                               
*TMS-WDQ2C-PCB                                                                  
         PCB   TYPE=DB,DBDNAME=WDQ2,PROCOPT=GOT,KEYLEN=21,POS=S,       *        
               PROCSEQ=WDQ2C                                                    
         SENSEG NAME=WDQ201,PARENT=0                                            
*                                                                               
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40327                                       
         END                                                                    
