*                                                                               
*        SATSORDERKÖN DIREKTNYCKEL WDJ2                                         
         PCB   TYPE=DB,DBDNAME=WLSATG,PROCOPT=G,KEYLEN=17,POS=S                 
         SENSEG NAME=WLSATG01,PARENT=0,PROCOPT=GR                               
         SENSEG NAME=WLSATG12,PARENT=WLSATG01,PROCOPT=GD                        
*                                                                               
*        SATSORDERKÖN DIREKTNYCKEL WDJ2                                         
         PCB   TYPE=DB,DBDNAME=WLSATG,PROCOPT=G,KEYLEN=9,POS=S                  
         SENSEG NAME=WLSATG01,PARENT=0                                          
         SENSEG NAME=WLSATG11,PARENT=WLSATG01,PROCOPT=GR                        
*                                                                               
*        KUNDORDERREGISTER WDE4                                                 
         PCB   TYPE=DB,DBDNAME=WDE4,PROCOPT=G,KEYLEN=26,POS=S                   
         SENSEG NAME=WDE401,PARENT=0,PROCOPT=GIRD                               
         SENSEG NAME=WDE411,PARENT=WDE401,PROCOPT=GI                            
*                                                                               
*        KOLLIREGISTER     WDE6                                                 
         PCB   TYPE=DB,DBDNAME=WDE6,PROCOPT=G,KEYLEN=4,POS=S                    
         SENSEG NAME=WDE601,PARENT=0,PROCOPT=GI                                 
*                                                                               
*        RYI-TRANS PÅ WDG6                                                      
         PCB   TYPE=DB,DBDNAME=WLZZAC,PROCOPT=G,KEYLEN=18,POS=S                 
         SENSEG NAME=WLZZAC01,PARENT=0,PROCOPT=I                                
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40373                                       
         END                                                                    
