*          DATA SET W40365PII0 AT LEVEL 007 AS OF 90/10/23                      
*                                                                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
*        PRINTERTABELL WDR1 HTYP=4453                                           
         PCB   TYPE=DB,DBDNAME=WLXXKL,PROCOPT=G,KEYLEN=31,POS=S                 
         SENSEG NAME=WLXXKL01,PARENT=0                                          
         SENSEG NAME=WLXXKL11,PARENT=WLXXKL01,PROCOPT=GIRD                      
*                                                                               
*        PRODUKTIONSKANALSTABELL WDR1 HTYP=4447                                 
         PCB   TYPE=DB,DBDNAME=WLXXKH,PROCOPT=GOT,KEYLEN=35,POS=S               
         SENSEG NAME=WLXXKH01,PARENT=0                                          
         SENSEG NAME=WLXXKH11,PARENT=WLXXKH01                                   
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40365                                       
         END                                                                    
