***********************************************************                     
*        PSB  W40345                                                            
*                                                                               
*        UPPDATERING SAMLINGSKOLLI                                              
*                                                                               
***********************************************************                     
*                                                                               
*                                                                               
*        434P - SKRIV SAMLINGSKOLLIFLAGGA                                       
         PCB   TYPE=TP,NAME=W4T34PX,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*        434S - SKRIV SAMLINGSKOLLIFÖLJESEDEL                                   
         PCB   TYPE=TP,NAME=W4T34SX,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB    TYPE=DB,DBDNAME=WDP7,PROCOPT=G,KEYLEN=8,POS=S                   
         SENSEG NAME=WDP701,PARENT=0,PROCOPT=GIR                                
*                                                                               
*        SAMLINGSKOLLI                                                          
         PCB   TYPE=DB,DBDNAME=WDE7,PROCOPT=G,KEYLEN=28,POS=S                   
         SENSEG NAME=WDE701,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDE711,PARENT=WDE701,PROCOPT=GIRD                          
         SENSEG NAME=WDE721,PARENT=WDE711,PROCOPT=GID                           
*                                                                               
*        SAMLINGSKOLLI SEQ-INDEX WDE7A                                          
         PCB   TYPE=DB,DBDNAME=WDE7,PROCOPT=G,KEYLEN=24,POS=S,         *        
               PROCSEQ=WDE7A                                                    
         SENSEG NAME=WDE711,PARENT=0,PROCOPT=GR                                 
         SENSEG NAME=WDE701,PARENT=WDE711                                       
         SENSEG NAME=WDE721,PARENT=WDE711                                       
*                                                                               
*        KOLLI                                                                  
         PCB   TYPE=DB,DBDNAME=WDE6,PROCOPT=G,KEYLEN=07,POS=S                   
         SENSEG NAME=WDE601,PARENT=0                                            
         SENSEG NAME=WDE611,PARENT=WDE601,PROCOPT=GR                            
*                                                                               
*        KUNDORDER                                                              
         PCB   TYPE=DB,DBDNAME=WDE4,PROCOPT=GOT,KEYLEN=23,POS=S,       *        
               PROCSEQ=WDE4A                                                    
         SENSEG NAME=WDE401,PARENT=0                                            
*                                                                               
*        KOLLIKODREGISTER                                                       
         PCB   TYPE=DB,DBDNAME=WDK5,PROCOPT=GOT,KEYLEN=08,POS=S                 
         SENSEG NAME=WDK501,PARENT=0                                            
*4539                                                                           
*WDR1    4539-4540 REGISTER SAMLINGSKOLLI-NUMMERSERIE                           
         PCB   TYPE=DB,DBDNAME=WDR1,PROCOPT=G,KEYLEN=31,POS=S                   
         SENSEG NAME=WDR101,PARENT=0                                            
         SENSEG NAME=WDGX4540,PARENT=WDR101,PROCOPT=GR                          
*                                                                               
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40345                                       
         END                                                                    
