*                                                                               
*        TRANS TILL PGM W4037900                                                
         PCB   TYPE=TP,NAME=W4T379X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*        PCB FÖR INL-PRINTERN                                                   
         PCB   TYPE=TP,LTERM=,ALTRESP=NO,SAMETRM=NO,                   *        
               MODIFY=YES,EXPRESS=NO                                            
*                                                                               
*        ÅTERSTART PLOCKLISTA                                                   
         PCB    TYPE=DB,DBDNAME=WLLISB,PROCOPT=G,KEYLEN=19,POS=S                
         SENSEG NAME=WLLISB01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLLISB11,PARENT=WLLISB01,PROCOPT=GI                        
*                                                                               
*        SATSORDERKÖN DIREKTNYCKEL                                              
         PCB   TYPE=DB,DBDNAME=WLSATG,PROCOPT=G,KEYLEN=17,POS=S                 
         SENSEG NAME=WLSATG01,PARENT=0,PROCOPT=GR                               
         SENSEG NAME=WLSATG12,PARENT=WLSATG01                                   
*                                                                               
*        BENÄMNINGSREGISTER                                                     
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=8,POS=S,      *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
*        PRINTERTABELL PRC       WDGX HTYP=4453                                 
         PCB    TYPE=DB,DBDNAME=WLXXKL,PROCOPT=GOT,KEYLEN=30,POS=S              
         SENSEG NAME=WLXXKL01,PARENT=0                                          
         SENSEG NAME=WLXXKL11,PARENT=WLXXKL01                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40374                                       
         END                                                                    
