*          DATA SET W40352PII0 AT LEVEL 032 AS OF 90/11/21                      
*                                                                               
*        TRANS TILL PGM W4037500                                                
         PCB    TYPE=TP,NAME=W4T375U,ALTRESP=NO,SAMETRM=NO,            *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*        MPP-USER-INIT-REGISTER - WDP7                                          
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
*        ORDERDELSKÖN DIREKTNYCKEL                                              
         PCB   TYPE=DB,DBDNAME=WLORQA,PROCOPT=G,KEYLEN=12,POS=S                 
         SENSEG NAME=WLORQA01,PARENT=0,PROCOPT=GR                               
*                                                                               
*        ORDERDELSKÖN SEKUNDÄWINDEX TRP-ID                                      
         PCB   TYPE=DB,DBDNAME=WDQ3A,PROCOPT=GOT,KEYLEN=56,POS=S                
         SENSEG NAME=WDQ3A1,PARENT=0                                            
*                                                                               
*        ORDERDELSKÖN SEKUNDÄWINDEX PRC                                         
         PCB   TYPE=DB,DBDNAME=WDQ3B,PROCOPT=GOT,KEYLEN=52,POS=S                
         SENSEG NAME=WDQ3B1,PARENT=0                                            
*                                                                               
*        ORDERDELSKÖN SEKUNDÄWINDEX PRODNR-PLOCKLISTNR                          
         PCB   TYPE=DB,DBDNAME=WLORQA,PROCOPT=G,KEYLEN=6,POS=S,        *        
               PROCSEQ=WDQ3D                                                    
         SENSEG NAME=WLORQA01,PARENT=0,PROCOPT=GR                               
*                                                                               
*WDR1    PRODUKTIONSKANALSTABELL WDGX HTYP=4447,4448                            
         PCB    TYPE=DB,DBDNAME=WLXXKH,PROCOPT=GOT,KEYLEN=35,POS=S              
         SENSEG NAME=WLXXKH01,PARENT=0                                          
         SENSEG NAME=WLXXKH11,PARENT=WLXXKH01                                   
*                                                                               
*WDR4    PLOCKSATS               WDGX HTYP=4001,4002                            
         PCB    TYPE=DB,DBDNAME=WL4001,PROCOPT=G,KEYLEN=31,POS=S                
         SENSEG NAME=WL400101,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WL400111,PARENT=WL400101,PROCOPT=GI                        
*                                                                               
*WDR4    LÖPNR PLOCKSATS         WDGX HTYP=4461,4462                            
         PCB    TYPE=DB,DBDNAME=WLXXKO,PROCOPT=G,KEYLEN=35,POS=S                
         SENSEG NAME=WLXXKO01,PARENT=0                                          
         SENSEG NAME=WLXXKO11,PARENT=WLXXKO01,PROCOPT=GR                        
*                                                                               
*WDQ2    ORDERHUVUD DIREKTNYCKEL                                                
         PCB    TYPE=DB,DBDNAME=WLORQI,PROCOPT=G,KEYLEN=6,POS=S                 
         SENSEG NAME=WLORQI01,PARENT=0                                          
*                                                                               
*WDR4    PLOCKSATS/PLOCKARE      WDGX HTYP=4011,4012                            
         PCB    TYPE=DB,DBDNAME=WL4011,PROCOPT=G,KEYLEN=31,POS=S                
         SENSEG NAME=WL401101,PARENT=0,PROCOPT=GID                              
         SENSEG NAME=WL401111,PARENT=WL401101,PROCOPT=GIRD                      
*                                                                               
*WDB2-PCB - KUNDREGISTER GODSMOTTAGARE WDB2                                     
        PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=7,POS=S                   
        SENSEG NAME=WDB201,PARENT=0                                             
*                                                                               
*WDB6-PCB - DC-REGISTER WDB6                                                    
 PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                          
 SENSEG NAME=WDB601,PARENT=0                                                    
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40352                                       
         END                                                                    
