*                                                                               
*            FÖR PRINTER                                                        
         PCB   TYPE=TP,LTERM=,ALTRESP=NO,SAMETRM=NO,                   *        
               MODIFY=YES,EXPRESS=NO                                            
*                                                                               
*        SAMLINGSKOLLI SEQ-INDEX WDE7A                                          
         PCB   TYPE=DB,DBDNAME=WDE7,PROCOPT=GOT,KEYLEN=5,POS=S,        *        
               PROCSEQ=WDE7A                                                    
         SENSEG NAME=WDE711,PARENT=0                                            
*                                                                               
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W4034P                                       
         END                                                                    
