*                                                                               
* WZ01-PCB, STARTAR   PGM W4049100                                              
RECCOUN  PCB   TYPE=TP,NAME=W4T491X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* WDP7-USER-DB                                                                  
         PCB   TYPE=DB,DBDNAME=WDP7,PROCOPT=G,KEYLEN=8,POS=S                    
         SENSEG NAME=WDP701,PARENT=0,PROCOPT=GIR                                
*                                                                               
* LANDBENÄMNINGAR                                                               
         PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=G,KEYLEN=33,POS=S                   
         SENSEG NAME=WDR501,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDGX4138,PARENT=WDR501,PROCOPT=GDIR                        
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40491                                       
         END                                                                    
