*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLGMTA,PROCOPT=G,KEYLEN=7,POS=S                  
         SENSEG NAME=WLGMTA01,PARENT=0,PROCOPT=GR                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXKM,PROCOPT=GOT,KEYLEN=40,POS=S               
         SENSEG NAME=WLXXKM01,PARENT=0                                          
         SENSEG NAME=WLXXKM11,PARENT=WLXXKM01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLBETC,PROCOPT=GOT,KEYLEN=11,POS=S               
         SENSEG NAME=WLBETC01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLLEVA,PROCOPT=GOT,KEYLEN=5,POS=S                
         SENSEG NAME=WLLEVA01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLGMTB,PROCOPT=GOT,KEYLEN=9,POS=S                
         SENSEG NAME=WLGMTB01,PARENT=0                                          
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=3,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB617,PARENT=WDB601                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40412                                       
         END                                                                    
