*                                                                               
         PCB    TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GIR,KEYLEN=08,POS=S              
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
* WDB6 DC STYRREGISTER                                                          
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=G,KEYLEN=9,POS=S                    
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB615,PARENT=WDB601,PROCOPT=GIR                           
         SENSEG NAME=WDB618,PARENT=WDB601,PROCOPT=GIRD                          
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40409                                       
         END                                                                    
