*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLGMTA,PROCOPT=G,KEYLEN=7,POS=S                  
         SENSEG NAME=WLGMTA01,PARENT=0,PROCOPT=GRD                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLGMTB,PROCOPT=GOT,KEYLEN=9,POS=S                
         SENSEG NAME=WLGMTB01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLGMTC,PROCOPT=GOT,KEYLEN=11,POS=S               
         SENSEG NAME=WLGMTC01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLBETC,PROCOPT=GOT,KEYLEN=11,POS=S               
         SENSEG NAME=WLBETC01,PARENT=0                                          
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40413                                       
         END                                                                    
