*                                                                               
         PCB    TYPE=DB,DBDNAME=WDP7,PROCOPT=G,KEYLEN=8,POS=S                   
         SENSEG NAME=WDP701,PARENT=0,PROCOPT=GIR                                
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=G,KEYLEN=38,POS=S                   
         SENSEG NAME=WDB601,PARENT=0,PROCOPT=GR                                 
         SENSEG NAME=WDB611,PARENT=WDB601,PROCOPT=GID                           
*                                                                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=6,POS=S                  
         SENSEG NAME=WDK601,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR6,PROCOPT=G,KEYLEN=27,POS=S                   
         SENSEG NAME=WDR601,PARENT=0,PROCOPT=GI                                 
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40405                                       
         END                                                                    
