*                                                                               
         PCB    TYPE=DB,DBDNAME=WDP7,PROCOPT=G,KEYLEN=8,POS=S                   
         SENSEG NAME=WDP701,PARENT=0,PROCOPT=GIR                                
*                                                                               
*        PRC-TABELLER 4447/4448                                                 
         PCB   TYPE=DB,DBDNAME=WDR1,PROCOPT=GOT,KEYLEN=35,POS=S                 
         SENSEG NAME=WDR101,PARENT=0                                            
         SENSEG NAME=WDR160,PARENT=WDR101                                       
*                                                                               
*        KOLLIKODREGISTER                                                       
         PCB   TYPE=DB,DBDNAME=WDK5,PROCOPT=GOT,KEYLEN=08,POS=S                 
         SENSEG NAME=WDK501,PARENT=0                                            
*                                                                               
*        DC STYRREGISTER                                                        
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=G,KEYLEN=06,POS=S                   
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB612,PARENT=WDB601,PROCOPT=GIRD                          
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40406                                       
         END                                                                    
