         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLGMTA,PROCOPT=G,KEYLEN=7,POS=S                  
         SENSEG NAME=WLGMTA01,PARENT=0,PROCOPT=GR                               
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40484                                       
         END                                                                    
