*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLGMTB,PROCOPT=GOT,KEYLEN=9,POS=S                
         SENSEG NAME=WLGMTB01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLGMTB,PROCOPT=G,KEYLEN=9,POS=S                  
         SENSEG NAME=WLGMTB01,PARENT=0,PROCOPT=GIRD                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLGMTC,PROCOPT=GOT,KEYLEN=11,POS=S               
         SENSEG NAME=WLGMTC01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLGMTA,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG NAME=WLGMTA01,PARENT=0                                          
*                                                                               
*        PRODUKTIONSKANALSTABELL WDR1 HTYP=4445                                 
         PCB   TYPE=DB,DBDNAME=WLXXKG,PROCOPT=GOT,KEYLEN=35,POS=S               
         SENSEG NAME=WLXXKG01,PARENT=0                                          
         SENSEG NAME=WLXXKG11,PARENT=WLXXKG01                                   
*                                                                               
*        PRODUKTIONSKLASSTABELL WDR1 HTYP=4443                                  
         PCB   TYPE=DB,DBDNAME=WLXXKF,PROCOPT=GOT,KEYLEN=35,POS=S               
         SENSEG NAME=WLXXKF01,PARENT=0                                          
         SENSEG NAME=WLXXKF11,PARENT=WLXXKF01                                   
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40415                                       
         END                                                                    
