*                                                                               
         PCB    TYPE=DB,DBDNAME=WDP7,PROCOPT=G,KEYLEN=8,POS=S                   
         SENSEG NAME=WDP701,PARENT=0,PROCOPT=GIR                                
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=G,KEYLEN=2,POS=S                    
         SENSEG NAME=WDB601,PARENT=0,PROCOPT=GIR                                
         SENSEG NAME=WDB602,PARENT=WDB601,PROCOPT=GIRD                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR6,PROCOPT=G,KEYLEN=27,POS=S                   
         SENSEG NAME=WDR601,PARENT=0,PROCOPT=GI                                 
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40402                                       
         END                                                                    
