*                                                                               
* USEA-PCB                                                                      
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
* ORDD-PCB - KOLLIREGISTER WDE6                                                 
        PCB TYPE=DB,DBDNAME=WDE6,PROCOPT=GOT,KEYLEN=7,POS=S                     
        SENSEG NAME=WDE601,PARENT=0                                             
        SENSEG NAME=WDE611,PARENT=WDE601                                        
*                                                                               
* ORQA-PCB - ORDERDELSKÖ WDQ3                                                   
        PCB TYPE=DB,DBDNAME=WLORQA,PROCOPT=GOT,KEYLEN=12,POS=S                  
        SENSEG NAME=WLORQA01,PARENT=0                                           
*                                                                               
* ORQI-PCB - ORDERHUVUDET SEK                                                   
        PCB TYPE=DB,DBDNAME=WLORQI,PROCOPT=GOT,KEYLEN=20,POS=S,        *        
               PROCSEQ=WDQ2B                                                    
        SENSEG NAME=WLORQI01,PARENT=0                                           
        SENSEG NAME=WLORQI12,PARENT=WLORQI01                                    
*                                                                               
* XXKA-PCB - TRANSPORTTABELL (HTR4432)                                          
        PCB TYPE=DB,DBDNAME=WLXXKA,PROCOPT=GOT,KEYLEN=35,POS=S                  
        SENSEG NAME=WLXXKA01,PARENT=0                                           
        SENSEG NAME=WLXXKA11,PARENT=WLXXKA01                                    
*                                                                               
* XXKB-PCB - TRP.AVGÅNGSTABELL (HTR4434)                                        
        PCB TYPE=DB,DBDNAME=WLXXKB,PROCOPT=GOT,KEYLEN=40,POS=S                  
        SENSEG NAME=WLXXKB01,PARENT=0                                           
        SENSEG NAME=WLXXKB11,PARENT=WLXXKB01                                    
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
        PSBGEN LANG=COBOL,PSBNAME=W40551                                        
        END                                                                     
