*                                                                               
         PCB   TYPE=TP,NAME=,ALTRESP=NO,SAMETRM=NO,                    *        
               MODIFY=YES,EXPRESS=NO                                            
*                                                                               
* --- USERBASEN                                                                 
         PCB    TYPE=DB,DBDNAME=WDP7,PROCOPT=G,KEYLEN=8,POS=S                   
         SENSEG NAME=WDP701,PARENT=0,PROCOPT=GIR                                
*                                                                               
* --- WDQ3G                                                                     
         PCB    TYPE=DB,DBDNAME=WDQ3G,PROCOPT=G,KEYLEN=29,POS=S                 
         SENSEG NAME=WDQ3G1,PARENT=0                                            
*                                                                               
* --- ORDERHUVUD (DATUM-SORTERING)                                              
         PCB   TYPE=DB,DBDNAME=WDQ2D,PROCOPT=GOT,KEYLEN=16,POS=S                
         SENSEG NAME=WDQ2D1,PARENT=0                                            
*                                                                               
* --- ORDERDELAR                                                                
         PCB   TYPE=DB,DBDNAME=WDQ3,PROCOPT=GOT,KEYLEN=12,POS=S                 
         SENSEG NAME=WDQ301,PARENT=0                                            
*                                                                               
* --- ORDERHUVUD (PROFORMA)                                                     
         PCB   TYPE=DB,DBDNAME=WDE8,PROCOPT=GOT,KEYLEN=17,POS=S                 
         SENSEG NAME=WDE801,PARENT=0                                            
*                                                                               
* --- DC-STYR                                                                   
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
* --- KUNDREGISTER                                                              
         PCB    TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=7,POS=S                 
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
* --- BETALARREGISTER                                                           
         PCB    TYPE=DB,DBDNAME=WDB1,PROCOPT=GOT,KEYLEN=11,POS=S                
         SENSEG NAME=WDB101,PARENT=0                                            
*                                                                               
* WDG2-PCB/9305-PCB  - W510CURR                                                 
         PCB   TYPE=DB,DBDNAME=WDG2,PROCOPT=GOT,KEYLEN=37,POS=S                 
         SENSEG NAME=WDG201,PARENT=0                                            
         SENSEG NAME=WDGX9306,PARENT=WDG201                                     
         SENSEG NAME=WDGX9308,PARENT=WDGX9306                                   
*                                                                               
*                                                                               
* --- KOLLIREGISTER                                                             
         PCB   TYPE=DB,DBDNAME=WDE6,PROCOPT=GOT,KEYLEN=4,POS=S                  
         SENSEG NAME=WDE601,PARENT=0                                            
*                                                                               
* --- ORDERHUVUD                                                                
         PCB   TYPE=DB,DBDNAME=WDQ2,PROCOPT=GOT,KEYLEN=6,POS=S                  
         SENSEG NAME=WDQ201,PARENT=0                                            
         SENSEG NAME=WDQ212,PARENT=WDQ201                                       
*                                                                               
* --- ORDERHUVUD (DATUM-SORTERING)                                              
         PCB   TYPE=DB,DBDNAME=WDQ2F,PROCOPT=GOT,KEYLEN=16,POS=S                
         SENSEG NAME=WDQ2F1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40511                                       
         END                                                                    
