*                                                                               
         PCB   TYPE=TP,NAME=,ALTRESP=NO,SAMETRM=NO,                    *        
               MODIFY=YES,EXPRESS=NO                                            
*                                                                               
         PCB    TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                 
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
        PCB   TYPE=DB,DBDNAME=WLORQM,PROCOPT=GOT,KEYLEN=36,POS=S,      *        
               PROCSEQ=WDQ1B                                                    
        SENSEG NAME=WLORQM01,PARENT=0                                           
*                                                                               
        PCB   TYPE=DB,DBDNAME=WLORDP,PROCOPT=GOT,KEYLEN=24,POS=S                
        SENSEG NAME=WLORDP01,PARENT=0                                           
*                                                                               
        PCB   TYPE=DB,DBDNAME=WLORQO,PROCOPT=GOT,KEYLEN=42,POS=S                
        SENSEG NAME=WLORQO01,PARENT=0                                           
*                                                                               
        PCB   TYPE=DB,DBDNAME=WLORQM,PROCOPT=GOT,KEYLEN=18,POS=S                
        SENSEG NAME=WLORQM01,PARENT=0                                           
*                                                                               
        PSBGEN LANG=COBOL,PSBNAME=W40575                                        
        END                                                                     
