*          DATA SET W40502PII0 AT LEVEL 057 AS OF 91/01/22                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
*       --- TILL WDQ201                                                         
        PCB TYPE=DB,DBDNAME=WLORQI,PROCOPT=GOT,KEYLEN=24,POS=S,        *        
               PROCSEQ=WDQ2C                                                    
        SENSEG NAME=WLORQI01,PARENT=0                                           
        SENSEG NAME=WLORQI11,PARENT=WLORQI01                                    
        SENSEG NAME=WLORQI12,PARENT=WLORQI01                                    
*                                                                               
*       --- TILL WDQ301                                                         
        PCB TYPE=DB,DBDNAME=WLORQA,PROCOPT=GOT,KEYLEN=12,POS=S                  
        SENSEG NAME=WLORQA01,PARENT=0                                           
*                                                                               
*       --- TILL WDE401 VIA A-KEY                                               
        PCB TYPE=DB,DBDNAME=WDE4,PROCOPT=GOTP,KEYLEN=30,POS=S,         *        
               PROCSEQ=WDE4A                                                    
        SENSEG NAME=WDE401,PARENT=0                                             
        SENSEG NAME=WDE411,PARENT=WDE401                                        
        SENSEG NAME=WDE421,PARENT=WDE411                                        
*                                                                               
*       --- TILL WDE420 VIA B-KEY                                               
        PCB TYPE=DB,DBDNAME=WDE4,PROCOPT=GOTP,KEYLEN=17,POS=S,         *        
               PROCSEQ=WDE4B                                                    
        SENSEG NAME=WDE411,PARENT=0                                             
        SENSEG NAME=WDE421,PARENT=WDE411                                        
*                                                                               
        PCB TYPE=DB,DBDNAME=WDE6,PROCOPT=GOT,KEYLEN=7,POS=S                     
        SENSEG NAME=WDE601,PARENT=0                                             
        SENSEG NAME=WDE611,PARENT=WDE601                                        
*                                                                               
*       --- TILL WDQ401                                                         
        PCB TYPE=DB,DBDNAME=WLORQF,PROCOPT=GOT,KEYLEN=20,POS=S                  
        SENSEG NAME=WLORQF01,PARENT=0                                           
*                                                                               
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
* WDF6-PCB - PU DIREKTLEVERANTÖRER  WDF6                                        
         PCB   TYPE=DB,DBDNAME=WDF6,PROCOPT=GOT,KEYLEN=4,POS=S                  
         SENSEG NAME=WDF601,PARENT=0                                            
*                                                                               
        PSBGEN LANG=COBOL,PSBNAME=W40502                                        
        END                                                                     
