*                                                                               
         PCB   TYPE=TP,NAME=,ALTRESP=NO,SAMETRM=NO,                    *        
               MODIFY=YES,EXPRESS=NO                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
*        KOLLIREG WDE6 - SEK INDEX WDE6A                                        
         PCB   TYPE=DB,DBDNAME=WDE6A,PROCOPT=GOT,KEYLEN=16,POS=S                
         SENSEG NAME=WDE6A1,PARENT=0                                            
*                                                                               
*        KOLLIREGISTER WDE6                                                     
         PCB   TYPE=DB,DBDNAME=WDE6,PROCOPT=GOT,KEYLEN=4,POS=S                  
         SENSEG NAME=WDE601,PARENT=0                                            
*                                                                               
*        KUNDORDERREGISTER - SEK INDEX WDE4E                                    
         PCB   TYPE=DB,DBDNAME=WDE4E,PROCOPT=GOT,KEYLEN=23,POS=S                
         SENSEG NAME=WDE4E1,PARENT=0                                            
*                                                                               
*        ORDERHUVUDREGISTER KÖ WDQ2 - SEK INDEX WDQ2C                           
         PCB   TYPE=DB,DBDNAME=WLORQI,PROCOPT=GOT,KEYLEN=17,POS=S,     *        
               PROCSEQ=WDQ2C                                                    
         SENSEG NAME=WLORQI01,PARENT=0                                          
*                                                                               
*        ORDERHUVUDREGISTER KÖ WDQ2                                             
         PCB   TYPE=DB,DBDNAME=WLORQI,PROCOPT=GOT,KEYLEN=6,POS=S                
         SENSEG NAME=WLORQI01,PARENT=0                                          
         SENSEG NAME=WLORQI12,PARENT=WLORQI01                                   
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40517                                       
         END                                                                    
