*                                                                               
        PCB    TYPE=TP,NAME=W4T295X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
*      LORQ-PCB - ORDERHUVUDREGISTER WDQ2                                       
        PCB    TYPE=DB,DBDNAME=WLORQI,PROCOPT=GOT,KEYLEN=19,POS=S,     *        
               PROCSEQ=WDQ2C                                                    
        SENSEG NAME=WLORQI01,PARENT=0                                           
        SENSEG NAME=WLORQI12,PARENT=WLORQI01                                    
*                                                                               
* KREG-GMTA-PCB - KUNDREGISTRET  WDB2                                           
         PCB   TYPE=DB,DBDNAME=WLGMTA,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG NAME=WLGMTA01,PARENT=0                                          
*                                                                               
* KREG-BETC-PCB - BETALARE-REGISTER WDB1                                        
         PCB   TYPE=DB,DBDNAME=WLBETC,PROCOPT=GOT,KEYLEN=11,POS=S               
         SENSEG NAME=WLBETC01,PARENT=0                                          
*                                                                               
* WDB6-PCB  DC-REGISTER WDB6                                                    
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
                                                                                
*                                                                               
        PSBGEN LANG=COBOL,PSBNAME=W40504                                        
        END                                                                     
