******************************************************                          
*                                                                               
**       - TULLINFORMATION                                                      
*                                                                               
******************************************************                          
*                                                                               
**  TULLREGISTER HUVUD                                                          
         PCB   TYPE=DB,DBDNAME=WDM7,PROCOPT=G,KEYLEN=15,POS=S                   
         SENSEG NAME=WDM701,PARENT=0,PROCOPT=GR                                 
*                                                                               
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40548                                       
         END                                                                    
