*                                                                               
*            FÖR PRINTER                                                        
         PCB   TYPE=TP,LTERM=,ALTRESP=NO,SAMETRM=NO,                   *        
               MODIFY=YES,EXPRESS=NO                                            
*                                                                               
*        --  DISTRIBUTION & PRINT                                               
DISTRDOC PCB   TYPE=TP,NAME=WZ0420X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB    TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GOT,KEYLEN=8,POS=S               
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
*        WDG8 ÅTERSTART FARLIGT GODS BLANKETT                                   
         PCB    TYPE=DB,DBDNAME=WLLISB,PROCOPT=G,KEYLEN=19,POS=S                
         SENSEG NAME=WLLISB01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLLISB11,PARENT=WLLISB01,PROCOPT=GI                        
*                                                                               
*        WDR4  FARLIGT-GODS-REGISTER                                            
         PCB   TYPE=DB,DBDNAME=WL4513,PROCOPT=G,KEYLEN=51,POS=S                 
         SENSEG NAME=WL451301,PARENT=0                                          
         SENSEG NAME=WL451311,PARENT=WL451301,PROCOPT=GD                        
         SENSEG NAME=WL451321,PARENT=WL451311,PROCOPT=GD                        
*                                                                               
*        WDR2 HTYP 1165/1168  FARLIGT GODS                                      
         PCB   TYPE=DB,DBDNAME=WL1165,PROCOPT=GOT,KEYLEN=32,POS=S               
         SENSEG NAME=WL116501                                                   
         SENSEG NAME=WL116512,PARENT=WL116501                                   
*                                                                               
*        WDB2 KUNDREGISTER - GODSMOTTAGARE                                      
         PCB   TYPE=DB,DBDNAME=WLGMTA,PROCOPT=GOT,KEYLEN=07,POS=S               
         SENSEG NAME=WLGMTA01,PARENT=0                                          
*                                                                               
*        WDE6 KOLLIREGISTER                                                     
         PCB TYPE=DB,DBDNAME=WDE6,PROCOPT=GOT,KEYLEN=07,POS=S                   
         SENSEG NAME=WDE601,PARENT=0                                            
         SENSEG NAME=WDE611,PARENT=WDE601                                       
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40539                                       
         END                                                                    
