*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB    TYPE=DB,DBDNAME=WLXXKA,PROCOPT=GOT,KEYLEN=35,POS=S              
         SENSEG NAME=WLXXKA01,PARENT=0                                          
         SENSEG NAME=WLXXKA11,PARENT=WLXXKA01                                   
*                                                                               
         PCB    TYPE=DB,DBDNAME=WLXXKB,PROCOPT=GOT,KEYLEN=40,POS=S              
         SENSEG NAME=WLXXKB01,PARENT=0                                          
         SENSEG NAME=WLXXKB11,PARENT=WLXXKB01                                   
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40582                                       
         END                                                                    
