*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
* WDQ2 - ORDERHUVUD (+ DIRLEV OCH ARBTAB)                                       
        PCB    TYPE=DB,DBDNAME=WLORQI,PROCOPT=GOT,KEYLEN=24,POS=S,     *        
               PROCSEQ=WDQ2C                                                    
        SENSEG NAME=WLORQI01,PARENT=0                                           
        SENSEG NAME=WLORQI11,PARENT=WLORQI01                                    
        SENSEG NAME=WLORQI12,PARENT=WLORQI01                                    
        SENSEG NAME=WLORQI21,PARENT=WLORQI12                                    
*                                                                               
* ORDERKÖN     WDQ3, ORDERDELAR                                                 
        PCB    TYPE=DB,DBDNAME=WLORQA,PROCOPT=GOT,KEYLEN=12,POS=S               
        SENSEG NAME=WLORQA01,PARENT=0                                           
*                                                                               
* ORDER        WDE6, ORDER PACKADE                                              
        PCB    TYPE=DB,DBDNAME=WDE6,PROCOPT=GOT,KEYLEN=7,POS=S                  
        SENSEG NAME=WDE601,PARENT=0                                             
        SENSEG NAME=WDE611,PARENT=WDE601                                        
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40503                                       
         END                                                                    
