*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40522                                       
         END                                                                    
