*          DATA SET W40581PII0 AT LEVEL 010 AS OF 90/11/21                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB    TYPE=DB,DBDNAME=WLXXKA,PROCOPT=G,KEYLEN=35,POS=S                
         SENSEG NAME=WLXXKA01,PARENT=0,PROCOPT=GR                               
         SENSEG NAME=WLXXKA11,PARENT=WLXXKA01,PROCOPT=GIRD                      
*                                                                               
         PCB    TYPE=DB,DBDNAME=WLXXKB,PROCOPT=G,KEYLEN=40,POS=S                
         SENSEG NAME=WLXXKB01,PARENT=0,PROCOPT=GR                               
         SENSEG NAME=WLXXKB11,PARENT=WLXXKB01,PROCOPT=GIRD                      
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40581                                       
         END                                                                    
