******************************************************                          
*                                                                               
**  4538 - TULLINFORMATION                                                      
*                                                                               
******************************************************                          
*                                                                               
         PCB   TYPE=TP,NAME=W0T606U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
**  USERREGISTER                                                                
         PCB   TYPE=DB,DBDNAME=WDP7,PROCOPT=G,KEYLEN=8,POS=S                    
                SENSEG NAME=WDP701,PARENT=0,PROCOPT=GIR                         
*                                                                               
**  TULLREGISTER HUVUD                                                          
         PCB   TYPE=DB,DBDNAME=WDM7,PROCOPT=G,KEYLEN=15,POS=S                   
         SENSEG NAME=WDM701,PARENT=0,PROCOPT=GRD                                
*                                                                               
**  TULLREGISTER VIA SEK.INDEX WDM7A                                            
         PCB   TYPE=DB,DBDNAME=WDM7A,PROCOPT=GOT,KEYLEN=18,POS=S                
         SENSEG NAME=WDM7A1,PARENT=0                                            
*                                                                               
**  TULLREGISTER RADER                                                          
         PCB   TYPE=DB,DBDNAME=WDM8,PROCOPT=G,KEYLEN=19,POS=S                   
         SENSEG NAME=WDM801,PARENT=0,PROCOPT=GD                                 
*                                                                               
**  TULLNR NUMMERSERIE                                                          
         PCB   TYPE=DB,DBDNAME=WDR1,PROCOPT=G,KEYLEN=31,POS=S                   
         SENSEG NAME=WDR101,PARENT=0                                            
         SENSEG NAME=WDR115,PARENT=WDR101,PROCOPT=GR                            
*                                                                               
**  KOLLLIREGISTER                                                              
         PCB   TYPE=DB,DBDNAME=WDE6,PROCOPT=G,KEYLEN=7,POS=S                    
         SENSEG NAME=WDE601,PARENT=0                                            
         SENSEG NAME=WDE611,PARENT=WDE601,PROCOPT=GR                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40538                                       
         END                                                                    
