*                                                                               
*        TRANS TILL DISTRIBUTION & PRINT                                        
DISTRDOC PCB   TYPE=TP,NAME=WZ0420X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=TP,NAME=W4T690X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLORQI,PROCOPT=G,KEYLEN=11,POS=S                 
         SENSEG NAME=WLORQI01,PARENT=0,PROCOPT=GR                               
         SENSEG NAME=WLORQI11,PARENT=WLORQI01,PROCOPT=GR                        
         SENSEG NAME=WLORQI12,PARENT=WLORQI01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLORQA,PROCOPT=G,KEYLEN=12,POS=S                 
         SENSEG NAME=WLORQA01,PARENT=0,PROCOPT=R                                
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLORQF,PROCOPT=G,KEYLEN=20,POS=S                 
         SENSEG NAME=WLORQF01,PARENT=0,PROCOPT=D                                
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE4,PROCOPT=G,KEYLEN=26,POS=S                   
         SENSEG NAME=WDE401,PARENT=0,PROCOPT=I                                  
         SENSEG NAME=WDE411,PARENT=WDE401,PROCOPT=I                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE6,PROCOPT=G,KEYLEN=4,POS=S                    
         SENSEG NAME=WDE601,PARENT=0,PROCOPT=I                                  
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDF6,PROCOPT=G,KEYLEN=11,POS=S                   
         SENSEG NAME=WDF601,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDF611,PARENT=WDF601,PROCOPT=I                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=8,POS=S,      *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
*              ARTIKELREG.                                                      
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
*                                                                               
*              ARTIKELREG. FÖR SDC/NDC                                          
         PCB   TYPE=DB,DBDNAME=WLARTS,PROCOPT=GOT,KEYLEN=08,POS=S               
         SENSEG NAME=WLARTS01                                                   
         SENSEG NAME=WLARTS11,PARENT=WLARTS01                                   
*                                                                               
*    WDD5                                                                       
         PCB   TYPE=DB,DBDNAME=WLARTN,PROCOPT=GOT,KEYLEN=5,POS=S                
         SENSEG NAME=WLARTN01,PARENT=0                                          
*                                                                               
*    WDB6 DC-REGISTER                                                           
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*    WDF1 LEVERANTÖRSREGISTER                                                   
         PCB   TYPE=DB,DBDNAME=WDF1,PROCOPT=GOT,KEYLEN=13,POS=S                 
         SENSEG NAME=WDF101,PARENT=0                                            
         SENSEG NAME=WDF118,PARENT=WDF101                                       
*    WDQ1 ORDER CONF REGISTER                                                   
         PCB   TYPE=DB,DBDNAME=WDQ1,PROCOPT=G,KEYLEN=17,POS=S                   
         SENSEG NAME=WDQ101,PARENT=0,PROCOPT=I                                  
*    WDB2 CUSTOMER REGISTER                                                     
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40695                                       
         END                                                                    
