*                                                                               
         PCB   TYPE=TP,NAME=W4T611,ALTRESP=NO,SAMETRM=NO,              *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=TP,NAME=,ALTRESP=NO,SAMETRM=NO,                    *        
               MODIFY=YES,EXPRESS=NO                                            
*                                                                               
         PCB   TYPE=TP,NAME=,ALTRESP=NO,SAMETRM=NO,                    *        
               MODIFY=YES,EXPRESS=NO                                            
*                                                                               
*        ÅTERSTART FRAKTSEDLAR                                                  
         PCB   TYPE=DB,DBDNAME=WLLISB,PROCOPT=G,KEYLEN=19,POS=S                 
         SENSEG NAME=WLLISB01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLLISB11,PARENT=WLLISB01,PROCOPT=GI                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE4D,PROCOPT=GOT,KEYLEN=27,POS=S                
         SENSEG NAME=WDE4D1,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE6,PROCOPT=G,KEYLEN=7,POS=S                    
         SENSEG NAME=WDE601,PARENT=0,PROCOPT=GR                                 
         SENSEG NAME=WDE611,PARENT=WDE601,PROCOPT=GR                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WL4732,PROCOPT=GOT,KEYLEN=31,POS=S               
         SENSEG NAME=WL473201,PARENT=0                                          
         SENSEG NAME=WL473211,PARENT=WL473201                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDQ2,PROCOPT=GOT,KEYLEN=19,POS=S,       *        
               PROCSEQ=WDQ2C                                                    
         SENSEG NAME=WDQ201,PARENT=0                                            
         SENSEG NAME=WDQ212,PARENT=WDQ201                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40694                                       
         END                                                                    
