*          DATA SET W40672PII0 AT LEVEL 003 AS OF 87/08/26                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXDQ,PROCOPT=GOT,KEYLEN=70,POS=S               
         SENSEG NAME=WLXXDQ01,PARENT=0                                          
         SENSEG NAME=WLXXDQ11,PARENT=WLXXDQ01                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40672                                       
         END                                                                    
