*                                                                               
*   IMS PRINTER                                                                 
PRINT    PCB   TYPE=TP,NAME=,ALTRESP=NO,SAMETRM=NO,                    *        
               MODIFY=YES,EXPRESS=NO                                            
*                                                                               
*   TRANS TILL DISTRIBUTION & PRINT                                             
DISTRDOC PCB   TYPE=TP,NAME=WZ0420X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*                                                                               
DISTRWEB PCB   TYPE=TP,NAME=WZ0420U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*   WDE1-PCB                                                                    
         PCB   TYPE=DB,DBDNAME=WDE1,PROCOPT=G,KEYLEN=21,POS=S                   
         SENSEG NAME=WDE101,PARENT=0,PROCOPT=GR                                 
         SENSEG NAME=WDE111,PARENT=WDE101                                       
         SENSEG NAME=WDE121,PARENT=WDE111                                       
*                                                                               
*   WDB3-PCB                                                                    
         PCB   TYPE=DB,DBDNAME=WDB3,PROCOPT=GOT,KEYLEN=09,POS=S                 
         SENSEG NAME=WDB301,PARENT=0                                            
*                                                                               
*   WDB9-PSB SHIPPING DOCUMENT PARAMETERS                                       
         PCB   TYPE=DB,DBDNAME=WDB9,PROCOPT=G,KEYLEN=17,POS=S                   
         SENSEG NAME=WDB901,PARENT=0                                            
*                                                                               
*   WDE6-PCB    KOLLI-REG                                                       
         PCB   TYPE=DB,DBDNAME=WDE6,PROCOPT=G,KEYLEN=4,POS=S                    
         SENSEG NAME=WDE601,PARENT=0                                            
*                                                                               
*   WDB6-PCB    DC-STYRREGISTER                                                 
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
*   SUBPROGRAM W476KLIS CARGO SPECIFICATION                                     
*                                                                               
*   KLIS-WDE1-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDE1,PROCOPT=GOTP,KEYLEN=24,POS=S                
         SENSEG NAME=WDE101,PARENT=0                                            
         SENSEG NAME=WDE111,PARENT=WDE101                                       
         SENSEG NAME=WDE121,PARENT=WDE111                                       
         SENSEG NAME=WDE131,PARENT=WDE121                                       
*                                                                               
*   KLIS-WDQ2-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDQ2,PROCOPT=GOT,KEYLEN=04,POS=S                 
         SENSEG NAME=WDQ201,PARENT=0                                            
*                                                                               
*   KLIS-WDR1-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDR1,PROCOPT=GOT,KEYLEN=31,POS=S                 
         SENSEG NAME=WDR101,PARENT=0                                            
         SENSEG NAME=WDGX4738,PARENT=WDR101                                     
*                                                                               
*   KLIS-WDB2-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
* WDG2-PCB/9305-PCB                                                             
         PCB   TYPE=DB,DBDNAME=WDG2,PROCOPT=GOT,KEYLEN=37,POS=S                 
         SENSEG NAME=WDG201,PARENT=0                                            
         SENSEG NAME=WDGX9306,PARENT=WDG201                                     
         SENSEG NAME=WDGX9308,PARENT=WDGX9306                                   
*                                                                               
*   KLIS-WDE7-PCB                                                               
*        SAMLINGSKOLLI SEQ-INDEX WDE7A                                          
         PCB   TYPE=DB,DBDNAME=WDE7,PROCOPT=GOT,KEYLEN=5,POS=S,        *        
               PROCSEQ=WDE7A                                                    
         SENSEG NAME=WDE711,PARENT=0                                            
*                                                                               
*   SUBPROGRAM W476VERS CARGO VALUE SPECIFICATION                               
*                                                                               
*   VERS-WDE1-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDE1,PROCOPT=GOTP,KEYLEN=37,POS=S                
         SENSEG NAME=WDE101,PARENT=0                                            
         SENSEG NAME=WDE111,PARENT=WDE101                                       
         SENSEG NAME=WDE122,PARENT=WDE111                                       
         SENSEG NAME=WDE121,PARENT=WDE111                                       
         SENSEG NAME=WDE131,PARENT=WDE121                                       
*                                                                               
*        4731   FÖRSÄKRANSREG. FAKTURERING   ***                                
*                                                                               
*   VERS-4731-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDG7,PROCOPT=GOT,KEYLEN=31,POS=S                 
         SENSEG NAME=WDG701,PARENT=0                                            
         SENSEG NAME=WDG730,PARENT=WDG701                                       
*                                                                               
*        4735   LEVERANSVILLKORSTEXTER   ***                                    
*                                                                               
*   VERS-4735-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDR1,PROCOPT=GOT,KEYLEN=31,POS=S                 
         SENSEG NAME=WDR101,PARENT=0                                            
         SENSEG NAME=WDGX4735,PARENT=WDR101                                     
*                                                                               
*   VERS-WDB2-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
*   SUBPROGRAM W476SPED SPEDITION SPECIFICATION                                 
*                                                                               
*   SPED-WDE1-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDE1,PROCOPT=GOTP,KEYLEN=37,POS=S                
         SENSEG NAME=WDE101,PARENT=0                                            
         SENSEG NAME=WDE111,PARENT=WDE101                                       
         SENSEG NAME=WDE122,PARENT=WDE111                                       
         SENSEG NAME=WDE121,PARENT=WDE111                                       
         SENSEG NAME=WDE131,PARENT=WDE121                                       
*                                                                               
*        4732   FRAKTTEXTER           ***                                       
*                                                                               
*   SPED-4732-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDR1,PROCOPT=GOT,KEYLEN=31,POS=S                 
         SENSEG NAME=WDR101,PARENT=0                                            
         SENSEG NAME=WDGX4732,PARENT=WDR101                                     
*                                                                               
*        4735   LEVERANSVILLKORSTEXTER   ***                                    
*                                                                               
*   SPED-4735-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDR1,PROCOPT=GOT,KEYLEN=31,POS=S                 
         SENSEG NAME=WDR101,PARENT=0                                            
         SENSEG NAME=WDGX4735,PARENT=WDR101                                     
*                                                                               
*        4738   EMBALLAGETYPSTEXT   ***                                         
*                                                                               
*   SPED-4738-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDR1,PROCOPT=GOT,KEYLEN=31,POS=S                 
         SENSEG NAME=WDR101,PARENT=0                                            
         SENSEG NAME=WDGX4738,PARENT=WDR101                                     
*                                                                               
*   SPED-WDB2-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
*   SUBPROGRAM W476GMTL GOODS RECEIVER                                          
*                                                                               
*   GMTL-WDE1-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDE1,PROCOPT=GOT,KEYLEN=37,POS=S                 
         SENSEG NAME=WDE101,PARENT=0                                            
         SENSEG NAME=WDE111,PARENT=WDE101                                       
         SENSEG NAME=WDE122,PARENT=WDE111                                       
         SENSEG NAME=WDE121,PARENT=WDE111                                       
         SENSEG NAME=WDE131,PARENT=WDE121                                       
*                                                                               
*   GMTL-WDB1-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDB1,PROCOPT=GOT,KEYLEN=11,POS=S                 
         SENSEG NAME=WDB101,PARENT=0                                            
*                                                                               
*   GMTL-WDB2-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
*        4738   EMBALLAGETYPSTEXT   ***                                         
*                                                                               
*   GMTL-4738-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDR1,PROCOPT=GOT,KEYLEN=31,POS=S                 
         SENSEG NAME=WDR101,PARENT=0                                            
         SENSEG NAME=WDGX4738,PARENT=WDR101                                     
*                                                                               
*                                                                               
*   SUBPROGRAM W476STAT CUSTOM INFORMATION                                      
*                                                                               
*   STAT-WDE1-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDE1,PROCOPT=GOTP,KEYLEN=24,POS=S                
         SENSEG NAME=WDE101,PARENT=0                                            
         SENSEG NAME=WDE111,PARENT=WDE101                                       
         SENSEG NAME=WDE121,PARENT=WDE111                                       
         SENSEG NAME=WDE131,PARENT=WDE121                                       
*                                                                               
*   STAT-WDB2-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
*   SUBPROGRAM W476PACK PACKING LIST                                            
*                                                                               
*   PACK-WDE1-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDE1,PROCOPT=GOT,KEYLEN=37,POS=S                 
         SENSEG NAME=WDE101,PARENT=0                                            
         SENSEG NAME=WDE111,PARENT=WDE101                                       
         SENSEG NAME=WDE122,PARENT=WDE111                                       
         SENSEG NAME=WDE121,PARENT=WDE111                                       
         SENSEG NAME=WDE131,PARENT=WDE121                                       
*                                                                               
*   PACK-WDE2-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDE2,PROCOPT=GOT,KEYLEN=37,POS=S                 
         SENSEG NAME=WDE201,PARENT=0                                            
         SENSEG NAME=WDE211,PARENT=WDE201                                       
         SENSEG NAME=WDE221,PARENT=WDE211                                       
         SENSEG NAME=WDE231,PARENT=WDE221                                       
*                                                                               
*   PACK-WDB1-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDB1,PROCOPT=GOT,KEYLEN=11,POS=S                 
         SENSEG NAME=WDB101,PARENT=0                                            
*                                                                               
*   PACK-WDB2-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
*        4738   EMBALLAGETYPSTEXT   ***                                         
*                                                                               
*   PACK-4738-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDR1,PROCOPT=GOT,KEYLEN=31,POS=S                 
         SENSEG NAME=WDR101,PARENT=0                                            
         SENSEG NAME=WDGX4738,PARENT=WDR101                                     
*                                                                               
*   PACK-WDF5-PCB                                                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDF5,PROCOPT=GOT,KEYLEN=11,POS=S                 
         SENSEG NAME=WDF501,PARENT=0                                            
         SENSEG NAME=WDF502,PARENT=WDF501                                       
*                                                                               
*                                                                               
*   SUBPROGRAM W476NAPR AMERICAN PROFORMA                                       
*                                                                               
*   NAPR-WDE1-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDE1,PROCOPT=GOT,KEYLEN=37,POS=S                 
         SENSEG NAME=WDE101,PARENT=0                                            
         SENSEG NAME=WDE111,PARENT=WDE101                                       
         SENSEG NAME=WDE122,PARENT=WDE111                                       
         SENSEG NAME=WDE121,PARENT=WDE111                                       
         SENSEG NAME=WDE131,PARENT=WDE121                                       
*                                                                               
*   NAPR-WDB2-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
*   NAPR-WDK7-PCB,  ARTIKELREG *DC                                              
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
*                                                                               
*   NAPR-WDD3-PCB,  BENÄMNINGSREG.                                              
         PCB   TYPE=DB,DBDNAME=WDD3,PROCOPT=GOT,KEYLEN=08,POS=S,       *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WDD301,PARENT=0                                            
         SENSEG NAME=WDD311,PARENT=WDD301                                       
*                                                                               
*   NAPR-WDR7-PCB, TRANSAR-BATCH-DISTRIBUTION DDI                               
         PCB   TYPE=DB,DBDNAME=WDR7,PROCOPT=G,KEYLEN=27,POS=S                   
         SENSEG NAME=WDR701,PARENT=0,PROCOPT=GI                                 
*                                                                               
*   NAPR-WDB6-PCB, DC STYR-REGISTER                                             
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=02,POS=S                 
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
*   SUBPROGRAM W476KULB KULLAGERBILAGA                                          
*                                                                               
*   KULB-WDE1-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDE1,PROCOPT=GOT,KEYLEN=37,POS=S                 
         SENSEG NAME=WDE101,PARENT=0                                            
         SENSEG NAME=WDE111,PARENT=WDE101                                       
         SENSEG NAME=WDE121,PARENT=WDE111                                       
         SENSEG NAME=WDE131,PARENT=WDE121                                       
*                                                                               
*   KULB-WDB2-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
*   KULB-WDB1-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDB1,PROCOPT=GOT,KEYLEN=11,POS=S                 
         SENSEG NAME=WDB101,PARENT=0                                            
*                                                                               
*   KULB-WDG7-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDG7,PROCOPT=GOT,KEYLEN=31,POS=S                 
         SENSEG NAME=WDG701,PARENT=0                                            
         SENSEG NAME=WDG740,PARENT=WDG701                                       
*                                                                               
*   SUBPROGRAM W476BLAD   BILL OF LADING                                        
*                                                                               
*   BILL-WDE1-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDE1,PROCOPT=GOTP,KEYLEN=21,POS=S                
         SENSEG NAME=WDE101,PARENT=0                                            
         SENSEG NAME=WDE111,PARENT=WDE101                                       
         SENSEG NAME=WDE121,PARENT=WDE111                                       
*                                                                               
*   BILL-WDE6-PCB  KOLLIREG.                                                    
         PCB   TYPE=DB,DBDNAME=WDE6,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDE601,PARENT=0                                            
         SENSEG NAME=WDE611,PARENT=WDE601                                       
*                                                                               
*   BILL-WDQ2-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDQ2,PROCOPT=GOT,KEYLEN=04,POS=S                 
         SENSEG NAME=WDQ201,PARENT=0                                            
*                                                                               
*   BILL-WDR1-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDR1,PROCOPT=GOT,KEYLEN=31,POS=S                 
         SENSEG NAME=WDR101,PARENT=0                                            
         SENSEG NAME=WDGX4738,PARENT=WDR101                                     
*                                                                               
*        WDR2 HTYP 1165/1168, FARLIGT GODS                                      
*   BILL-1165-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDR2,PROCOPT=GOT,KEYLEN=32,POS=S                 
         SENSEG NAME=WDR201,PARENT=0                                            
         SENSEG NAME=WDGX1168,PARENT=WDR201                                     
*                                                                               
*   BILL-TRANSAKTIONS REGISTER                                                  
         PCB   TYPE=DB,DBDNAME=WDR6,PROCOPT=G,KEYLEN=27,POS=S                   
         SENSEG NAME=WDR601,PARENT=0,PROCOPT=GI                                 
*                                                                               
*   MANF-ARTIKELREG CDC                                                         
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=05,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
*                                                                               
*   MANF-LEVERANTÖR REGISTER                                                    
         PCB   TYPE=DB,DBDNAME=WDF1,PROCOPT=GOT,KEYLEN=6,POS=S                  
         SENSEG NAME=WDF101,PARENT=0                                            
         SENSEG NAME=WDF106,PARENT=WDF101                                       
*                                                                               
*   SUBPROGRAM W476CUST CUSTOM INFORMATION DUBAI                                
*                                                                               
*   CUST-WDE1-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDE1,PROCOPT=GOTP,KEYLEN=24,POS=S                
         SENSEG NAME=WDE101,PARENT=0                                            
         SENSEG NAME=WDE111,PARENT=WDE101                                       
         SENSEG NAME=WDE122,PARENT=WDE111                                       
         SENSEG NAME=WDE121,PARENT=WDE111                                       
         SENSEG NAME=WDE131,PARENT=WDE121                                       
*                                                                               
*   CUST-WDD3-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDD3,PROCOPT=GOT,KEYLEN=8,POS=S,        *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WDD301,PARENT=0                                            
         SENSEG NAME=WDD311,PARENT=WDD301                                       
*                                                                               
*   CUST-WDK6-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=6,POS=S                  
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40631                                       
         END                                                                    
