*                                                                               
*             PCB FÖR PRINTER                                                   
         PCB   TYPE=TP,LTERM=,ALTRESP=NO,SAMETRM=NO,                   *        
               MODIFY=YES,EXPRESS=NO                                            
*                                                                               
*        WDR4 HTYP 4463, BILL OF LADING                                         
         PCB   TYPE=DB,DBDNAME=WL4463,PROCOPT=GOT,KEYLEN=76,POS=S               
         SENSEG NAME=WL446301,PARENT=0                                          
         SENSEG NAME=WL446311,PARENT=WL446301                                   
         SENSEG NAME=WL446321,PARENT=WL446311                                   
         SENSEG NAME=WL446331,PARENT=WL446321                                   
*                                                                               
*        ORQI-PCB - WDQ2C, ORDERHUVUDREG KÖ SEK.INDEX                           
         PCB   TYPE=DB,DBDNAME=WLORQI,PROCOPT=GOT,KEYLEN=19,POS=S,     *        
               PROCSEQ=WDQ2C                                                    
         SENSEG NAME=WLORQI01,PARENT=0                                          
         SENSEG NAME=WLORQI12,PARENT=WLORQI01                                   
*                                                                               
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40682                                       
         END                                                                    
