*  ALT-PCB   FOR RETURN TO W4677                                                
         PCB   TYPE=TP,NAME=W4T677,ALTRESP=NO,SAMETRM=NO,              *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*  WDP7-PCB  USER DATABASE                                                      
         PCB    TYPE=DB,DBDNAME=WDP7,PROCOPT=G,KEYLEN=8,POS=S                   
         SENSEG NAME=WDP701,PARENT=0,PROCOPT=GIR                                
*                                                                               
*  4479-PCB                                                                     
         PCB   TYPE=DB,DBDNAME=WDR4,PROCOPT=GOT,KEYLEN=55,POS=S                 
         SENSEG NAME=WDR401,PARENT=0                                            
         SENSEG NAME=WDGX4482,PARENT=WDR401                                     
*                                                                               
*  4495-PCB                                                                     
         PCB   TYPE=DB,DBDNAME=WDR4,PROCOPT=GOT,KEYLEN=31,POS=S                 
         SENSEG NAME=WDR401,PARENT=0                                            
         SENSEG NAME=WDGX4496,PARENT=WDR401                                     
*                                                                               
*  WDE2-PCB  TRANSPORT RELEASE REGISTER - BILL IT                               
         PCB   TYPE=DB,DBDNAME=WDE2,PROCOPT=G,KEYLEN=14,POS=S                   
         SENSEG NAME=WDE201,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDE211,PARENT=WDE201,PROCOPT=GIR                           
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
*  PCB TO SUBPROGRAM W476SHNO                                                   
*                                                                               
*  SHNO-4517-PCB IDSHIPM REGISTER                                               
         PCB   TYPE=DB,DBDNAME=WDR1,PROCOPT=G,KEYLEN=31,POS=S                   
         SENSEG NAME=WDR101,PARENT=0                                            
         SENSEG NAME=WDGX4518,PARENT=WDR101,PROCOPT=GR                          
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40678                                       
         END                                                                    
