*                                                                               
*                                                                               
* TRPINF PCB'ERNA ÄR TILL FÖR ATT WZ01 SKALL SKRIVA                             
* TESTFILER MOT PRINTER. NÄR SKRIVNING SKER MOT                                 
* VCOM BEHÖVS INTE PSB'ERNA MER                                                 
*                                                                               
NLTRPRSI PCB   TYPE=TP,LTERM=,ALTRESP=NO,SAMETRM=NO,                   *        
               MODIFY=YES,EXPRESS=NO                                            
*                                                                               
OVTRPRSI PCB   TYPE=TP,LTERM=,ALTRESP=NO,SAMETRM=NO,                   *        
               MODIFY=YES,EXPRESS=NO                                            
*                                                                               
*                                                                               
* TRANSPORTRELEASE                                                              
         PCB   TYPE=DB,DBDNAME=WDE1,PROCOPT=GOT,KEYLEN=24,POS=S                 
         SENSEG NAME=WDE101,PARENT=0                                            
         SENSEG NAME=WDE111,PARENT=WDE101                                       
         SENSEG NAME=WDE121,PARENT=WDE111                                       
         SENSEG NAME=WDE131,PARENT=WDE121                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE4,PROCOPT=GOT,KEYLEN=30,POS=S,       *        
               PROCSEQ=WDE4B                                                    
         SENSEG NAME=WDE411,PARENT=0                                            
         SENSEG NAME=WDE401,PARENT=WDE411                                       
         SENSEG NAME=WDE421,PARENT=WDE411                                       
*                                                                               
*    HÄNDELSE (4491) I R4  BOLLA-NUMMER                                         
         PCB   TYPE=DB,DBDNAME=WDR4,PROCOPT=GOT,KEYLEN=64,POS=S                 
         SENSEG NAME=WDR401,PARENT=0                                            
         SENSEG NAME=WDGX4494,PARENT=WDR401                                     
*                                                                               
*     WDB6-DC-REGISTER  WDB6                                                    
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
*     WDB2-KUND-REG  WDB2                                                       
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40630                                       
         END                                                                    
