*                                                                               
* SOP-START                                                                     
         PCB   TYPE=TP,NAME=W0T606U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* WZ01-PCB, STARTAR   PGM W4063100                                              
SHIPDOK  PCB   TYPE=TP,NAME=W40631X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* WZ01-PCB, STARTAR   PGM W4063700                                              
BUILDIT  PCB   TYPE=TP,NAME=W40637X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* 4679-PCB, START BACKGROUND MPP TO SEND SHIPMENT TO TMS                        
SHIP2TMS PCB   TYPE=TP,NAME=W40679X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*WDP7-     USER-DB                                                              
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GOT,KEYLEN=8,POS=S                
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
* SHIPPING                                                                      
         PCB   TYPE=DB,DBDNAME=WDE1,PROCOPT=G,KEYLEN=21,POS=S                   
         SENSEG NAME=WDE101,PARENT=0,PROCOPT=GR                                 
         SENSEG NAME=WDE111,PARENT=WDE101                                       
         SENSEG NAME=WDE121,PARENT=WDE111,PROCOPT=GR                            
*                                                                               
* TRPT.RELEASEREG                                                               
         PCB   TYPE=DB,DBDNAME=WDE2,PROCOPT=GOT,KEYLEN=24,POS=S                 
         SENSEG NAME=WDE201,PARENT=0                                            
         SENSEG NAME=WDE211,PARENT=WDE201                                       
         SENSEG NAME=WDE221,PARENT=WDE211                                       
         SENSEG NAME=WDE231,PARENT=WDE221                                       
*                                                                               
* KUNDREG KÖPARREG                                                              
         PCB   TYPE=DB,DBDNAME=WDB1,PROCOPT=GOT,KEYLEN=11,POS=S                 
         SENSEG NAME=WDB101,PARENT=0                                            
*                                                                               
* GODSMOTTAGARREG                                                               
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=G,KEYLEN=07,POS=S                   
         SENSEG NAME=WDB201,PARENT=0,PROCOPT=GR                                 
*                                                                               
* KUNDORDERREG.                                                                 
         PCB   TYPE=DB,DBDNAME=WDE4,PROCOPT=GOT,KEYLEN=26,POS=S,       *        
               PROCSEQ=WDE4E                                                    
         SENSEG NAME=WDE401,PARENT=0                                            
*                                                                               
* KOLLIREG                                                                      
         PCB   TYPE=DB,DBDNAME=WDE6,PROCOPT=G,KEYLEN=07,POS=S                   
         SENSEG NAME=WDE601,PARENT=0,PROCOPT=GR                                 
         SENSEG NAME=WDE611,PARENT=WDE601,PROCOPT=GR                            
*                                                                               
* ORDERHUVUD                                                                    
         PCB   TYPE=DB,DBDNAME=WDQ2,PROCOPT=G,KEYLEN=11,POS=S                   
         SENSEG NAME=WDQ201,PARENT=0                                            
         SENSEG NAME=WDQ211,PARENT=WDQ201,PROCOPT=GR                            
         SENSEG NAME=WDQ212,PARENT=WDQ201,PROCOPT=GR                            
*                                                                               
* ARTIKELREG CDC                                                                
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=06,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
*                                                                               
*                                                                               
* TRANSAR-BATCH-DISTRIBUTION DDI                                                
         PCB   TYPE=DB,DBDNAME=WDR7,PROCOPT=G,KEYLEN=27,POS=S                   
         SENSEG NAME=WDR701,PARENT=0,PROCOPT=GI                                 
*                                                                               
* DDI-FAKT-TRANSAR                                                              
         PCB   TYPE=DB,DBDNAME=WDR4,PROCOPT=G,KEYLEN=44,POS=S                   
         SENSEG NAME=WDR401,PARENT=0                                            
         SENSEG NAME=WDGX4508,PARENT=WDR401,PROCOPT=GIR                         
         SENSEG NAME=WDGX4510,PARENT=WDGX4508,PROCOPT=GI                        
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40634                                       
         END                                                                    
