*                                                                               
* WZ01-PCB, START     PGM W4063600                                              
ADDIT    PCB   TYPE=TP,NAME=W40636X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*        -- ALT-PCB  FOR 4639                                                   
         PCB   TYPE=TP,NAME=W40639X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*        -- ALT3-PCB  FOR 4539                                                  
         PCB   TYPE=TP,NAME=W4T539X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*        -- ALT4-PCB  FOR 4540                                                  
         PCB   TYPE=TP,NAME=W4T540X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*  USER DATABASE                                                                
         PCB    TYPE=DB,DBDNAME=WDP7,PROCOPT=G,KEYLEN=8,POS=S                   
         SENSEG NAME=WDP701,PARENT=0,PROCOPT=GIR                                
*                                                                               
*        KOLLIREGISTER,                                                         
         PCB   TYPE=DB,DBDNAME=WDE6,PROCOPT=GOT,KEYLEN=10,POS=S                 
         SENSEG NAME=WDE601,PARENT=0                                            
         SENSEG NAME=WDE611,PARENT=WDE601                                       
*                                                                               
*  TRANSPORT RELEASE REGISTER                                                   
         PCB   TYPE=DB,DBDNAME=WDE1,PROCOPT=G,KEYLEN=21,POS=S                   
         SENSEG NAME=WDE101,PARENT=0,PROCOPT=GIR                                
         SENSEG NAME=WDE111,PARENT=WDE101,PROCOPT=GI                            
         SENSEG NAME=WDE121,PARENT=WDE111,PROCOPT=GI                            
*                                                                               
*  TRANSPORT RELEASE REGISTER - BILL IT                                         
         PCB   TYPE=DB,DBDNAME=WDE2,PROCOPT=G,KEYLEN=21,POS=S                   
         SENSEG NAME=WDE201,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDE211,PARENT=WDE201,PROCOPT=GIR                           
         SENSEG NAME=WDE221,PARENT=WDE211,PROCOPT=GI                            
*                                                                               
*  CUSTOMER REGISTER                                                            
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
*  4495-PCB                                                                     
         PCB   TYPE=DB,DBDNAME=WDR4,PROCOPT=GOT,KEYLEN=55,POS=S                 
         SENSEG NAME=WDR401,PARENT=0                                            
         SENSEG NAME=WDGX4498,PARENT=WDR401                                     
*                                                                               
*  4513-PCB 'FARLIGT-GOOD'-REGISTER                                             
         PCB   TYPE=DB,DBDNAME=WDR4,PROCOPT=G,KEYLEN=51,POS=S                   
         SENSEG NAME=WDR401,PARENT=0                                            
         SENSEG NAME=WDGX4514,PARENT=WDR401,PROCOPT=GI                          
         SENSEG NAME=WDGX4516,PARENT=WDGX4514,PROCOPT=GI                        
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
*  PCB TO SUBPROGRAM W476SHNO                                                   
*  SHNO-4517-PCB IDSHIPM REGISTER                                               
         PCB   TYPE=DB,DBDNAME=WDR1,PROCOPT=G,KEYLEN=31,POS=S                   
         SENSEG NAME=WDR101,PARENT=0                                            
         SENSEG NAME=WDGX4518,PARENT=WDR101,PROCOPT=GR                          
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40639                                       
         END                                                                    
