*                                                                               
*                                                                               
*   IMS PRINTER                                                                 
         PCB   TYPE=TP,NAME=,ALTRESP=NO,SAMETRM=NO,                    *        
               MODIFY=YES,EXPRESS=NO                                            
*                                                                               
*                                                                               
* ALT-PCB,  STARTAR OM PGM W4066400                                             
         PCB   TYPE=TP,NAME=W4T664,ALTRESP=NO,SAMETRM=NO,              *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*   TRANS TILL DISTRIBUTION & PRINT                                             
*  DISTRDOC PCB   TYPE=TP,NAME=WZ0420X,ALTRESP=NO,SAMETRM=NO,                   
*                MODIFY=NO,EXPRESS=NO                                           
*                                                                               
* USER DATABASE                                                                 
         PCB   TYPE=DB,DBDNAME=WDP7,PROCOPT=G,KEYLEN=8,POS=S                    
         SENSEG NAME=WDP701,PARENT=0,PROCOPT=GIR                                
*                                                                               
* PCB WDE1  TRANSPORTRELEASEREG.                                                
         PCB   TYPE=DB,DBDNAME=WDE1,PROCOPT=GOT,KEYLEN=21,POS=S                 
         SENSEG NAME=WDE101,PARENT=0                                            
         SENSEG NAME=WDE111,PARENT=WDE101                                       
*        SENSEG NAME=WDE122,PARENT=WDE111                                       
         SENSEG NAME=WDE121,PARENT=WDE111                                       
*                                                                               
* PCB WDE6  KOLLIREGISTER                                                       
         PCB   TYPE=DB,DBDNAME=WDE6,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDE601,PARENT=0                                            
         SENSEG NAME=WDE611,PARENT=WDE601                                       
*                                                                               
*        4738   EMBALLAGETYPSTEXT   ***                                         
*        4739   LASTBÄRARTYPSTEXT   ***                                         
*                                                                               
*   WDR1-4738-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDR1,PROCOPT=GOT,KEYLEN=31,POS=S                 
         SENSEG NAME=WDR101,PARENT=0                                            
         SENSEG NAME=WDGX4738,PARENT=WDR101                                     
         SENSEG NAME=WDGX4739,PARENT=WDR101                                     
*                                                                               
*   WDB9-PSB SHIPPING DOCUMENT PARAMETERS                                       
         PCB   TYPE=DB,DBDNAME=WDB9,PROCOPT=GOT,KEYLEN=17,POS=S                 
         SENSEG NAME=WDB901,PARENT=0                                            
*                                                                               
*   WDB5-PSB FRAKT-MÄRKNING, KUNDREG.                                           
         PCB   TYPE=DB,DBDNAME=WDB5,PROCOPT=GOT,KEYLEN=11,POS=S                 
         SENSEG NAME=WDB501,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40674                                       
         END                                                                    
