*                                                                               
* ALT1-PCB TRANS FOR PGM W4062200                                               
         PCB   TYPE=TP,NAME=W4T622,ALTRESP=NO,SAMETRM=NO,              *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB    TYPE=DB,DBDNAME=WDP7,PROCOPT=G,KEYLEN=8,POS=S                   
         SENSEG NAME=WDP701,PARENT=0,PROCOPT=GIR                                
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE1,PROCOPT=GOTP,KEYLEN=21,POS=S                
         SENSEG NAME=WDE101,PARENT=0                                            
         SENSEG NAME=WDE111,PARENT=WDE101                                       
         SENSEG NAME=WDE121,PARENT=WDE111                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40621                                       
         END                                                                    
