*          DATA SET W40652PII0 AT LEVEL 003 AS OF 87/08/26                      
*                                                                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE6C,PROCOPT=GOT,KEYLEN=42,POS=S                
         SENSEG NAME=WDE6C1,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXDN,PROCOPT=G,KEYLEN=50,POS=S                 
         SENSEG NAME=WLXXDN01,PARENT=0                                          
         SENSEG NAME=WLXXDN11,PARENT=WLXXDN01                                   
         SENSEG NAME=WLXXDN21,PARENT=WLXXDN11,PROCOPT=GRI                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXDO,PROCOPT=G,KEYLEN=50,POS=S                 
         SENSEG NAME=WLXXDO01,PARENT=0                                          
         SENSEG NAME=WLXXDO11,PARENT=WLXXDO01                                   
         SENSEG NAME=WLXXDO21,PARENT=WLXXDO11,PROCOPT=GR                        
*                                                                               
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40652                                       
         END                                                                    
