*                                                                               
*        -- ALT-OMSTART-PCB                                                     
         PCB   TYPE=TP,NAME=W4T664U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*        -- ALT-4698-PCB                                                        
         PCB   TYPE=TP,NAME=W4T698X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*        -- ALT-4675-PCB                                                        
         PCB   TYPE=TP,NAME=W4T675,ALTRESP=NO,SAMETRM=NO,              *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*        -- ALT-4675-PCB                                                        
         PCB   TYPE=TP,NAME=W4T675X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*        -- ALT-4677-PCB                                                        
         PCB   TYPE=TP,NAME=W4T677,ALTRESP=NO,SAMETRM=NO,              *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*        -- ALT-4677-PCB                                                        
         PCB   TYPE=TP,NAME=W4T677X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*        -- ALT-4639-PCB                                                        
         PCB   TYPE=TP,NAME=W40639X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
*        KOLLIREGISTER,                UPPDATERA                                
         PCB   TYPE=DB,DBDNAME=WDE6,PROCOPT=G,KEYLEN=7,POS=S                    
         SENSEG NAME=WDE601,PARENT=0,PROCOPT=GR                                 
         SENSEG NAME=WDE611,PARENT=WDE601,PROCOPT=GR                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE4,PROCOPT=GOT,KEYLEN=23,POS=S,       *        
               PROCSEQ=WDE4A                                                    
         SENSEG NAME=WDE401,PARENT=0                                            
*                                                                               
*        ACTIONFILE, LASTADE KOLLIN PÅ TRANSPORT/LASTBÄRARE                     
         PCB   TYPE=DB,DBDNAME=WDR4,PROCOPT=G,KEYLEN=55,POS=S                   
         SENSEG NAME=WDR401,PARENT=0,PROCOPT=GD                                 
         SENSEG NAME=WDGX4496,PARENT=WDR401,PROCOPT=GR                          
         SENSEG NAME=WDGX4497,PARENT=WDR401,PROCOPT=GD                          
         SENSEG NAME=WDGX4498,PARENT=WDR401,PROCOPT=GD                          
*                                                                               
*        KUNDREGISTER, WDB2                                                     
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
*        4479 ACTION TRANSACTION FOR PROFORMA - COPY OF 4495                    
         PCB   TYPE=DB,DBDNAME=WDR4,PROCOPT=G,KEYLEN=56,POS=S                   
         SENSEG NAME=WDR401,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDGX4480,PARENT=WDR401,PROCOPT=GI                          
         SENSEG NAME=WDGX4482,PARENT=WDR401,PROCOPT=GI                          
*        DC-REGISTER, WDB6                                                      
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
* KUNDREG      WDB1, KUNDREG, BETALARINF.                                       
         PCB    TYPE=DB,DBDNAME=WDB1,PROCOPT=GOT,KEYLEN=11,POS=S                
         SENSEG NAME=WDB101,PARENT=0                                            
*                                                                               
* WDG2-PCB/9305-PCB                                                             
         PCB   TYPE=DB,DBDNAME=WDG2,PROCOPT=GOT,KEYLEN=37,POS=S                 
         SENSEG NAME=WDG201,PARENT=0                                            
         SENSEG NAME=WDGX9306,PARENT=WDG201                                     
         SENSEG NAME=WDGX9308,PARENT=WDGX9306                                   
*                                                                               
*        SAMKOLLIREGISTER                                                       
         PCB   TYPE=DB,DBDNAME=WDE7,PROCOPT=G,KEYLEN=5,POS=S,          *        
               PROCSEQ=WDE7A                                                    
         SENSEG NAME=WDE711,PARENT=0,PROCOPT=GR                                 
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40664                                       
         END                                                                    
