*                                                                               
*        -- ALT-4697-PCB                                                        
         PCB   TYPE=TP,NAME=W4T697X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WL4491,PROCOPT=GOT,KEYLEN=64,POS=S               
         SENSEG NAME=WL449101,PARENT=0                                          
         SENSEG NAME=WL449112,PARENT=WL449101                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40667                                       
         END                                                                    
