*                                                                               
*        TRANS TILL DISTRIBUTION & PRINT                                        
DISTRDOC PCB   TYPE=TP,NAME=WZ0420X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*        TRANS TILL DISTRIBUTION & PRINT WEB                                    
DISTRWEB PCB   TYPE=TP,NAME=WZ0420U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*        -- ALT-4675-PCB                                                        
         PCB   TYPE=TP,NAME=W4T675,ALTRESP=NO,SAMETRM=NO,              *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*        -- ALT-4675-PCB                                                        
         PCB   TYPE=TP,NAME=W4T675X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*             WDB2 KUNDREGISTER                                                 
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
*             WDB7 VIPS-KUNDREGISTER                                            
         PCB   TYPE=DB,DBDNAME=WDB7,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDB701,PARENT=0                                            
*                                                                               
*             WDB7 VIPS-KUNDREGISTER                                            
         PCB   TYPE=DB,DBDNAME=WDB7,PROCOPT=GOT,KEYLEN=08,POS=S,       *        
               PROCSEQ=WDB7A                                                    
         SENSEG NAME=WDB701,PARENT=0                                            
*                                                                               
*             WDE6 KOLLIREG                                                     
         PCB   TYPE=DB,DBDNAME=WDE6,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDE601,PARENT=0                                            
         SENSEG NAME=WDE611,PARENT=WDE601                                       
*                                                                               
*             WDE4 KUNDORDER                                                    
         PCB   TYPE=DB,DBDNAME=WDE4,PROCOPT=GOT,KEYLEN=14,POS=S,       *        
               PROCSEQ=WDE4F                                                    
         SENSEG NAME=WDE411,PARENT=0                                            
         SENSEG NAME=WDE421,PARENT=WDE411                                       
*                                                                               
*             WDQ2 ORDERHUVUD                                                   
         PCB   TYPE=DB,DBDNAME=WDQ2,PROCOPT=GOT,KEYLEN=17,POS=S,       *        
               PROCSEQ=WDQ2C                                                    
         SENSEG NAME=WDQ201,PARENT=0                                            
*                                                                               
*             WDR4 LASTBÄRARREGISTER                                            
         PCB   TYPE=DB,DBDNAME=WL4495,PROCOPT=G,KEYLEN=55,POS=S                 
         SENSEG NAME=WL449501,PARENT=0                                          
         SENSEG NAME=WL449512,PARENT=WL449501,PROCOPT=GID                       
*                                                                               
*             WDR4 BOLLAREGISTER                                                
         PCB   TYPE=DB,DBDNAME=WL4491,PROCOPT=G,KEYLEN=64,POS=S                 
         SENSEG NAME=WL449101,PARENT=0                                          
         SENSEG NAME=WL449111,PARENT=WL449101,PROCOPT=GIRD                      
         SENSEG NAME=WL449112,PARENT=WL449101,PROCOPT=GID                       
*                                                                               
*             WDR1 EMBALLAGETYP                                                 
         PCB  TYPE=DB,DBDNAME=WL4738,PROCOPT=GOT,KEYLEN=31,POS=S                
         SENSEG NAME=WL473801,PARENT=0                                          
         SENSEG NAME=WL473811,PARENT=WL473801                                   
*                                                                               
*        DC-REGISTER, WDB6                                                      
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
*        ÅTERSTART INLÄGGNINGSLISTA                                             
         PCB   TYPE=DB,DBDNAME=WLLISB,PROCOPT=G,KEYLEN=19,POS=S                 
         SENSEG NAME=WLLISB01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLLISB11,PARENT=WLLISB01,PROCOPT=GI                        
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40698                                       
         END                                                                    
