*                                                                               
* DISP MPP                                                                      
         PCB   TYPE=TP,NAME=W0T693X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* WZ01-PCB, STARTAR   PGM W4063200                                              
SHIPIT   PCB   TYPE=TP,NAME=W40632X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* WZ01-PCB, STARTAR   PGM W4063100                                              
SHIPDOK  PCB   TYPE=TP,NAME=W40631X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* WZ01-PCB, STARTAR   PGM W4063700                                              
BUILDIT  PCB   TYPE=TP,NAME=W40637X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* WZ01-PCB, STARTAR   PGM W4063600                                              
ADDIT    PCB   TYPE=TP,NAME=W40636X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* ALT-PCB,  STARTAR   PGM W4067400                                              
         PCB   TYPE=TP,NAME=W4T674,ALTRESP=NO,SAMETRM=NO,              *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*                                                                               
* TRANSPORTRELEASEREG.                                                          
         PCB   TYPE=DB,DBDNAME=WDE1,PROCOPT=G,KEYLEN=24,POS=S                   
         SENSEG NAME=WDE101,PARENT=0,PROCOPT=GR                                 
         SENSEG NAME=WDE111,PARENT=WDE101,PROCOPT=GR                            
         SENSEG NAME=WDE122,PARENT=WDE111                                       
         SENSEG NAME=WDE121,PARENT=WDE111,PROCOPT=GR                            
         SENSEG NAME=WDE131,PARENT=WDE121,PROCOPT=GI                            
*                                                                               
* PCB WDE1X TRANSPORTRELEASEREG.                                                
         PCB   TYPE=DB,DBDNAME=WDE1,PROCOPT=G,KEYLEN=21,POS=S                   
         SENSEG NAME=WDE101,PARENT=0                                            
         SENSEG NAME=WDE111,PARENT=WDE101,PROCOPT=GR                            
         SENSEG NAME=WDE122,PARENT=WDE111,PROCOPT=GIR                           
         SENSEG NAME=WDE121,PARENT=WDE111                                       
*                                                                               
* TRANSPORTRELEASEREG. FAKTURA                                                  
         PCB   TYPE=DB,DBDNAME=WDE2,PROCOPT=G,KEYLEN=24,POS=S                   
         SENSEG NAME=WDE201,PARENT=0                                            
         SENSEG NAME=WDE211,PARENT=WDE201,PROCOPT=GR                            
         SENSEG NAME=WDE221,PARENT=WDE211,PROCOPT=GR                            
         SENSEG NAME=WDE231,PARENT=WDE221,PROCOPT=GI                            
*                                                                               
* PCB  WDE2X  TRANSPORTRELEASEREG. FAKTURA                                      
         PCB   TYPE=DB,DBDNAME=WDE2,PROCOPT=G,KEYLEN=21,POS=S                   
         SENSEG NAME=WDE201,PARENT=0,PROCOPT=GR                                 
         SENSEG NAME=WDE211,PARENT=WDE201,PROCOPT=GR                            
         SENSEG NAME=WDE221,PARENT=WDE211                                       
*                                                                               
* KUNDORDERREG.                                                                 
         PCB   TYPE=DB,DBDNAME=WDE4,PROCOPT=G,KEYLEN=30,POS=S,         *        
               PROCSEQ=WDE4F                                                    
         SENSEG NAME=WDE411,PARENT=0,PROCOPT=GR                                 
         SENSEG NAME=WDE401,PARENT=WDE411,PROCOPT=GR                            
         SENSEG NAME=WDE421,PARENT=WDE411                                       
*                                                                               
* KUNDORDERREG. WDE4X                                                           
         PCB   TYPE=DB,DBDNAME=WDE4,PROCOPT=G,KEYLEN=30,POS=S,         *        
               PROCSEQ=WDE4F                                                    
         SENSEG NAME=WDE411,PARENT=0,PROCOPT=GR                                 
         SENSEG NAME=WDE401,PARENT=WDE411,PROCOPT=GR                            
*                                                                               
* KOLLIREG.                                                                     
         PCB   TYPE=DB,DBDNAME=WDE6,PROCOPT=G,KEYLEN=08,POS=S                   
         SENSEG NAME=WDE601,PARENT=0,PROCOPT=GR                                 
         SENSEG NAME=WDE611,PARENT=WDE601,PROCOPT=GR                            
         SENSEG NAME=WDE621,PARENT=WDE611,PROCOPT=GR                            
*                                                                               
* DDI PRISFRÅGA                                                                 
         PCB   TYPE=DB,DBDNAME=WDC7,PROCOPT=G,KEYLEN=33,POS=S                   
         SENSEG NAME=WDC701,PARENT=0                                            
         SENSEG NAME=WDC711,PARENT=WDC701,PROCOPT=GR                            
*                                                                               
* AREG-ARTIKELINFORMATION  WDK6                                                 
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=06,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
* ARTIKELREG *DC                                                                
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK712,PARENT=WDK701                                       
*                                                                               
* WDG2-PCB/9305-PCB                                                             
         PCB   TYPE=DB,DBDNAME=WDG2,PROCOPT=GOT,KEYLEN=37,POS=S                 
         SENSEG NAME=WDG201,PARENT=0                                            
         SENSEG NAME=WDGX9306,PARENT=WDG201                                     
         SENSEG NAME=WDGX9308,PARENT=WDGX9306                                   
*                                                                               
* BETALARINFO                                                                   
         PCB   TYPE=DB,DBDNAME=WDB1,PROCOPT=GOT,KEYLEN=11,POS=S                 
         SENSEG NAME=WDB101,PARENT=0                                            
*                                                                               
* GODSMOTTAGARREG                                                               
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
* KUNDREG  LAGER-INFO                                                           
         PCB   TYPE=DB,DBDNAME=WDB3,PROCOPT=GOT,KEYLEN=09,POS=S                 
         SENSEG NAME=WDB301,PARENT=0                                            
*                                                                               
* BENÄMNINGSREG.                                                                
         PCB   TYPE=DB,DBDNAME=WDD3,PROCOPT=GOT,KEYLEN=08,POS=S,       *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WDD301,PARENT=0                                            
         SENSEG NAME=WDD311,PARENT=WDD301                                       
*                                                                               
* SALDO-LOGG - SOL                                                              
         PCB   TYPE=DB,DBDNAME=WDL9,PROCOPT=G,KEYLEN=20,POS=S                   
         SENSEG NAME=WDL901,PARENT=0,PROCOPT=GI                                 
*                                                                               
* ORDERHUVUDREG.                                                                
         PCB   TYPE=DB,DBDNAME=WDQ2,PROCOPT=GOT,KEYLEN=04,POS=S                 
         SENSEG NAME=WDQ201,PARENT=0                                            
*                                                                               
* VOR REGISTER NYTT                                                             
         PCB   TYPE=DB,DBDNAME=WDA6,PROCOPT=G,KEYLEN=40,POS=S,         *        
               PROCSEQ=WDA6B                                                    
         SENSEG NAME=WDA601,PARENT=0,PROCOPT=GR                                 
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=3,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB617,PARENT=WDB601                                       
*                                                                               
* ORDER HEAD                                                                    
        PCB    TYPE=DB,DBDNAME=WDQ2,PROCOPT=GOT,KEYLEN=24,POS=S,       *        
               PROCSEQ=WDQ2C                                                    
        SENSEG NAME=WDQ201,PARENT=0                                             
*                                                                               
* BACK ORDER                                                                    
         PCB   TYPE=DB,DBDNAME=WDA5,PROCOPT=GOT,KEYLEN=24,POS=S                 
         SENSEG NAME=WDA501,PARENT=0                                            
*                                                                               
*- - -  PRISMODULENS BASER                                                      
* PRIS-ARTC-PCB - ARTIKELINFORMATION  WDK6                                      
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=19,POS=S               
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
         SENSEG NAME=WLARTC21,PARENT=WLARTC11                                   
*                                                                               
* PRIS-WDK7-PCB - ARTIKELINFO                                                   
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=20,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK724,PARENT=WDK711                                       
         SENSEG NAME=WDK712,PARENT=WDK701                                       
*                                                                               
* PRIS-GMTA-PCB - GODSMOTTAGARE     WDB2                                        
         PCB     TYPE=DB,DBDNAME=WLGMTA,PROCOPT=GOT,KEYLEN=07,POS=S             
         SENSEG  NAME=WLGMTA01                                                  
*                                                                               
* PRIS-BETA-PCB - BETALAREREGISTRET WDB1                                        
         PCB     TYPE=DB,DBDNAME=WLBETC,PROCOPT=GOT,KEYLEN=11,POS=S             
         SENSEG  NAME=WLBETC01                                                  
*                                                                               
* PRIS-WLPRIA-PCB - PRISREGISTRET WDC1                                          
         PCB     TYPE=DB,DBDNAME=WLPRIA,PROCOPT=GOT,KEYLEN=06,POS=S             
         SENSEG  NAME=WLPRIA01                                                  
*                                                                               
* PRIS-WLPRIB-PCB - PRIS RABATT REGISTER WLC2                                   
         PCB     TYPE=DB,DBDNAME=WLPRIB,PROCOPT=GOT,KEYLEN=16,POS=S             
         SENSEG  NAME=WLPRIB01,PARENT=0                                         
         SENSEG  NAME=WLPRIB11,PARENT=WLPRIB01                                  
         SENSEG  NAME=WLPRIB12,PARENT=WLPRIB01                                  
         SENSEG  NAME=WLPRIB13,PARENT=WLPRIB01                                  
*                                                                               
* PRIS-COST-WDK6-PCB - ARTIKELINFORMATION WDK6                                  
         PCB     TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=19,POS=S               
         SENSEG  NAME=WDK601,PARENT=0                                           
         SENSEG  NAME=WDK611,PARENT=WDK601                                      
         SENSEG  NAME=WDK621,PARENT=WDK611                                      
*                                                                               
* PRIS-COST-WDK7-PCB - ARTIKELINFORMATION WDK7                                  
         PCB     TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG  NAME=WDK701,PARENT=0                                           
         SENSEG  NAME=WDK711,PARENT=WDK701                                      
*                                                                               
* PRIS-COST-WDF1-PCB - LEVERANTÖRSINFO WDF1                                     
         PCB     TYPE=DB,DBDNAME=WDF1,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG  NAME=WDF101,PARENT=0                                           
         SENSEG  NAME=WDF102,PARENT=WDF101                                      
*                                                                               
* PRIS-COST-WDG2-PCB - VALUTAINFORMATION WDG2                                   
         PCB   TYPE=DB,DBDNAME=WDG2,PROCOPT=GOT,KEYLEN=37,POS=S                 
         SENSEG NAME=WDG201,PARENT=0                                            
         SENSEG NAME=WDGX9306,PARENT=WDG201                                     
         SENSEG NAME=WDGX9308,PARENT=WDGX9306                                   
*                                                                               
* PRIS-COST-WDK72-PCB - ARTIKELREGISTER DC                                      
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=20,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK724,PARENT=WDK711                                       
*                                                                               
* PRIS-COST-WDB6-PCB - DC-REGISTER  WDB6                                        
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=3,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB617,PARENT=WDB601                                       
*                                                                               
*- - -  PLATSMODULENS  BASER                                                    
         PCB   TYPE=DB,DBDNAME=WLXXDM,PROCOPT=GOT,KEYLEN=50,POS=S               
         SENSEG NAME=WLXXDM01,PARENT=0                                          
         SENSEG NAME=WLXXDM11,PARENT=WLXXDM01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXDN,PROCOPT=G,KEYLEN=50,POS=S                 
         SENSEG NAME=WLXXDN01,PARENT=0                                          
         SENSEG NAME=WLXXDN11,PARENT=WLXXDN01                                   
         SENSEG NAME=WLXXDN21,PARENT=WLXXDN11,PROCOPT=GRD                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXDP,PROCOPT=G,KEYLEN=50,POS=S                 
         SENSEG NAME=WLXXDP01,PARENT=0,PROCOPT=GIRD                             
         SENSEG NAME=WLXXDP11,PARENT=WLXXDP01,PROCOPT=GIRD                      
         SENSEG NAME=WLXXDP21,PARENT=WLXXDP11,PROCOPT=GIRD                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXDO,PROCOPT=G,KEYLEN=50,POS=S                 
         SENSEG NAME=WLXXDO01,PARENT=0,PROCOPT=GIRD                             
         SENSEG NAME=WLXXDO11,PARENT=WLXXDO01,PROCOPT=GIRD                      
         SENSEG NAME=WLXXDO21,PARENT=WLXXDO11,PROCOPT=GIRD                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE6C,PROCOPT=GOT,KEYLEN=42,POS=S                
         SENSEG NAME=WDE6C1,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLGMTC,PROCOPT=GOT,KEYLEN=11,POS=S               
         SENSEG NAME=WLGMTC01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
* - - - SLUT PÅ PLATSMODULENS BASER                                             
*                                                                               
* W006KOM DISPATCH DB                                                           
         PCB   TYPE=DB,DBDNAME=WDP8,PROCOPT=G,KEYLEN=28,POS=S                   
         SENSEG NAME=WDP801,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDP811,PARENT=WDP801,PROCOPT=GI                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40636                                       
         END                                                                    
