*                                                                               
* WZ01-PCB, STARTAR SÄNDNING TILL BILL-IT                                       
RECEIVE  PCB   TYPE=TP,NAME=WF0201X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*                                                                               
* WZ01-PCB, STARTAR SÄNDNING TILL PASS-IT                                       
PASSIT   PCB   TYPE=TP,NAME=W40635X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*                                                                               
* 4679-PCB, START BACKGROUND MPP TO SEND SHIPMENT TO TMS                        
SHIP2TMS PCB   TYPE=TP,NAME=W40679X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*                                                                               
* TRANSPORT-RELEASE, FAKTURA                                                    
         PCB   TYPE=DB,DBDNAME=WDE2,PROCOPT=G,KEYLEN=24,POS=S                   
         SENSEG NAME=WDE201,PARENT=0                                            
         SENSEG NAME=WDE211,PARENT=WDE201                                       
         SENSEG NAME=WDE221,PARENT=WDE211,PROCOPT=GR                            
         SENSEG NAME=WDE231,PARENT=WDE221                                       
*                                                                               
* KUNDORDERREG.                                                                 
         PCB   TYPE=DB,DBDNAME=WDE4,PROCOPT=G,KEYLEN=30,POS=S,         *        
               PROCSEQ=WDE4E                                                    
         SENSEG NAME=WDE401,PARENT=0                                            
         SENSEG NAME=WDE411,PARENT=WDE401,PROCOPT=GR                            
*                                                                               
* KUNDORDERREG.                                                                 
         PCB   TYPE=DB,DBDNAME=WDE4,PROCOPT=G,KEYLEN=30,POS=S,         *        
               PROCSEQ=WDE4B                                                    
         SENSEG NAME=WDE411,PARENT=0,PROCOPT=GR                                 
         SENSEG NAME=WDE401,PARENT=WDE411                                       
*                                                                               
* BENÄMNINGSREG.                                                                
         PCB   TYPE=DB,DBDNAME=WDD3,PROCOPT=GOT,KEYLEN=08,POS=S,       *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WDD301,PARENT=0                                            
         SENSEG NAME=WDD311,PARENT=WDD301                                       
*                                                                               
* KUNDREG KÖPARREG                                                              
         PCB   TYPE=DB,DBDNAME=WDB1,PROCOPT=GOT,KEYLEN=11,POS=S                 
         SENSEG NAME=WDB101,PARENT=0                                            
*                                                                               
* GODSMOTTAGARREG                                                               
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
* 4735   TEXT REGISTER  LEV.VILLKOR FAKTURERING   ***                           
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR1,PROCOPT=GOT,KEYLEN=31,POS=S                 
         SENSEG NAME=WDR101,PARENT=0                                            
         SENSEG NAME=WDGX4735,PARENT=WDR101                                     
*                                                                               
* KOLLIREG                                                                      
         PCB   TYPE=DB,DBDNAME=WDE6,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDE601,PARENT=0                                            
         SENSEG NAME=WDE611,PARENT=WDE601                                       
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
* WDQ2-PCB - ORDERHUVUDSREG KÖ WDQ2                                             
         PCB   TYPE=DB,DBDNAME=WDQ2,PROCOPT=GOT,KEYLEN=4,POS=S                  
         SENSEG NAME=WDQ201,PARENT=0                                            
*                                                                               
* TRANSPORT-RELEASE, FAKTURA                                                    
         PCB   TYPE=DB,DBDNAME=WDE1,PROCOPT=G,KEYLEN=49,POS=S                   
         SENSEG NAME=WDE101,PARENT=0,PROCOPT=GR                                 
         SENSEG NAME=WDE111,PARENT=WDE101                                       
         SENSEG NAME=WDE121,PARENT=WDE111                                       
         SENSEG NAME=WDE131,PARENT=WDE121                                       
         SENSEG NAME=WDE141,PARENT=WDE131,PROCOPT=GI                            
*                                                                               
* WDK7-PCB - ARTIKELINFO                                                        
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=23,POS=S                   
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701,PROCOPT=GR                            
         SENSEG NAME=WDK728,PARENT=WDK711,PROCOPT=GR                            
*                                                                               
* WDG2-PCB/9305-PCB                                                             
         PCB   TYPE=DB,DBDNAME=WDG2,PROCOPT=GOT,KEYLEN=37,POS=S                 
         SENSEG NAME=WDG201,PARENT=0                                            
         SENSEG NAME=WDGX9306,PARENT=WDG201                                     
         SENSEG NAME=WDGX9308,PARENT=WDGX9306                                   
*                                                                               
* WDK6-PCB - ARTIKELINFO                                                        
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=6,POS=S                  
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
* WDR2-PCB                                                                      
         PCB   TYPE=DB,DBDNAME=WDR2,PROCOPT=GOT,KEYLEN=33,POS=S                 
         SENSEG NAME=WDR201,PARENT=0                                            
         SENSEG NAME=WDGX4592,PARENT=WDR201                                     
*                                                                               
* WDM1-PCB - PCOO                                                               
         PCB   TYPE=DB,DBDNAME=WDM1,PROCOPT=GOT,KEYLEN=48,POS=S                 
         SENSEG NAME=WDM101,PARENT=0                                            
         SENSEG NAME=WDM111,PARENT=WDM101                                       
         SENSEG NAME=WDM121,PARENT=WDM111                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR2,PROCOPT=GOT,KEYLEN=42,POS=S                 
         SENSEG NAME=WDR201,PARENT=0                                            
         SENSEG NAME=WDGX5110,PARENT=WDR201                                     
         SENSEG NAME=WDGX5112,PARENT=WDGX5110                                   
*                                                                               
* PCB FÖR W510AVG                                                               
         PCB   TYPE=DB,DBDNAME=WDG2,PROCOPT=GOT,KEYLEN=37,POS=S                 
         SENSEG NAME=WDG201,PARENT=0                                            
         SENSEG NAME=WDGX9306,PARENT=WDG201                                     
         SENSEG NAME=WDGX9308,PARENT=WDGX9306                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=8,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB617,PARENT=WDB601                                       
         SENSEG NAME=WDB621,PARENT=WDB617                                       
         SENSEG NAME=WDB622,PARENT=WDB617                                       
*                                                                               
*4637-PCB:S                                                                     
         PCB   TYPE=DB,DBDNAME=WDF5,PROCOPT=GOT,KEYLEN=11,POS=S                 
         SENSEG NAME=WDF501,PARENT=0                                            
         SENSEG NAME=WDF502,PARENT=WDF501                                       
*                                                                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDL3,PROCOPT=G,KEYLEN=20,POS=S                   
         SENSEG NAME=WDL301,PARENT=0,PROCOPT=GI                                 
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40637                                       
         END                                                                    
