*                                                                               
* WZ01-PCB START  PGM W4063100                                                  
SHIPDOK  PCB   TYPE=TP,NAME=W40631X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* ALT-PCB TRANS FOR PGM W4062100                                                
         PCB   TYPE=TP,NAME=W4T621,ALTRESP=NO,SAMETRM=NO,              *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB    TYPE=DB,DBDNAME=WDP7,PROCOPT=G,KEYLEN=8,POS=S                   
         SENSEG NAME=WDP701,PARENT=0,PROCOPT=GIR                                
*                                                                               
* SHIPPING                                                                      
         PCB    TYPE=DB,DBDNAME=WDE1,PROCOPT=G,KEYLEN=20,POS=S                  
         SENSEG NAME=WDE101,PARENT=0,PROCOPT=GR                                 
*                                                                               
         PCB    TYPE=DB,DBDNAME=WDE1A,PROCOPT=G,KEYLEN=24,POS=S                 
         SENSEG NAME=WDE1A1,PARENT=0,PROCOPT=G                                  
*                                                                               
         PCB    TYPE=DB,DBDNAME=WDE1,PROCOPT=G,KEYLEN=20,POS=S,        *        
               PROCSEQ=WDE1A                                                    
         SENSEG NAME=WDE101,PARENT=0,PROCOPT=GR                                 
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40622                                       
         END                                                                    
