*  ALT-PCB   FOR RETURN TO W4675                                                
         PCB   TYPE=TP,NAME=W4T675,ALTRESP=NO,SAMETRM=NO,              *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* WDP7-PCB  USER DATABASE                                                       
         PCB    TYPE=DB,DBDNAME=WDP7,PROCOPT=G,KEYLEN=8,POS=S                   
         SENSEG NAME=WDP701,PARENT=0,PROCOPT=GIR                                
*                                                                               
*  4495-PCB                                                                     
         PCB   TYPE=DB,DBDNAME=WDR4,PROCOPT=GOT,KEYLEN=55,POS=S                 
         SENSEG NAME=WDR401,PARENT=0                                            
         SENSEG NAME=WDGX4496,PARENT=WDR401                                     
         SENSEG NAME=WDGX4498,PARENT=WDR401                                     
*                                                                               
*  WDE1-PCB  TRANSPORT RELEASE REGISTER                                         
         PCB   TYPE=DB,DBDNAME=WDE1,PROCOPT=G,KEYLEN=15,POS=S                   
         SENSEG NAME=WDE101,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDE111,PARENT=WDE101,PROCOPT=GIR                           
         SENSEG NAME=WDE122,PARENT=WDE111,PROCOPT=GIR                           
*                                                                               
*  WDE2-PCB  TRANSPORT RELEASE REGISTER - BILL IT                               
         PCB   TYPE=DB,DBDNAME=WDE2,PROCOPT=G,KEYLEN=14,POS=S                   
         SENSEG NAME=WDE201,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDE211,PARENT=WDE201,PROCOPT=GIR                           
*                                                                               
* WDG2-PCB/9305-PCB                                                             
         PCB   TYPE=DB,DBDNAME=WDG2,PROCOPT=GOT,KEYLEN=37,POS=S                 
         SENSEG NAME=WDG201,PARENT=0                                            
         SENSEG NAME=WDGX9306,PARENT=WDG201                                     
         SENSEG NAME=WDGX9308,PARENT=WDGX9306                                   
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
*  PCB TO SUBPROGRAM W476SHNO                                                   
*                                                                               
*  SHNO-4517-PCB IDSHIPM REGISTER                                               
         PCB   TYPE=DB,DBDNAME=WDR1,PROCOPT=G,KEYLEN=31,POS=S                   
         SENSEG NAME=WDR101,PARENT=0                                            
         SENSEG NAME=WDGX4518,PARENT=WDR101,PROCOPT=GR                          
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40676                                       
         END                                                                    
