*    SKAPAR LISTAN LISTA DE EMBARQUE                                            
*                                                                               
*             PCB FÖR PRINTER                                                   
         PCB   TYPE=TP,LTERM=,ALTRESP=NO,SAMETRM=NO,                   *        
               MODIFY=YES,EXPRESS=NO                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
*             WDGX TRANSPORT/LASTBÄRARE                                         
         PCB   TYPE=DB,DBDNAME=WL4495,PROCOPT=GOT,KEYLEN=55,POS=S               
         SENSEG NAME=WL449501,PARENT=0                                          
         SENSEG NAME=WL449511,PARENT=WL449501                                   
         SENSEG NAME=WL449512,PARENT=WL449501                                   
*                                                                               
*             WDB2 KUNDREGISTER                                                 
         PCB   TYPE=DB,DBDNAME=WLGMTA,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG NAME=WLGMTA01,PARENT=0                                          
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40699                                       
         END                                                                    
