*                                                                               
         PCB    TYPE=DB,DBDNAME=WDP7,PROCOPT=G,KEYLEN=8,POS=S                   
         SENSEG NAME=WDP701,PARENT=0,PROCOPT=GIR                                
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDQ3E,PROCOPT=GOT,KEYLEN=25,POS=S                
         SENSEG NAME=WDQ3E1,PARENT=0                                            
*                                                                               
        PCB    TYPE=DB,DBDNAME=WDE6,PROCOPT=GOT,KEYLEN=4,POS=S                  
        SENSEG NAME=WDE601,PARENT=0                                             
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40653                                       
         END                                                                    
