*                                                                               
*             PCB FÖR PRINTER                                                   
         PCB   TYPE=TP,LTERM=,ALTRESP=NO,SAMETRM=NO,                   *        
               MODIFY=YES,EXPRESS=NO                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WL4491,PROCOPT=G,KEYLEN=64,POS=S                 
         SENSEG NAME=WL449101,PARENT=0                                          
         SENSEG NAME=WL449111,PARENT=WL449101,PROCOPT=GR                        
         SENSEG NAME=WL449112,PARENT=WL449101,PROCOPT=GR                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLGMTA,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG NAME=WLGMTA01,PARENT=0                                          
*                                                                               
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40697                                       
         END                                                                    
