*          DATA SET W40671PII0 AT LEVEL 003 AS OF 87/08/26                      
*                                                                               
         PCB   TYPE=TP,NAME=W4T672,ALTRESP=NO,SAMETRM=NO,              *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXDQ,PROCOPT=GOT,KEYLEN=70,POS=S               
         SENSEG NAME=WLXXDQ01,PARENT=0                                          
         SENSEG NAME=WLXXDQ11,PARENT=WLXXDQ01                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40671                                       
         END                                                                    
