*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXDM,PROCOPT=G,KEYLEN=45,POS=S                 
         SENSEG NAME=WLXXDM01,PARENT=0                                          
         SENSEG NAME=WLXXDM11,PARENT=WLXXDM01,PROCOPT=GIRD                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXDN,PROCOPT=G,KEYLEN=50,POS=S                 
         SENSEG NAME=WLXXDN01,PARENT=0                                          
         SENSEG NAME=WLXXDN11,PARENT=WLXXDN01,PROCOPT=GIRD                      
         SENSEG NAME=WLXXDN21,PARENT=WLXXDN11,PROCOPT=GI                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXDO,PROCOPT=G,KEYLEN=50,POS=S                 
         SENSEG NAME=WLXXDO01,PARENT=0                                          
         SENSEG NAME=WLXXDO11,PARENT=WLXXDO01                                   
         SENSEG NAME=WLXXDO21,PARENT=WLXXDO11,PROCOPT=GR                        
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40661                                       
         END                                                                    
