*                                                                               
         PCB   TYPE=TP,NAME=W4T712,ALTRESP=NO,SAMETRM=NO,              *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=TP,NAME=W4T715,ALTRESP=NO,SAMETRM=NO,              *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=TP,NAME=W4T723,ALTRESP=NO,SAMETRM=NO,              *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
               SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLKREE,PROCOPT=GOT,KEYLEN=22,POS=S               
         SENSEG NAME=WLKREE01,PARENT=0                                          
         SENSEG NAME=WLKREE11,PARENT=WLKREE01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLKREI,PROCOPT=GOT,KEYLEN=24,POS=S               
         SENSEG NAME=WLKREI01,PARENT=0                                          
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40724                                       
         END                                                                    
