*---USERBAS                                                                     
         PCB    TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                 
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
*---DC-STYRNING AV LEVERANSANM TILL REMISS                                      
         PCB   TYPE=DB,DBDNAME=WDR2,PROCOPT=G,KEYLEN=34,POS=S                   
         SENSEG NAME=WDR201,PARENT=0                                            
         SENSEG NAME=WDGX4130,PARENT=WDR201,PROCOPT=GID                         
         SENSEG NAME=WDGX4132,PARENT=WDGX4130,PROCOPT=GID                       
*                                                                               
*---DC-VALIDERING                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40754                                       
         END                                                                    
