*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLRETA,PROCOPT=G,KEYLEN=15,POS=S                 
         SENSEG NAME=WLRETA01,PARENT=0,PROCOPT=GI                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLRETA,PROCOPT=G,KEYLEN=11,POS=S,       *        
               PROCSEQ=WDA3B                                                    
         SENSEG NAME=WLRETA01,PARENT=0,PROCOPT=GR                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLRETG,PROCOPT=GOT,KEYLEN=38,POS=S               
         SENSEG NAME=WLRETG01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLKREE,PROCOPT=GOT,KEYLEN=22,POS=S               
         SENSEG NAME=WLKREE01,PARENT=0                                          
         SENSEG NAME=WLKREE11,PARENT=WLKREE01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WL4111,PROCOPT=G,KEYLEN=30,POS=S                 
         SENSEG NAME=WL411101,PARENT=0,PROCOPT=G                                
         SENSEG NAME=WL411111,PARENT=WL411101,PROCOPT=GR                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WL4113,PROCOPT=GOT,KEYLEN=34,POS=S               
         SENSEG NAME=WL411301,PARENT=0                                          
         SENSEG NAME=WL411311,PARENT=WL411301                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WL4115,PROCOPT=GOT,KEYLEN=34,POS=S               
         SENSEG NAME=WL411501,PARENT=0                                          
         SENSEG NAME=WL411511,PARENT=WL411501                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WL4117,PROCOPT=GOT,KEYLEN=36,POS=S               
         SENSEG NAME=WL411701,PARENT=0                                          
         SENSEG NAME=WL411711,PARENT=WL411701                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40733                                       
         END                                                                    
