*             PCB FÖR PRINTER                                                   
         PCB   TYPE=TP,LTERM=,ALTRESP=NO,SAMETRM=NO,                   *        
               MODIFY=YES,EXPRESS=NO                                            
*                                                                               
*        ÅTERSTART INLÄGGNINGSLISTA                                             
         PCB   TYPE=DB,DBDNAME=WLLISB,PROCOPT=G,KEYLEN=19,POS=S                 
         SENSEG NAME=WLLISB01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLLISB11,PARENT=WLLISB01,PROCOPT=GI                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLKREJ,PROCOPT=GOT,KEYLEN=36,POS=S               
         SENSEG NAME=WLKREJ01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLKREE,PROCOPT=GOT,KEYLEN=23,POS=S               
         SENSEG NAME=WLKREE01,PARENT=0                                          
         SENSEG NAME=WLKREE11,PARENT=WLKREE01                                   
         SENSEG NAME=WLKREE21,PARENT=WLKREE11                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=6,POS=S                
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTS,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG NAME=WLARTS01,PARENT=0                                          
         SENSEG NAME=WLARTS11,PARENT=WLARTS01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=8,POS=S,      *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40795                                       
         END                                                                    
