*                                                                               
         PCB    TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                 
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WL4107,PROCOPT=G,KEYLEN=31,POS=S                 
         SENSEG NAME=WL410701,PARENT=0                                          
         SENSEG NAME=WL410711,PARENT=WL410701,PROCOPT=GR                        
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40706                                       
         END                                                                    
