*                                                                               
         PCB   TYPE=DB,DBDNAME=WDP7,PROCOPT=G,KEYLEN=8,POS=S                    
         SENSEG NAME=WDP701,PARENT=0,PROCOPT=GIR                                
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA8,PROCOPT=G,KEYLEN=52,POS=S                   
         SENSEG NAME=WDA801,PARENT=0,PROCOPT=GIRD                               
         SENSEG NAME=WDA811,PARENT=WDA801,PROCOPT=GIRD                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA8,PROCOPT=GOT,KEYLEN=52,POS=S,       *        
               PROCSEQ=WDA8B                                                    
         SENSEG NAME=WDA801,PARENT=0                                            
         SENSEG NAME=WDA811,PARENT=WDA801                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40751                                       
         END                                                                    
