*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA2,PROCOPT=G,KEYLEN=22,POS=S                   
         SENSEG NAME=WDA201,PARENT=0,PROCOPT=GR                                 
         SENSEG NAME=WDA211,PARENT=WDA201,PROCOPT=GR                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDC7,PROCOPT=G,KEYLEN=33,POS=S                   
         SENSEG NAME=WDC701,PARENT=0                                            
         SENSEG NAME=WDC711,PARENT=WDC701,PROCOPT=GD                            
*                                                                               
* ATTEST AV KREDITNOTA             WDR5  IDHTYP=4103                            
         PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=G,KEYLEN=34,POS=S                   
         SENSEG NAME=WDR501,PARENT=0                                            
         SENSEG NAME=WDGX4104,PARENT=WDR501,PROCOPT=GR                          
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40798                                       
         END                                                                    
