*                                                                               
         PCB   TYPE=TP,NAME=,ALTRESP=NO,SAMETRM=NO,                    *        
               MODIFY=YES,EXPRESS=NO                                            
*                                                                               
* UTSKRIFTS-PCB                                                                 
         PCB   TYPE=TP,NAME=W4T794X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLKREH,PROCOPT=GOT,KEYLEN=43,POS=S               
         SENSEG NAME=WLKREH01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLKREE,PROCOPT=G,KEYLEN=22,POS=S                 
         SENSEG NAME=WLKREE01,PARENT=0,PROCOPT=GR                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLRETA,PROCOPT=GOT,KEYLEN=19,POS=S,     *        
               PROCSEQ=WDA3F                                                    
         SENSEG NAME=WLRETA01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA2G,PROCOPT=GOT,KEYLEN=42,POS=S                
         SENSEG NAME=WDA2G1,PARENT=0                                            
*                                                                               
* STATUS-PCB                                                                    
         PCB   TYPE=DB,DBDNAME=WLRETA,PROCOPT=G,KEYLEN=11,POS=S,       *        
               PROCSEQ=WDA3B                                                    
         SENSEG NAME=WLRETA01,PARENT=0,PROCOPT=GR                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLRETA,PROCOPT=G,KEYLEN=16,POS=S,       *        
               PROCSEQ=WDA3F                                                    
         SENSEG NAME=WLRETA01,PARENT=0,PROCOPT=GR                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WL4107,PROCOPT=GOT,KEYLEN=31,POS=S               
         SENSEG NAME=WL410701,PARENT=0                                          
         SENSEG NAME=WL410711,PARENT=WL410701                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40736                                       
         END                                                                    
