*                                                                               
         PCB   TYPE=TP,NAME=W0T606U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
DISTRDOC PCB   TYPE=TP,NAME=WZ0420X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA4,PROCOPT=G,KEYLEN=17,POS=S                   
         SENSEG NAME=WDA401,PARENT=0,PROCOPT=GIRD                               
         SENSEG NAME=WDA411,PARENT=WDA401,PROCOPT=GIRD                          
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40728                                       
         END                                                                    
