*                                                                               
         PCB    TYPE=DB,DBDNAME=WDP7,PROCOPT=G,KEYLEN=8,POS=S                   
         SENSEG NAME=WDP701,PARENT=0,PROCOPT=GIR                                
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=G,KEYLEN=35,POS=S                   
         SENSEG NAME=WDR501,PARENT=0                                            
         SENSEG NAME=WDGX4104,PARENT=WDR501                                     
         SENSEG NAME=WDGX4105,PARENT=WDGX4104,PROCOPT=GIR                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40718                                       
         END                                                                    
