*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
                SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLRETA,PROCOPT=GOT,KEYLEN=19,POS=S,     *        
               PROCSEQ=WDA3A                                                    
         SENSEG NAME=WLRETA01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLRETA,PROCOPT=GOT,KEYLEN=11,POS=S,     *        
               PROCSEQ=WDA3B                                                    
         SENSEG NAME=WLRETA01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLRETA,PROCOPT=G,KEYLEN=19,POS=S,       *        
               PROCSEQ=WDA3F                                                    
         SENSEG NAME=WLRETA01,PARENT=0,PROCOPT=GR                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLRETA,PROCOPT=G,KEYLEN=15,POS=S                 
         SENSEG NAME=WLRETA01,PARENT=0,PROCOPT=GIRD                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLRETC,PROCOPT=GOT,KEYLEN=24,POS=S               
         SENSEG NAME=WLRETC01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WL4111,PROCOPT=G,KEYLEN=30,POS=S                 
         SENSEG NAME=WL411101,PARENT=0                                          
         SENSEG NAME=WL411111,PARENT=WL411101,PROCOPT=GR                        
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40742                                       
         END                                                                    
