*                                                                               
         PCB   TYPE=TP,NAME=,ALTRESP=NO,SAMETRM=NO,                    *        
               MODIFY=YES,EXPRESS=NO                                            
*                                                                               
*  -- ALT-DISP-PCB - START AV DISPATCHER-PGM W0069300 ***********               
         PCB   TYPE=TP,NAME=W0T693X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB    TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                 
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA2,PROCOPT=G,KEYLEN=22,POS=S                   
         SENSEG NAME=WDA201,PARENT=0,PROCOPT=GR                                 
         SENSEG NAME=WDA211,PARENT=WDA201,PROCOPT=GR                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=G,KEYLEN=6,POS=S                    
         SENSEG NAME=WDK601,PARENT=0,PROCOPT=GR                                 
         SENSEG NAME=WDK611,PARENT=WDK601,PROCOPT=GR                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=7,POS=S                    
         SENSEG NAME=WDK701,PARENT=0,PROCOPT=GIR                                
         SENSEG NAME=WDK711,PARENT=WDK701,PROCOPT=GIR                           
         SENSEG NAME=WDK712,PARENT=WDK701,PROCOPT=GI                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDL9,PROCOPT=G,KEYLEN=20,POS=S                   
         SENSEG NAME=WDL901,PARENT=0,PROCOPT=GI                                 
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDH1,PROCOPT=G,KEYLEN=23,POS=S                   
         SENSEG NAME=WDH101,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDH111,PARENT=WDH101,PROCOPT=GI                            
         SENSEG NAME=WDH121,PARENT=WDH111,PROCOPT=GI                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDL2,PROCOPT=G,KEYLEN=21,POS=S                   
         SENSEG NAME=WDL201,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDL211,PARENT=WDL201,PROCOPT=GI                            
         SENSEG NAME=WDL222,PARENT=WDL211,PROCOPT=GI                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDL6,PROCOPT=G,KEYLEN=21,POS=S                   
         SENSEG NAME=WDL601,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDL611,PARENT=WDL601,PROCOPT=GI                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR1,PROCOPT=G,KEYLEN=30,POS=S                   
         SENSEG NAME=WDR101,PARENT=0                                            
         SENSEG NAME=WDGX4112,PARENT=WDR101,PROCOPT=GR                          
*                                                                               
* PCB FÖR SUBPGM W006KOM                                                        
         PCB   TYPE=DB,DBDNAME=WLKOMA,PROCOPT=G,KEYLEN=28,POS=S                 
         SENSEG NAME=WLKOMA01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLKOMA11,PARENT=WLKOMA01,PROCOPT=GI                        
*                                                                               
*    WDR901, EKONOMITRANS                                                       
*                                                                               
         PCB    TYPE=DB,DBDNAME=WDR9,PROCOPT=GI,KEYLEN=31,POS=S                 
         SENSEG NAME=WDR901,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR6,PROCOPT=G,KEYLEN=27,POS=S                   
         SENSEG NAME=WDR601,PARENT=0,PROCOPT=GI                                 
*                                                                               
* WDD3 BENÄMNINGSREGISTER                                                       
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=8,POS=S,      *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40739                                       
         END                                                                    
