*                                                                               
*        DISP-PCB - FEL/KLAR MEDDELANDE TILL DISPATCHER                         
         PCB   TYPE=TP,NAME=W0T693X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
ATAB     PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=GOT,KEYLEN=80,POS=S                 
         SENSEG NAME=WDR501,PARENT=0                                            
         SENSEG NAME=WDGX0102,PARENT=WDR501                                     
*                                                                               
*        KREDITERINGSBAS WDA2 ANVÄNDS I W418KTL1                                
         PCB   TYPE=DB,DBDNAME=WLKREE,PROCOPT=GOT,KEYLEN=14,POS=S               
         SENSEG NAME=WLKREE01,PARENT=0                                          
*                                                                               
*        FAKTURAHISTORIK WDL5                                                   
         PCB   TYPE=DB,DBDNAME=WDL5,PROCOPT=GOT,KEYLEN=19,POS=S                 
         SENSEG NAME=WDL501,PARENT=0                                            
         SENSEG NAME=WDL511,PARENT=WDL501                                       
         SENSEG NAME=WDL521,PARENT=WDL511                                       
*                                                                               
*        ARTIKELREGISTER WDK6                                                   
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=6,POS=S                
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
*                                                                               
**** KOMMUNIKATIONS DB                                                          
         PCB   TYPE=DB,DBDNAME=WLKOMA,PROCOPT=G,KEYLEN=28,POS=S                 
         SENSEG NAME=WLKOMA01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLKOMA11,PARENT=WLKOMA01,PROCOPT=GI                        
*                                                                               
***  ANALYSNR WDR1 HTYP 4109                                                    
         PCB   TYPE=DB,DBDNAME=WL4109,PROCOPT=GOT,KEYLEN=45,POS=S               
         SENSEG NAME=WL410901,PARENT=0                                          
         SENSEG NAME=WL410911,PARENT=WL410901                                   
*                                                                               
***  BETALARREGISTER WDB1                                                       
         PCB   TYPE=DB,DBDNAME=WDB1,PROCOPT=GOT,KEYLEN=11,POS=S                 
         SENSEG NAME=WDB101,PARENT=0                                            
*                                                                               
***  KUNDREGISTER WDB2                                                          
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
**** ANVÄNDS I W335PRIS                                                         
*                                                                               
* PRIS-ARTC-PCB - ARTIKELINFORMATION  WDK6                                      
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=19,POS=S               
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
         SENSEG NAME=WLARTC21,PARENT=WLARTC11                                   
*                                                                               
* PRIS-WDK7-PCB - ARTIKELINFO                                                   
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
*                                                                               
* PRIS-GMTA-PCB - GODSMOTTAGARE     WDB2                                        
         PCB   TYPE=DB,DBDNAME=WLGMTA,PROCOPT=GOT,KEYLEN=07,POS=S               
         SENSEG NAME=WLGMTA01                                                   
*                                                                               
* PRIS-BETA-PCB - BETALAREREGISTRET WDB1                                        
         PCB   TYPE=DB,DBDNAME=WLBETC,PROCOPT=GOT,KEYLEN=11,POS=S               
         SENSEG NAME=WLBETC01                                                   
*                                                                               
* PRIS-PRIA-PCB - PRISREGISTRET WDC1                                            
         PCB   TYPE=DB,DBDNAME=WLPRIA,PROCOPT=GOT,KEYLEN=06,POS=S               
         SENSEG NAME=WLPRIA01                                                   
*                                                                               
* PRIS-PRIB-PCB - PRIS RABATT REGISTER WDC2                                     
         PCB   TYPE=DB,DBDNAME=WLPRIB,PROCOPT=GOT,KEYLEN=16,POS=S               
         SENSEG NAME=WLPRIB01,PARENT=0                                          
         SENSEG NAME=WLPRIB11,PARENT=WLPRIB01                                   
         SENSEG NAME=WLPRIB12,PARENT=WLPRIB01                                   
         SENSEG NAME=WLPRIB13,PARENT=WLPRIB01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLGMTB,PROCOPT=GOT,KEYLEN=09,POS=S               
         SENSEG NAME=WLGMTB01,PARENT=0                                          
*                                                                               
* WDG2-PCB/9305-PCB                                                             
         PCB   TYPE=DB,DBDNAME=WDG2,PROCOPT=GOT,KEYLEN=37,POS=S                 
         SENSEG NAME=WDG201,PARENT=0                                            
         SENSEG NAME=WDGX9306,PARENT=WDG201                                     
         SENSEG NAME=WDGX9308,PARENT=WDGX9306                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA2A,PROCOPT=GOT,KEYLEN=17,POS=S                
         SENSEG NAME=WDA2A1,PARENT=0                                            
*                                                                               
***  BETALARREGISTER WDB1 - SUBMODUL W418KTL1                                   
         PCB   TYPE=DB,DBDNAME=WDB1,PROCOPT=GOT,KEYLEN=11,POS=S                 
         SENSEG NAME=WDB101,PARENT=0                                            
*                                                                               
***  ANVÄNDS I W418KTL1                                                         
         PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=GOT,KEYLEN=46,POS=S                 
         SENSEG NAME=WDR501,PARENT=0                                            
         SENSEG NAME=WDGX4128,PARENT=WDR501                                     
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=38,POS=S                 
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB611,PARENT=WDB601                                       
*                                                                               
* WDK7-PCB - ART-REGISTER  WDK7                                                 
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
*                                                                               
* WDK6-PCB - ART-REGISTER  WDK6                                                 
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=5,POS=S                  
         SENSEG NAME=WDK601,PARENT=0                                            
*                                                                               
* WDA2-PCB - LEVERANSANMÄRKNINGSBAS                                             
         PCB   TYPE=DB,DBDNAME=WDA2,PROCOPT=GOT,KEYLEN=22,POS=S                 
         SENSEG NAME=WDA201,PARENT=0                                            
         SENSEG NAME=WDA211,PARENT=WDA201                                       
*                                                                               
* COST-WDK6-PCB                                                                 
         PCB     TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=19,POS=S               
         SENSEG  NAME=WDK601,PARENT=0                                           
         SENSEG  NAME=WDK611,PARENT=WDK601                                      
         SENSEG  NAME=WDK621,PARENT=WDK611                                      
* COST-WDK7-PCB                                                                 
         PCB     TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG  NAME=WDK701,PARENT=0                                           
         SENSEG  NAME=WDK711,PARENT=WDK701                                      
* COST-WDF1-PCB                                                                 
         PCB     TYPE=DB,DBDNAME=WDF1,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG  NAME=WDF101,PARENT=0                                           
         SENSEG  NAME=WDF102,PARENT=WDF101                                      
* COST-WDG2-PCB                                                                 
         PCB   TYPE=DB,DBDNAME=WDG2,PROCOPT=GOT,KEYLEN=37,POS=S                 
         SENSEG NAME=WDG201,PARENT=0                                            
         SENSEG NAME=WDGX9306,PARENT=WDG201                                     
         SENSEG NAME=WDGX9308,PARENT=WDGX9306                                   
* COST-WDK72-PCB                                                                
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=20,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK724,PARENT=WDK711                                       
*                                                                               
* COST-WDB6-PCB - DC-REGISTER  WDB6                                             
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=3,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB617,PARENT=WDB601                                       
*                                                                               
********** SUBMODUL W335COST**************************************              
*                                                                               
* PRIS-COST-WDK6-PCB - ARTIKELINFORMATION WDK6                                  
         PCB     TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=19,POS=S               
         SENSEG  NAME=WDK601,PARENT=0                                           
         SENSEG  NAME=WDK611,PARENT=WDK601                                      
         SENSEG  NAME=WDK621,PARENT=WDK611                                      
*                                                                               
* PRIS-COST-WDK7-PCB - ARTIKELINFORMATION WDK7                                  
         PCB     TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG  NAME=WDK701,PARENT=0                                           
         SENSEG  NAME=WDK711,PARENT=WDK701                                      
*                                                                               
* PRIS-COST-WDF1-PCB - LEVERANTÖRSINFO WDF1                                     
         PCB     TYPE=DB,DBDNAME=WDF1,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG  NAME=WDF101,PARENT=0                                           
         SENSEG  NAME=WDF102,PARENT=WDF101                                      
*                                                                               
* PRIS-COST-WDG2-PCB - VALUTAINFORMATION WDG2                                   
         PCB   TYPE=DB,DBDNAME=WDG2,PROCOPT=GOT,KEYLEN=37,POS=S                 
         SENSEG NAME=WDG201,PARENT=0                                            
         SENSEG NAME=WDGX9306,PARENT=WDG201                                     
         SENSEG NAME=WDGX9308,PARENT=WDGX9306                                   
*                                                                               
* PRIS-COST-WDK72-PCB - ARTIKELREGISTER DC                                      
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=20,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK724,PARENT=WDK711                                       
*                                                                               
* PRIS-COST-WDB6-PCB - DC-REGISTER  WDB6                                        
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=3,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB617,PARENT=WDB601                                       
*                                                                               
********** SUBMODUL W418KTL3**************************************              
*                                                                               
* KTL3-WDA8-PCB  RETUR-MATRIS                                                   
         PCB   TYPE=DB,DBDNAME=WDA8,PROCOPT=GOT,KEYLEN=52,POS=S,       *        
               PROCSEQ=WDA8A                                                    
         SENSEG NAME=WDA811,PARENT=0                                            
         SENSEG NAME=WDA801,PARENT=WDA811                                       
*                                                                               
* KTL3-WDB2-PCB  KUNDREGISTER                                                   
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
* KTL3-WDK6-PCB ART-REGISTER  WDK6                                              
         PCB     TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=19,POS=S               
         SENSEG  NAME=WDK601,PARENT=0                                           
         SENSEG  NAME=WDK611,PARENT=WDK601                                      
         SENSEG  NAME=WDK621,PARENT=WDK611                                      
*                                                                               
* KTL3-WDK7-PCB ART-REGISTER  WDK7                                              
         PCB     TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG  NAME=WDK701,PARENT=0                                           
         SENSEG  NAME=WDK711,PARENT=WDK701                                      
*                                                                               
* KTL3-WDB6-PCB  DC-REGISTER                                                    
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=02,POS=S                 
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
* KTL3-1165-PCB  WDR2 HTYP 1165/1168 FARLIGT GODS                               
         PCB   TYPE=DB,DBDNAME=WDR2,PROCOPT=GOT,KEYLEN=32,POS=S                 
         SENSEG NAME=WDR201,PARENT=0                                            
         SENSEG NAME=WDGX1168,PARENT=WDR201                                     
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40704                                       
         END                                                                    
