*                                                                               
* UTSKRIFTS-PCB                                                                 
         PCB   TYPE=TP,NAME=W4T795X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB    TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                 
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=GOT,KEYLEN=35,POS=S                 
         SENSEG NAME=WDR501,PARENT=0                                            
         SENSEG NAME=WDGX4704,PARENT=WDR501                                     
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=6,POS=S                  
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA2,PROCOPT=G,KEYLEN=14,POS=S,         *        
               PROCSEQ=WDA2E                                                    
         SENSEG NAME=WDA211,PARENT=0,PROCOPT=GR                                 
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40748                                       
         END                                                                    
