*                                                                               
*        PCB FÖR PRINTER                                                        
         PCB   TYPE=TP,NAME=,ALTRESP=NO,SAMETRM=NO,                    *        
               MODIFY=YES,EXPRESS=NO                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLKREE,PROCOPT=GOT,KEYLEN=23,POS=S               
         SENSEG NAME=WLKREE01,PARENT=0                                          
         SENSEG NAME=WLKREE11,PARENT=WLKREE01                                   
         SENSEG NAME=WLKREE21,PARENT=WLKREE11                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLRETG,PROCOPT=GOT,KEYLEN=38,POS=S               
         SENSEG NAME=WLRETG01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=6,POS=S                
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTS,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG NAME=WLARTS01,PARENT=0                                          
         SENSEG NAME=WLARTS11,PARENT=WLARTS01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=13,POS=S,     *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6KVAH,PROCOPT=GOT,KEYLEN=18,POS=S               
         SENSEG NAME=W6KVAH01,PARENT=0                                          
         SENSEG NAME=W6KVAH11,PARENT=W6KVAH01                                   
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
*WDD5-PCB ARTIKELREGISTER WDD5                                                  
         PCB   TYPE=DB,DBDNAME=WDD5,PROCOPT=GOT,KEYLEN=5,POS=S                  
         SENSEG NAME=WDD501,PARENT=0                                            
*                                                                               
*WDK6-PCB ARTIKELREGISTER WDK6                                                  
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=8,POS=S                  
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK613,PARENT=WDK601                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40794                                       
         END                                                                    
