*                                                                               
         PCB   TYPE=TP,NAME=W0T693X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA2,PROCOPT=G,KEYLEN=47,POS=S                   
         SENSEG NAME=WDA201,PARENT=0,PROCOPT=GR                                 
         SENSEG NAME=WDA211,PARENT=WDA201,PROCOPT=GR                            
         SENSEG NAME=WDA222,PARENT=WDA211,PROCOPT=GI                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=G,KEYLEN=06,POS=S                 
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01,PROCOPT=GR                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=23,POS=S                   
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701,PROCOPT=GR                            
         SENSEG NAME=WDK728,PARENT=WDK711,PROCOPT=GR                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLINLE,PROCOPT=G,KEYLEN=21,POS=S                 
         SENSEG NAME=WLINLE01,PARENT=0                                          
         SENSEG NAME=WLINLE11,PARENT=WLINLE01                                   
         SENSEG NAME=WLINLE21,PARENT=WLINLE11,PROCOPT=GR                        
         SENSEG NAME=WLINLE31,PARENT=WLINLE21,PROCOPT=GID                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLZZAC,PROCOPT=G,KEYLEN=18,POS=S                 
         SENSEG NAME=WLZZAC01,PARENT=0,PROCOPT=GI                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLRETA,PROCOPT=G,KEYLEN=17,POS=S,       *        
               PROCSEQ=WDA3F                                                    
         SENSEG NAME=WLRETA01,PARENT=0,PROCOPT=GR                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLFILB,PROCOPT=G,KEYLEN=27,POS=S                 
         SENSEG NAME=WLFILB01,PARENT=0,PROCOPT=GI                               
*                                                                               
* INLC-PCB  - HISTORIK/ ORDER FÖR SDC/ NDC                                      
         PCB   TYPE=DB,DBDNAME=WLINLC,PROCOPT=G,KEYLEN=21,POS=S                 
         SENSEG NAME=WLINLC01,PARENT=0                                          
         SENSEG NAME=WLINLC11,PARENT=WLINLC01,PROCOPT=GR                        
*                                                                               
*    WDL9, SALDOFÖRÄNDRINGAR                                                    
*                                                                               
         PCB    TYPE=DB,DBDNAME=WLLOGA,PROCOPT=GI,KEYLEN=20,POS=S               
         SENSEG NAME=WLLOGA01,PARENT=0                                          
*                                                                               
*    WDR901, EKONOMITRANS                                                       
*                                                                               
         PCB    TYPE=DB,DBDNAME=WLSAPA,PROCOPT=GI,KEYLEN=31,POS=S               
         SENSEG NAME=WLSAPA01,PARENT=0                                          
*                                                                               
*    WDR601, LOGGAR PASSIVA ARTIKLAR LDC-1A                                     
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR6,PROCOPT=GI,KEYLEN=27,POS=S                  
         SENSEG NAME=WDR601,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
* PCB FÖR W510AVG                                                               
         PCB   TYPE=DB,DBDNAME=WDG2,PROCOPT=GOT,KEYLEN=37,POS=S                 
         SENSEG NAME=WDG201,PARENT=0                                            
         SENSEG NAME=WDGX9306,PARENT=WDG201                                     
         SENSEG NAME=WDGX9308,PARENT=WDGX9306                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=8,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB617,PARENT=WDB601                                       
         SENSEG NAME=WDB621,PARENT=WDB617                                       
         SENSEG NAME=WDB622,PARENT=WDB617                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40797                                       
         END                                                                    
