*                                                                               
         PCB   TYPE=TP,NAME=,ALTRESP=NO,SAMETRM=NO,                    *        
               MODIFY=YES,EXPRESS=NO                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLKREK,PROCOPT=GOT,KEYLEN=26,POS=S               
         SENSEG NAME=WLKREK01,PARENT=0                                          
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40726                                       
         END                                                                    
