*                                                                               
         PCB   TYPE=TP,NAME=,ALTRESP=NO,SAMETRM=NO,                    *        
               MODIFY=YES,EXPRESS=NO                                            
*                                                                               
* DISP-MSG-PCB - FEL/KLAR MEDDELANDE TILL DISPATCHERN                           
         PCB   TYPE=TP,NAME=W0T693X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB    TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                 
                SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLRETA,PROCOPT=G,KEYLEN=11,POS=S,       *        
               PROCSEQ=WDA3B                                                    
         SENSEG NAME=WLRETA01,PARENT=0,PROCOPT=GR                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLRETA,PROCOPT=GOT,KEYLEN=25,POS=S,     *        
               PROCSEQ=WDA3F                                                    
         SENSEG NAME=WLRETA01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLRETA,PROCOPT=G,KEYLEN=15,POS=S                 
         SENSEG NAME=WLRETA01,PARENT=0,PROCOPT=GD                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLRETG,PROCOPT=GOT,KEYLEN=38,POS=S               
         SENSEG NAME=WLRETG01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLRETH,PROCOPT=GOT,KEYLEN=43,POS=S               
         SENSEG NAME=WLRETH01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLKREE,PROCOPT=G,KEYLEN=23,POS=S                 
         SENSEG NAME=WLKREE01,PARENT=0,PROCOPT=GR                               
         SENSEG NAME=WLKREE11,PARENT=WLKREE01,PROCOPT=GR                        
*                                                                               
* STATUS-PCB                                                                    
         PCB   TYPE=DB,DBDNAME=WLRETA,PROCOPT=G,KEYLEN=11,POS=S,       *        
               PROCSEQ=WDA3B                                                    
         SENSEG NAME=WLRETA01,PARENT=0,PROCOPT=GR                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLRETA,PROCOPT=G,KEYLEN=16,POS=S,       *        
               PROCSEQ=WDA3F                                                    
         SENSEG NAME=WLRETA01,PARENT=0,PROCOPT=GR                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WL4107,PROCOPT=GOT,KEYLEN=31,POS=S               
         SENSEG NAME=WL410701,PARENT=0                                          
         SENSEG NAME=WL410711,PARENT=WL410701                                   
*                                                                               
* PCB FÖR SUBPGM W006KOM                                                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLKOMA,PROCOPT=G,KEYLEN=28,POS=S                 
         SENSEG NAME=WLKOMA01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLKOMA11,PARENT=WLKOMA01,PROCOPT=GI                        
*                                                                               
* LÄSNING WDK6                                                                  
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=06,POS=S               
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
*                                                                               
* LÄSNING WDK7                                                                  
         PCB   TYPE=DB,DBDNAME=WLARTS,PROCOPT=GOT,KEYLEN=07,POS=S               
         SENSEG NAME=WLARTS01,PARENT=0                                          
         SENSEG NAME=WLARTS11,PARENT=WLARTS01                                   
*                                                                               
* LÄSNING DCREG, WDB6                                                           
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40734                                       
         END                                                                    
