*                                                                               
         PCB   TYPE=TP,NAME=,ALTRESP=NO,SAMETRM=NO,                    *        
               MODIFY=YES,EXPRESS=NO                                            
*                                                                               
         PCB   TYPE=TP,NAME=W0T541X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB    TYPE=DB,DBDNAME=WDP7,PROCOPT=G,KEYLEN=8,POS=S                   
         SENSEG NAME=WDP701,PARENT=0,PROCOPT=GIR                                
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA2A,PROCOPT=GOT,KEYLEN=17,POS=S                
         SENSEG NAME=WDA2A1,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA2,PROCOPT=G,KEYLEN=14,POS=S                   
         SENSEG NAME=WDA201,PARENT=0,PROCOPT=GR                                 
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=GOT,KEYLEN=45,POS=S                 
         SENSEG NAME=WDR501,PARENT=0                                            
         SENSEG NAME=WDGX6328,PARENT=WDR501                                     
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=G,KEYLEN=48,POS=S                   
         SENSEG NAME=WDR501,PARENT=0                                            
         SENSEG NAME=WDGX4104,PARENT=WDR501,PROCOPT=GR                          
         SENSEG NAME=WDGX4105,PARENT=WDGX4104                                   
         SENSEG NAME=WDGX4106,PARENT=WDGX4104,PROCOPT=GIR                       
*                                                                               
* WDG2-PCB/9305-PCB - W510CURR                                                  
         PCB   TYPE=DB,DBDNAME=WDG2,PROCOPT=GOT,KEYLEN=37,POS=S                 
         SENSEG NAME=WDG201,PARENT=0                                            
         SENSEG NAME=WDGX9306,PARENT=WDG201                                     
         SENSEG NAME=WDGX9308,PARENT=WDGX9306                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40717                                       
         END                                                                    
