*                                                                               
         PCB   TYPE=DB,DBDNAME=WDL5,PROCOPT=GOT,KEYLEN=19,POS=S                 
         SENSEG NAME=WDL501,PARENT=0                                            
         SENSEG NAME=WDL511,PARENT=WDL501                                       
         SENSEG NAME=WDL521,PARENT=WDL511                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
*              KUNDREG. BETALARINF.                                             
         PCB   TYPE=DB,DBDNAME=WDB1,PROCOPT=GOT,KEYLEN=11,POS=S                 
         SENSEG NAME=WDB101,PARENT=0                                            
*                                                                               
*              KUNDREG. GODSMOTTAG.                                             
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
* WDB6-PCB - DC-REGISTER                                                        
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=02,POS=S                 
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
* WDK7-PCB - ART-REGISTER  WDK7                                                 
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=8,POS=S                  
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40725                                       
         END                                                                    
