*                                                                               
         PCB   TYPE=TP,NAME=W4T796X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*                                                                               
         PCB    TYPE=DB,DBDNAME=WDP7,PROCOPT=G,KEYLEN=8,POS=S                   
         SENSEG NAME=WDP701,PARENT=0,PROCOPT=GIR                                
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA2,PROCOPT=GOT,KEYLEN=14,POS=S                 
         SENSEG NAME=WDA201,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE4A,PROCOPT=GOT,KEYLEN=23,POS=S                
         SENSEG NAME=WDE4A1,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE6,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDE601,PARENT=0                                            
         SENSEG NAME=WDE611,PARENT=WDE601                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40705                                       
         END                                                                    
