*          DATA SET W40902PII0 AT LEVEL 003 AS OF 87/08/26                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXJD,PROCOPT=GOT,KEYLEN=50,POS=S               
         SENSEG NAME=WLXXJD01,PARENT=0                                          
         SENSEG NAME=WLXXJD11,PARENT=WLXXJD01                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40902                                       
         END                                                                    
