*          DATA SET W40901PII0 AT LEVEL 007 AS OF 90/10/10                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLORQL,PROCOPT=GOT,KEYLEN=21,POS=S               
         SENSEG NAME=WLORQL01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLORQI,PROCOPT=GOT,KEYLEN=4,POS=S                
         SENSEG NAME=WLORQI01,PARENT=0                                          
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W40901                                       
         END                                                                    
