*                                                                               
         PCB   TYPE=DB,DBDNAME=WL4541,PROCOPT=G,KEYLEN=46,POS=S                 
         SENSEG NAME=WL454101,PARENT=0                                          
         SENSEG NAME=WL454111,PARENT=WL454101,PROCOPT=GD                        
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W41214,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
