* WDI1   PIE SW ORDER HISTORIK                                                  
         PCB   TYPE=DB,DBDNAME=WDI1,PROCOPT=G,KEYLEN=38,POS=S                   
         SENSEG NAME=WDI101,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDI111,PARENT=WDI101,PROCOPT=GI                            
*                                                                               
* WDI1A  PIE SW ORDER HISTORIK INDX IDPIERAD                                    
         PCB   TYPE=DB,DBDNAME=WDI1,PROCOPT=G,KEYLEN=20,POS=S,         *        
               PROCSEQ=WDI1A                                                    
         SENSEG NAME=WDI111,PARENT=0,PROCOPT=GR                                 
* WDR4   ÅTERSTARTSREGISTER                                                     
         PCB   TYPE=DB,DBDNAME=WDR4,PROCOPT=G,KEYLEN=31,POS=S                   
         SENSEG NAME=WDR401,PARENT=0                                            
         SENSEG NAME=WDR470,PARENT=WDR401,PROCOPT=GR                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W41207,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
