*                                                                               
*        KUNDREG WDB4                                                           
         PCB   TYPE=DB,DBDNAME=WDB4,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDB401,PARENT=0                                            
         SENSEG NAME=WDB414,PARENT=WDB401                                       
*                                                                               
*        RO/TPO REGISTER SEK INDX WDA5B                                         
         PCB    TYPE=DB,DBDNAME=WLORDR,PROCOPT=GOT,KEYLEN=26,POS=S              
         SENSEG NAME=WLORDR01,PARENT=0                                          
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W41208                                       
         END                                                                    
