******************************************* DISPATCHER                          
         PCB   TYPE=TP,NAME=W0T693X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
******************************************* KOMMUNIKATIONS DB                   
         PCB   TYPE=DB,DBDNAME=WLKOMA,PROCOPT=G,KEYLEN=28,POS=S                 
         SENSEG NAME=WLKOMA01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLKOMA11,PARENT=WLKOMA01,PROCOPT=GI                        
*                                                                               
******************************************* HÄNDELSE DATABAS                    
         PCB   TYPE=DB,DBDNAME=WL4579,PROCOPT=G,KEYLEN=31,POS=S                 
         SENSEG NAME=WL457901,PARENT=0                                          
         SENSEG NAME=WL457911,PARENT=WL457901,PROCOPT=GIR                       
*                                                                               
* WDK6-PCB - ARTIKELREGISTER  WDK6                                              
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=06,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
* WDK7-PCB - ARTIKELREGISTER  WDK7                                              
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
*                                                                               
* WDD7-PCB - ERSÄTTNINGSREGISTER  WDK6                                          
         PCB   TYPE=DB,DBDNAME=WDD7,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDD701,PARENT=0                                            
         SENSEG NAME=WDD702,PARENT=WDD701                                       
*                                                                               
* WDQ1-PCB - ORDERBEKRÄFTELSEREGISTER                                           
         PCB   TYPE=DB,DBDNAME=WDQ1,PROCOPT=G,KEYLEN=17,POS=S                   
         SENSEG NAME=WDQ101,PARENT=0,PROCOPT=GI                                 
*                                                                               
******** SUBMODUL   W411SPAR  KONTROLL DIV SPÄRRAR    ********                  
*                                                                               
* SPAR-WDF8-PCB SPÄRREGLER                                                      
         PCB   TYPE=DB,DBDNAME=WDF8,PROCOPT=GOT,KEYLEN=24,POS=S                 
         SENSEG NAME=WDF801,PARENT=0                                            
         SENSEG NAME=WDF811,PARENT=WDF801                                       
         SENSEG NAME=WDF812,PARENT=WDF801                                       
         SENSEG NAME=WDF813,PARENT=WDF801                                       
         SENSEG NAME=WDF814,PARENT=WDF801                                       
         SENSEG NAME=WDF815,PARENT=WDF801                                       
*                                                                               
* SPAR-WDF8A-PCB SPÄRREGLER (SEKUNDÄRINDEX DISTR/KUND INGÅNG)                   
         PCB   TYPE=DB,DBDNAME=WDF8A,PROCOPT=GOT,KEYLEN=24,POS=S                
         SENSEG NAME=WDF8A1,PARENT=0                                            
*                                                                               
* SPAR-WDK6-PCB - ARTIKELREGISTER                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=11,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W41242,CMPAT=YES                             
         END                                                                    
