*                                                                               
* WDA5   RESTORDER                                                              
         PCB   TYPE=DB,DBDNAME=WDA5,PROCOPT=GOT,KEYLEN=24,POS=S                 
         SENSEG NAME=WDA501,PARENT=0                                            
*                                                                               
* WDB2-PCB - KUNDREGISTER GODSMOTTAGARE WDB2                                    
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
* WDR5   HTR 4564 RESTOREDERNOTERINGAR                                          
         PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=GOT,KEYLEN=54,POS=S                 
         SENSEG NAME=WDR501,PARENT=0                                            
         SENSEG NAME=WDGX4564,PARENT=WDR501                                     
*                                                                               
* WDK6   ARTIKELREGISTER                                                        
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=6,POS=S                  
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK9,PROCOPT=GOT,KEYLEN=5,POS=S                  
         SENSEG NAME=WDK901,PARENT=0                                            
*                                                                               
* WDK7-PCB  PART DATABASE                                                       
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
*                                                                               
*                                                                               
* WDB5-PCB  CUSTOMER FRAKTKOD-GODSMOTTAGARE                                     
         PCB   TYPE=DB,DBDNAME=WDB5,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDB501,PARENT=0                                            
*                                                                               
* WDR1-PCB  WDGX4433/34                                                         
         PCB TYPE=DB,DBDNAME=WDR1,PROCOPT=GOT,KEYLEN=40,POS=S                   
         SENSEG NAME=WDR101,PARENT=0                                            
         SENSEG NAME=WDR130,PARENT=WDR101                                       
*                                                                               
* WDB3-PCB  KUNDREGISTRET  WDB3                                                 
         PCB   TYPE=DB,DBDNAME=WDB3,PROCOPT=GOT,KEYLEN=9,POS=S                  
         SENSEG NAME=WDB301,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W41222                                       
         END                                                                    
