*                                                                               
         PCB   TYPE=DB,DBDNAME=WDQ4,PROCOPT=GOT,KEYLEN=20,POS=S                 
         SENSEG NAME=WDQ401,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W41239                                       
         END                                                                    
