*                                                                               
         PCB   TYPE=DB,DBDNAME=WDQ2,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDQ201,PARENT=0                                            
         PSBGEN LANG=COBOL,PSBNAME=W41230                                       
         END                                                                    
