*        UTLÄSNING ORAD-KVOKS-PREL > ZERO                                       
         PCB   TYPE=DB,DBDNAME=WDQ4C,PROCOPT=G,KEYLEN=20,POS=S                  
         SENSEG NAME=WDQ4C1,PARENT=0                                            
*                                                                               
*        ORAD-KVOKS-PREL TILL SLAG-KVOKS-BULK                                   
* ORDERRAD WDQ4                                                                 
         PCB   TYPE=DB,DBDNAME=WDQ4,PROCOPT=G,KEYLEN=20,POS=S                   
         SENSEG NAME=WDQ401,PARENT=0,PROCOPT=GR                                 
*                                                                               
* ORDERHUVUD WDQ2                                                               
         PCB    TYPE=DB,DBDNAME=WDQ2,PROCOPT=GOT,KEYLEN=4,POS=S                 
         SENSEG NAME=WDQ201,PARENT=0                                            
*                                                                               
* DC-REGISTER  WDB6                                                             
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
* ARTIKELINFO WDK7                                                              
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=7,POS=S                    
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701,PROCOPT=GR                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W41236                                       
         END                                                                    
