*                                                                               
         PCB   TYPE=DB,DBDNAME=WDQ4,PROCOPT=GOT,KEYLEN=20,POS=S                 
         SENSEG NAME=WDQ401,PARENT=0                                            
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W41244                                       
         END                                                                    
