*                                                                               
*        KUNDREGISTER WDB2                                                      
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
*        USER INFO WDP7                                                         
         PCB   TYPE=DB,DBDNAME=WDP7,PROCOPT=GOT,KEYLEN=8,POS=S                  
         SENSEG NAME=WDP701,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W41201                                       
         END                                                                    
