*                                                                               
        PCB    TYPE=DB,DBDNAME=WLORQM,PROCOPT=GOT,KEYLEN=17,POS=S               
        SENSEG NAME=WLORQM01,PARENT=0                                           
*                                                                               
        PCB    TYPE=DB,DBDNAME=WLGMTA,PROCOPT=GOT,KEYLEN=07,POS=S               
        SENSEG NAME=WLGMTA01,PARENT=0                                           
*                                                                               
        PSBGEN LANG=COBOL,PSBNAME=W41231                                        
        END                                                                     
