*                                                                               
*WDP701  USER DATABAS                                                           
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GOT,KEYLEN=8,POS=S                
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*WDR101-130                                                                     
*        ARBETSTIDSTABELL WDGX HTYP=4435                                        
         PCB    TYPE=DB,DBDNAME=WLXXKC,PROCOPT=GOT,KEYLEN=40,POS=S              
         SENSEG NAME=WLXXKC01,PARENT=0                                          
         SENSEG NAME=WLXXKC11,PARENT=WLXXKC01                                   
*WDR101-110                                                                     
*        ARBETSTIDSKALENDER WDGX HTYP=4437                                      
         PCB    TYPE=DB,DBDNAME=WL4437,PROCOPT=G,KEYLEN=38,POS=S                
         SENSEG NAME=WL443701,PARENT=0,PROCOPT=GID                              
         SENSEG NAME=WL443711,PARENT=WL443701,PROCOPT=GIR                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W41321                                       
         END                                                                    
