*          DATA SET W41320PII0 AT LEVEL 008 AS OF 90/10/16                      
*          DATA SET W41320PII1 AT LEVEL 008 AS OF 90/03/23                      
*                                                                               
         PCB    TYPE=DB,DBDNAME=WLXXKC,PROCOPT=G,KEYLEN=40,POS=S                
         SENSEG NAME=WLXXKC01,PARENT=0                                          
         SENSEG NAME=WLXXKC11,PARENT=WLXXKC01,PROCOPT=GI                        
*                                                                               
         PCB    TYPE=DB,DBDNAME=WL4437,PROCOPT=G,KEYLEN=38,POS=S                
         SENSEG NAME=WL443701,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WL443711,PARENT=WL443701,PROCOPT=GID                       
*                                                                               
         PCB    TYPE=DB,DBDNAME=WLXXKY,PROCOPT=G,KEYLEN=40,POS=S                
         SENSEG NAME=WLXXKY01,PARENT=0,PROCOPT=GR                               
         SENSEG NAME=WLXXKY11,PARENT=WLXXKY01,PROCOPT=GR                        
*                                                                               
         PCB    TYPE=DB,DBDNAME=WLXXKH,PROCOPT=GOT,KEYLEN=35,POS=S              
         SENSEG NAME=WLXXKH01,PARENT=0                                          
         SENSEG NAME=WLXXKH11,PARENT=WLXXKH01                                   
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6   (NEXT-PCB)                                     
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W41320,CMPAT=YES                             
         END                                                                    
