*          DATA SET W41307PII0 AT LEVEL 007 AS OF 91/02/13                      
*                                                                               
         PCB    TYPE=DB,DBDNAME=WDR4,PROCOPT=GOT,KEYLEN=206                     
         SENSEG NAME=WDR401,PARENT=0                                            
         SENSEG NAME=WDR430,PARENT=WDR401                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W41307                                       
         END                                                                    
