*                                                                               
* SATG-PCB                     SATSORDER-HUVUD        WDJ2                      
         PCB   TYPE=DB,DBDNAME=WLSATG,PROCOPT=G,KEYLEN=4,POS=S                  
         SENSEG NAME=WLSATG01,PARENT=0,PROCOPT=GD                               
*                                                                               
* SATJ-PCB  SEKUNDÄR-INDX      SATSORDER-HUVUD        WDJ2C1                    
         PCB   TYPE=DB,DBDNAME=WLSATJ,PROCOPT=GOT,KEYLEN=17,POS=S               
         SENSEG NAME=WLSATJ01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE6,PROCOPT=GOT,KEYLEN=4,POS=S                  
         SENSEG NAME=WDE601,PARENT=0                                            
*                                                                               
* W6INLA-PCB - INLEVERANS PARTI-SEGMENT W6D111        W6D1                      
         PCB   TYPE=DB,DBDNAME=W6INLA,PROCOPT=GOT,KEYLEN=8,POS=S,      *        
               PROCSEQ=W6D1B                                                    
         SENSEG NAME=W6INLA11,PARENT=0                                          
*                                                                               
* INLB-PCB                     ARTIKELINFO            WDD9                      
         PCB   TYPE=DB,DBDNAME=WLINLB,PROCOPT=GOT,KEYLEN=24,POS=S               
         SENSEG NAME=WLINLB01,PARENT=0                                          
         SENSEG NAME=WLINLB11,PARENT=WLINLB01                                   
         SENSEG NAME=WLINLB23,PARENT=WLINLB11                                   
         SENSEG NAME=WLINLB31,PARENT=WLINLB23                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W41603,CMPAT=YES                             
         END                                                                    
