*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=6,POS=S                
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLSATB,PROCOPT=GOT,KEYLEN=9,POS=S                
         SENSEG NAME=WLSATB01,PARENT=0                                          
         SENSEG NAME=WLSATB11,PARENT=WLSATB01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLSATG,PROCOPT=G,KEYLEN=9,POS=S                  
         SENSEG NAME=WLSATG01,PARENT=0,PROCOPT=GIR                              
         SENSEG NAME=WLSATG11,PARENT=WLSATG01,PROCOPT=GIR                       
*                                                                               
******** SUBMODUL W4110RDN UTTAG AV AUTOMATISKA ORDERNUMMER *******             
******** IDHTYP = 4525                                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXKP,PROCOPT=G,KEYLEN=35,POS=S                 
         SENSEG NAME=WLXXKP01,PARENT=0                                          
         SENSEG NAME=WLXXKP11,PARENT=WLXXKP01,PROCOPT=GR                        
*                                                                               
******** HÄNDELSEBASER FÖR KOMMUNIKATION MOT ANSKAFFNINGEN  *******             
******** IDHTYP = 2235 OCH 2236 FRÅN ANSKAFFNINGEN (INSERT TILLF) *             
******** IDHTYP = 2237 OCH 2238 TILL ANSKAFFNINGEN                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXCN,PROCOPT=G,KEYLEN=40,POS=S                 
         SENSEG NAME=WLXXCN01,PARENT=0                                          
         SENSEG NAME=WLXXCN11,PARENT=WLXXCN01,PROCOPT=GID                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXCO,PROCOPT=G,KEYLEN=40,POS=S                 
         SENSEG NAME=WLXXCO01,PARENT=0                                          
         SENSEG NAME=WLXXCO11,PARENT=WLXXCO01,PROCOPT=GI                        
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W41601,CMPAT=YES                             
         END                                                                    
