*                                                                               
         PCB   TYPE=DB,DBDNAME=WLRETA,PROCOPT=G,KEYLEN=15,POS=S                 
         SENSEG NAME=WLRETA01,PARENT=0,PROCOPT=GD                               
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W41890,CMPAT=YES                             
         END                                                                    
