*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR4,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDR401,PARENT=0                                            
         SENSEG NAME=WDGX4102,PARENT=WDR401                                     
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W41839                                       
         END                                                                    
