*                                                                               
         PCB   TYPE=DB,DBDNAME=WLKREE,PROCOPT=G,KEYLEN=22,POS=S                 
         SENSEG NAME=WLKREE01,PARENT=0,PROCOPT=GR                               
         SENSEG NAME=WLKREE11,PARENT=WLKREE01,PROCOPT=GR                        
*                                                                               
* ATTEST AV KREDITNOTA             WDR5  IDHTYP=4103                            
         PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=G,KEYLEN=34,POS=S                   
         SENSEG NAME=WDR501,PARENT=0,PROCOPT=GD                                 
         SENSEG NAME=WDGX4104,PARENT=WDR501,PROCOPT=GRD                         
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA3F,PROCOPT=GOT,KEYLEN=38,POS=S                
         SENSEG NAME=WDA3F1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W41815,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
