*0693-PCB                                                                       
         PCB   TYPE=TP,NAME=W0T693X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLKREE,PROCOPT=G,KEYLEN=22,POS=S                 
         SENSEG NAME=WLKREE01,PARENT=0,PROCOPT=GR                               
         SENSEG NAME=WLKREE11,PARENT=WLKREE01,PROCOPT=GR                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDH1,PROCOPT=G,KEYLEN=23,POS=S                   
         SENSEG NAME=WDH101,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDH111,PARENT=WDH101,PROCOPT=GIR                           
         SENSEG NAME=WDH121,PARENT=WDH111,PROCOPT=GIR                           
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=G,KEYLEN=06,POS=S                 
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01,PROCOPT=GR                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=23,POS=S                   
         SENSEG NAME=WDK701,PARENT=0,PROCOPT=GIR                                
         SENSEG NAME=WDK711,PARENT=WDK701,PROCOPT=GIR                           
         SENSEG NAME=WDK728,PARENT=WDK711,PROCOPT=GR                            
         SENSEG NAME=WDK712,PARENT=WDK701,PROCOPT=GI                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WL4121,PROCOPT=G,KEYLEN=30,POS=S                 
         SENSEG NAME=WL412101,PARENT=0                                          
         SENSEG NAME=WL412111,PARENT=WL412101,PROCOPT=GR                        
*                                                                               
*WDL901                                                                         
         PCB   TYPE=DB,DBDNAME=WLLOGA,PROCOPT=G,KEYLEN=20,POS=S                 
         SENSEG NAME=WLLOGA01,PARENT=0,PROCOPT=GI                               
*                                                                               
* ATTEST AV KREDITNOTA             WDR5  IDHTYP=4103                            
         PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=G,KEYLEN=30,POS=S                   
         SENSEG NAME=WDR501,PARENT=0,PROCOPT=GD                                 
*                                                                               
* WDL7 ORDERINGÅNGSREGISTER SDC                                                 
         PCB   TYPE=DB,DBDNAME=WLOIGA,PROCOPT=G,KEYLEN=25,POS=S                 
         SENSEG NAME=WLOIGA01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLOIGA11,PARENT=WLOIGA01,PROCOPT=GI                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
* WDB2-PCB - KUNDREGISTER GODSMOTTAGARE WDB2                                    
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
* WDP8-PCB - KOMMUNIKATIONS DB                                                  
         PCB   TYPE=DB,DBDNAME=WLKOMA,PROCOPT=G,KEYLEN=28,POS=S                 
         SENSEG NAME=WLKOMA01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLKOMA11,PARENT=WLKOMA01,PROCOPT=GI                        
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W41835,CMPAT=YES                             
         END                                                                    
