*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA4,PROCOPT=GOT,KEYLEN=17,POS=S                 
         SENSEG NAME=WDA401,PARENT=0                                            
         SENSEG NAME=WDA411,PARENT=WDA401                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W4182A                                       
         END                                                                    
