*                                                                               
RECEIVE3 PCB   TYPE=TP,NAME=WF0212X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
STARTPRO PCB   TYPE=TP,NAME=WF0204X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA2,PROCOPT=G,KEYLEN=22,POS=S                   
         SENSEG NAME=WDA201,PARENT=0,PROCOPT=GR                                 
         SENSEG NAME=WDA211,PARENT=WDA201,PROCOPT=GR                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD3,PROCOPT=GOT,KEYLEN=11,POS=S,       *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WDD301,PARENT=0                                            
         SENSEG NAME=WDD311,PARENT=WDD301                                       
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=GOT,KEYLEN=48,POS=S                 
         SENSEG NAME=WDR501,PARENT=0                                            
         SENSEG NAME=WDGX4104,PARENT=WDR501                                     
         SENSEG NAME=WDGX4106,PARENT=WDGX4104                                   
*                                                                               
* WDF5-PCB -LYNK CROSS REF                                                      
         PCB   TYPE=DB,DBDNAME=WDF5,PROCOPT=GOT,KEYLEN=11,POS=S                 
         SENSEG NAME=WDF501,PARENT=0                                            
         SENSEG NAME=WDF502,PARENT=WDF501                                       
*                                                                               
* WDK6-PCB - ARTIKELINFO                                                        
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=6,POS=S                  
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W41831,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
