*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W4183D,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
