*0693-PCB                                                                       
         PCB   TYPE=TP,NAME=W0T693X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA2,PROCOPT=G,KEYLEN=47,POS=S                   
         SENSEG NAME=WDA201,PARENT=0,PROCOPT=GR                                 
         SENSEG NAME=WDA211,PARENT=WDA201,PROCOPT=GR                            
         SENSEG NAME=WDA222,PARENT=WDA211,PROCOPT=GI                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=G,KEYLEN=06,POS=S                   
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601,PROCOPT=GR                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=23,POS=S                   
         SENSEG NAME=WDK701,PARENT=0,PROCOPT=GIR                                
         SENSEG NAME=WDK711,PARENT=WDK701,PROCOPT=GIR                           
         SENSEG NAME=WDK728,PARENT=WDK711,PROCOPT=GR                            
         SENSEG NAME=WDK712,PARENT=WDK701,PROCOPT=GIR                           
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDH1,PROCOPT=G,KEYLEN=23,POS=S                   
         SENSEG NAME=WDH101,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDH111,PARENT=WDH101,PROCOPT=GIR                           
         SENSEG NAME=WDH121,PARENT=WDH111,PROCOPT=GIR                           
*                                                                               
*    WDL9, SALDOFÖRÄNDRINGAR                                                    
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDL9,PROCOPT=GI,KEYLEN=20,POS=S                  
         SENSEG NAME=WDL901,PARENT=0                                            
*                                                                               
*    WDR901, EKONOMITRANS                                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR9,PROCOPT=GI,KEYLEN=31,POS=S                  
         SENSEG NAME=WDR901,PARENT=0                                            
*                                                                               
*    WDR4, ÅTERSTARTREGISTER BMP                                                
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR4,PROCOPT=G,KEYLEN=30,POS=S                   
         SENSEG NAME=WDR401,PARENT=0                                            
         SENSEG NAME=WDR470,PARENT=WDR401,PROCOPT=GR                            
*                                                                               
* ATTEST AV KREDITNOTA             WDR5  IDHTYP=4103                            
         PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=G,KEYLEN=30,POS=S                   
         SENSEG NAME=WDR501,PARENT=0,PROCOPT=GD                                 
*                                                                               
* WDL7 ORDERINGÅNGSREGISTER SDC                                                 
         PCB   TYPE=DB,DBDNAME=WLOIGA,PROCOPT=G,KEYLEN=25,POS=S                 
         SENSEG NAME=WLOIGA01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLOIGA11,PARENT=WLOIGA01,PROCOPT=GI                        
*                                                                               
*    WDR801, EKONOMITRANS                                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR8,PROCOPT=GI,KEYLEN=27,POS=S                  
         SENSEG NAME=WDR801,PARENT=0                                            
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
* GODSMOTTAGARREG                                                               
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
* KUNDREG KÖPARREG                                                              
         PCB   TYPE=DB,DBDNAME=WDB1,PROCOPT=GOT,KEYLEN=11,POS=S                 
         SENSEG NAME=WDB101,PARENT=0                                            
*                                                                               
* WDP8-PCB - KOMMUNIKATIONS DB                                                  
         PCB   TYPE=DB,DBDNAME=WLKOMA,PROCOPT=G,KEYLEN=28,POS=S                 
         SENSEG NAME=WLKOMA01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLKOMA11,PARENT=WLKOMA01,PROCOPT=GI                        
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W41833,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
