*                                                                               
*        KUNDREGISTER WDB2                                                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLGMTA,PROCOPT=GOT,KEYLEN=07,POS=S               
         SENSEG NAME=WLGMTA01,PARENT=0                                          
*                                                                               
* WDB1-PCB - KUNDREGISTER BETAL WDB1                                            
         PCB   TYPE=DB,DBDNAME=WDB1,PROCOPT=GOT,KEYLEN=11,POS=S                 
         SENSEG NAME=WDB101,PARENT=0                                            
*                                                                               
* DC-REGISTER                                                                   
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=38,POS=S                 
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB611,PARENT=WDB601                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=5,POS=S                  
         SENSEG NAME=WDK601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W41807                                       
         END                                                                    
