         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=6,POS=S                
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W41893                                       
         END                                                                    
