*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA2,PROCOPT=GOT,KEYLEN=22,POS=S                 
         SENSEG NAME=WDA201,PARENT=0                                            
         SENSEG NAME=WDA211,PARENT=WDA201                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=19,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
         SENSEG NAME=WDK621,PARENT=WDK611                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDL5,PROCOPT=GOT,KEYLEN=19,POS=S                 
         SENSEG NAME=WDL501,PARENT=0                                            
         SENSEG NAME=WDL511,PARENT=WDL501                                       
         SENSEG NAME=WDL521,PARENT=WDL511                                       
*                                                                               
*        KUNDREGISTER WDB2                                                      
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W41834                                       
         END                                                                    
