*                                                                               
         PCB   TYPE=DB,DBDNAME=W6KODA,PROCOPT=G,KEYLEN=31,POS=S                 
         SENSEG NAME=W6KODA01,PARENT=0,PROCOPT=GID                              
         SENSEG NAME=W6KODA11,PARENT=W6KODA01,PROCOPT=G                         
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=6,POS=S                
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=13,POS=S,     *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6KVAH,PROCOPT=GOT,KEYLEN=10,POS=S               
         SENSEG NAME=W6KVAH01,PARENT=0                                          
         SENSEG NAME=W6KVAH12,PARENT=W6KVAH01                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W42664,CMPAT=YES                             
         END                                                                    
