*                                                                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6KVAE,PROCOPT=GOT,KEYLEN=5,POS=S                
         SENSEG NAME=W6KVAE01,PARENT=0                                          
         SENSEG NAME=W6KVAE12,PARENT=W6KVAE01                                   
         SENSEG NAME=W6KVAE13,PARENT=W6KVAE01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLLEVA,PROCOPT=GOT,KEYLEN=8,POS=S                
         SENSEG NAME=WLLEVA01,PARENT=0                                          
         SENSEG NAME=WLLEVA14,PARENT=WLLEVA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=6,POS=S                
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=8,POS=S,      *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXLA,PROCOPT=GOT,KEYLEN=40,POS=S               
         SENSEG NAME=WLXXLA01,PARENT=0                                          
         SENSEG NAME=WLXXLA11,PARENT=WLXXLA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6LEVA,PROCOPT=GOT,KEYLEN=8,POS=S                
         SENSEG NAME=W6LEVA01,PARENT=0                                          
         SENSEG NAME=W6LEVA11,PARENT=W6LEVA01                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W42632                                       
*                                                                               
         END                                                                    
