*                                                                               
         PCB   TYPE=DB,DBDNAME=WLFILC,PROCOPT=GOT,KEYLEN=27,POS=S               
         SENSEG NAME=WLFILC01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6H7,PROCOPT=GOT,KEYLEN=5,POS=S                  
         SENSEG NAME=W6H701,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W42691                                       
         END                                                                    
