*                                                                               
         PCB   TYPE=DB,DBDNAME=WLFILC,PROCOPT=GOT,KEYLEN=27,POS=S               
         SENSEG NAME=WLFILC01,PARENT=0                                          
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W42698                                       
         END                                                                    
