*                                                                               
         PCB  TYPE=DB,DBDNAME=W6KVAB,KEYLEN=28,PROCOPT=GOT,POS=S,      *        
               PROCSEQ=W6H6A                                                    
         SENSEG NAME=W6KVAB01,PARENT=0                                          
         SENSEG NAME=W6KVAB11,PARENT=W6KVAB01                                   
*                                                                               
         PCB  TYPE=DB,DBDNAME=W6KVAB,KEYLEN=14,PROCOPT=G,POS=S                  
         SENSEG NAME=W6KVAB01,PARENT=0,PROCOPT=GD                               
*                                                                               
         PCB  TYPE=DB,DBDNAME=WLXXJY,KEYLEN=35,PROCOPT=GOT,POS=S                
         SENSEG NAME=WLXXJY01,PARENT=0                                          
         SENSEG NAME=WLXXJY11,PARENT=WLXXJY01                                   
*                                                                               
         PCB  TYPE=DB,DBDNAME=W6KVAA,KEYLEN=15,PROCOPT=GOT,POS=S                
         SENSEG NAME=W6KVAA01,PARENT=0                                          
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W42605                                       
         END                                                                    
