*                                                                               
         PCB   TYPE=DB,DBDNAME=W6UPFA,PROCOPT=G,KEYLEN=10,POS=S                 
         SENSEG NAME=W6UPFA01,PARENT=0,PROCOPT=GD                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6CKPD,PROCOPT=G,KEYLEN=30,POS=S                 
         SENSEG NAME=W6CKPD01,PARENT=0                                          
         SENSEG NAME=W6CKPD11,PARENT=W6CKPD01,PROCOPT=GR                        
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W42669,CMPAT=YES                             
         END                                                                    
*                                                                               
