*                                                                               
        PCB   TYPE=DB,DBDNAME=W6LOPB,PROCOPT=GR,KEYLEN=30,POS=S                 
        SENSEG NAME=W6LOPB01,PARENT=0,PROCOPT=G                                 
        SENSEG NAME=W6LOPB11,PARENT=W6LOPB01,PROCOPT=GR                         
*                                                                               
        PSBGEN LANG=COBOL,PSBNAME=W42649,CMPAT=YES                              
        END                                                                     
