         PCB   TYPE=DB,DBDNAME=WLLEVA,PROCOPT=GOT,KEYLEN=8,POS=S                
         SENSEG NAME=WLLEVA01,PARENT=0                                          
         SENSEG NAME=WLLEVA14,PARENT=WLLEVA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6KVAE,PROCOPT=GOT,KEYLEN=9,POS=S                
         SENSEG NAME=W6KVAE01,PARENT=0                                          
         SENSEG NAME=W6KVAE11,PARENT=W6KVAE01                                   
         SENSEG NAME=W6KVAE12,PARENT=W6KVAE01                                   
         SENSEG NAME=W6KVAE14,PARENT=W6KVAE01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=8,POS=S,      *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXLA,PROCOPT=GOT,KEYLEN=40,POS=S               
         SENSEG NAME=WLXXLA01,PARENT=0                                          
         SENSEG NAME=WLXXLA11,PARENT=WLXXLA01                                   
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
* WDL6 INLEVERANS HISTORIK SDC                                                  
         PCB   TYPE=DB,DBDNAME=WDL6,PROCOPT=GOT,KEYLEN=21,POS=S                 
         SENSEG NAME=WDL601,PARENT=0                                            
         SENSEG NAME=WDL611,PARENT=WDL601                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W42625                                       
         END                                                                    
