*                                                                               
*        W6H5 KVALITET LAGERINDELNING                                           
         PCB  TYPE=DB,DBDNAME=W6KVAA,KEYLEN=15,PROCOPT=GOT,POS=S                
         SENSEG NAME=W6KVAA01,PARENT=0                                          
*                                                                               
*        W6H6 KVALITET LAGERKONTROLL                                            
         PCB  TYPE=DB,DBDNAME=W6KVAB,KEYLEN=21,PROCOPT=GOT,POS=S                
         SENSEG NAME=W6KVAB01,PARENT=0                                          
         SENSEG NAME=W6KVAB11,PARENT=W6KVAB01                                   
*                                                                               
*        WDK6 CDC-ARTIKELREGISTRET                                              
         PCB  TYPE=DB,DBDNAME=WLARTC,KEYLEN=6,PROCOPT=GOT,POS=S                 
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
*                                                                               
*        WDK7 SDC-ARTIKELREGISTRET                                              
         PCB  TYPE=DB,DBDNAME=WLARTS,KEYLEN=7,PROCOPT=GOT,POS=S                 
         SENSEG NAME=WLARTS01,PARENT=0                                          
         SENSEG NAME=WLARTS11,PARENT=WLARTS01                                   
*                                                                               
*        WDD3 BENÄMNINGSREGISTRET                                               
         PCB  TYPE=DB,DBDNAME=WLBENA,KEYLEN=8,PROCOPT=GOT,POS=S,       *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
*        WDR1 KVALITET FELKOD   IDHTYP=4821                                     
         PCB  TYPE=DB,DBDNAME=WLXXJY,KEYLEN=35,PROCOPT=GOT,POS=S                
         SENSEG NAME=WLXXJY01,PARENT=0                                          
         SENSEG NAME=WLXXJY11,PARENT=WLXXJY01                                   
*                                                                               
*        WDG2 KVALITET LISTBEST IDHTYP=4823                                     
         PCB  TYPE=DB,DBDNAME=WLXXJZ,KEYLEN=31,PROCOPT=G,POS=S                  
         SENSEG NAME=WLXXJZ01,PARENT=0,PROCOPT=GID                              
         SENSEG NAME=WLXXJZ11,PARENT=WLXXJZ01,PROCOPT=G                         
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W42604,CMPAT=YES                             
         END                                                                    
