*                                                                               
         PCB  TYPE=DB,DBDNAME=W6KVAA,PROCOPT=GOT,KEYLEN=15,POS=S                
         SENSEG NAME=W6KVAA01,PARENT=0                                          
*                                                                               
         PCB  TYPE=DB,DBDNAME=W6KVAA,PROCOPT=GOT,KEYLEN=15,POS=S                
         SENSEG NAME=W6KVAA01,PARENT=0                                          
*                                                                               
         PCB  TYPE=DB,DBDNAME=W6KVAB,KEYLEN=14,POS=S                            
         SENSEG NAME=W6KVAB01,PARENT=0,PROCOPT=GI                               
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W42603                                       
         END                                                                    
