*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=6,POS=S                
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
*                                                                               
* W6D1 INLEVERANSREGISTER SEK INDX                                              
         PCB   TYPE=DB,DBDNAME=W6INLA,PROCOPT=GOT,KEYLEN=05,POS=S,     *        
               PROCSEQ=W6D1B                                                    
         SENSEG NAME=W6INLA11,PARENT=0                                          
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W42652                                       
         END                                                                    
