*                                                                               
*        KONTROLLRAPPORT                                                        
         PCB   TYPE=DB,DBDNAME=W6H7,PROCOPT=GOT,KEYLEN=5,POS=S                  
         SENSEG NAME=W6H701,PARENT=0                                            
         SENSEG NAME=W6H712,PARENT=W6H701                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=6,POS=S                  
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W42634                                       
         END                                                                    
