*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=G,KEYLEN=7,POS=S                    
         SENSEG NAME=WDB201,PARENT=0,PROCOPT=GR                                 
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W43210,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
