*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLBETC,PROCOPT=GOT,KEYLEN=11,POS=S               
         SENSEG NAME=WLBETC01,PARENT=0                                          
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W43230                                       
         END                                                                    
