*                                                                               
*        KUNDORDERREG WDE4                                                      
         PCB   TYPE=DB,DBDNAME=WDE4,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDE401,PARENT=0                                            
         SENSEG NAME=WDE411,PARENT=WDE401                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W44069                                       
         END                                                                    
