*                                                                               
         PCB   TYPE=TP,NAME=W0T693X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDP8,PROCOPT=G,KEYLEN=28,POS=S                   
         SENSEG NAME=WDP801,PARENT=0,PROCOPT=GIR                                
         SENSEG NAME=WDP811,PARENT=WDP801,PROCOPT=GI                            
*                                                                               
         PCB  TYPE=DB,DBDNAME=WLARTC,PROCOPT=G,KEYLEN=6,POS=S                   
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01,PROCOPT=GR                        
*                                                                               
         PCB  TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=8,POS=S                     
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701,PROCOPT=GR                            
         SENSEG NAME=WDK722,PARENT=WDK711                                       
*                                                                               
         PCB  TYPE=DB,DBDNAME=WLORDP,PROCOPT=G,KEYLEN=58,POS=S,        *        
               PROCSEQ=WDA5A                                                    
         SENSEG NAME=WLORDP01,PARENT=0,PROCOPT=GR                               
*                                                                               
         PCB  TYPE=DB,DBDNAME=WLORDP,PROCOPT=G,KEYLEN=26,POS=S                  
         SENSEG NAME=WLORDP01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLZZAC,PROCOPT=G,KEYLEN=18,POS=S                 
         SENSEG NAME=WLZZAC01,PARENT=0,PROCOPT=I                                
*                                                                               
         PCB   TYPE=DB,DBDNAME=WL4505,PROCOPT=G,KEYLEN=35,POS=S                 
         SENSEG NAME=WL450501,PARENT=0                                          
         SENSEG NAME=WL450511,PARENT=WL450501,PROCOPT=GRD                       
*                                                                               
* WDB2-PCB - KUNDREGISTER GODSMOTTAGARE WDB2                                    
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S,        *        
               PROCSEQ=WDB6A                                                    
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
*                                                                               
* ORDN-XXKP-PCB - AUTOMATISKA ORDERNUMMER WDR1  IDHTYP=4525                     
         PCB   TYPE=DB,DBDNAME=WLXXKP,PROCOPT=G,KEYLEN=35,POS=S                 
         SENSEG NAME=WLXXKP01,PARENT=0                                          
         SENSEG NAME=WLXXKP11,PARENT=WLXXKP01,PROCOPT=GR                        
*                                                                               
* ORDN-ORQL-PCB - ORDERHUVUDSREG KÖ (WDQ2C)-SEK.INDEX                           
         PCB   TYPE=DB,DBDNAME=WLORQL,PROCOPT=GOT,KEYLEN=17,POS=S               
         SENSEG NAME=WLORQL01,PARENT=0                                          
*                                                                               
* ORDN-PROC-PCB - PROFORMAHUVUDREG    WDE8                                      
         PCB   TYPE=DB,DBDNAME=WLPROC,PROCOPT=GOT,KEYLEN=17,POS=S               
         SENSEG NAME=WLPROC01,PARENT=0                                          
*                                                                               
* ORDN-ORQI-PCB - ORDERHUVUDSREG KÖ (WDQ201)                                    
         PCB   TYPE=DB,DBDNAME=WLORQI,PROCOPT=GOT,KEYLEN=04,POS=S               
         SENSEG NAME=WLORQI01,PARENT=0                                          
*                                                                               
* EMOH-WDQ2-PCB - ORDERHUVUDSREGISTER KÖ SEK.INDEX  WDQ2C                       
         PCB   TYPE=DB,DBDNAME=WDQ2,PROCOPT=GOT,KEYLEN=24,POS=S,       *        
               PROCSEQ=WDQ2C                                                    
         SENSEG NAME=WDQ201,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W44032,CMPAT=YES                             
         END                                                                    
