*          DATA SET W44066PII0 AT LEVEL 001 AS OF 91/06/06                      
*                                                                               
* WDK9 - RO-REG                                                                 
        PCB    TYPE=DB,DBDNAME=WDK9,PROCOPT=GOT,KEYLEN=210,POS=S                
        SENSEG NAME=WDK901,PARENT=0                                             
*                                                                               
        PSBGEN LANG=COBOL,PSBNAME=W44066                                        
        END                                                                     
