* USEA-PCB - USER INFO WDP7                                                     
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
* WDK7-PCB - ARTIKELINFO WDK7                                                   
*                                                                               
         PCB  TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=8,POS=S                     
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701,PROCOPT=GR                            
         SENSEG NAME=WDK722,PARENT=WDK711                                       
         SENSEG NAME=WDK712,PARENT=WDK701                                       
*                                                                               
* ARTC-PCB - ARTIKELINFO WDK6                                                   
*                                                                               
         PCB  TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=6,POS=S                 
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
*                                                                               
* ORDP-PCB - RESTORDERINFO WDA5                                                 
*                                                                               
         PCB  TYPE=DB,DBDNAME=WLORDP,PROCOPT=G,KEYLEN=58,POS=S,        *        
               PROCSEQ=WDA5A                                                    
         SENSEG NAME=WLORDP01,PARENT=0,PROCOPT=GR                               
*                                                                               
* ORQL-PCB -ORDERHUVUDSREG KÖ(WDQ2C)-SEK.INDEX TILL WDQ201                      
         PCB   TYPE=DB,DBDNAME=WLORQI,PROCOPT=GOT,KEYLEN=17,POS=S,     *        
               PROCSEQ=WDQ2C                                                    
         SENSEG NAME=WLORQI01,PARENT=0                                          
*                                                                               
* ORQM-PCB - ORDERBEKRÄFTELSEREGISTER   WDQ1                                    
         PCB   TYPE=DB,DBDNAME=WLORQM,PROCOPT=G,KEYLEN=17,POS=S                 
         SENSEG NAME=WLORQM01,PARENT=0,PROCOPT=GI                               
*                                                                               
*------- WDR4 HTR ROT 4505 (RO-TÄCKNING)                                        
         PCB   TYPE=DB,DBDNAME=WL4505,PROCOPT=G,KEYLEN=35,POS=S                 
         SENSEG NAME=WL450501,PARENT=0                                          
         SENSEG NAME=WL450511,PARENT=WL450501,PROCOPT=I                         
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
* WDB2-PCB - KUNDREGISTER GODSMOTTAGARE WDB2                                    
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
******** SUBMODUL    W218ETA   HÄMTA TIBERANK FÖR NDC:ER ***                    
*                                                                               
* ETA-WDK7-PCB - ARTIKELREGISTRET WDK7                                          
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK712,PARENT=WDK701                                       
*                                                                               
* ETA-INLC-PCB - INLEV-HISTORIKREGISTRET WDL6                                   
         PCB   TYPE=DB,DBDNAME=WLINLC,PROCOPT=GOT,KEYLEN=21,POS=S               
         SENSEG NAME=WLINLC01,PARENT=0                                          
         SENSEG NAME=WLINLC11,PARENT=WLINLC01                                   
         SENSEG NAME=WLINLC12,PARENT=WLINLC01                                   
*                                                                               
* ETA-WDB6-PCB - DC REGISTER WDB6                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=4,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB616,PARENT=WDB601                                       
*                                                                               
* ETA-WDD9-PCB - DC REGISTER WDD9                                               
         PCB   TYPE=DB,DBDNAME=WDD9,PROCOPT=GOT,KEYLEN=20,POS=S                 
         SENSEG NAME=WDD901,PARENT=0                                            
         SENSEG NAME=WDD902,PARENT=WDD901                                       
         SENSEG NAME=WDD905,PARENT=WDD902                                       
         SENSEG NAME=WDD924,PARENT=WDD902                                       
*                                                                               
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W44038,CMPAT=YES                             
         END                                                                    
