* WDE9 - PROF.RAD-REG.                                                          
         PCB   TYPE=DB,DBDNAME=WLPROD,PROCOPT=GOT,KEYLEN=11,POS=S               
         SENSEG NAME=WLPROD01,PARENT=0                                          
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W44072                                       
         END                                                                    
