*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA6,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDA601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W4405A                                       
         END                                                                    
