*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD9,PROCOPT=GOT,KEYLEN=53,POS=S                 
               SENSEG NAME=WDD901,PARENT=0                                      
               SENSEG NAME=WDD902,PARENT=WDD901                                 
               SENSEG NAME=WDD924,PARENT=WDD902                                 
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W44087                                       
               END                                                              
