* WDE8 - PROF-REG                                                               
         PCB   TYPE=DB,DBDNAME=WDE8,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDE801,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W44071                                       
         END                                                                    
