*                                                                               
*------- WDR4 HTR ROT 4557 (BMP-STYRNING)                                       
         PCB   TYPE=DB,DBDNAME=WLXXLP,PROCOPT=G,KEYLEN=31,POS=S                 
         SENSEG NAME=WLXXLP01,PARENT=0                                          
         SENSEG NAME=WLXXLP11,PARENT=WLXXLP01,PROCOPT=GIRD                      
*                                                                               
*------- WDR4 HTR ROT 4505 (RO-TÄCKNING)                                        
         PCB   TYPE=DB,DBDNAME=WL4505,PROCOPT=G,KEYLEN=35,POS=S                 
         SENSEG NAME=WL450501,PARENT=0                                          
         SENSEG NAME=WL450511,PARENT=WL450501,PROCOPT=I                         
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W44031,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
