*                                                                               
*                                                                               
* ALT-PCB TRANS TILL PGM W3039100                                               
PRQRY    PCB   TYPE=TP,NAME=W30391X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*------- WDK6                                                                   
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=G,KEYLEN=6,POS=S                  
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01,PROCOPT=GR                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=8,POS=S                    
         SENSEG NAME=WDK701,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDK711,PARENT=WDK701,PROCOPT=GRI                           
         SENSEG NAME=WDK722,PARENT=WDK711                                       
         SENSEG NAME=WDK712,PARENT=WDK701,PROCOPT=GI                            
*                                                                               
*------- WDA5                                                                   
         PCB   TYPE=DB,DBDNAME=WLORDP,PROCOPT=G,KEYLEN=26,POS=S                 
         SENSEG NAME=WLORDP01,PARENT=0,PROCOPT=GIRD                             
*                                                                               
*------- WDK9                                                                   
         PCB   TYPE=DB,DBDNAME=WLARTM,PROCOPT=G,KEYLEN=11,POS=S                 
         SENSEG NAME=WLARTM01,PARENT=0,PROCOPT=GIR                              
         SENSEG NAME=WLARTM11,PARENT=WLARTM01,PROCOPT=GIRD                      
*                                                                               
*------- WDR4 HTR ROT 4553                                                      
         PCB   TYPE=DB,DBDNAME=WLXXLN,PROCOPT=G,KEYLEN=31,POS=S                 
         SENSEG NAME=WLXXLN01,PARENT=0                                          
         SENSEG NAME=WLXXLN11,PARENT=WLXXLN01,PROCOPT=GIRD                      
*                                                                               
*------- WDR2 HTR ROT 2231                                                      
         PCB   TYPE=DB,DBDNAME=WLXXBX,PROCOPT=GOT,KEYLEN=35,POS=S               
         SENSEG NAME=WLXXBX01,PARENT=0                                          
         SENSEG NAME=WLXXBX11,PARENT=WLXXBX01                                   
*                                                                               
*------- WDR5 HTR ROT 2223+IDANSK                                               
         PCB   TYPE=DB,DBDNAME=WLXXBU,PROCOPT=G,KEYLEN=40,POS=S                 
         SENSEG NAME=WLXXBU01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLXXBU11,PARENT=WLXXBU01,PROCOPT=GID                       
*                                                                               
*------- WDR4 HTR ROT 4505+4506                                                 
         PCB   TYPE=DB,DBDNAME=WL4505,PROCOPT=G,KEYLEN=35,POS=S                 
         SENSEG NAME=WL450501,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WL450511,PARENT=WL450501,PROCOPT=GI                        
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
*------- WDK9 TILL W440RROT                                                     
         PCB   TYPE=DB,DBDNAME=WLARTM,PROCOPT=GOT,KEYLEN=11,POS=S               
         SENSEG NAME=WLARTM01,PARENT=0                                          
         SENSEG NAME=WLARTM11,PARENT=WLARTM01                                   
*                                                                               
*        ARTIKELINFORMATION  WDK7                                               
         PCB   TYPE=DB,DBDNAME=WLARTS,PROCOPT=GOT,KEYLEN=07,POS=S               
         SENSEG NAME=WLARTS01,PARENT=0                                          
         SENSEG NAME=WLARTS11,PARENT=WLARTS01                                   
*                                                                               
*                                                                               
******** SUBMODUL   W335PRNO  PRISFRÅGENUMMER ***********                       
*                                                                               
* PRNO-3107-PCB - PRISFRÅGENUMMER       WDR1  IDHTYP=3107                       
         PCB   TYPE=DB,DBDNAME=WDR1,PROCOPT=G,KEYLEN=31,POS=S                   
         SENSEG NAME=WDR101,PARENT=0                                            
         SENSEG NAME=WDGX3108,PARENT=WDR101,PROCOPT=GR                          
*                                                                               
*                                                                               
******** SUBMODUL   W335PRQU  UPPDATERA PRISFRÅGA ********                      
*                                                                               
* PRQU-WDG2-PCB - VALUTAREGISTER  WDG2                                          
         PCB   TYPE=DB,DBDNAME=WDG2,PROCOPT=GOT,KEYLEN=37,POS=S                 
         SENSEG NAME=WDG201,PARENT=0                                            
         SENSEG NAME=WDGX9306,PARENT=WDG201                                     
         SENSEG NAME=WDGX9308,PARENT=WDGX9306                                   
*                                                                               
* PRQU-WDC7-PCB - UPPDATERA PRISFRÅGA WDC7                                      
         PCB   TYPE=DB,DBDNAME=WDC7,PROCOPT=G,KEYLEN=33,POS=S                   
         SENSEG NAME=WDC701,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDC711,PARENT=WDC701,PROCOPT=GIRD                          
*                                                                               
* PRQU-SJKO-WDK6-PCB - ARTIKELINFORMATION  WDK6                                 
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=06,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
**********************************************                                  
*------- GSAM                                                                   
         PCB   TYPE=GSAM,DBDNAME=WDS1,PROCOPT=L                                 
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W44024,CMPAT=YES                             
         END                                                                    
