*          DATA SET W44051PII0 AT LEVEL 001 AS OF 91/06/20                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDQ4,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDQ401,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W44051                                       
         END                                                                    
