*WDA6J-PCB                                                                      
         PCB   TYPE=DB,DBDNAME=WDA6,PROCOPT=GOT,KEYLEN=15,POS=S,       *        
               PROCSEQ=WDA6J                                                    
         SENSEG NAME=WDA601,PARENT=0                                            
*WDK6-PCB                                                                       
         PCB    TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=6,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*WDK7-PCB                                                                       
         PCB    TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=8,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK722,PARENT=WDK711                                       
*WDD3-PCB                                                                       
         PCB   TYPE=DB,DBDNAME=WDD3,PROCOPT=GOT,KEYLEN=11,POS=S,       *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WDD301,PARENT=0                                            
         SENSEG NAME=WDD311,PARENT=WDD301                                       
*WDD9-PCB                                                                       
         PCB   TYPE=DB,DBDNAME=WDD9,PROCOPT=GOT,KEYLEN=20,POS=S                 
         SENSEG NAME=WDD901,PARENT=0                                            
         SENSEG NAME=WDD902,PARENT=WDD901                                       
         SENSEG NAME=WDD924,PARENT=WDD902                                       
*WDD9-INFO-PCB                                                                  
         PCB   TYPE=DB,DBDNAME=WDD9,PROCOPT=GOT,KEYLEN=20,POS=S                 
         SENSEG NAME=WDD901,PARENT=0                                            
         SENSEG NAME=WDD902,PARENT=WDD901                                       
         SENSEG NAME=WDD925,PARENT=WDD902                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W4405J                                       
         END                                                                    
