*                                                                               
* ALT-PCB TRANS TILL PGM W2010900                                               
         PCB   TYPE=TP,NAME=W2T109X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* ALT-PCB TRANS TILL PGM W3039100                                               
PRQRY    PCB   TYPE=TP,NAME=W30391X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*       LARMKÖ                                                                  
        PCB    TYPE=DB,DBDNAME=WLXXBU,PROCOPT=G,KEYLEN=40,POS=S                 
        SENSEG NAME=WLXXBU01,PARENT=0,PROCOPT=G                                 
        SENSEG NAME=WLXXBU11,PARENT=WLXXBU01,PROCOPT=GD                         
*                                                                               
*       ARTIKEL-REG WDK9                                                        
        PCB    TYPE=DB,DBDNAME=WDK9,PROCOPT=G,KEYLEN=11,POS=S                   
        SENSEG NAME=WDK901,PARENT=0,PROCOPT=GR                                  
        SENSEG NAME=WDK911,PARENT=WDK901,PROCOPT=GIR                            
*                                                                               
*       TRANSAKTIONSBAS                                                         
        PCB    TYPE=DB,DBDNAME=WLZZAC,PROCOPT=G,KEYLEN=18,POS=S                 
        SENSEG NAME=WLZZAC01,PARENT=0,PROCOPT=I                                 
*                                                                               
*       RESTORDER-/TPO-REG VIA SEKUNDÄRINDEX                                    
        PCB    TYPE=DB,DBDNAME=WDA5,PROCOPT=GOT,KEYLEN=14,POS=S,       *        
               PROCSEQ=WDA5E                                                    
        SENSEG NAME=WDA501,PARENT=0                                             
*                                                                               
*       RESTORDER-/TPO-REG WDA5                                                 
        PCB    TYPE=DB,DBDNAME=WDA5,PROCOPT=G,KEYLEN=24,POS=S                   
        SENSEG NAME=WDA501,PARENT=0,PROCOPT=GR                                  
*                                                                               
*       GODSMOTTAGAR-REG                                                        
        PCB    TYPE=DB,DBDNAME=WLGMTA,PROCOPT=GOT,KEYLEN=7,POS=S                
        SENSEG NAME=WLGMTA01,PARENT=0                                           
*                                                                               
*       ARTIKEL-REG     WDK6                                                    
        PCB     TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=06,POS=S                
        SENSEG  NAME=WDK601,PARENT=0                                            
        SENSEG  NAME=WDK611,PARENT=WDK601                                       
*                                                                               
*       ÖVERSÄTTN ANSK-LARM                                                     
        PCB     TYPE=DB,DBDNAME=WLXXBX,PROCOPT=GOT,KEYLEN=35,POS=S              
        SENSEG  NAME=WLXXBX01,PARENT=0                                          
        SENSEG  NAME=WLXXBX11,PARENT=WLXXBX01                                   
*                                                                               
*       ORDERHUVUD-REG WDQ2                                                     
        PCB    TYPE=DB,DBDNAME=WDQ2,PROCOPT=GOT,KEYLEN=17,POS=S,       *        
               PROCSEQ=WDQ2C                                                    
        SENSEG NAME=WDQ201,PARENT=0                                             
*                                                                               
*       ORDERBEKRÄFTELSE-REG     WDQ1                                           
        PCB   TYPE=DB,DBDNAME=WLORQM,PROCOPT=I,KEYLEN=17,POS=S                  
        SENSEG NAME=WLORQM01,PARENT=0                                           
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
*       TILL PROGRAM W335PRIS                                                   
*                                                                               
*       ARTIKEL-REG                                                             
        PCB     TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=19,POS=S              
        SENSEG  NAME=WLARTC01,PARENT=0                                          
        SENSEG  NAME=WLARTC11,PARENT=WLARTC01                                   
        SENSEG  NAME=WLARTC21,PARENT=WLARTC11                                   
*                                                                               
*       ARTIKELINFO                                                             
        PCB     TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=20,POS=S                
        SENSEG  NAME=WDK701,PARENT=0                                            
        SENSEG  NAME=WDK711,PARENT=WDK701                                       
        SENSEG  NAME=WDK724,PARENT=WDK711                                       
        SENSEG  NAME=WDK712,PARENT=WDK701                                       
*                                                                               
*       GODSMOTTAGAR-REG                                                        
        PCB    TYPE=DB,DBDNAME=WLGMTA,PROCOPT=GOT,KEYLEN=7,POS=S                
        SENSEG NAME=WLGMTA01,PARENT=0                                           
*                                                                               
*       BETALARREGISTER                                                         
         PCB   TYPE=DB,DBDNAME=WLBETC,PROCOPT=GOT,KEYLEN=11,POS=S               
         SENSEG  NAME=WLBETC01,PARENT=0                                         
*                                                                               
*       BETAILREGISTER                                                          
         PCB     TYPE=DB,DBDNAME=WLPRIA,PROCOPT=GOT,KEYLEN=6,POS=S              
         SENSEG  NAME=WLPRIA01,PARENT=0                                         
*                                                                               
*       PRIS/RABATTREGISTER                                                     
         PCB     TYPE=DB,DBDNAME=WLPRIB,PROCOPT=GOT,KEYLEN=16,POS=S             
         SENSEG  NAME=WLPRIB01,PARENT=0                                         
         SENSEG  NAME=WLPRIB11,PARENT=WLPRIB01                                  
         SENSEG  NAME=WLPRIB12,PARENT=WLPRIB01                                  
         SENSEG  NAME=WLPRIB13,PARENT=WLPRIB01                                  
*                                                                               
********** SUBMODUL W335COST**************************************              
*                                                                               
* PRIS-COST-WDK6-PCB - ARTIKELINFORMATION WDK6                                  
         PCB     TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=19,POS=S               
         SENSEG  NAME=WDK601,PARENT=0                                           
         SENSEG  NAME=WDK611,PARENT=WDK601                                      
         SENSEG  NAME=WDK621,PARENT=WDK611                                      
*                                                                               
* PRIS-COST-WDK7-PCB - ARTIKELINFORMATION WDK7                                  
         PCB     TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG  NAME=WDK701,PARENT=0                                           
         SENSEG  NAME=WDK711,PARENT=WDK701                                      
*                                                                               
* PRIS-COST-WDF1-PCB - LEVERANTÖRSINFO WDF1                                     
         PCB     TYPE=DB,DBDNAME=WDF1,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG  NAME=WDF101,PARENT=0                                           
         SENSEG  NAME=WDF102,PARENT=WDF101                                      
*                                                                               
* PRIS-COST-WDG2-PCB - VALUTAINFORMATION WDG2                                   
         PCB   TYPE=DB,DBDNAME=WDG2,PROCOPT=GOT,KEYLEN=37,POS=S                 
         SENSEG NAME=WDG201,PARENT=0                                            
         SENSEG NAME=WDGX9306,PARENT=WDG201                                     
         SENSEG NAME=WDGX9308,PARENT=WDGX9306                                   
*                                                                               
* PRIS-COST-WDK72-PCB - ARTIKELREGISTER DC                                      
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=20,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK724,PARENT=WDK711                                       
*                                                                               
* PRIS-COST-WDB6-PCB - DC-REGISTER  WDB6                                        
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=3,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB617,PARENT=WDB601                                       
*       TILL SUBMODUL W411ARTM                                                  
*       ARTIKELREGISTER                                                         
        PCB    TYPE=DB,DBDNAME=WLARTM,PROCOPT=G,KEYLEN=5,POS=S                  
        SENSEG NAME=WLARTM01,PARENT=0,PROCOPT=I                                 
*                                                                               
******** SUBMODUL   W335PRNO  PRISFRÅGENUMMER ***********                       
*                                                                               
* PRNO-3107-PCB - PRISFRÅGENUMMER       WDR1  IDHTYP=3107                       
         PCB   TYPE=DB,DBDNAME=WDR1,PROCOPT=G,KEYLEN=31,POS=S                   
         SENSEG NAME=WDR101,PARENT=0                                            
         SENSEG NAME=WDGX3108,PARENT=WDR101,PROCOPT=GR                          
*                                                                               
*                                                                               
******** SUBMODUL   W335PRQU  UPPDATERA PRISFRÅGA ********                      
*                                                                               
* PRQU-WDG2-PCB - VALUTAREGISTER  WDG2                                          
         PCB   TYPE=DB,DBDNAME=WDG2,PROCOPT=GOT,KEYLEN=37,POS=S                 
         SENSEG NAME=WDG201,PARENT=0                                            
         SENSEG NAME=WDGX9306,PARENT=WDG201                                     
         SENSEG NAME=WDGX9308,PARENT=WDGX9306                                   
*                                                                               
* PRQU-WDC7-PCB - UPPDATERA PRISFRÅGA WDC7                                      
         PCB   TYPE=DB,DBDNAME=WDC7,PROCOPT=G,KEYLEN=33,POS=S                   
         SENSEG NAME=WDC701,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDC711,PARENT=WDC701,PROCOPT=GIRD                          
*                                                                               
* PRQU-SJKO-WDK6-PCB - ARTIKELINFORMATION  WDK6                                 
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=06,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
        PSBGEN LANG=COBOL,PSBNAME=W44037                                        
*                                                                               
        END                                                                     
