*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA6,PROCOPT=GOT,KEYLEN=40,POS=S                 
         SENSEG NAME=WDA601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W4405D                                       
         END                                                                    
