*                                                                               
         PCB   TYPE=DB,DBDNAME=WL4491,PROCOPT=GOT,KEYLEN=64,POS=S               
         SENSEG NAME=WL449101,PARENT=0                                          
         SENSEG NAME=WL449112,PARENT=WL449101                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W46101                                       
         END                                                                    
