* WDF2-                                                                         
*---DIRLEVBAS                                                                   
         PCB   TYPE=DB,DBDNAME=WDF2,PROCOPT=G,KEYLEN=20,POS=S                   
         SENSEG NAME=WDF201,PARENT=0                                            
         SENSEG NAME=WDF212,PARENT=WDF201,PROCOPT=GR                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDF2A,PROCOPT=GOT,KEYLEN=10,POS=S                
         SENSEG NAME=WDF2A1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W46341,CMPAT=YES                             
         END                                                                    
