*                                                                               
*             WDB7 VIPS-KUNDREGISTER                                            
         PCB   TYPE=DB,DBDNAME=WDB7,PROCOPT=GOT,KEYLEN=09,POS=S,       *        
               PROCSEQ=WDB7A                                                    
         SENSEG NAME=WDB701,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W46362                                       
         END                                                                    
