*                                                                               
         PCB   TYPE=DB,DBDNAME=WDQ3,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDQ301,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE4,PROCOPT=GOT,KEYLEN=26,POS=S                 
         SENSEG NAME=WDE401,PARENT=0                                            
         SENSEG NAME=WDE411,PARENT=WDE401                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDF6,PROCOPT=GOT,KEYLEN=4,POS=S                  
         SENSEG NAME=WDF601,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDQ2,PROCOPT=GOT,KEYLEN=11,POS=S                 
         SENSEG NAME=WDQ201,PARENT=0                                            
         SENSEG NAME=WDQ211,PARENT=WDQ201                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W46380                                       
         END                                                                    
