*                                                                               
         PCB   TYPE=DB,DBDNAME=WDF6,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDF601,PARENT=0                                            
         SENSEG NAME=WDF611,PARENT=WDF601                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W46397                                       
         END                                                                    
