*                                                                               
         PCB   TYPE=DB,DBDNAME=WDM7,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDM701,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W47532                                       
         END                                                                    
