*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR1,PROCOPT=G,KEYLEN=52,POS=S                   
         SENSEG NAME=WDR101,PARENT=0,PROCOPT=GDI                                
         SENSEG NAME=WDGX4544,PARENT=WDR101,PROCOPT=GI                          
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W47561,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
