*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE1,PROCOPT=G,KEYLEN=07,POS=S                   
         SENSEG NAME=WDE101,PARENT=0,PROCOPT=GD                                 
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W47695,CMPAT=YES,LOCKMAX=3                   
         END                                                                    
