*                                                                               
         PCB  TYPE=DB,DBDNAME=WDE6,PROCOPT=GOT,KEYLEN=7,POS=S                   
         SENSEG NAME=WDE601,PARENT=0                                            
         SENSEG NAME=WDE611,PARENT=WDE601                                       
*                                                                               
         PCB  TYPE=DB,DBDNAME=WDE4,PROCOPT=GOT,KEYLEN=37,POS=S,        *        
               PROCSEQ=WDE4F                                                    
         SENSEG NAME=WDE411,PARENT=0                                            
         SENSEG NAME=WDE401,PARENT=WDE411                                       
         SENSEG NAME=WDE421,PARENT=WDE411                                       
*                                                                               
         PCB  TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=14,POS=S                  
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
         SENSEG NAME=WDK623,PARENT=WDK611                                       
*                                                                               
         PCB  TYPE=DB,DBDNAME=WDF2,PROCOPT=GOT,KEYLEN=19,POS=S,        *        
               PROCSEQ=WDF2A                                                    
         SENSEG NAME=WDF201,PARENT=0                                            
         SENSEG NAME=WDF211,PARENT=WDF201                                       
*                                                                               
         PCB  TYPE=DB,DBDNAME=WDQ2,PROCOPT=GOT,KEYLEN=17,POS=S,        *        
               PROCSEQ=WDQ2C                                                    
         SENSEG NAME=WDQ201,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W47693,CMPAT=YES                             
         END                                                                    
