*                                                                               
*                                                                               
*  KUNDREG. GODSMOTT.                                                           
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
* KUNDORDER                                                                     
         PCB   TYPE=DB,DBDNAME=WDE4,PROCOPT=GOT,KEYLEN=30,POS=S,       *        
               PROCSEQ=WDE4E                                                    
         SENSEG NAME=WDE401,PARENT=0                                            
         SENSEG NAME=WDE411,PARENT=WDE401                                       
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
* KUNDORDER                                                                     
         PCB   TYPE=DB,DBDNAME=WDE4,PROCOPT=GOT,KEYLEN=30,POS=S,       *        
               PROCSEQ=WDE4B                                                    
         SENSEG NAME=WDE411,PARENT=0                                            
         SENSEG NAME=WDE401,PARENT=WDE411                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W47649                                       
         END                                                                    
