*                                                                               
        PCB   TYPE=DB,DBDNAME=WDL5A,PROCOPT=GOT,KEYLEN=18,POS=S                 
        SENSEG NAME=WDL5A1,PARENT=0                                             
*                                                                               
        PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=GOT,KEYLEN=46,POS=S                  
        SENSEG NAME=WDR501,PARENT=0                                             
        SENSEG NAME=WDGX4128,PARENT=WDR501                                      
*                                                                               
        PSBGEN LANG=COBOL,PSBNAME=W47687                                        
        END                                                                     
