*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR4,PROCOPT=G,KEYLEN=37,POS=S                   
         SENSEG NAME=WDR401,PARENT=0                                            
         SENSEG NAME=WDGX4504,PARENT=WDR401,PROCOPT=GD                          
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W47644,CMPAT=YES                             
         END                                                                    
