*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR4,PROCOPT=GOT,KEYLEN=37,POS=S                 
         SENSEG NAME=WDR401,PARENT=0                                            
         SENSEG NAME=WDGX4546,PARENT=WDR401                                     
*                                                                               
* KOLLIREG.                                                                     
         PCB   TYPE=DB,DBDNAME=WDE6,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDE601,PARENT=0                                            
         SENSEG NAME=WDE611,PARENT=WDE601                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W47645                                       
         END                                                                    
