*                                                                               
         PCB   TYPE=DB,DBDNAME=WDL5,PROCOPT=G,KEYLEN=4,POS=S                    
         SENSEG NAME=WDL501,PARENT=0,PROCOPT=GD                                 
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W47688,CMPAT=YES                             
         END                                                                    
