*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE2,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDE201,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W47692                                       
         END                                                                    
