*                                                                               
         PCB   TYPE=DB,DBDNAME=WDM7,PROCOPT=G,KEYLEN=15,POS=S                   
         SENSEG NAME=WDM701,PROCOPT=GD                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDM8,PROCOPT=G,KEYLEN=19,POS=S                   
         SENSEG NAME=WDM801,PROCOPT=GD                                          
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W47682,CMPAT=YES                             
         END                                                                    
