*                                                                               
         PCB   TYPE=DB,DBDNAME=WDM7,PROCOPT=GOT,KEYLEN=18,POS=S,       *        
               PROCSEQ=WDM7B                                                    
         SENSEG NAME=WDM701,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDM8,PROCOPT=GOT,KEYLEN=19,POS=S                 
         SENSEG NAME=WDM801                                                     
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB5,PROCOPT=GOT,KEYLEN=11,POS=S                 
         SENSEG NAME=WDB501,PARENT=0                                            
*                                                                               
* KOLLIREG                                                                      
         PCB   TYPE=DB,DBDNAME=WDE6,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDE601,PARENT=0                                            
         SENSEG NAME=WDE611,PARENT=WDE601                                       
*                                                                               
* WDK6 - ARTIKELINFO                                                            
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=6,POS=S                  
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
* TRANSPORT-RELEASE, FAKTURA                                                    
         PCB   TYPE=DB,DBDNAME=WDE2,PROCOPT=GOT,KEYLEN=14,POS=S                 
         SENSEG NAME=WDE201,PARENT=0                                            
         SENSEG NAME=WDE211,PARENT=WDE201                                       
*                                                                               
* 4735   TEXT REGISTER  LEV.VILLKOR FAKTURERING                                 
         PCB   TYPE=DB,DBDNAME=WDR1,PROCOPT=GOT,KEYLEN=31,POS=S                 
         SENSEG NAME=WDR101,PARENT=0                                            
         SENSEG NAME=WDGX4735,PARENT=WDR101                                     
*                                                                               
* GODSMOTTAGARREG                                                               
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDB201,PARENT=0                                            
* WDR2 DB                                                                       
         PCB   TYPE=DB,DBDNAME=WL1165,PROCOPT=GOT,KEYLEN=32,POS=S               
         SENSEG NAME=WL116501,PARENT=0                                          
         SENSEG NAME=WL116512,PARENT=WL116501                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W47680                                       
         END                                                                    
