*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE1,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDE101,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W47690                                       
         END                                                                    
