*                                                                               
MQASYNC  PCB   TYPE=TP,NAME=WZ0431X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* KUNDORDER                                                                     
         PCB   TYPE=DB,DBDNAME=WDE4,PROCOPT=GOT,KEYLEN=30,POS=S,       *        
               PROCSEQ=WDE4B                                                    
         SENSEG NAME=WDE411,PARENT=0                                            
         SENSEG NAME=WDE401,PARENT=WDE411                                       
         SENSEG NAME=WDE421,PARENT=WDE411                                       
* KUNDORDER                                                                     
         PCB   TYPE=DB,DBDNAME=WDE4,PROCOPT=GOT,KEYLEN=30,POS=S,       *        
               PROCSEQ=WDE4E                                                    
         SENSEG NAME=WDE401,PARENT=0                                            
         SENSEG NAME=WDE411,PARENT=WDE401                                       
*                                                                               
* KOLLIREG                                                                      
         PCB   TYPE=DB,DBDNAME=WDE6,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDE601,PARENT=0                                            
         SENSEG NAME=WDE611,PARENT=WDE601                                       
*                                                                               
* ARTIKELREG CDC                                                                
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=06,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
* ARTIKELREG *DC                                                                
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
*                                                                               
* ORDERHUVUD-REG                                                                
         PCB   TYPE=DB,DBDNAME=WDQ2,PROCOPT=GOT,KEYLEN=04,POS=S                 
         SENSEG NAME=WDQ201,PARENT=0                                            
*                                                                               
*                                                                               
* KUNDREG KÖPARREG                                                              
         PCB   TYPE=DB,DBDNAME=WDB1,PROCOPT=GOT,KEYLEN=11,POS=S                 
         SENSEG NAME=WDB101,PARENT=0                                            
*                                                                               
* GODSMOTTAGARREG                                                               
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
* HÄNDELSE- R4                                                                  
         PCB   TYPE=DB,DBDNAME=WDR4,PROCOPT=GOT,KEYLEN=64,POS=S                 
         SENSEG NAME=WDR401,PARENT=0                                            
         SENSEG NAME=WDGX4494,PARENT=WDR401                                     
*                                                                               
* TRANSPORTRELEASEREG.                                                          
         PCB   TYPE=DB,DBDNAME=WDE1,PROCOPT=GOT,KEYLEN=49,POS=S                 
         SENSEG NAME=WDE101,PARENT=0                                            
         SENSEG NAME=WDE111,PARENT=WDE101                                       
         SENSEG NAME=WDE122,PARENT=WDE111                                       
         SENSEG NAME=WDE121,PARENT=WDE111                                       
         SENSEG NAME=WDE131,PARENT=WDE121                                       
         SENSEG NAME=WDE141,PARENT=WDE131                                       
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
******** SUBMODUL   W335PRIS  PRISTILLÄMPNING ********                          
*                                                                               
* PRIS-ARTC-PCB - ARTIKELINFORMATION  WDK6                                      
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=19,POS=S               
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
         SENSEG NAME=WLARTC21,PARENT=WLARTC11                                   
*                                                                               
* PRIS-WDK7-PCB - ARTIKELINFO                                                   
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=20,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK724,PARENT=WDK711                                       
         SENSEG NAME=WDK712,PARENT=WDK701                                       
*                                                                               
* PRIS-GMTA-PCB - GODSMOTTAGARE     WDB2                                        
         PCB     TYPE=DB,DBDNAME=WLGMTA,PROCOPT=GOT,KEYLEN=07,POS=S             
         SENSEG  NAME=WLGMTA01                                                  
*                                                                               
* PRIS-BETA-PCB - BETALAREREGISTRET WDB1                                        
         PCB     TYPE=DB,DBDNAME=WLBETC,PROCOPT=GOT,KEYLEN=11,POS=S             
         SENSEG  NAME=WLBETC01                                                  
*                                                                               
* PRIS-WLPRIA-PCB - PRISREGISTRET WDC1                                          
         PCB     TYPE=DB,DBDNAME=WLPRIA,PROCOPT=GOT,KEYLEN=06,POS=S             
         SENSEG  NAME=WLPRIA01                                                  
*                                                                               
* PRIS-WLPRIB-PCB - PRIS RABATT REGISTER WLC2                                   
         PCB     TYPE=DB,DBDNAME=WLPRIB,PROCOPT=GOT,KEYLEN=16,POS=S             
         SENSEG  NAME=WLPRIB01,PARENT=0                                         
         SENSEG  NAME=WLPRIB11,PARENT=WLPRIB01                                  
         SENSEG  NAME=WLPRIB12,PARENT=WLPRIB01                                  
         SENSEG  NAME=WLPRIB13,PARENT=WLPRIB01                                  
* COST-WDK6-PCB                                                                 
         PCB     TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=19,POS=S               
         SENSEG  NAME=WDK601,PARENT=0                                           
         SENSEG  NAME=WDK611,PARENT=WDK601                                      
         SENSEG  NAME=WDK621,PARENT=WDK611                                      
* COST-WDK7-PCB                                                                 
         PCB     TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG  NAME=WDK701,PARENT=0                                           
         SENSEG  NAME=WDK711,PARENT=WDK701                                      
* COST-WDF1-PCB                                                                 
         PCB     TYPE=DB,DBDNAME=WDF1,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG  NAME=WDF101,PARENT=0                                           
         SENSEG  NAME=WDF102,PARENT=WDF101                                      
* COST-WDG2-PCB                                                                 
         PCB   TYPE=DB,DBDNAME=WDG2,PROCOPT=GOT,KEYLEN=37,POS=S                 
         SENSEG NAME=WDG201,PARENT=0                                            
         SENSEG NAME=WDGX9306,PARENT=WDG201                                     
         SENSEG NAME=WDGX9308,PARENT=WDGX9306                                   
*                                                                               
* COST-WDK72-PCB                                                                
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=20,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK724,PARENT=WDK711                                       
*                                                                               
* COST-WDB6-PCB - DC-REGISTER  WDB6                                             
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=3,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB617,PARENT=WDB601                                       
*                                                                               
********** SUBMODUL W335COST**************************************              
*                                                                               
* PRIS-COST-WDK6-PCB - ARTIKELINFORMATION WDK6                                  
         PCB     TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=19,POS=S               
         SENSEG  NAME=WDK601,PARENT=0                                           
         SENSEG  NAME=WDK611,PARENT=WDK601                                      
         SENSEG  NAME=WDK621,PARENT=WDK611                                      
*                                                                               
* PRIS-COST-WDK7-PCB - ARTIKELINFORMATION WDK7                                  
         PCB     TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG  NAME=WDK701,PARENT=0                                           
         SENSEG  NAME=WDK711,PARENT=WDK701                                      
*                                                                               
* PRIS-COST-WDF1-PCB - LEVERANTÖRSINFO WDF1                                     
         PCB     TYPE=DB,DBDNAME=WDF1,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG  NAME=WDF101,PARENT=0                                           
         SENSEG  NAME=WDF102,PARENT=WDF101                                      
*                                                                               
* PRIS-COST-WDG2-PCB - VALUTAINFORMATION WDG2                                   
         PCB   TYPE=DB,DBDNAME=WDG2,PROCOPT=GOT,KEYLEN=37,POS=S                 
         SENSEG NAME=WDG201,PARENT=0                                            
         SENSEG NAME=WDGX9306,PARENT=WDG201                                     
         SENSEG NAME=WDGX9308,PARENT=WDGX9306                                   
*                                                                               
* PRIS-COST-WDK72-PCB - ARTIKELREGISTER DC                                      
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=20,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK724,PARENT=WDK711                                       
*                                                                               
* PRIS-COST-WDB6-PCB - DC-REGISTER  WDB6                                        
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=3,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB617,PARENT=WDB601                                       
*                                                                               
* SLUT W335PRIS                                                                 
         PSBGEN LANG=COBOL,PSBNAME=W47651                                       
         END                                                                    
