*                                                                               
*                                                                               
*  TRANSAR TILL BATCH (CBLHSSR)                                                 
         PCB  TYPE=DB,DBDNAME=WDR7,PROCOPT=GOT,KEYLEN=210,POS=S                 
         SENSEG NAME=WDR701,PARENT=0                                            
*                                                                               
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W47623                                       
         END                                                                    
