*                                                                               
*                                                                               
* CODRIK PCB'ERNA ÄR TILL FÖR ATT WZ01 SKALL SKRIVA                             
* TESTFILER MOT PRINTER. NÄR SKRIVNING SKER MOT                                 
* VCOM BEHÖVS INTE PSB'ERNA MER                                                 
*                                                                               
O2CODRIK PCB   TYPE=TP,LTERM=,ALTRESP=NO,SAMETRM=NO,                   *        
               MODIFY=YES,EXPRESS=NO                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W47614                                       
         END                                                                    
