*                                                                               
* TRANSPORTRELEASE-REG                                                          
         PCB   TYPE=DB,DBDNAME=WDE1,PROCOPT=GOT,KEYLEN=21,POS=S                 
         SENSEG NAME=WDE101,PARENT=0                                            
         SENSEG NAME=WDE111,PARENT=WDE101                                       
         SENSEG NAME=WDE121,PARENT=WDE111                                       
*                                                                               
* KUND-REG, GODSMOTTAGARE                                                       
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
* ORDERHUVUD-REG                                                                
         PCB   TYPE=DB,DBDNAME=WDQ2,PROCOPT=GOT,KEYLEN=4,POS=S                  
         SENSEG NAME=WDQ201,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W47640                                       
         END                                                                    
