*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE2,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDE201,PARENT=0                                            
         SENSEG NAME=WDE211,PARENT=WDE201                                       
*                                                                               
*   WDB9A-PSB SHIPPING DOCUMENT PARAMETERS                                      
         PCB   TYPE=DB,DBDNAME=WDB9A,PROCOPT=GOT,KEYLEN=17,POS=S                
         SENSEG NAME=WDB9A1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W47696                                       
         END                                                                    
