*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE6,PROCOPT=GOT,KEYLEN=216,POS=S                
         SENSEG NAME=WDE601,PARENT=0                                            
         SENSEG NAME=WDE611,PARENT=WDE601                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE4E,PROCOPT=GOT,KEYLEN=23,POS=S                
         SENSEG NAME=WDE4E1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W47815                                       
         END                                                                    
