*          DATA SET W47848PII0 AT LEVEL 002 AS OF 90/08/29                      
         PCB   TYPE=DB,DBDNAME=WDJ1,PROCOPT=GOT,KEYLEN=209,POS=S                
         SENSEG NAME=WDJ101,PARENT=0                                            
         SENSEG NAME=WDJ111,PARENT=WDJ101                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W47848                                       
         END                                                                    
