*                                                                               
*        KUNDREGISTER                        ***                                
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W47843                                       
         END                                                                    
