*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR4,PROCOPT=G,KEYLEN=52,POS=S                   
         SENSEG NAME=WDR401,PARENT=0,PROCOPT=GD                                 
         SENSEG NAME=WDGX4014,PARENT=WDR401,PROCOPT=GD                          
         SENSEG NAME=WDGX4102,PARENT=WDR401,PROCOPT=GD                          
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W47922,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
