*                                                                               
         PCB   TYPE=DB,DBDNAME=WDQ2,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDQ201,PARENT=0                                            
         SENSEG NAME=WDQ211,PARENT=WDQ201                                       
         SENSEG NAME=WDQ212,PARENT=WDQ201                                       
         SENSEG NAME=WDQ221,PARENT=WDQ212                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA5,PROCOPT=GOT,KEYLEN=24,POS=S                 
         SENSEG NAME=WDA501,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W47911                                       
         END                                                                    
