*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXLB,PROCOPT=GOT,KEYLEN=40,POS=S               
         SENSEG NAME=WLXXLB01,PARENT=0                                          
         SENSEG NAME=WLXXLB11,PARENT=WLXXLB01                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W47990                                       
         END                                                                    
