*                                                                               
         PCB   TYPE=DB,DBDNAME=WDQ3,PROCOPT=G,KEYLEN=12,POS=S                   
         SENSEG NAME=WDQ301,PARENT=0,PROCOPT=GD                                 
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDQ2,PROCOPT=G,KEYLEN=11,POS=S                   
         SENSEG NAME=WDQ201,PARENT=0,PROCOPT=GRD                                
         SENSEG NAME=WDQ211,PARENT=WDQ201,PROCOPT=GD                            
         SENSEG NAME=WDQ212,PARENT=WDQ201,PROCOPT=GD                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDQ1,PROCOPT=G,KEYLEN=17,POS=S                   
         SENSEG NAME=WDQ101,PARENT=0,PROCOPT=GD                                 
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W47913,CMPAT=YES                             
         END                                                                    
