*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE6,PROCOPT=GOT,KEYLEN=208,POS=S                
         SENSEG NAME=WDE601,PARENT=0                                            
         SENSEG NAME=WDE611,PARENT=WDE601                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE4F,PROCOPT=GOT,KEYLEN=29,POS=S                
         SENSEG NAME=WDE4F1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W4795J                                       
         END                                                                    
