*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK9,PROCOPT=GOT,KEYLEN=05,POS=S                 
         SENSEG NAME=WDK901,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W47984                                       
         END                                                                    
