*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE6,PROCOPT=GOT,KEYLEN=208,POS=S                
         SENSEG NAME=WDE601,PARENT=0                                            
         SENSEG NAME=WDE611,PARENT=WDE601                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE4F,PROCOPT=GOT,KEYLEN=29,POS=S                
         SENSEG NAME=WDE4F1,PARENT=0                                            
*                                                                               
*        SECONDARY INDEX WDQ3D1                                                 
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLORQA,PROCOPT=GOT,KEYLEN=7,POS=S,      *        
               PROCSEQ=WDQ3D                                                    
         SENSEG NAME=WLORQA01,PARENT=0                                          
*                                                                               
*        KUNDREGISTER WDB2                                                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLGMTA,PROCOPT=GOT,KEYLEN=07,POS=S               
         SENSEG NAME=WLGMTA01,PARENT=0                                          
*                                                                               
*        TRANSPORTRELEASEREGISTER WDE2                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE2,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDE201,PARENT=0                                            
*                                                                               
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W47960                                       
         END                                                                    
