*          DATA SET W47977PII0 AT LEVEL 002 AS OF 90/11/30                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDL1,PROCOPT=GOT,KEYLEN=27,POS=S                 
         SENSEG NAME=WDL101,PARENT=0,                                           
         SENSEG NAME=WDL111,PARENT=WDL101,                                      
         SENSEG NAME=WDL112,PARENT=WDL101,                                      
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W47977                                       
         END                                                                    
