*          DATA SET W21160PII0 AT LEVEL 005 AS OF 88/12/09                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDL1,PROCOPT=G,KEYLEN=27,POS=S                   
         SENSEG NAME=WDL101,PARENT=0,PROCOPT=GD                                 
         SENSEG NAME=WDL111,PARENT=WDL101,PROCOPT=GD                            
         SENSEG NAME=WDL112,PARENT=WDL101,PROCOPT=GD                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W47978                                       
         END                                                                    
