*          DATA SET W47976PII0 AT LEVEL 004 AS OF 90/11/30                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDL1,PROCOPT=G,KEYLEN=27,POS=S                   
         SENSEG NAME=WDL101,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDL111,PARENT=WDL101,PROCOPT=GI                            
         SENSEG NAME=WDL112,PARENT=WDL101,PROCOPT=GI                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W47976                                       
         END                                                                    
