*                                                                               
         PCB   TYPE=DB,DBDNAME=WLORQI,PROCOPT=GOT,KEYLEN=6,POS=S                
         SENSEG NAME=WLORQI01,PARENT=0                                          
         SENSEG NAME=WLORQI12,PARENT=WLORQI01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLORQM,PROCOPT=GOT,KEYLEN=17,POS=S               
         SENSEG NAME=WLORQM01,PARENT=0                                          
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W47916,CMPAT=YES                             
         END                                                                    
