*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE6,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDE601,PARENT=0                                            
         SENSEG NAME=WDE611,PARENT=WDE601                                       
         SENSEG NAME=WDE621,PARENT=WDE611                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W48321                                       
         END                                                                    
