*   WDB5-PSB FRAKT-MÄRKNING, KUNDREG.                                           
         PCB   TYPE=DB,DBDNAME=WDB5,PROCOPT=GOT,KEYLEN=11,POS=S                 
         SENSEG NAME=WDB501,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W48327                                       
         END                                                                    
