*          DATA SET W48832PII0 AT LEVEL 005 AS OF 90/04/06                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD8,PROCOPT=GOT,KEYLEN=213,POS=S                
         SENSEG NAME=WDD801,PARENT=0                                            
         SENSEG NAME=WDD811,PARENT=WDD801                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W48832                                       
         END                                                                    
