*          DATA SET W48880PII0 AT LEVEL 006 AS OF 87/08/28                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD8,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDD801,PARENT=0                                            
         SENSEG NAME=WDD811,PARENT=WDD801                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W48880                                       
         END                                                                    
