*                                                                               
FELODEL  PCB   TYPE=TP,NAME=W4T298X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDQ4,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDQ401,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDQ3,PROCOPT=GOT,KEYLEN=12,POS=S                 
         SENSEG NAME=WDQ301,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDQ2,PROCOPT=GOT,KEYLEN=8,POS=S                  
         SENSEG NAME=WDQ201,PARENT=0                                            
         SENSEG NAME=WDQ212,PARENT=WDQ201                                       
         SENSEG NAME=WDQ221,PARENT=WDQ212                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W49903,CMPAT=YES                             
         END                                                                    
