*                                                                               
         PCB    TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                 
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE4A,PROCOPT=GOT,KEYLEN=27,POS=S                
         SENSEG NAME=WDE4A1,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE4,PROCOPT=GOTP,KEYLEN=30,POS=S,      *        
               PROCSEQ=WDE4B                                                    
         SENSEG NAME=WDE411,PARENT=0                                            
         SENSEG NAME=WDE401,PARENT=WDE411                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE6,PROCOPT=G,KEYLEN=7,POS=S                    
         SENSEG NAME=WDE601,PARENT=0                                            
         SENSEG NAME=WDE611,PARENT=WDE601,PROCOPT=GR                            
*                                                                               
* WDGX4401-4402 PCB                                                             
         PCB   TYPE=DB,DBDNAME=WLXXDM,PROCOPT=GOT,KEYLEN=45,POS=S               
         SENSEG NAME=WLXXDM01,PARENT=0                                          
         SENSEG NAME=WLXXDM11,PARENT=WLXXDM01                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W4W347                                       
         END                                                                    
