*                                                                               
*        -- ALT-4688-PCB                                                        
         PCB   TYPE=TP,NAME=W4T688X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*        -- ALT-4681-PCB                                                        
         PCB   TYPE=TP,NAME=W4T681X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*        -- ALT-4682-PCB                                                        
         PCB   TYPE=TP,NAME=W4T682X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WL4463,PROCOPT=G,KEYLEN=52,POS=S                 
         SENSEG NAME=WL446301,PARENT=0                                          
         SENSEG NAME=WL446311,PARENT=WL446301,PROCOPT=GD                        
         SENSEG NAME=WL446321,PARENT=WL446311                                   
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W4W668                                       
         END                                                                    
