*                                                                               
         PCB   TYPE=TP,NAME=W5T116,ALTRESP=NO,SAMETRM=NO,              *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLPRIG,PROCOPT=G,KEYLEN=17,POS=S                 
         SENSEG NAME=WLPRIG01,PARENT=0,PROCOPT=GR                               
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W50117                                       
         END                                                                    
