         PCB    TYPE=DB,DBDNAME=WDP7,PROCOPT=G,KEYLEN=8,POS=S                   
         SENSEG NAME=WDP701,PARENT=0,PROCOPT=GIR                                
*                                                                               
* PRIS-COST-WDK72-PCB - ARTIKELREGISTER DC                                      
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=20,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK724,PARENT=WDK711                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=19,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
         SENSEG NAME=WDK621,PARENT=WDK611                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W50125                                       
         END                                                                    
