*          DATA SET W50107PII0 AT LEVEL 004 AS OF 87/09/01                      
*                                                                               
* 5197-MSG-PCB - START AV BILD 5197-SVARSBILD                                   
         PCB   TYPE=TP,NAME=W5T197,ALTRESP=NO,SAMETRM=NO,              *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLINLE,PROCOPT=GOT,KEYLEN=21,POS=S               
         SENSEG NAME=WLINLE01,PARENT=0                                          
         SENSEG NAME=WLINLE11,PARENT=WLINLE01                                   
         SENSEG NAME=WLINLE21,PARENT=WLINLE11                                   
         SENSEG NAME=WLINLE31,PARENT=WLINLE21                                   
         SENSEG NAME=WLINLE22,PARENT=WLINLE11                                   
         SENSEG NAME=WLINLE23,PARENT=WLINLE11                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLINLC,PROCOPT=GOT,KEYLEN=21,POS=S               
         SENSEG NAME=WLINLC01,PARENT=0                                          
         SENSEG NAME=WLINLC11,PARENT=WLINLC01                                   
*                                                                               
* ARTIKELREGISTER (SECURITY CHECK BY IDLEVNR)                                   
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=05,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W50107                                       
         END                                                                    
