*                                                                               
         PCB   TYPE=DB,DBDNAME=WDP7,PROCOPT=G,KEYLEN=8,POS=S                    
         SENSEG NAME=WDP701,PARENT=0,PROCOPT=GIR                                
*                                                                               
* WDR2 IDHTYP=5108                                                              
         PCB   TYPE=DB,DBDNAME=WDR2,PROCOPT=G,KEYLEN=35,POS=S                   
         SENSEG NAME=WDR201,PARENT=0                                            
         SENSEG NAME=WDGX5108,PARENT=WDR201,PROCOPT=GIR                         
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W50145                                       
         END                                                                    
