*                                                                               
*        FÖRPACKN.KOSTNAD/FP-TYP REGISTER HTYP=5131                             
         PCB   TYPE=DB,DBDNAME=WL5131,PROCOPT=G,KEYLEN=35,POS=S                 
         SENSEG NAME=WL513101,PARENT=0                                          
         SENSEG NAME=WL513111,PARENT=WL513101,PROCOPT=GIRD                      
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W50141                                       
         END                                                                    
