*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=G,KEYLEN=19,POS=S                 
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01,PROCOPT=GR                        
         SENSEG NAME=WLARTC21,PARENT=WLARTC11                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=8,POS=S,      *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
* WDG2-PCB/9305-PCB  - FOR W510CURR                                             
         PCB   TYPE=DB,DBDNAME=WDG2,PROCOPT=GOT,KEYLEN=37,POS=S                 
         SENSEG NAME=WDG201,PARENT=0                                            
         SENSEG NAME=WDGX9306,PARENT=WDG201                                     
         SENSEG NAME=WDGX9308,PARENT=WDGX9306                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTS,PROCOPT=G,KEYLEN=7,POS=S                  
         SENSEG NAME=WLARTS01,PARENT=0                                          
         SENSEG NAME=WLARTS11,PARENT=WLARTS01,PROCOPT=GR                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLPRIG,PROCOPT=G,KEYLEN=17,POS=S                 
         SENSEG NAME=WLPRIG01,PARENT=0,PROCOPT=GR                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLPRIG,PROCOPT=G,KEYLEN=17,POS=S                 
         SENSEG NAME=WLPRIG01,PARENT=0,PROCOPT=GR                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLLEVA,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG NAME=WLLEVA01,PARENT=0                                          
         SENSEG NAME=WLLEVA11,PARENT=WLLEVA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTS,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG NAME=WLARTS01,PARENT=0                                          
         SENSEG NAME=WLARTS11,PARENT=WLARTS01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLSAPA,PROCOPT=G,KEYLEN=31,POS=S                 
         SENSEG NAME=WLSAPA01,PARENT=0,PROCOPT=GI                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W50116                                       
         END                                                                    
