*                                                                               
*        FÖRPACKN.KOSTNAD/FÖRPACKN.GRP REGISTER HTYP=5137                       
         PCB   TYPE=DB,DBDNAME=WL5137,PROCOPT=G,KEYLEN=35,POS=S                 
         SENSEG NAME=WL513701,PARENT=0                                          
         SENSEG NAME=WL513711,PARENT=WL513701,PROCOPT=GIRD                      
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W50144                                       
         END                                                                    
