*                                                                               
* 5211-MSG-PCB - START AV BILD 5107-SVARSBILD                                   
         PCB   TYPE=TP,NAME=W5T107,ALTRESP=NO,SAMETRM=NO,              *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB    TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                 
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W50197                                       
         END                                                                    
