*                                                                               
ATAB     PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=GOT,KEYLEN=80,POS=S                 
         SENSEG NAME=WDR501,PARENT=0                                            
         SENSEG NAME=WDGX0102,PARENT=WDR501                                     
*                                                                               
***------------------------------------------------------------                 
***      PCBS FOR SUB PGM W5017API                                              
***------------------------------------------------------------                 
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W50171                                       
         END                                                                    
