*                                                                               
*        DATABASE WDP7 - DESCRIPTION OF GENERAL IO-INIT-AREA.                   
         PCB    TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                 
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
*        DATABASE WDK6 - PARTSDATABASE FOR CDC.                                 
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GP,KEYLEN=06,POS=S                
         SENSEG NAME=WLARTC01,PARENT=0,PROCOPT=GPR                              
         SENSEG NAME=WLARTC11,PARENT=WLARTC01,PROCOPT=GR                        
*                                                                               
*        DATABASE WDK6 - PARTSDATABASE FOR CDC.                                 
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GP,KEYLEN=06,POS=S                
         SENSEG NAME=WLARTC01,PARENT=0,PROCOPT=GPR                              
         SENSEG NAME=WLARTC11,PARENT=WLARTC01,PROCOPT=GR                        
*                                                                               
*        DATABASE WDK7 - PARTSDATABASE FOR SDC.                                 
         PCB   TYPE=DB,DBDNAME=WLARTS,PROCOPT=G,KEYLEN=08,POS=S                 
         SENSEG NAME=WLARTS01,PROCOPT=GR                                        
         SENSEG NAME=WLARTS11,PARENT=WLARTS01,PROCOPT=GIR                       
*                                                                               
*        DATABASE WDK7 - PARTSDATABASE FOR SDC.                                 
         PCB   TYPE=DB,DBDNAME=WLARTS,PROCOPT=G,KEYLEN=08,POS=S                 
         SENSEG NAME=WLARTS01,PROCOPT=GR                                        
         SENSEG NAME=WLARTS11,PARENT=WLARTS01,PROCOPT=GIR                       
*                                                                               
*        ARTIKELREGISTER SEKUNDÄRINDEX ARTIKELNR                                
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=8,POS=S,      *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
*                                                                               
*        DATABASE WDL2 - INCOMING GOODS HISTORIC PART INFO.                     
         PCB   TYPE=DB,DBDNAME=WLINLE,PROCOPT=G,KEYLEN=32,POS=S                 
         SENSEG NAME=WLINLE01,PARENT=0,PROCOPT=GIR                              
         SENSEG NAME=WLINLE11,PARENT=WLINLE01,PROCOPT=GIR                       
         SENSEG NAME=WLINLE21,PARENT=WLINLE11,PROCOPT=GIR                       
*                                                                               
*        DATABASE WDL6 - INCOMING GOODS SDC HISTORIC PART INFO.                 
         PCB   TYPE=DB,DBDNAME=WLINLC,PROCOPT=G,KEYLEN=29,POS=S                 
         SENSEG NAME=WLINLC01,PROCOPT=GIR                                       
         SENSEG NAME=WLINLC11,PARENT=WLINLC01,PROCOPT=GIR                       
*                                                                               
*        DATABASE WDR8 - TRANSACTIONS TO BATCH                                  
         PCB   TYPE=DB,DBDNAME=WLFILB,PROCOPT=G,KEYLEN=27,POS=S                 
         SENSEG NAME=WLFILB01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLLOGA,PROCOPT=G,KEYLEN=20,POS=S                 
         SENSEG NAME=WLLOGA01,PARENT=0,PROCOPT=GI                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLSAPA,PROCOPT=G,KEYLEN=31,POS=S                 
         SENSEG NAME=WLSAPA01,PARENT=0,PROCOPT=GI                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLSAPC,PROCOPT=GOT,KEYLEN=17,POS=S               
         SENSEG NAME=WLSAPC01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA9,PROCOPT=G,KEYLEN=11,POS=S                   
         SENSEG NAME=WDA901,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDA912,PARENT=WDA901,PROCOPT=GIR                           
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W50151                                       
         END                                                                    
