*                                                                               
*    EMB.KOSTNAD/DETALJKOD                HTYP=5133                             
         PCB   TYPE=DB,DBDNAME=WL5133,PROCOPT=G,KEYLEN=35,POS=S                 
         SENSEG NAME=WL513301,PARENT=0                                          
         SENSEG NAME=WL513311,PARENT=WL513301,PROCOPT=GIRD                      
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W50143                                       
         END                                                                    
