* 5221-MSG-PCB - START AV BILD 5221-SVARSBILD                                   
         PCB   TYPE=TP,NAME=W5T221,ALTRESP=NO,SAMETRM=NO,              *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB    TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                 
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*---STYRDB FÖR EKONOMISKA HÄNDELSER(WDH5 VIA WDH5ASEQ)                          
         PCB   TYPE=DB,DBDNAME=WDH5,PROCOPT=GOT,KEYLEN=24,POS=S,       *        
               PROCSEQ=WDH5A                                                    
         SENSEG NAME=WDH531,PARENT=0                                            
         SENSEG NAME=WDH521,PARENT=WDH531                                       
         SENSEG NAME=WDH511,PARENT=WDH521                                       
         SENSEG NAME=WDH501,PARENT=WDH511                                       
*                                                                               
*---STYRDB FÖR EKONOMISKA HÄNDELSER                                             
         PCB   TYPE=DB,DBDNAME=WDH5,PROCOPT=GOT,KEYLEN=24,POS=S                 
         SENSEG NAME=WDH501,PARENT=0                                            
         SENSEG NAME=WDH511,PARENT=WDH501                                       
         SENSEG NAME=WDH521,PARENT=WDH511                                       
         SENSEG NAME=WDH531,PARENT=WDH521                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W50213                                       
         END                                                                    
