* 5222-MSG-PCB - START AV BILD 5222-SVARSBILD                                   
         PCB   TYPE=TP,NAME=W5T222,ALTRESP=NO,SAMETRM=NO,              *        
               MODIFY=NO,EXPRESS=NO                                             
*---USERBAS                                                                     
         PCB    TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                 
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*---EKONOMIBAS                                                                  
         PCB   TYPE=DB,DBDNAME=WDR1,PROCOPT=G,KEYLEN=46,POS=S                   
         SENSEG NAME=WDR101,PARENT=0                                            
         SENSEG NAME=WDGX5122,PARENT=WDR101,PROCOPT=GD                          
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W50223                                       
         END                                                                    
