*        --  DISTRIBUTION & PRINT                                               
DISTRDOC PCB   TYPE=TP,NAME=WZ0420X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDJ7,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDJ701,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDJ7,PROCOPT=GOT,KEYLEN=11,POS=S,       *        
               PROCSEQ=WDJ7A                                                    
         SENSEG NAME=WDJ701,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDJ7,PROCOPT=GOT,KEYLEN=20,POS=S,       *        
               PROCSEQ=WDJ7D                                                    
         SENSEG NAME=WDJ701,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDJ7,PROCOPT=GOT,KEYLEN=20,POS=S,       *        
               PROCSEQ=WDJ7E                                                    
         SENSEG NAME=WDJ701,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDJ7,PROCOPT=GOT,KEYLEN=20,POS=S,       *        
               PROCSEQ=WDJ7F                                                    
         SENSEG NAME=WDJ701,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR2,PROCOPT=GOT,KEYLEN=32,POS=S                 
         SENSEG NAME=WDR201,PARENT=0                                            
         SENSEG NAME=WDGX5104,PARENT=WDR201                                     
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W50293                                       
         END                                                                    
