*                                                                               
*        ALT-PCB - KLAR/FEL MEDDELANDE TILL DISPATCHER                          
         PCB   TYPE=TP,NAME=W0T693X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=G,KEYLEN=19,POS=S                 
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01,PROCOPT=GR                        
         SENSEG NAME=WLARTC21,PARENT=WLARTC11,PROCOPT=GIRD                      
         SENSEG NAME=WLARTC22,PARENT=WLARTC11                                   
         SENSEG NAME=WLARTC23,PARENT=WLARTC11                                   
         SENSEG NAME=WLARTC25,PARENT=WLARTC11,PROCOPT=GIRD                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=G,KEYLEN=19,POS=S                 
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01,PROCOPT=GR                        
         SENSEG NAME=WLARTC21,PARENT=WLARTC11,PROCOPT=GIRD                      
         SENSEG NAME=WLARTC22,PARENT=WLARTC11                                   
         SENSEG NAME=WLARTC23,PARENT=WLARTC11                                   
         SENSEG NAME=WLARTC25,PARENT=WLARTC11,PROCOPT=GIRD                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=8,POS=S,      *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLLEVA,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG NAME=WLLEVA01,PARENT=0                                          
         SENSEG NAME=WLLEVA11,PARENT=WLLEVA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLINLE,PROCOPT=GOT,KEYLEN=26,POS=S               
         SENSEG NAME=WLINLE01,PARENT=0                                          
         SENSEG NAME=WLINLE11,PARENT=WLINLE01                                   
         SENSEG NAME=WLINLE21,PARENT=WLINLE11                                   
         SENSEG NAME=WLINLE22,PARENT=WLINLE11                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=20,POS=S                   
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK724,PARENT=WDK711,PROCOPT=GIRD                          
         SENSEG NAME=WDK712,PARENT=WDK701,PROCOPT=GR                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLFILB,PROCOPT=G,KEYLEN=27,POS=S                 
         SENSEG NAME=WLFILB01,PARENT=0,PROCOPT=GIR                              
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=3,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB617,PARENT=WDB601                                       
*                                                                               
* WDK6-PCB  - ARTIKELINFORMATION WDK6 FÖR SUBPROGRAM W510PRTR                   
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=19,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
         SENSEG NAME=WDK621,PARENT=WDK611                                       
         SENSEG NAME=WDK629,PARENT=WDK611                                       
*                                                                               
*        KOMMUNIKATIONSDATABAS                                                  
         PCB   TYPE=DB,DBDNAME=WLKOMA,PROCOPT=G,KEYLEN=28,POS=S                 
         SENSEG NAME=WLKOMA01,PARENT=0,PROCOPT=GIR                              
         SENSEG NAME=WLKOMA11,PARENT=WLKOMA01,PROCOPT=GI                        
*                                                                               
* WDB2-PCB - KUNDREGISTER WDB2                                                  
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=G,KEYLEN=7,POS=S                    
         SENSEG NAME=WDB201,PARENT=0,PROCOPT=G                                  
*                                                                               
* WDG2-PCB/9305-PCB                                                             
         PCB   TYPE=DB,DBDNAME=WDG2,PROCOPT=GOT,KEYLEN=37,POS=S                 
         SENSEG NAME=WDG201,PARENT=0                                            
         SENSEG NAME=WDGX9306,PARENT=WDG201                                     
         SENSEG NAME=WDGX9308,PARENT=WDGX9306                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W50206                                       
         END                                                                    
