*                                                                               
         PCB   TYPE=TP,NAME=W0T606U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* 5212-MSG-PCB - START AV BILD 5212-SVARSBILD                                   
         PCB   TYPE=TP,NAME=W5T212,ALTRESP=NO,SAMETRM=NO,              *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB    TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                 
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*---PEDALBAS(WDR9)                                                              
         PCB   TYPE=DB,DBDNAME=WLSAPA,PROCOPT=GOT,KEYLEN=31,POS=S               
         SENSEG NAME=WLSAPA01,PARENT=0                                          
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W50211                                       
         END                                                                    
