         PCB    TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                 
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDH5,PROCOPT=G,KEYLEN=24,POS=S                   
         SENSEG NAME=WDH501,PARENT=0                                            
         SENSEG NAME=WDH511,PARENT=WDH501                                       
         SENSEG NAME=WDH521,PARENT=WDH511,PROCOPT=GI                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W50216                                       
         END                                                                    
