*                                                                               
         PCB   TYPE=TP,NAME=,ALTRESP=NO,SAMETRM=NO,                    *        
               MODIFY=YES,EXPRESS=NO                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB    TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=15,POS=S              
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD8B,PROCOPT=GOT,KEYLEN=22,POS=S                
         SENSEG NAME=WDD8B1,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE4C,PROCOPT=GOT,KEYLEN=29,POS=S                
         SENSEG NAME=WDE4C1,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE4,PROCOPT=GOTP,KEYLEN=26,POS=S                
         SENSEG NAME=WDE401,PARENT=0                                            
         SENSEG NAME=WDE411,PARENT=WDE401                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDH1,PROCOPT=G,KEYLEN=30,POS=S                   
         SENSEG NAME=WDH101,PARENT=0                                            
         SENSEG NAME=WDH111,PARENT=WDH101,PROCOPT=GRID                          
         SENSEG NAME=WDH121,PARENT=WDH111,PROCOPT=GRID                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=8,POS=S,      *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLSATB,PROCOPT=GOTP,KEYLEN=45,POS=S,    *        
               PROCSEQ=WDJ1C                                                    
         SENSEG NAME=WLSATB11,PARENT=0                                          
         SENSEG NAME=WLSATB01,PARENT=WLSATB11                                   
*                                                                               
         PCB    TYPE=DB,DBDNAME=WLARTS,PROCOPT=GOT,KEYLEN=15,POS=S              
         SENSEG NAME=WLARTS01,PARENT=0                                          
         SENSEG NAME=WLARTS11,PARENT=WLARTS01                                   
*                                                                               
         PCB    TYPE=DB,DBDNAME=WLINVC,PROCOPT=GOT,KEYLEN=12,POS=S              
         SENSEG NAME=WLINVC01,PARENT=0                                          
         SENSEG NAME=WLINVC11,PARENT=WLINVC01                                   
*                                                                               
         PCB    TYPE=DB,DBDNAME=WDG3,PROCOPT=G,KEYLEN=31,POS=S                  
         SENSEG NAME=WDG301,PARENT=0                                            
         SENSEG NAME=WDGX5102,PARENT=WDG301,PROCOPT=GIR                         
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W50301                                       
         END                                                                    
