*          DATA SET W50303PII0 AT LEVEL 003 AS OF 87/09/01                      
*                                                                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB TYPE=DB,DBDNAME=WDH1A,PROCOPT=GOT,KEYLEN=23,POS=S                  
         SENSEG NAME=WDH1A1,PARENT=0                                            
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W50303                                       
         END                                                                    
