*                                                                               
         PCB   TYPE=TP,NAME=W0T606U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB    TYPE=DB,DBDNAME=WDP7,PROCOPT=G,KEYLEN=8,POS=S                   
         SENSEG NAME=WDP701,PARENT=0,PROCOPT=GIR                                
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDP3,PROCOPT=GOT,KEYLEN=10,POS=S                 
         SENSEG NAME=WDP301,PARENT=0                                            
         SENSEG NAME=WDP311,PARENT=WDP301                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDH7,PROCOPT=GOT,KEYLEN=23,POS=S                 
         SENSEG NAME=WDH701,PARENT=0                                            
         SENSEG NAME=WDH711,PARENT=WDH701                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W50312                                       
         END                                                                    
