*          DATA SET W50309PII0 AT LEVEL 004 AS OF 90/01/15                      
*                                                                               
         PCB TYPE=TP,NAME=W5T301X,MODIFY=NO                                     
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB TYPE=DB,DBDNAME=WLINVB,PROCOPT=GOT,KEYLEN=23,POS=S                 
         SENSEG NAME=WLINVB01,PARENT=0                                          
*                                                                               
         PCB TYPE=DB,DBDNAME=WDH1,PROCOPT=GOT,KEYLEN=30,POS=S                   
         SENSEG NAME=WDH101,PARENT=0                                            
         SENSEG NAME=WDH111,PARENT=WDH101                                       
         SENSEG NAME=WDH121,PARENT=WDH111                                       
*                                                                               
         PCB     TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=6,POS=S              
         SENSEG  NAME=WLARTC01,PARENT=0                                         
         SENSEG  NAME=WLARTC11,PARENT=WLARTC01                                  
*                                                                               
*        SEQB LÄSNINGAR                                                         
         PCB   TYPE=DB,DBDNAME=WDH1,PROCOPT=GOT,KEYLEN=23,POS=S,       *        
               PROCSEQ=WDH1B                                                    
         SENSEG NAME=WDH111,PARENT=0                                            
         SENSEG NAME=WDH101,PARENT=WDH111                                       
*                                                                               
*        ALT2 LÄSNINGAR                                                         
         PCB   TYPE=DB,DBDNAME=WDH1,PROCOPT=GOT,KEYLEN=23,POS=S,       *        
               PROCSEQ=WDH1B                                                    
         SENSEG NAME=WDH111,PARENT=0                                            
         SENSEG NAME=WDH101,PARENT=WDH111                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W50309                                       
         END                                                                    
