*          DATA SET W50304PII0 AT LEVEL 003 AS OF 87/09/01                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB TYPE=DB,DBDNAME=WDH1,PROCOPT=G,KEYLEN=30,POS=S                     
         SENSEG NAME=WDH101,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDH111,PARENT=WDH101,PROCOPT=GIR                           
         SENSEG NAME=WDH121,PARENT=WDH111,PROCOPT=GIR                           
*                                                                               
         PCB TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=15,POS=S                 
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
*                                                                               
         PCB TYPE=DB,DBDNAME=WLARTS,PROCOPT=GOT,KEYLEN=15,POS=S                 
         SENSEG NAME=WLARTS01,PARENT=0                                          
         SENSEG NAME=WLARTS11,PARENT=WLARTS01                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W50304                                       
         END                                                                    
