*          DATA SET W50302PII0 AT LEVEL 004 AS OF 90/01/15                      
*                                                                               
         PCB TYPE=TP,NAME=W5T301X,MODIFY=NO                                     
*                                                                               
         PCB TYPE=TP,NAME=W5T392X,MODIFY=NO                                     
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB TYPE=DB,DBDNAME=WDH1A,PROCOPT=GOT,KEYLEN=23,POS=S                  
         SENSEG NAME=WDH1A1,PARENT=0                                            
*                                                                               
         PCB TYPE=DB,DBDNAME=WDH1,PROCOPT=GOT,KEYLEN=31,POS=S                   
         SENSEG NAME=WDH101,PARENT=0                                            
         SENSEG NAME=WDH111,PARENT=WDH101                                       
*                                                                               
         PCB     TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=6,POS=S              
         SENSEG  NAME=WLARTC01,PARENT=0                                         
         SENSEG  NAME=WLARTC11,PARENT=WLARTC01                                  
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W50302                                       
         END                                                                    
