         PSBGEN LANG=COBOL,PSBNAME=W50493                                       
         END                                                                    
