*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W51084                                       
         END                                                                    
