* ARTIKELREGISTER C-LAGER                                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=G,KEYLEN=6,POS=S                  
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01,PROCOPT=GR                        
*                                                                               
* ARTIKELREGISTER S-LAGER                                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTS,PROCOPT=G,KEYLEN=7,POS=S                  
         SENSEG NAME=WLARTS01,PARENT=0                                          
         SENSEG NAME=WLARTS11,PARENT=WLARTS01,PROCOPT=GR                        
*                                                                               
*                                                                               
* SALDOFÖRÄNDRINGAR WDL9                                                        
         PCB     TYPE=DB,DBDNAME=WLLOGA,PROCOPT=GI,KEYLEN=20,POS=S              
         SENSEG  NAME=WLLOGA01,PARENT=0                                         
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W51091,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
