*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR8,PROCOPT=GOT,KEYLEN=227,POS=S                
         SENSEG NAME=WDR801,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W51039                                       
         END                                                                    
