*                                                                               
*        ALT-PCB - KLAR/FEL MEDDELANDE TILL DISPATCHER                          
         PCB   TYPE=TP,NAME=W0T693X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*        KOMMUNIKATIONSDATABAS                                                  
         PCB   TYPE=DB,DBDNAME=WLKOMA,PROCOPT=G,KEYLEN=28,POS=S                 
         SENSEG NAME=WLKOMA01,PARENT=0,PROCOPT=GIR                              
         SENSEG NAME=WLKOMA11,PARENT=WLKOMA01,PROCOPT=GI                        
*                                                                               
* WDK6-PCB  - ARTIKELINFORMATION WDK6 FÖR SUBPROGRAM W510PRTR                   
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=19,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
         SENSEG NAME=WDK621,PARENT=WDK611                                       
         SENSEG NAME=WDK629,PARENT=WDK611                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=20,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK724,PARENT=WDK711                                       
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=3,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB617,PARENT=WDB601                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLLEVA,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG NAME=WLLEVA01,PARENT=0                                          
         SENSEG NAME=WLLEVA11,PARENT=WLLEVA01                                   
* WDB2-PCB - KUNDREGISTER WDB2                                                  
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=G,KEYLEN=7,POS=S                    
         SENSEG NAME=WDB201,PARENT=0,PROCOPT=G                                  
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W51085                                       
         END                                                                    
