         PCB   TYPE=DB,DBDNAME=WDH5,PROCOPT=GOT,KEYLEN=24,POS=S                 
         SENSEG NAME=WDH501,PARENT=0,PROCOPT=G                                  
         SENSEG NAME=WDH511,PARENT=WDH501                                       
         SENSEG NAME=WDH521,PARENT=WDH511                                       
         SENSEG NAME=WDH531,PARENT=WDH521                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W51067                                       
         END                                                                    
