*                                                                               
         PCB   TYPE=DB,DBDNAME=WDH3,PROCOPT=G,KEYLEN=17,POS=S                   
         SENSEG NAME=WDH301,PARENT=0,PROCOPT=GIRD                               
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W51014,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
