*                                                                               
* WDG2-PCB/9309-PCB                                                             
         PCB   TYPE=DB,DBDNAME=WDG2,PROCOPT=G,KEYLEN=37,POS=S                   
         SENSEG NAME=WDG201,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDGX9310,PARENT=WDG201,PROCOPT=GIR                         
* WDB6                                                                          
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W51017,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
