*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=215,POS=S                
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
         SENSEG NAME=WDK621,PARENT=WDK611                                       
         SENSEG NAME=WDK622,PARENT=WDK611                                       
         SENSEG NAME=WDK623,PARENT=WDK611                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W51020                                       
         END                                                                    
