*                                                                               
         PCB   TYPE=DB,DBDNAME=WLSAPA,PROCOPT=G,KEYLEN=31,POS=S                 
         SENSEG NAME=WLSAPA01,PARENT=0,PROCOPT=GD                               
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W51062,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
