*                                                                               
*                     *** STYRREGISTER EKONOMI - WDH5 ***                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDH5,PROCOPT=GOT,KEYLEN=24,POS=S                 
         SENSEG NAME=WDH501,PARENT=0                                            
         SENSEG NAME=WDH511,PARENT=WDH501                                       
         SENSEG NAME=WDH521,PARENT=WDH511                                       
         SENSEG NAME=WDH531,PARENT=WDH521                                       
*                                                                               
* VALUTAREG  ÅRSVALUTA                                                          
* WDG2-PCB/9305-PCB  - FOR W510CURR                                             
         PCB   TYPE=DB,DBDNAME=WDG2,PROCOPT=GOT,KEYLEN=37,POS=S                 
         SENSEG NAME=WDG201,PARENT=0                                            
         SENSEG NAME=WDGX9306,PARENT=WDG201                                     
         SENSEG NAME=WDGX9308,PARENT=WDGX9306                                   
*WDL2 PCB                                                                       
         PCB   TYPE=DB,DBDNAME=WDL2,PROCOPT=GOT,KEYLEN=21,POS=S                 
         SENSEG NAME=WDL201,PARENT=0                                            
         SENSEG NAME=WDL211,PARENT=WDL201                                       
         SENSEG NAME=WDL222,PARENT=WDL211                                       
*                                                                               
* WDB2-PCB - KUNDREGISTER WDB2                                                  
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
*WDB1-PCB                                                                       
         PCB   TYPE=DB,DBDNAME=WDB1,PROCOPT=GOT,KEYLEN=11,POS=S                 
         SENSEG NAME=WDB101,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W51080                                       
         END                                                                    
