         PCB   TYPE=DB,DBDNAME=WLSATG,PROCOPT=GOT,KEYLEN=9,POS=S                
         SENSEG NAME=WLSATG01,PARENT=0                                          
         SENSEG NAME=WLSATG11,PARENT=WLSATG01                                   
*                                                                               
        PSBGEN LANG=COBOL,PSBNAME=W51298                                        
        END                                                                     
