*        LÄSER WDK6 MED HSSR                                                    
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
         SENSEG NAME=WDK621,PARENT=WDK611                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W51232                                       
         END                                                                    
