*                                                                               
         PCB   TYPE=DB,DBDNAME=WDH7,PROCOPT=GOT,KEYLEN=212,POS=S                
         SENSEG NAME=WDH701,PARENT=0                                            
         SENSEG NAME=WDH711,PARENT=WDH701                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W51342                                       
         END                                                                    
