*                                                                               
         PCB   TYPE=DB,DBDNAME=WDH1,PROCOPT=GOT,KEYLEN=209,POS=S                
         SENSEG NAME=WDH101,PARENT=0                                            
         SENSEG NAME=WDH111,PARENT=WDH101                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W51397                                       
         END                                                                    
