*                                                                               
         PCB   TYPE=DB,DBDNAME=WDH1,PROCOPT=G,KEYLEN=30,POS=S                   
         SENSEG NAME=WDH101,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDH111,PARENT=WDH101,PROCOPT=GI                            
         SENSEG NAME=WDH121,PARENT=WDH111,PROCOPT=GI                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W51378,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
