*                                                                               
         PCB    TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=212,POS=S               
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W51371                                       
         END                                                                    
