*                                                                               
         PCB    TYPE=DB,DBDNAME=WDH7,PROCOPT=GOT,KEYLEN=212,POS=S               
         SENSEG NAME=WDH701,PARENT=0                                            
         SENSEG NAME=WDH711,PARENT=WDH701                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=19,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W51360                                       
         END                                                                    
