*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W52202                                       
         END                                                                    
