*                                                                               
*    ARTIKELREGISTER               WDK6                                         
     PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=G,KEYLEN=19,POS=S                     
     SENSEG NAME=WLARTC01,PARENT=0                                              
     SENSEG NAME=WLARTC11,PARENT=WLARTC01,PROCOPT=GR                            
     SENSEG NAME=WLARTC21,PARENT=WLARTC11                                       
*                                                                               
*    ARTIKELREGISTER, SLAGER       WDK7                                         
     PCB   TYPE=DB,DBDNAME=WLARTS,PROCOPT=GOT,KEYLEN=7,POS=S                    
     SENSEG NAME=WLARTS01,PARENT=0                                              
     SENSEG NAME=WLARTS11,PARENT=WLARTS01                                       
*                                                                               
     PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                      
     SENSEG NAME=WDB601,PARENT=0                                                
*                                                                               
     PCB   TYPE=DB,DBDNAME=WDR4,PROCOPT=G,KEYLEN=31,POS=S                       
     SENSEG NAME=WDR401,PARENT=0                                                
     SENSEG NAME=WDR470,PARENT=WDR401,PROCOPT=GIR                               
*                                                                               
*----GSAM                                                                       
     PCB   TYPE=GSAM,DBDNAME=WDS1,PROCOPT=L                                     
*                                                                               
*                                                                               
     PSBGEN LANG=COBOL,PSBNAME=W54020,CMPAT=YES                                 
     END                                                                        
