*                                                                               
         PCB   TYPE=DB,DBDNAME=WL1117,PROCOPT=GIRD,KEYLEN=35,POS=S              
         SENSEG NAME=WL111701,PARENT=0                                          
         SENSEG NAME=WL111711,PARENT=WL111701                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GR,KEYLEN=6,POS=S                 
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTS,PROCOPT=G,KEYLEN=7,POS=S                  
         SENSEG NAME=WLARTS01,PARENT=0                                          
         SENSEG NAME=WLARTS11,PARENT=WLARTS01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLSAPA,PROCOPT=GI,KEYLEN=31,POS=S                
         SENSEG NAME=WLSAPA01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR1,PROCOPT=G,KEYLEN=35,POS=S                   
         SENSEG NAME=WDR101,PARENT=0                                            
         SENSEG NAME=WDGX5142,PARENT=WDR101,PROCOPT=GI                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD3,PROCOPT=GOT,KEYLEN=8,POS=S,        *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WDD301,PARENT=0                                            
         SENSEG NAME=WDD311,PARENT=WDD301                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR8,PROCOPT=GI,KEYLEN=27,POS=S                  
         SENSEG NAME=WDR801,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W54010,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
