*   STANDARDPRISREGISTER (KOMMANDE)                                             
         PCB   TYPE=DB,DBDNAME=WDC6,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDC601,PARENT=0                                            
*                                                                               
*   DATUM FÖR SENASTE LADDNING AV SPIS-BASEN                                    
         PCB   TYPE=DB,DBDNAME=WLXXEH,PROCOPT=GOT,KEYLEN=30,POS=S               
         SENSEG NAME=WLXXEH01,PARENT=0                                          
         SENSEG NAME=WLXXEH11,PARENT=WLXXEH01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=09,POS=S                 
         SENSEG NAME=WDK601,PARENT=0,                                           
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDP3,PROCOPT=GOT,KEYLEN=10,POS=S                 
         SENSEG NAME=WDP301,PARENT=0,                                           
         SENSEG NAME=WDP311,PARENT=WDP301                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W55147                                       
         END                                                                    
