*                                                                               
*        ARTIKELREG                   WDK6                                      
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=6,POS=S                
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
*                                                                               
*        EMB.KOSTNAD/FÖRPACKNINGSTYP  WDR1 IDHTYP=5131                          
         PCB   TYPE=DB,DBDNAME=WL5131,PROCOPT=GOT,KEYLEN=35,POS=S               
         SENSEG NAME=WL513101,PARENT=0                                          
         SENSEG NAME=WL513111,PARENT=WL513101                                   
*                                                                               
*        EMB.KOSTNAD/DETALJKOD        WDR1 IDHTYP=5133                          
         PCB   TYPE=DB,DBDNAME=WL5133,PROCOPT=GOT,KEYLEN=35,POS=S               
         SENSEG NAME=WL513301,PARENT=0                                          
         SENSEG NAME=WL513311,PARENT=WL513301                                   
*                                                                               
*        EXTRA EMB.KOSTNAD/ARTIKEL    WDR1 IDHTYP=5135                          
         PCB   TYPE=DB,DBDNAME=WL5135,PROCOPT=GOT,KEYLEN=35,POS=S               
         SENSEG NAME=WL513501,PARENT=0                                          
         SENSEG NAME=WL513511,PARENT=WL513501                                   
*                                                                               
*                                     WDR2 IDHTYP=5108                          
         PCB   TYPE=DB,DBDNAME=WDR2,PROCOPT=GOT,KEYLEN=35,POS=S                 
         SENSEG NAME=WDR201,PARENT=0                                            
         SENSEG NAME=WDGX5108,PARENT=WDR201                                     
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W55101                                       
         END                                                                    
