*                                                                               
     PCB   TYPE=DB,DBDNAME=WDF1,PROCOPT=GOT,KEYLEN=205,POS=S                    
     SENSEG NAME=WDF101,PARENT=0                                                
     SENSEG NAME=WDF102,PARENT=WDF101                                           
*                                                                               
     PSBGEN LANG=COBOL,PSBNAME=W55144                                           
     END                                                                        
