         PCB   TYPE=DB,DBDNAME=WLXXEH,PROCOPT=G,KEYLEN=30,POS=S                 
         SENSEG NAME=WLXXEH01,PARENT=0                                          
         SENSEG NAME=WLXXEH11,PARENT=WLXXEH01,PROCOPT=GR                        
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W55161,CMPAT=YES                             
         END                                                                    
