*                                                                               
*        PRISREGISTER FÖR STD/SJKUPPD  WDH8                                     
         PCB   TYPE=DB,DBDNAME=WLPRIG,PROCOPT=G,KEYLEN=17,POS=S                 
         SENSEG NAME=WLPRIG01,PARENT=0,PROCOPT=GD                               
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W55326,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
