*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=19,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
         SENSEG NAME=WDK621,PARENT=WDK611                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDF1,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDF101,PARENT=0                                            
         SENSEG NAME=WDF102,PARENT=WDF101                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD3,PROCOPT=GOT,KEYLEN=11,POS=S,       *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WDD301,PARENT=0                                            
         SENSEG NAME=WDD311,PARENT=WDD301                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=24,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK722,PARENT=WDK711                                       
         SENSEG NAME=WDK724,PARENT=WDK711                                       
         SENSEG NAME=WDK712,PARENT=WDK701                                       
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
                                                                                
         PCB   TYPE=DB,DBDNAME=WDP3,PROCOPT=GOT,KEYLEN=10,POS=S                 
         SENSEG NAME=WDP301,PARENT=0                                            
         SENSEG NAME=WDP311,PARENT=WDP301                                       
*                                                                               
* WDG2-PCB/9305-PCB                                                             
         PCB   TYPE=DB,DBDNAME=WDG2,PROCOPT=GOT,KEYLEN=37,POS=S                 
         SENSEG NAME=WDG201,PARENT=0                                            
         SENSEG NAME=WDGX9306,PARENT=WDG201                                     
         SENSEG NAME=WDGX9308,PARENT=WDGX9306                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W55373                                       
         END                                                                    
