*                                                                               
*        PRISREGISTER FÖR STD/SJKUPPD  WDH8                                     
         PCB   TYPE=DB,DBDNAME=WLPRIG,PROCOPT=G,KEYLEN=17,POS=S                 
         SENSEG NAME=WLPRIG01,PARENT=0,PROCOPT=GR                               
*                                                                               
*        ARTIKELREGISTER               WDK6                                     
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=G,KEYLEN=19,POS=S                 
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01,PROCOPT=GR                        
         SENSEG NAME=WLARTC21,PARENT=WLARTC11                                   
*                                                                               
*        ARTIKELREGISTER, SLAGER       WDK7                                     
         PCB   TYPE=DB,DBDNAME=WLARTS,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG NAME=WLARTS01,PARENT=0                                          
         SENSEG NAME=WLARTS11,PARENT=WLARTS01                                   
*                                                                               
*        EKONOMIBASEN PEDAL , WDR9                                              
         PCB   TYPE=DB,DBDNAME=WLSAPA,PROCOPT=G,KEYLEN=31,POS=S                 
         SENSEG NAME=WLSAPA01,PARENT=0,PROCOPT=GI                               
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W55322,CMPAT=YES,LOCKMAX=3                   
         END                                                                    
