         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=9,POS=S                  
         SENSEG NAME=WDK601,PARENT=0                                            
                                                                                
         PSBGEN LANG=COBOL,PSBNAME=W55305                                       
         END                                                                    
