*                                                                               
*        PRISREGISTER FÖR STD/SJKUPPD                                           
         PCB   TYPE=DB,DBDNAME=WDH8,PROCOPT=GOT,KEYLEN=244,POS=S                
         SENSEG NAME=WDH801,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W55324                                       
         END                                                                    
