*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W55504,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
