         PCB   TYPE=DB,DBDNAME=WLLOGA,PROCOPT=G,KEYLEN=20,POS=S                 
         SENSEG NAME=WLLOGA01,PARENT=0,PROCOPT=GID                              
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W55505,CMPAT=YES                             
         END                                                                    
