*                                                                               
         PCB   TYPE=DB,DBDNAME=WDF1,PROCOPT=GOT,KEYLEN=06,POS=S                 
         SENSEG NAME=WDF101,PARENT=0                                            
         SENSEG NAME=WDF106,PARENT=WDF101                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD3,PROCOPT=GOT,KEYLEN=8,POS=S,        *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WDD301,PARENT=0                                            
         SENSEG NAME=WDD311,PARENT=WDD301                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=06,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=20,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK724,PARENT=WDK711                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W56132                                       
         END                                                                    
