*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR9,PROCOPT=GOT,KEYLEN=266,POS=S                
         SENSEG NAME=WDR901,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W57061                                       
         END                                                                    
