*                                                                               
         PCB   TYPE=DB,DBDNAME=WDL9,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDL901,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
                                                                                
         PSBGEN LANG=COBOL,PSBNAME=W57040                                       
         END                                                                    
