*                                                                               
* DISP-PCB  - KLAR MEDDELANDE TILL DISPATCHEN                                   
         PCB   TYPE=TP,NAME=W0T693X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* 6202-PCB    - KVALITET                                                        
         PCB   TYPE=TP,NAME=W6T202X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* W6INLC-PCB  - INLEVERANSREGISTER W6D1B1 INDEX IDLOPNRM                        
         PCB   TYPE=DB,DBDNAME=W6INLC,PROCOPT=GOT,KEYLEN=25,POS=S               
         SENSEG NAME=W6INLC01,PARENT=0                                          
*                                                                               
* W6INLA-PCB  - INLEVERANSREGISTER W6D1                                         
         PCB   TYPE=DB,DBDNAME=W6INLA,PROCOPT=G,KEYLEN=25,POS=S                 
         SENSEG NAME=W6INLA01,PARENT=0                                          
         SENSEG NAME=W6INLA11,PARENT=W6INLA01,PROCOPT=GR                        
         SENSEG NAME=W6INLA21,PARENT=W6INLA11                                   
*                                                                               
* W6KVAI-PCB  - KONTROLLRAPPORT W6H7C1 INDEX IDLOPNRM                           
         PCB   TYPE=DB,DBDNAME=W6KVAI,PROCOPT=GOT,KEYLEN=18,POS=S               
         SENSEG NAME=W6KVAI01,PARENT=0                                          
*                                                                               
* W6KVAE-PCB  - KONTROLLRAPPORT W6H7                                            
         PCB   TYPE=DB,DBDNAME=W6KVAE,PROCOPT=GOT,KEYLEN=05,POS=S               
         SENSEG NAME=W6KVAE01,PARENT=0                                          
*                                                                               
* ARTC-PCB  - ARTIKELINFORMATION WDK6                                           
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=G,KEYLEN=19,POS=S                 
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01,PROCOPT=GR                        
         SENSEG NAME=WLARTC21,PARENT=WLARTC11,PROCOPT=GR                        
         SENSEG NAME=WLARTC23,PARENT=WLARTC11,PROCOPT=G                         
*                                                                               
* ARTS-PCB  - ARTIKELINFORMATION WDK7                                           
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=7,POS=S                    
         SENSEG NAME=WDK701,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDK711,PARENT=WDK701,PROCOPT=GIR                           
         SENSEG NAME=WDK712,PARENT=WDK701,PROCOPT=GI                            
*                                                                               
* WDL6-PCB  - INLEVERANS HISTORIK SDC                                           
         PCB   TYPE=DB,DBDNAME=WDL6,PROCOPT=G,KEYLEN=21,POS=S                   
         SENSEG NAME=WDL601,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDL611,PARENT=WDL601,PROCOPT=GIR                           
         SENSEG NAME=WDL621,PARENT=WDL611,PROCOPT=GIRD                          
         SENSEG NAME=WDL612,PARENT=WDL601,PROCOPT=GIRD                          
*                                                                               
* INLB-PCB  - LEVERANSPLAN WDD9                                                 
         PCB   TYPE=DB,DBDNAME=WLINLB,PROCOPT=GP,KEYLEN=25,POS=S                
         SENSEG NAME=WLINLB01,PARENT=0                                          
         SENSEG NAME=WLINLB11,PARENT=WLINLB01,PROCOPT=GR                        
         SENSEG NAME=WLINLB23,PARENT=WLINLB11,PROCOPT=GRP                       
         SENSEG NAME=WLINLB31,PARENT=WLINLB23,PROCOPT=AP                        
*                                                                               
* INLE-PCB  - INLEVERANS-HISTORIK WDL2                                          
         PCB   TYPE=DB,DBDNAME=WLINLE,PROCOPT=G,KEYLEN=21,POS=S                 
         SENSEG NAME=WLINLE01,PARENT=0                                          
         SENSEG NAME=WLINLE11,PARENT=WLINLE01,PROCOPT=GR                        
         SENSEG NAME=WLINLE21,PARENT=WLINLE11,PROCOPT=GR                        
         SENSEG NAME=WLINLE31,PARENT=WLINLE21,PROCOPT=GIRD                      
*                                                                               
* ZZAC-PCB  - LOGG WDG6                                                         
         PCB   TYPE=DB,DBDNAME=WLZZAC,PROCOPT=G,KEYLEN=18,POS=S                 
         SENSEG NAME=WLZZAC01,PARENT=0,PROCOPT=I                                
*                                                                               
* XXBW-PCB  - DISP. DAT. NÄSTA INLEV.                                           
         PCB   TYPE=DB,DBDNAME=WLXXBW,PROCOPT=G,KEYLEN=50,POS=S                 
         SENSEG NAME=WLXXBW01,PARENT=0                                          
         SENSEG NAME=WLXXBW11,PARENT=WLXXBW01,PROCOPT=GI                        
*                                                                               
* 4505-PCB  - RO-TÄCKNING                                                       
         PCB   TYPE=DB,DBDNAME=WL4505,PROCOPT=G,KEYLEN=35,POS=S                 
         SENSEG NAME=WL450501,PARENT=0                                          
         SENSEG NAME=WL450511,PARENT=WL450501,PROCOPT=I                         
*                                                                               
* KREA-PCB  - KOPPLING INLEV - KREDITERING                                      
         PCB   TYPE=DB,DBDNAME=W6KREA,PROCOPT=G,KEYLEN=35,POS=S                 
         SENSEG NAME=W6KREA01,PARENT=0                                          
         SENSEG NAME=W6KREA11,PARENT=W6KREA01,PROCOPT=GD                        
*                                                                               
* USEA-PCB  USER-BASEN FÖR ATT HITTA LOKAL TID                                  
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GOT,KEYLEN=08,POS=S               
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
*** FOR W510CURR                                                                
         PCB   TYPE=DB,DBDNAME=WDG2,PROCOPT=GOT,KEYLEN=37,POS=S                 
         SENSEG NAME=WDG201,PARENT=0                                            
         SENSEG NAME=WDGX9306,PARENT=WDG201                                     
         SENSEG NAME=WDGX9308,PARENT=WDGX9306                                   
*                                                                               
* XXIE-PCB  HÄNDELSEBAS FÖR ATT SUB-PGM W510AVG SKA HITTA VAL.KURS              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDG2,PROCOPT=GOT,KEYLEN=37,POS=S                 
         SENSEG NAME=WDG201,PARENT=0                                            
         SENSEG NAME=WDGX9306,PARENT=WDG201                                     
         SENSEG NAME=WDGX9308,PARENT=WDGX9306                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=8,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB617,PARENT=WDB601                                       
         SENSEG NAME=WDB621,PARENT=WDB617                                       
         SENSEG NAME=WDB622,PARENT=WDB617                                       
*                                                                               
* SALDOFÖRÄNDRINGAR WDL9                                                        
         PCB     TYPE=DB,DBDNAME=WLLOGA,PROCOPT=GI,KEYLEN=20,POS=S              
         SENSEG  NAME=WLLOGA01,PARENT=0                                         
*                                                                               
* FILB-PCB  - SUPERTRANS                                                        
         PCB   TYPE=DB,DBDNAME=WLFILB,PROCOPT=GI,KEYLEN=27,POS=S                
         SENSEG NAME=WLFILB01,PARENT=0                                          
*                                                                               
* SAPA-PCB WDR9                                                                 
         PCB    TYPE=DB,DBDNAME=WLSAPA,PROCOPT=GI,KEYLEN=31,POS=S               
         SENSEG NAME=WLSAPA01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=20,POS=S                   
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK723,PARENT=WDK711                                       
         SENSEG NAME=WDK724,PARENT=WDK711,PROCOPT=GR                            
         SENSEG NAME=WDK712,PARENT=WDK701,PROCOPT=GR                            
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=3,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB617,PARENT=WDB601                                       
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6 (NEXT-PCB)                                       
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
* WDF1 LEVERANTÖRSREGISTER                                                      
         PCB   TYPE=DB,DBDNAME=WLLEVA,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG NAME=WLLEVA01,PARENT=0                                          
         SENSEG NAME=WLLEVA11,PARENT=WLLEVA01                                   
*                                                                               
* WDG2-PCB/9305-PCB                                                             
         PCB   TYPE=DB,DBDNAME=WDG2,PROCOPT=GOT,KEYLEN=37,POS=S                 
         SENSEG NAME=WDG201,PARENT=0                                            
         SENSEG NAME=WDGX9306,PARENT=WDG201                                     
         SENSEG NAME=WDGX9308,PARENT=WDGX9306                                   
*                                                                               
* WDR2-PCB/HT-2215 CDC                                                          
         PCB   TYPE=DB,DBDNAME=WDR2,PROCOPT=GOT,KEYLEN=35,POS=S                 
         SENSEG NAME=WDR201,PARENT=0                                            
         SENSEG NAME=WDR242,PARENT=WDR201                                       
*                                                                               
* WDR5-PCB/2217-PCB - LEVERANTÖRSINFORMATION EDI CDC                            
         PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=G,KEYLEN=40,POS=S                   
         SENSEG NAME=WDR501,PARENT=0                                            
         SENSEG NAME=WDR551,PARENT=WDR501,PROCOPT=GI                            
*                                                                               
* WDR2-PCB/HT-2205 NDC                                                          
         PCB   TYPE=DB,DBDNAME=WDR2,PROCOPT=GOT,KEYLEN=37,POS=S                 
         SENSEG NAME=WDR201,PARENT=0                                            
         SENSEG NAME=WDGX2206,PARENT=WDR201                                     
*                                                                               
* WDR5-PCB/2247-PCB - LEVERANTÖRSINFORMATION EDI                                
         PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=G,KEYLEN=42,POS=S                   
         SENSEG NAME=WDR501,PARENT=0                                            
         SENSEG NAME=WDGX2248,PARENT=WDR501,PROCOPT=GI                          
*                                                                               
        PSBGEN LANG=COBOL,PSBNAME=W60193                                        
        END                                                                     
