*                                                                               
         PCB   TYPE=TP,NAME=W6T191X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*6197-PCB     TRANS TILL PGM W6019700 -  FÖRBEHANDLINGSRAPPORT                  
         PCB   TYPE=TP,NAME=W6T197X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GIR,KEYLEN=08,POS=S               
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6INLA,PROCOPT=G,KEYLEN=25,POS=S                 
         SENSEG NAME=W6INLA01,PARENT=0                                          
         SENSEG NAME=W6INLA11,PARENT=W6INLA01,PROCOPT=GR                        
         SENSEG NAME=W6INLA21,PARENT=W6INLA11,PROCOPT=GIRD                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6INLA,PROCOPT=GOT,KEYLEN=08,POS=S,     *        
               PROCSEQ=W6D1B                                                    
         SENSEG NAME=W6INLA11,PARENT=0                                          
         SENSEG NAME=W6INLA21,PARENT=W6INLA11                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6INLA,PROCOPT=G,KEYLEN=17,POS=S,       *        
               PROCSEQ=W6D1C                                                    
         SENSEG NAME=W6INLA11,PARENT=0,PROCOPT=G                                
         SENSEG NAME=W6INLA21,PARENT=W6INLA11,PROCOPT=GR                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6INLC,PROCOPT=GOT,KEYLEN=25,POS=S               
         SENSEG NAME=W6INLC01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6INLF,PROCOPT=GOT,KEYLEN=31,POS=S               
         SENSEG NAME=W6INLF01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6INLH,PROCOPT=GOT,KEYLEN=31,POS=S               
         SENSEG NAME=W6INLH01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6PLAA,PROCOPT=GOT,KEYLEN=35,POS=S               
         SENSEG NAME=W6PLAA01,PARENT=0                                          
         SENSEG NAME=W6PLAA11,PARENT=W6PLAA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=06,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD3,PROCOPT=GOT,KEYLEN=8,POS=S,        *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WDD301,PARENT=0                                            
         SENSEG NAME=WDD311,PARENT=WDD301                                       
*                                                                               
*PCB'ER FÖR W611PMRK                                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6INLA,PROCOPT=G,KEYLEN=08,POS=S,       *        
               PROCSEQ=W6D1B                                                    
         SENSEG NAME=W6INLA11,PARENT=0                                          
         SENSEG NAME=W6INLA21,PARENT=W6INLA11,PROCOPT=GR                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6INLA,PROCOPT=G,KEYLEN=17,POS=S,       *        
               PROCSEQ=W6D1C                                                    
         SENSEG NAME=W6INLA11,PARENT=0                                          
         SENSEG NAME=W6INLA21,PARENT=W6INLA11,PROCOPT=GR                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6PLAA,PROCOPT=GOT,KEYLEN=35,POS=S               
         SENSEG NAME=W6PLAA01,PARENT=0                                          
         SENSEG NAME=W6PLAA11,PARENT=W6PLAA01                                   
*                                                                               
        PSBGEN LANG=COBOL,PSBNAME=W60132                                        
        END                                                                     
