*********************  PSB W6011A   ***************************                 
*                                                                               
*    TRANS TILL PGM W6011500                                                    
         PCB   TYPE=TP,NAME=W6T115X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
DISTRDOC PCB   TYPE=TP,NAME=WZ0420U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
GCERRORN PCB   TYPE=TP,NAME=WZ0440X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* EVENT DB FOR API CALLS                                                        
ATAB     PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=GOT,KEYLEN=80,POS=S                 
         SENSEG NAME=WDR501,PARENT=0                                            
         SENSEG NAME=WDGX0104,PARENT=WDR501                                     
*                                                                               
W6D1ASEQ PCB   TYPE=DB,DBDNAME=W6D1,PROCOPT=GOT,KEYLEN=31,POS=S,       *        
               PROCSEQ=W6D1A                                                    
         SENSEG NAME=W6D101,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W6011A                                       
         END                                                                    
