*                                                                               
         PCB          TYPE=DB,DBDNAME=WDP7,PROCOPT=G,KEYLEN=8,POS=S             
         SENSEG NAME=WDP701,PARENT=0,PROCOPT=GIR                                
*                                                                               
         PCB         TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=06,POS=S           
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
         PCB         TYPE=DB,DBDNAME=WDM5,PROCOPT=G,KEYLEN=20,POS=S             
         SENSEG NAME=WDM501,PARENT=0,PROCOPT=GIR                                
         SENSEG NAME=WDM511,PARENT=WDM501,PROCOPT=GIR                           
         SENSEG NAME=WDM521,PARENT=WDM511,PROCOPT=GIR                           
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W60154                                       
         END                                                                    
