*                                                                               
*        TRANS TILL PGM W6010100 - OMSTARTTRANS                                 
         PCB   TYPE=TP,NAME=W6T101U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*        TRANS TILL PGM W6019100 - UPPFÖLJNINGSTRANS                            
         PCB   TYPE=TP,NAME=W6T191X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*        TRANS TILL PGM W6019700 -  FÖRBEHANDLINGSRAPPORT                       
         PCB   TYPE=TP,NAME=W6T197X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*        TILL DISPATCHER                                                        
         PCB   TYPE=TP,NAME=W0T693X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GIR,KEYLEN=8,POS=S                
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
*        INLEVERANSREGISTRET - W6D1                                             
         PCB   TYPE=DB,DBDNAME=W6INLA,PROCOPT=G,KEYLEN=9,POS=S,        *        
               PROCSEQ=W6D1F                                                    
         SENSEG NAME=W6INLA11,PARENT=0                                          
         SENSEG NAME=W6INLA21,PARENT=W6INLA11,PROCOPT=GR                        
*                                                                               
*        INLEVERANSREGISTRET - W6D1                                             
         PCB   TYPE=DB,DBDNAME=W6INLA,PROCOPT=GOT,KEYLEN=26,POS=S               
         SENSEG NAME=W6INLA01,PARENT=0                                          
         SENSEG NAME=W6INLA11,PARENT=W6INLA01                                   
         SENSEG NAME=W6INLA21,PARENT=W6INLA11                                   
*                                                                               
*        INLEVERANSREGISTRET W6D1 - SEK INDEX W6D1F - BAS                       
         PCB   TYPE=DB,DBDNAME=W6INLG,PROCOPT=GOT,KEYLEN=30,POS=S               
         SENSEG NAME=W6INLG01,PARENT=0                                          
*                                                                               
*        PLACERINGSREGISTRET - W6G1                                             
         PCB   TYPE=DB,DBDNAME=W6PLAA,PROCOPT=GOT,KEYLEN=35,POS=S               
         SENSEG NAME=W6PLAA01,PARENT=0                                          
         SENSEG NAME=W6PLAA11,PARENT=W6PLAA01                                   
*                                                                               
* PCB FÖR SUBPGM W006KOM                                                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLKOMA,PROCOPT=G,KEYLEN=28,POS=S                 
         SENSEG NAME=WLKOMA01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLKOMA11,PARENT=WLKOMA01,PROCOPT=GI                        
*                                                                               
* W6L1 UPPFÖLJNINGSREGISTRET KVALITET                                           
         PCB   TYPE=DB,DBDNAME=W6UPFA,PROCOPT=G,KEYLEN=10,POS=S                 
         SENSEG NAME=W6UPFA01,PARENT=0,PROCOPT=GIR                              
         SENSEG NAME=W6UPFA11,PARENT=W6UPFA01,PROCOPT=GR                        
         SENSEG NAME=W6UPFA12,PARENT=W6UPFA01,PROCOPT=GR                        
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W60101                                       
         END                                                                    
