*                                                                               
*                                                                               
*WDP701 - USERDATABAS                                                           
         PCB    TYPE=DB,DBDNAME=WDP7,PROCOPT=G,KEYLEN=8,POS=S                   
         SENSEG NAME=WDP701,PARENT=0,PROCOPT=GIR                                
*                                                                               
*WDE4A                                                                          
         PCB   TYPE=DB,DBDNAME=WDE4A,PROCOPT=GOT,KEYLEN=23,POS=S                
         SENSEG NAME=WDE4A1,PARENT=0                                            
*                                                                               
*WDE6    ***   KOLLIREGISTER                              ***                   
         PCB   TYPE=DB,DBDNAME=WDE6,PROCOPT=G,KEYLEN=10,POS=S                   
         SENSEG NAME=WDE601,PARENT=0,PROCOPT=GR                                 
         SENSEG NAME=WDE611,PARENT=WDE601,PROCOPT=GR                            
         SENSEG NAME=WDE621,PARENT=WDE611,PROCOPT=GI                            
*                                                                               
*WDE6F                                                                          
         PCB   TYPE=DB,DBDNAME=WDE6F,PROCOPT=GOT,KEYLEN=30,POS=S                
         SENSEG NAME=WDE6F1,PARENT=0                                            
*                                                                               
*WDG7 AUTFAKT-REGISTER   ***                                                    
         PCB   TYPE=DB,DBDNAME=WDG7,PROCOPT=G,KEYLEN=44,POS=S                   
         SENSEG NAME=WDG701,PARENT=0,PROCOPT=GID                                
         SENSEG NAME=WDG717,PARENT=WDG701,PROCOPT=GID                           
         SENSEG NAME=WDG718,PARENT=WDG717,PROCOPT=GID                           
*                                                                               
*WDR601  ***   WDR6 LOGG-REGISTER      *** WLFILA                               
         PCB   TYPE=DB,DBDNAME=WLFILA,PROCOPT=G,KEYLEN=27,POS=S                 
         SENSEG NAME=WLFILA01,PARENT=0,PROCOPT=GI                               
*                                                                               
*WDG2 -  WDGX4322 *** PU. TILL SVENSKA ÅF.                                      
         PCB   TYPE=DB,DBDNAME=WDG2,PROCOPT=G,KEYLEN=30,POS=S                   
         SENSEG NAME=WDG201,PARENT=0                                            
         SENSEG NAME=WDG202,PARENT=WDG201,PROCOPT=GI                            
*                                                                               
*                                                                               
*                                                                               
*- - - PLATSMODULENS BASER                                                      
         PCB   TYPE=DB,DBDNAME=WLXXDM,PROCOPT=GOT,KEYLEN=50,POS=S               
         SENSEG NAME=WLXXDM01,PARENT=0                                          
         SENSEG NAME=WLXXDM11,PARENT=WLXXDM01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXDN,PROCOPT=GOT,KEYLEN=50,POS=S               
         SENSEG NAME=WLXXDN01,PARENT=0                                          
         SENSEG NAME=WLXXDN11,PARENT=WLXXDN01                                   
         SENSEG NAME=WLXXDN21,PARENT=WLXXDN11                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXDP,PROCOPT=G,KEYLEN=50,POS=S                 
         SENSEG NAME=WLXXDP01,PARENT=0,PROCOPT=GIRD                             
         SENSEG NAME=WLXXDP11,PARENT=WLXXDP01,PROCOPT=GIRD                      
         SENSEG NAME=WLXXDP21,PARENT=WLXXDP11,PROCOPT=GIRD                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXDO,PROCOPT=G,KEYLEN=50,POS=S                 
         SENSEG NAME=WLXXDO01,PARENT=0,PROCOPT=GIRD                             
         SENSEG NAME=WLXXDO11,PARENT=WLXXDO01,PROCOPT=GIRD                      
         SENSEG NAME=WLXXDO21,PARENT=WLXXDO11,PROCOPT=GIRD                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE6C,PROCOPT=GOT,KEYLEN=42,POS=S                
         SENSEG NAME=WDE6C1,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLGMTC,PROCOPT=GOT,KEYLEN=11,POS=S               
         SENSEG NAME=WLGMTC01,PARENT=0                                          
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W60176                                       
         END                                                                    
