* ALT-PCB - TRANS TILL PROGRAM W6019100 UPPFÖLJNING/FLAGGOR                     
         PCB   TYPE=TP,NAME=W6T191X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
* DISP-MSG-PCB - FEL/KLAR MEDDELANDE TILL DISPATCHERN                           
         PCB   TYPE=TP,NAME=W0T693X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*        -- USEA-PCB                                                            
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GIR,KEYLEN=08,POS=S               
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
* PCB FÖR W6D1                                                                  
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6INLA,PROCOPT=G,KEYLEN=15,POS=S,       *        
               PROCSEQ=W6D1B                                                    
         SENSEG NAME=W6INLA11,PARENT=0,PROCOPT=GR                               
         SENSEG NAME=W6INLA21,PARENT=W6INLA11,PROCOPT=GID                       
*                                                                               
* UPPFÖLJNINGSREGISTER KVALITET                                                 
         PCB   TYPE=DB,DBDNAME=W6UPFA,PROCOPT=G,KEYLEN=10,POS=S                 
         SENSEG NAME=W6UPFA01,PARENT=0                                          
         SENSEG NAME=W6UPFA11,PARENT=W6UPFA01                                   
         SENSEG NAME=W6UPFA12,PARENT=W6UPFA01                                   
*                                                                               
* PCB FÖR SUBPGM W006KOM                                                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLKOMA,PROCOPT=G,KEYLEN=28,POS=S                 
         SENSEG NAME=WLKOMA01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLKOMA11,PARENT=WLKOMA01,PROCOPT=GI                        
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W60146                                       
         END                                                                    
