* DISP-MSG-PCB - FEL/KLAR MEDDELANDE TILL DISPATCHERN                           
         PCB   TYPE=TP,NAME=W0T693X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=TP,NAME=W6T191X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=TP,NAME=W6T196X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
* INLA4                                                                         
         PCB   TYPE=TP,NAME=W6T197X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*--------PCB FÖR TRANS TILL PROGRAM W6019900 UTSKR. INLÄGGNINGSLISTA            
*        -- ALT-6199-PCB                                                        
         PCB   TYPE=TP,NAME=W6T199X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* SYNQ                                                                          
*        TRANSACTION TO DISTRIBUTION & PRINT                                    
ORDERCRE PCB   TYPE=TP,NAME=WZ0440X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*        -- USEA-PCB                                                            
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GIR,KEYLEN=08,POS=S               
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=9,POS=S                
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
         SENSEG NAME=WLARTC24,PARENT=WLARTC11                                   
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6INLA,PROCOPT=G,KEYLEN=25,POS=S                 
         SENSEG NAME=W6INLA01,PARENT=0,PROCOPT=GR                               
         SENSEG NAME=W6INLA11,PARENT=W6INLA01,PROCOPT=GIR                       
         SENSEG NAME=W6INLA21,PARENT=W6INLA11,PROCOPT=GIR                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6INLA,PROCOPT=GOT,KEYLEN=34,POS=S,     *        
               PROCSEQ=W6D1A                                                    
         SENSEG NAME=W6INLA01,PARENT=0                                          
         SENSEG NAME=W6INLA11,PARENT=W6INLA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6INLB,PROCOPT=GOT,KEYLEN=31,POS=S               
         SENSEG NAME=W6INLB01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6INLA,PROCOPT=GOT,KEYLEN=22,POS=S               
         SENSEG NAME=W6INLA01,PARENT=0                                          
         SENSEG NAME=W6INLA11,PARENT=W6INLA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6INLE,PROCOPT=GOT,KEYLEN=33,POS=S               
         SENSEG NAME=W6INLE01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6D1,PROCOPT=G,KEYLEN=08,POS=S,         *        
               PROCSEQ=W6D1I                                                    
         SENSEG NAME=W6D111,PARENT=0                                            
         SENSEG NAME=W6D121,PARENT=W6D111                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6PLAA,PROCOPT=GOT,KEYLEN=35,POS=S               
         SENSEG NAME=W6PLAA01,PARENT=0                                          
         SENSEG NAME=W6PLAA11,PARENT=W6PLAA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6LASA,PROCOPT=G,KEYLEN=68,POS=S                 
         SENSEG NAME=W6LASA01,PARENT=0                                          
         SENSEG NAME=W6LASA11,PARENT=W6LASA01,PROCOPT=GIR                       
         SENSEG NAME=W6LASA21,PARENT=W6LASA11,PROCOPT=GIR                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6LOPA,PROCOPT=G,KEYLEN=31,POS=S                 
         SENSEG NAME=W6LOPA01,PARENT=0                                          
         SENSEG NAME=W6LOPA11,PARENT=W6LOPA01,PROCOPT=GR                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTS,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG NAME=WLARTS01,PARENT=0                                          
         SENSEG NAME=WLARTS11,PARENT=WLARTS01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDJ1,PROCOPT=GOTP,KEYLEN=45,POS=S,      *        
               PROCSEQ=WDJ1C                                                    
         SENSEG NAME=WDJ111,PARENT=0                                            
         SENSEG NAME=WDJ101,PARENT=WDJ111                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDJ2,PROCOPT=GOT,KEYLEN=7,POS=S,        *        
               PROCSEQ=WDJ2E                                                    
         SENSEG NAME=WDJ211                                                     
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6INLA,PROCOPT=G,KEYLEN=25,POS=S                 
         SENSEG NAME=W6INLA01,PARENT=0,PROCOPT=G                                
         SENSEG NAME=W6INLA11,PARENT=W6INLA01,PROCOPT=G                         
         SENSEG NAME=W6INLA21,PARENT=W6INLA11,PROCOPT=GD                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK9,PROCOPT=GOT,KEYLEN=5,POS=S                  
         SENSEG NAME=WDK901,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDL2,PROCOPT=GOT,KEYLEN=21,POS=S                 
         SENSEG NAME=WDL201,PARENT=0                                            
         SENSEG NAME=WDL211,PARENT=WDL201                                       
         SENSEG NAME=WDL221,PARENT=WDL211                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD9,PROCOPT=GOT,KEYLEN=19,POS=S                 
         SENSEG NAME=WDD901,PARENT=0                                            
         SENSEG NAME=WDD902,PARENT=WDD901                                       
         SENSEG NAME=WDD905,PARENT=WDD902                                       
*                                                                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD8,PROCOPT=G,KEYLEN=22,POS=S                   
         SENSEG NAME=WDD801,PARENT=0                                            
         SENSEG NAME=WDD811,PARENT=WDD801                                       
* PCB FÖR SUBPGM W611STYR                                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6HANB,PROCOPT=GOT,KEYLEN=37,POS=S               
         SENSEG NAME=W6HANB01,PARENT=0                                          
         SENSEG NAME=W6HANB11,PARENT=W6HANB01                                   
         SENSEG NAME=W6HANB12,PARENT=W6HANB01                                   
         SENSEG NAME=W6HANB13,PARENT=W6HANB01                                   
         SENSEG NAME=W6HANB14,PARENT=W6HANB01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6PLAA,PROCOPT=GOT,KEYLEN=35,POS=S               
         SENSEG NAME=W6PLAA01,PARENT=0                                          
         SENSEG NAME=W6PLAA11,PARENT=W6PLAA01                                   
*                                                                               
* PCB FÖR SUBPGM W611PRIO                                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6INLA,PROCOPT=G,KEYLEN=25,POS=S                 
         SENSEG NAME=W6INLA01,PARENT=0                                          
         SENSEG NAME=W6INLA11,PARENT=W6INLA01,PROCOPT=GR                        
         SENSEG NAME=W6INLA21,PARENT=W6INLA11,PROCOPT=GR                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=6,POS=S                
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTM,PROCOPT=GOT,KEYLEN=5,POS=S                
         SENSEG NAME=WLARTM01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLORDQ,PROCOPT=GOT,KEYLEN=40,POS=S               
         SENSEG NAME=WLORDQ01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTS,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG NAME=WLARTS01,PARENT=0                                          
         SENSEG NAME=WLARTS11,PARENT=WLARTS01                                   
*                                                                               
* W6KVAI-PCB  - KONTROLLRAPPORT W6H7C1 INDEX IDLOPNRM                           
         PCB   TYPE=DB,DBDNAME=W6KVAI,PROCOPT=GOT,KEYLEN=18,POS=S               
         SENSEG NAME=W6KVAI01,PARENT=0                                          
*                                                                               
*INLI1-PCB (I-INDEX-BAS)                                                        
         PCB   TYPE=DB,DBDNAME=W6INLJ,PROCOPT=GOT,KEYLEN=27,POS=S               
         SENSEG NAME=W6INLJ01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6KVAE,PROCOPT=GOT,KEYLEN=5,POS=S                
         SENSEG NAME=W6KVAE01,PARENT=0                                          
*                                                                               
* PCB FÖR SUBPGM W006KOM                                                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLKOMA,PROCOPT=G,KEYLEN=28,POS=S                 
         SENSEG NAME=WLKOMA01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLKOMA11,PARENT=WLKOMA01,PROCOPT=GI                        
*                                                                               
* PCB FÖR SUBPGM W426KNTR                                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=06,POS=S               
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6KVAH,PROCOPT=G,KEYLEN=12,POS=S                 
         SENSEG NAME=W6KVAH01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=W6KVAH12,PARENT=W6KVAH01,PROCOPT=GIR                       
         SENSEG NAME=W6KVAH22,PARENT=W6KVAH12,PROCOPT=G                         
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6KVAH,PROCOPT=GOT,KEYLEN=18,POS=S               
         SENSEG NAME=W6KVAH01,PARENT=0                                          
         SENSEG NAME=W6KVAH11,PARENT=W6KVAH01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6KVAE,PROCOPT=GOT,KEYLEN=19,POS=S,     *        
               PROCSEQ=W6H7B                                                    
         SENSEG NAME=W6KVAE01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6LEVA,PROCOPT=GOT,KEYLEN=5,POS=S                
         SENSEG NAME=W6LEVA01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6UPFA,PROCOPT=G,KEYLEN=10,POS=S                 
         SENSEG NAME=W6UPFA01,PARENT=0,PROCOPT=GIR                              
         SENSEG NAME=W6UPFA11,PARENT=W6UPFA01,PROCOPT=GI                        
         SENSEG NAME=W6UPFA12,PARENT=W6UPFA01,PROCOPT=GI                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6PROA,PROCOPT=GOT,KEYLEN=32,POS=S               
         SENSEG NAME=W6PROA01,PARENT=0                                          
         SENSEG NAME=W6PROA11,PARENT=W6PROA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXLA,PROCOPT=G,KEYLEN=40,POS=S                 
         SENSEG NAME=WLXXLA01,PARENT=0,PROCOPT=G                                
         SENSEG NAME=WLXXLA11,PARENT=WLXXLA01,PROCOPT=GI                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6KODA,PROCOPT=G,KEYLEN=31,POS=S                 
         SENSEG NAME=W6KODA01,PARENT=0,PROCOPT=G                                
         SENSEG NAME=W6KODA11,PARENT=W6KODA01,PROCOPT=GI                        
*                                                                               
* PCB:ER FÖR SUBPGM W61154/W27125                                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=G,KEYLEN=19,POS=S                   
         SENSEG NAME=WDK601,PARENT=0,PROCOPT=G                                  
         SENSEG NAME=WDK611,PARENT=WDK601,PROCOPT=GR                            
         SENSEG NAME=WDK621,PARENT=WDK611                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=7,POS=S                    
         SENSEG NAME=WDK701,PARENT=0,PROCOPT=G                                  
         SENSEG NAME=WDK711,PARENT=WDK701,PROCOPT=GR                            
         SENSEG NAME=WDK712,PARENT=WDK701                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR2,PROCOPT=GOT,KEYLEN=31,POS=S                 
         SENSEG NAME=WDR201,PARENT=0                                            
         SENSEG NAME=WDGX2502,PARENT=WDR201                                     
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE3,PROCOPT=G,KEYLEN=14,POS=S                   
         SENSEG NAME=WDE301,PARENT=0,PROCOPT=GIR                                
*                                                                               
*        LÄSNING WDK6 LÄSA ERSATT                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=09,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
*        LÄSNING WDK7 LÄSA (ERSATT)                                             
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK712,PARENT=WDK701                                       
*                                                                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDL6,PROCOPT=GOT,KEYLEN=21,POS=S                 
         SENSEG NAME=WDL601,PARENT=0                                            
         SENSEG NAME=WDL611,PARENT=WDL601                                       
*                                                                               
*        WDD7A1                                                                 
         PCB   TYPE=DB,DBDNAME=WDD7A,PROCOPT=GOT,KEYLEN=12,POS=S                
         SENSEG NAME=WDD7A1,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=4,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB616,PARENT=WDB601                                       
*                                                                               
* FÖR ANROP AV W22222                                                           
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=19,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
         SENSEG NAME=WDK621,PARENT=WDK611                                       
         SENSEG NAME=WDK624,PARENT=WDK611                                       
         SENSEG NAME=WDK626,PARENT=WDK611                                       
         SENSEG NAME=WDK629,PARENT=WDK611                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK712,PARENT=WDK701                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTM,PROCOPT=GOT,KEYLEN=11,POS=S               
         SENSEG NAME=WLARTM01,PARENT=0                                          
         SENSEG NAME=WLARTM11,PARENT=WLARTM01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WL2501,PROCOPT=GOT,KEYLEN=31,POS=S               
         SENSEG NAME=WL250101,PARENT=0                                          
         SENSEG NAME=WL250111,PARENT=WL250101                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=4,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB616,PARENT=WDB601                                       
*                                                                               
* WDD7A1      - ERSÄTTNINGSREGISTER                                             
         PCB   TYPE=DB,DBDNAME=WDD7A,PROCOPT=GOT,KEYLEN=12,POS=S                
         SENSEG NAME=WDD7A1,PARENT=0                                            
*                                                                               
* WDK7 ERSATT                                                                   
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6D2,PROCOPT=GOT,KEYLEN=24,POS=S                 
         SENSEG NAME=W6D201,PARENT=0                                            
         SENSEG NAME=W6D211,PARENT=W6D201                                       
*                                                                               
******** SUBMODULE  W488ORCR SEND SYNQ EVENT    ************                    
*                                                                               
* SYNQ-ATAB-PCB                                                                 
* EVENT DB FOR API CALLS                                                        
ATAB     PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=GOT,KEYLEN=80,POS=S                 
         SENSEG NAME=WDR501,PARENT=0                                            
         SENSEG NAME=WDGX0104,PARENT=WDR501                                     
*                                                                               
*        ORDERDELSKÖN SEKUNDÄWINDEX PRODNR-PLOCKLISTNR                          
         PCB   TYPE=DB,DBDNAME=WDQ3,PROCOPT=GOT,KEYLEN=6,POS=S,        *        
               PROCSEQ=WDQ3D                                                    
         SENSEG NAME=WDQ301,PARENT=0                                            
*                                                                               
        PSBGEN LANG=COBOL,PSBNAME=W60115                                        
        END                                                                     
