*        -- USEA-PCB                                                            
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GIR,KEYLEN=08,POS=S               
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
 PCB           TYPE=DB,DBDNAME=W6HANB,PROCOPT=GOT,KEYLEN=37,POS=S               
 SENSEG NAME=W6HANB01,PARENT=0                                                  
 SENSEG NAME=W6HANB11,PARENT=W6HANB01                                           
 SENSEG NAME=W6HANB12,PARENT=W6HANB01                                           
 SENSEG NAME=W6HANB13,PARENT=W6HANB01                                           
 SENSEG NAME=W6HANB14,PARENT=W6HANB01                                           
*                                                                               
 PCB           TYPE=DB,DBDNAME=W6PLAA,PROCOPT=GOT,KEYLEN=35,POS=S               
 SENSEG NAME=W6PLAA01,PARENT=0                                                  
 SENSEG NAME=W6PLAA11,PARENT=W6PLAA01                                           
*                                                                               
 PCB           TYPE=DB,DBDNAME=WDP3,PROCOPT=GOT,KEYLEN=10,POS=S                 
 SENSEG NAME=WDP301,PARENT=0                                                    
 SENSEG NAME=WDP311,PARENT=WDP301                                               
*                                                                               
 PCB           TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=06,POS=S               
 SENSEG NAME=WLARTC01,PARENT=0                                                  
 SENSEG NAME=WLARTC11,PARENT=WLARTC01                                           
*                                                                               
 PCB           TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=08,POS=S                 
 SENSEG NAME=WDK701,PARENT=0                                                    
 SENSEG NAME=WDK711,PARENT=WDK701                                               
 SENSEG NAME=WDK722,PARENT=WDK711                                               
 SENSEG NAME=WDK712,PARENT=WDK701                                               
*                                                                               
 PCB   TYPE=DB,DBDNAME=WDP3A,PROCOPT=GOT,KEYLEN=22,POS=S                        
 SENSEG NAME=WDP3A1,PARENT=0                                                    
*                                                                               
 PCB   TYPE=DB,DBDNAME=WDP3B,PROCOPT=GOT,KEYLEN=20,POS=S                        
 SENSEG NAME=WDP3B1,PARENT=0                                                    
*                                                                               
 PCB   TYPE=DB,DBDNAME=WDP3C,PROCOPT=GOT,KEYLEN=16,POS=S                        
 SENSEG NAME=WDP3C1,PARENT=0                                                    
*                                                                               
 PSBGEN LANG=COBOL,PSBNAME=W60108                                               
 END                                                                            
