*                                                                               
*        -- USEA-PCB                                                            
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GIR,KEYLEN=08,POS=S               
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6 LEV                                              
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
*        PCB'ER FÖR SUBPGM W611REG                                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6INLA,PROCOPT=GOT,KEYLEN=34,POS=S,     *        
               PROCSEQ=W6D1A                                                    
         SENSEG NAME=W6INLA01,PARENT=0                                          
         SENSEG NAME=W6INLA11,PARENT=W6INLA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6INLA,PROCOPT=G,KEYLEN=25,POS=S                 
         SENSEG NAME=W6INLA01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=W6INLA11,PARENT=W6INLA01,PROCOPT=GI                        
         SENSEG NAME=W6INLA21,PARENT=W6INLA11,PROCOPT=I                         
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6INLA,PROCOPT=G,KEYLEN=25,POS=S                 
         SENSEG NAME=W6INLA01,PARENT=0,PROCOPT=GRD                              
         SENSEG NAME=W6INLA11,PARENT=W6INLA01,PROCOPT=GRD                       
         SENSEG NAME=W6INLA21,PARENT=W6INLA11,PROCOPT=GD                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLLEVA,PROCOPT=GOT,KEYLEN=5,POS=S                
         SENSEG NAME=WLLEVA01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=6,POS=S                
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=8,POS=S,      *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD9,PROCOPT=GOT,KEYLEN=19,POS=S                 
         SENSEG NAME=WDD901,PARENT=0                                            
         SENSEG NAME=WDD902,PARENT=WDD901                                       
         SENSEG NAME=WDD905,PARENT=WDD902                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=20,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK712,PARENT=WDK701                                       
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK724,PARENT=WDK711                                       
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W60113                                       
         END                                                                    
