*                                                                               
* 6191-ALT1-PCB UPPFÖLJNING                                                     
         PCB   TYPE=TP,NAME=W6T191X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* 6194-ALT2-PCB FLAGGOR                                                         
         PCB   TYPE=TP,NAME=W6T194X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* 6195-ALT3-PCB ETIKETTER                                                       
         PCB   TYPE=TP,NAME=W6T195X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* 6197-ALT4-PCB FÖRBEHANDLINGSRAPPORT                                           
         PCB   TYPE=TP,NAME=W6T197X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* 6202-ALT5-PCB KVALITE                                                         
         PCB   TYPE=TP,NAME=W6W202T,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* DISP-MSG-PCB - FEL/KLAR MEDDELANDE TILL DISPATCHERN                           
         PCB   TYPE=TP,NAME=W0T693X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* USEA                                                                          
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GIR,KEYLEN=08,POS=S               
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
* W6D1 INLEVERANSREGISTER                                                       
         PCB   TYPE=DB,DBDNAME=W6INLA,PROCOPT=G,KEYLEN=25,POS=S                 
         SENSEG NAME=W6INLA01,PARENT=0                                          
         SENSEG NAME=W6INLA11,PARENT=W6INLA01                                   
         SENSEG NAME=W6INLA21,PARENT=W6INLA11,PROCOPT=GR                        
*                                                                               
* W6D1 INLEVERANSREGISTER SEK INDX                                              
         PCB   TYPE=DB,DBDNAME=W6INLA,PROCOPT=G,KEYLEN=08,POS=S,       *        
               PROCSEQ=W6D1B                                                    
         SENSEG NAME=W6INLA11,PARENT=0                                          
         SENSEG NAME=W6INLA21,PARENT=W6INLA11,PROCOPT=GIRD                      
*                                                                               
* W6D1 INLEVERANSREGISTER SEK INDX BAS                                          
         PCB   TYPE=DB,DBDNAME=W6INLC,PROCOPT=GOT,KEYLEN=25,POS=S               
         SENSEG NAME=W6INLC01,PARENT=0                                          
*                                                                               
* W6G1 PLACERINGSREGISTER                                                       
         PCB   TYPE=DB,DBDNAME=W6PLAA,PROCOPT=GOT,KEYLEN=35,POS=S               
         SENSEG NAME=W6PLAA01,PARENT=0                                          
         SENSEG NAME=W6PLAA11,PARENT=W6PLAA01                                   
*                                                                               
* W6G1 LÖPNUMMEWREGISTER                                                        
         PCB   TYPE=DB,DBDNAME=W6LOPA,PROCOPT=G,KEYLEN=35,POS=S                 
         SENSEG NAME=W6LOPA01,PARENT=0,PROCOPT=G                                
         SENSEG NAME=W6LOPA11,PARENT=W6LOPA01,PROCOPT=GR                        
*                                                                               
* W6H7 KONTROLLRAPPORTREGISTER SEK INDX                                         
         PCB   TYPE=DB,DBDNAME=W6KVAE,PROCOPT=G,KEYLEN=13,POS=S,       *        
               PROCSEQ=W6H7C                                                    
         SENSEG NAME=W6KVAE01,PARENT=0,PROCOPT=GR                               
*                                                                               
* W6H7 KONTROLLRAPPORTREGISTER SEK INDX                                         
         PCB   TYPE=DB,DBDNAME=W6KVAE,PROCOPT=G,KEYLEN=19,POS=S,       *        
               PROCSEQ=W6H7B                                                    
         SENSEG NAME=W6KVAE01,PARENT=0,PROCOPT=GR                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=06,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
*                                                                               
*PCB'ER FÖR W611PMRK                                                            
*                                                                               
* PMRK-INLASEQ1-PCB                                                             
         PCB   TYPE=DB,DBDNAME=W6INLA,PROCOPT=G,KEYLEN=08,POS=S,       *        
               PROCSEQ=W6D1B                                                    
         SENSEG NAME=W6INLA11,PARENT=0                                          
         SENSEG NAME=W6INLA21,PARENT=W6INLA11,PROCOPT=GR                        
*                                                                               
* PMRK-INLASEQ2-PCB                                                             
         PCB   TYPE=DB,DBDNAME=W6INLA,PROCOPT=G,KEYLEN=17,POS=S,       *        
               PROCSEQ=W6D1C                                                    
         SENSEG NAME=W6INLA11,PARENT=0                                          
         SENSEG NAME=W6INLA21,PARENT=W6INLA11,PROCOPT=GR                        
*                                                                               
* PMRK-PLAA-PCB                                                                 
         PCB   TYPE=DB,DBDNAME=W6PLAA,PROCOPT=GOT,KEYLEN=35,POS=S               
         SENSEG NAME=W6PLAA01,PARENT=0                                          
         SENSEG NAME=W6PLAA11,PARENT=W6PLAA01                                   
*                                                                               
* PCB FÖR W006KOM                                                               
*                                                                               
* KOM-KOMA-PCB                                                                  
         PCB   TYPE=DB,DBDNAME=WLKOMA,PROCOPT=G,KEYLEN=28,POS=S                 
         SENSEG NAME=WLKOMA01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLKOMA11,PARENT=WLKOMA01,PROCOPT=GI                        
*                                                                               
* PCB FÖR W611STYR                                                              
*                                                                               
* STYR-HANB-PCB                                                                 
         PCB   TYPE=DB,DBDNAME=W6HANB,PROCOPT=GOT,KEYLEN=37,POS=S               
         SENSEG NAME=W6HANB01,PARENT=0                                          
         SENSEG NAME=W6HANB11,PARENT=W6HANB01                                   
         SENSEG NAME=W6HANB12,PARENT=W6HANB01                                   
         SENSEG NAME=W6HANB13,PARENT=W6HANB01                                   
         SENSEG NAME=W6HANB14,PARENT=W6HANB01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6PLAA,PROCOPT=GOT,KEYLEN=35,POS=S               
         SENSEG NAME=W6PLAA01,PARENT=0                                          
         SENSEG NAME=W6PLAA11,PARENT=W6PLAA01                                   
*                                                                               
* W6L1 UPPFÖLJNINGSREGISTRET KVALITET                                           
         PCB   TYPE=DB,DBDNAME=W6UPFA,PROCOPT=G,KEYLEN=10,POS=S                 
         SENSEG NAME=W6UPFA01,PARENT=0,PROCOPT=GIR                              
         SENSEG NAME=W6UPFA11,PARENT=W6UPFA01,PROCOPT=GR                        
         SENSEG NAME=W6UPFA12,PARENT=W6UPFA01,PROCOPT=GR                        
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W60136                                       
         END                                                                    
