*                                                                               
         PCB   TYPE=TP,NAME=W0T693X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
MQASYNC  PCB   TYPE=TP,NAME=WZ0431X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
        PCB   TYPE=DB,DBDNAME=WLINLE,PROCOPT=G,KEYLEN=21,POS=S                  
        SENSEG NAME=WLINLE01,PARENT=0,PROCOPT=GI                                
        SENSEG NAME=WLINLE11,PARENT=WLINLE01,PROCOPT=GI                         
        SENSEG NAME=WLINLE22,PARENT=WLINLE11,PROCOPT=GI                         
*                                                                               
        PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=G,KEYLEN=19,POS=S                  
        SENSEG NAME=WLARTC01,PARENT=0                                           
        SENSEG NAME=WLARTC11,PARENT=WLARTC01,PROCOPT=GR                         
        SENSEG NAME=WLARTC21,PARENT=WLARTC11,PROCOPT=GR                         
        SENSEG NAME=WLARTC23,PARENT=WLARTC11,PROCOPT=G                          
*                                                                               
        PCB   TYPE=DB,DBDNAME=WLZZAC,PROCOPT=G,KEYLEN=18,POS=S                  
        SENSEG NAME=WLZZAC01,PARENT=0,PROCOPT=GI                                
*                                                                               
        PCB   TYPE=DB,DBDNAME=WLINLB,PROCOPT=G,KEYLEN=25,POS=S                  
        SENSEG NAME=WLINLB01,PARENT=0                                           
        SENSEG NAME=WLINLB11,PARENT=WLINLB01,PROCOPT=GR                         
        SENSEG NAME=WLINLB23,PARENT=WLINLB11,PROCOPT=GR                         
        SENSEG NAME=WLINLB31,PARENT=WLINLB23,PROCOPT=I                          
        SENSEG NAME=WLINLB32,PARENT=WLINLB23                                    
        SENSEG NAME=WLINLB24,PARENT=WLINLB11,PROCOPT=GRD                        
*                                                                               
        PCB   TYPE=DB,DBDNAME=W6LOPA,PROCOPT=G,KEYLEN=30,POS=S                  
        SENSEG NAME=W6LOPA01,PARENT=0                                           
        SENSEG NAME=W6LOPA11,PARENT=W6LOPA01,PROCOPT=GR                         
*                                                                               
* WDK7 ARTIKELREGISTER DC                                                       
        PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=07,POS=S                    
        SENSEG NAME=WDK701,PARENT=0,PROCOPT=GI                                  
        SENSEG NAME=WDK711,PARENT=WDK701,PROCOPT=GIR                            
        SENSEG NAME=WDK712,PARENT=WDK701,PROCOPT=GI                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=23,POS=S                   
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK724,PARENT=WDK711,PROCOPT=GR                            
         SENSEG NAME=WDK728,PARENT=WDK711,PROCOPT=GRI                           
         SENSEG NAME=WDK712,PARENT=WDK701,PROCOPT=GR                            
*                                                                               
        PCB   TYPE=DB,DBDNAME=WLINLC,PROCOPT=G,KEYLEN=21,POS=S                  
        SENSEG NAME=WLINLC01,PARENT=0,PROCOPT=GI                                
        SENSEG NAME=WLINLC11,PARENT=WLINLC01,PROCOPT=GI                         
*                                                                               
        PCB   TYPE=DB,DBDNAME=WLFILA,PROCOPT=G,KEYLEN=27,POS=S                  
        SENSEG NAME=WLFILA01,PARENT=0,PROCOPT=GI                                
*                                                                               
*                                                                               
        PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GIRD,KEYLEN=08,POS=S               
        SENSEG NAME=WLUSEA01,PARENT=0                                           
*                                                                               
* 4505-PCB  - RO-TÄCKNING                                                       
         PCB   TYPE=DB,DBDNAME=WL4505,PROCOPT=G,KEYLEN=35,POS=S                 
         SENSEG NAME=WL450501,PARENT=0                                          
         SENSEG NAME=WL450511,PARENT=WL450501,PROCOPT=I                         
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLLOGA,PROCOPT=G,KEYLEN=20,POS=S                 
         SENSEG NAME=WLLOGA01,PARENT=0,PROCOPT=GI                               
*                                                                               
* FILB-PCB  - EKOTRANSAR WDR8                                                   
         PCB   TYPE=DB,DBDNAME=WLFILB,PROCOPT=G,KEYLEN=27,POS=S                 
         SENSEG NAME=WLFILB01,PARENT=0,PROCOPT=GI                               
*                                                                               
* SAPA-PCB WDR9                                                                 
         PCB    TYPE=DB,DBDNAME=WLSAPA,PROCOPT=GI,KEYLEN=31,POS=S               
         SENSEG NAME=WLSAPA01,PARENT=0                                          
*                                                                               
* WDL7 ORDERINGÅNGSREGISTER SDC                                                 
         PCB   TYPE=DB,DBDNAME=WLOIGA,PROCOPT=G,KEYLEN=25,POS=S                 
         SENSEG NAME=WLOIGA01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLOIGA11,PARENT=WLOIGA01,PROCOPT=GI                        
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=3,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB617,PARENT=WDB601                                       
*                                                                               
* LEV                                                                           
         PCB   TYPE=DB,DBDNAME=WDF1,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDF101,PARENT=0                                            
         SENSEG NAME=WDF102,PARENT=WDF101                                       
*                                                                               
* WDG2-PCB/9305-PCB                                                             
        PCB   TYPE=DB,DBDNAME=WDG2,PROCOPT=GOT,KEYLEN=37,POS=S                  
        SENSEG NAME=WDG201,PARENT=0                                             
        SENSEG NAME=WDGX9306,PARENT=WDG201                                      
        SENSEG NAME=WDGX9308,PARENT=WDGX9306                                    
*                                                                               
*WDL3                                                                           
         PCB   TYPE=DB,DBDNAME=WDL3,PROCOPT=G,KEYLEN=20,POS=S                   
         SENSEG NAME=WDL301,PARENT=0,PROCOPT=GI                                 
*                                                                               
* WDL6-PCB (WDL623)                                                             
         PCB   TYPE=DB,DBDNAME=WDL6,PROCOPT=G,KEYLEN=21,POS=S                   
         SENSEG NAME=WDL601,PARENT=0                                            
         SENSEG NAME=WDL611,PARENT=WDL601                                       
         SENSEG NAME=WDL623,PARENT=WDL611,PROCOPT=GIR                           
*                                                                               
        PSBGEN LANG=COBOL,PSBNAME=W6011C                                        
        END                                                                     
