*                                                                               
ATAB     PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=GOT,KEYLEN=80,POS=S,LIST=NO         
         SENSEG NAME=WDR501,PARENT=0                                            
         SENSEG NAME=WDGX0104,PARENT=WDR501                                     
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GIR,KEYLEN=8,POS=S                
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=6,POS=S                
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=8,POS=S,      *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLETIA,PROCOPT=GOT,KEYLEN=8,POS=S                
         SENSEG NAME=WLETIA01,PARENT=0                                          
         SENSEG NAME=WLETIA11,PARENT=WLETIA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLINLE,PROCOPT=GOT,KEYLEN=21,POS=S               
         SENSEG NAME=WLINLE01,PARENT=0                                          
         SENSEG NAME=WLINLE11,PARENT=WLINLE01                                   
         SENSEG NAME=WLINLE21,PARENT=WLINLE11                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W60168                                       
         END                                                                    
