*********************  PSB W60123                                               
*                                                                               
*ALT1-PCB --- TRANS TILL PROGRAM W6019100 UPPFÖLJNING/FLAGGOR                   
         PCB   TYPE=TP,NAME=W6T191X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*PLAA-PCB                                                                       
         PCB   TYPE=DB,DBDNAME=W6PLAA,PROCOPT=GOT,KEYLEN=35,POS=S               
         SENSEG NAME=W6PLAA01,PARENT=0                                          
         SENSEG NAME=W6PLAA11,PARENT=W6PLAA01                                   
*                                                                               
*INLC-PMRK-PCB (C-INDEX)                                                        
         PCB   TYPE=DB,DBDNAME=W6INLA,PROCOPT=G,KEYLEN=17,POS=S,       *        
               PROCSEQ=W6D1C                                                    
         SENSEG NAME=W6INLA11,PARENT=0                                          
         SENSEG NAME=W6INLA21,PARENT=W6INLA11,PROCOPT=GR                        
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W6019C                                       
         END                                                                    
