*                                                                               
*        TRANS TILL PGM W6019100 - UPPFÖLJNINGSTRANS                            
         PCB   TYPE=TP,NAME=W6T191X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*        TILL DISPATCHER                                                        
         PCB   TYPE=TP,NAME=W0T693X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*        -- USEA-PCB                                                            
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GOT,KEYLEN=08,POS=S               
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
*        INLEVERANSREGISTRET - W6D1                                             
         PCB   TYPE=DB,DBDNAME=W6INLA,PROCOPT=G,KEYLEN=17,POS=S,       *        
               PROCSEQ=W6D1C                                                    
         SENSEG NAME=W6INLA11,PARENT=0                                          
         SENSEG NAME=W6INLA21,PARENT=W6INLA11,PROCOPT=GIR                       
*                                                                               
*        INLEVERANSREGISTRET - W6INLD01                                         
         PCB   TYPE=DB,DBDNAME=W6INLD,PROCOPT=GOT,KEYLEN=39,POS=S               
         SENSEG NAME=W6INLD01,PARENT=0                                          
*                                                                               
*        PLACERINGSREGISTRET - W6G1                                             
         PCB   TYPE=DB,DBDNAME=W6PLAA,PROCOPT=GOT,KEYLEN=35,POS=S               
         SENSEG NAME=W6PLAA01,PARENT=0                                          
         SENSEG NAME=W6PLAA11,PARENT=W6PLAA01                                   
*                                                                               
*        SALDOREGISTER BUFFERTLAGER - WDD8                                      
         PCB   TYPE=DB,DBDNAME=WLARTD,PROCOPT=G,KEYLEN=22,POS=S                 
         SENSEG NAME=WLARTD01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLARTD11,PARENT=WLARTD01,PROCOPT=GI                        
*                                                                               
*        UPPFÖLJNINGSREGISTER KVALITET                                          
         PCB   TYPE=DB,DBDNAME=W6UPFA,PROCOPT=G,KEYLEN=10,POS=S                 
         SENSEG NAME=W6UPFA01,PARENT=0                                          
         SENSEG NAME=W6UPFA11,PARENT=W6UPFA01                                   
         SENSEG NAME=W6UPFA12,PARENT=W6UPFA01                                   
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
*        PCB FÖR SUBPGM W611STYR                                                
         PCB   TYPE=DB,DBDNAME=W6HANB,PROCOPT=GOT,KEYLEN=37,POS=S               
         SENSEG NAME=W6HANB01,PARENT=0                                          
         SENSEG NAME=W6HANB11,PARENT=W6HANB01                                   
         SENSEG NAME=W6HANB12,PARENT=W6HANB01                                   
         SENSEG NAME=W6HANB13,PARENT=W6HANB01                                   
         SENSEG NAME=W6HANB14,PARENT=W6HANB01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6PLAA,PROCOPT=GOT,KEYLEN=35,POS=S               
         SENSEG NAME=W6PLAA01,PARENT=0                                          
         SENSEG NAME=W6PLAA11,PARENT=W6PLAA01                                   
*                                                                               
*        PCB FÖR SUBPGM W611PMRK                                                
         PCB   TYPE=DB,DBDNAME=W6INLA,PROCOPT=G,KEYLEN=14,POS=S,       *        
               PROCSEQ=W6D1B                                                    
         SENSEG NAME=W6INLA11,PARENT=0                                          
         SENSEG NAME=W6INLA21,PARENT=W6INLA11,PROCOPT=GR                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6INLA,PROCOPT=G,KEYLEN=18,POS=S,       *        
               PROCSEQ=W6D1C                                                    
         SENSEG NAME=W6INLA11,PARENT=0                                          
         SENSEG NAME=W6INLA21,PARENT=W6INLA11,PROCOPT=GR                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6PLAA,PROCOPT=GOT,KEYLEN=35,POS=S               
         SENSEG NAME=W6PLAA01,PARENT=0                                          
         SENSEG NAME=W6PLAA11,PARENT=W6PLAA01                                   
*                                                                               
*        PCB FÖR SUBPGM W006KOM                                                 
         PCB   TYPE=DB,DBDNAME=WLKOMA,PROCOPT=G,KEYLEN=28,POS=S                 
         SENSEG NAME=WLKOMA01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLKOMA11,PARENT=WLKOMA01,PROCOPT=GI                        
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W60143                                       
         END                                                                    
