*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GIR,KEYLEN=8,POS=S                
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLETIA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLETIA01,PARENT=0,PROCOPT=GR                               
         SENSEG NAME=WLETIA11,PARENT=WLETIA01,PROCOPT=GIRD                      
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W60167                                       
         END                                                                    
