*                                                                               
         PCB   TYPE=TP,NAME=W0T693X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
        PCB   TYPE=DB,DBDNAME=WLINLE,PROCOPT=G,KEYLEN=21,POS=S                  
        SENSEG NAME=WLINLE01,PARENT=0,PROCOPT=GI                                
        SENSEG NAME=WLINLE11,PARENT=WLINLE01,PROCOPT=GI                         
        SENSEG NAME=WLINLE23,PARENT=WLINLE11,PROCOPT=GI                         
*                                                                               
        PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=G,KEYLEN=06,POS=S                  
        SENSEG NAME=WLARTC01,PARENT=0                                           
        SENSEG NAME=WLARTC11,PARENT=WLARTC01,PROCOPT=GR                         
*                                                                               
        PCB   TYPE=DB,DBDNAME=WLZZAC,PROCOPT=G,KEYLEN=18,POS=S                  
        SENSEG NAME=WLZZAC01,PARENT=0,PROCOPT=GI                                
*                                                                               
        PCB   TYPE=DB,DBDNAME=WLINLB,PROCOPT=G,KEYLEN=12,POS=S                  
        SENSEG NAME=WLINLB01,PARENT=0                                           
        SENSEG NAME=WLINLB11,PARENT=WLINLB01,PROCOPT=GR                         
*                                                                               
        PCB   TYPE=DB,DBDNAME=W6LOPA,PROCOPT=G,KEYLEN=30,POS=S                  
        SENSEG NAME=W6LOPA01,PARENT=0                                           
        SENSEG NAME=W6LOPA11,PARENT=W6LOPA01,PROCOPT=GR                         
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLLOGA,PROCOPT=G,KEYLEN=20,POS=S                 
         SENSEG NAME=WLLOGA01,PARENT=0,PROCOPT=GI                               
*                                                                               
* WDR8-PCB                                                                      
         PCB    TYPE=DB,DBDNAME=WDR8,PROCOPT=GI,KEYLEN=31,POS=S                 
         SENSEG NAME=WDR801,PARENT=0                                            
*                                                                               
* SAPA-PCB WDR9                                                                 
         PCB    TYPE=DB,DBDNAME=WLSAPA,PROCOPT=GI,KEYLEN=31,POS=S               
         SENSEG NAME=WLSAPA01,PARENT=0                                          
*                                                                               
* WDA9, BYTES - UPPFÖLJNINGSREGISTER                                            
         PCB   TYPE=DB,DBDNAME=WDA9,PROCOPT=G,KEYLEN=08,POS=S                   
         SENSEG NAME=WDA901,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDA911,PARENT=WDA901,PROCOPT=GIR                           
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=10,POS=S,       *        
               PROCSEQ=WDB2B                                                    
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
        PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=20,POS=S                    
        SENSEG NAME=WDK701,PARENT=0                                             
        SENSEG NAME=WDK711,PARENT=WDK701,PROCOPT=GR                             
        SENSEG NAME=WDK724,PARENT=WDK711,PROCOPT=G                              
*                                                                               
        PCB   TYPE=DB,DBDNAME=WDL6,PROCOPT=G,KEYLEN=21,POS=S                    
        SENSEG NAME=WDL601,PARENT=0,PROCOPT=GI                                  
        SENSEG NAME=WDL611,PARENT=WDL601,PROCOPT=GI                             
*                                                                               
        PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=3,POS=S                   
        SENSEG NAME=WDB601,PARENT=0                                             
        SENSEG NAME=WDB617,PARENT=WDB601                                        
*W510AVG                                                                        
        PCB   TYPE=DB,DBDNAME=WDG2,PROCOPT=GOT,KEYLEN=37,POS=S                  
        SENSEG NAME=WDG201,PARENT=0                                             
        SENSEG NAME=WDGX9306,PARENT=WDG201                                      
        SENSEG NAME=WDGX9308,PARENT=WDGX9306                                    
*                                                                               
        PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=8,POS=S                   
        SENSEG NAME=WDB601,PARENT=0                                             
        SENSEG NAME=WDB617,PARENT=WDB601                                        
        SENSEG NAME=WDB621,PARENT=WDB617                                        
        SENSEG NAME=WDB622,PARENT=WDB617                                        
***                                                                             
* W6H7-PCB                                                                      
        PCB   TYPE=DB,DBDNAME=W6H7,PROCOPT=G,KEYLEN=6,POS=S                     
        SENSEG NAME=W6H701,PARENT=0,PROCOPT=G                                   
        SENSEG NAME=W6H712,PARENT=W6H701,PROCOPT=G                              
        SENSEG NAME=W6H721,PARENT=W6H712,PROCOPT=G                              
*                                                                               
* WDF1 LEVERANTÖRSREGISTER                                                      
        PCB   TYPE=DB,DBDNAME=WLLEVA,PROCOPT=GOT,KEYLEN=7,POS=S                 
        SENSEG NAME=WLLEVA01,PARENT=0                                           
        SENSEG NAME=WLLEVA11,PARENT=WLLEVA01                                    
*                                                                               
* WDG2-PCB/9305-PCB                                                             
        PCB   TYPE=DB,DBDNAME=WDG2,PROCOPT=GOT,KEYLEN=37,POS=S                  
        SENSEG NAME=WDG201,PARENT=0                                             
        SENSEG NAME=WDGX9306,PARENT=WDG201                                      
        SENSEG NAME=WDGX9308,PARENT=WDGX9306                                    
*                                                                               
        PSBGEN LANG=COBOL,PSBNAME=W6011D                                        
        END                                                                     
