*                                                                               
*        ALT-PCB, (PCB FÖR P-TO-P-SW)                                           
         PCB   TYPE=TP,NAME=W6T18AX,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB    TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                 
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD1,PROCOPT=G,KEYLEN=9,POS=S                    
         SENSEG NAME=WDD101,PARENT=0,PROCOPT=GIRD                               
         SENSEG NAME=WDD111,PARENT=WDD101,PROCOPT=GIRD                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD1A,PROCOPT=GOT,KEYLEN=9,POS=S                 
         SENSEG NAME=WDD1A1,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD1,PROCOPT=GOT,KEYLEN=9,POS=S,        *        
               PROCSEQ=WDD1A                                                    
         SENSEG NAME=WDD101,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDT3,PROCOPT=GOT,KEYLEN=20,POS=S                 
         SENSEG NAME=WDT301,PARENT=0                                            
         SENSEG NAME=WDT311,PARENT=WDT301                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR2,PROCOPT=G,KEYLEN=31,POS=S                   
         SENSEG NAME=WDR201,PARENT=0,PROCOPT=G                                  
         SENSEG NAME=WDGX6312,PARENT=WDR201,PROCOPT=GR                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDP3,PROCOPT=GOT,KEYLEN=10,POS=S                 
         SENSEG NAME=WDP301,PARENT=0                                            
         SENSEG NAME=WDP311,PARENT=WDP301                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD1B,PROCOPT=GOT,KEYLEN=9,POS=S                 
         SENSEG NAME=WDD1B1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W60183                                       
         END                                                                    
