*                                                                               
*                                                                               
*        ALT-PCB FÖR PRINTERN                                                   
         PCB   TYPE=TP,LTERM=,ALTRESP=NO,SAMETRM=NO,                   *        
               MODIFY=YES,EXPRESS=NO                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDP7,PROCOPT=G,KEYLEN=8,POS=S                    
         SENSEG NAME=WDP701,PARENT=0,PROCOPT=GIR                                
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDM5,PROCOPT=GIRD,KEYLEN=20,POS=S                
         SENSEG NAME=WDM501,PARENT=0                                            
         SENSEG NAME=WDM511,PARENT=WDM501                                       
         SENSEG NAME=WDM521,PARENT=WDM511                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDM5,PROCOPT=GIR,KEYLEN=20,POS=S                 
         SENSEG NAME=WDM501,PARENT=0                                            
         SENSEG NAME=WDM511,PARENT=WDM501                                       
         SENSEG NAME=WDM521,PARENT=WDM511                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDM9,PROCOPT=GIR,KEYLEN=19,POS=S                 
         SENSEG NAME=WDM901,PARENT=0                                            
         SENSEG NAME=WDM911,PARENT=WDM901                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=06,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6G1,PROCOPT=G,KEYLEN=31,POS=S                   
         SENSEG NAME=W6G101,PARENT=0                                            
         SENSEG NAME=W6G110,PARENT=W6G101,PROCOPT=GR                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W60152                                       
         END                                                                    
