*                                                                               
         PCB   TYPE=DB,DBDNAME=W6D1E,PROCOPT=GOTP,KEYLEN=125,POS=S              
         SENSEG NAME=W6D1E1,PARENT=0                                            
*                                                                               
        PSBGEN LANG=COBOL,PSBNAME=W60134                                        
        END                                                                     
