*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GIR,KEYLEN=8,POS=S                
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=5,POS=S                
         SENSEG NAME=WLARTC01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=8,POS=S,      *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLETIA,PROCOPT=G,KEYLEN=5,POS=S                  
         SENSEG NAME=WLETIA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W60166                                       
         END                                                                    
