*********************  PSB W60123                                               
*                                                                               
*ALT1-PCB --- TRANS TILL PROGRAM W6019100 UPPFÖLJNING                           
         PCB   TYPE=TP,NAME=W6T191X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*ALT2-PCB --- TRANS TILL PROGRAM W6019400 FLAGGOR                               
         PCB   TYPE=TP,NAME=W6T194X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*ALT3-PCB --- TRANS TILL PROGRAM W6019500 ETIKETTER                             
         PCB   TYPE=TP,NAME=W6T195X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*                                                                               
*USEA-PCB                                                                       
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GIR,KEYLEN=08,POS=S               
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
*INLA-PCB                                                                       
         PCB   TYPE=DB,DBDNAME=W6INLA,PROCOPT=G,KEYLEN=27,POS=S                 
         SENSEG NAME=W6INLA01,PARENT=0                                          
         SENSEG NAME=W6INLA11,PARENT=W6INLA01,PROCOPT=GR                        
         SENSEG NAME=W6INLA21,PARENT=W6INLA11,PROCOPT=GR                        
*                                                                               
*INLB1-PCB (B-INDEX-BAS)                                                        
         PCB   TYPE=DB,DBDNAME=W6INLC,PROCOPT=G,KEYLEN=27,POS=S                 
         SENSEG NAME=W6INLC01,PARENT=0                                          
*                                                                               
*INLB-PCB (B-INDEX)                                                             
         PCB   TYPE=DB,DBDNAME=W6INLA,PROCOPT=G,KEYLEN=10,POS=S,       *        
               PROCSEQ=W6D1B                                                    
         SENSEG NAME=W6INLA11,PARENT=0                                          
         SENSEG NAME=W6INLA21,PARENT=W6INLA11,PROCOPT=GR                        
*                                                                               
*INLH1-PCB (H-INDEX-BAS)                                                        
         PCB   TYPE=DB,DBDNAME=W6INLI,PROCOPT=G,KEYLEN=27,POS=S                 
         SENSEG NAME=W6INLI01,PARENT=0                                          
*                                                                               
*LOPA-PCB                                                                       
         PCB   TYPE=DB,DBDNAME=W6LOPA,PROCOPT=G,KEYLEN=35,POS=S                 
         SENSEG NAME=W6LOPA01,PARENT=0                                          
         SENSEG NAME=W6LOPA11,PARENT=W6LOPA01,PROCOPT=GR                        
*                                                                               
*PLAA-PCB                                                                       
         PCB   TYPE=DB,DBDNAME=W6PLAA,PROCOPT=GOT,KEYLEN=35,POS=S               
         SENSEG NAME=W6PLAA01,PARENT=0                                          
         SENSEG NAME=W6PLAA11,PARENT=W6PLAA01                                   
*                                                                               
*****************************                                                   
**** PSB:ER FOR W611PMRK ****                                                   
*****************************                                                   
*                                                                               
*INLB-PMRK-PCB (B-INDEX)                                                        
         PCB   TYPE=DB,DBDNAME=W6INLA,PROCOPT=G,KEYLEN=10,POS=S,       *        
               PROCSEQ=W6D1B                                                    
         SENSEG NAME=W6INLA11,PARENT=0                                          
         SENSEG NAME=W6INLA21,PARENT=W6INLA11,PROCOPT=GR                        
*                                                                               
*INLC-PMRK-PCB (C-INDEX)                                                        
         PCB   TYPE=DB,DBDNAME=W6INLA,PROCOPT=G,KEYLEN=17,POS=S,       *        
               PROCSEQ=W6D1C                                                    
         SENSEG NAME=W6INLA11,PARENT=0                                          
         SENSEG NAME=W6INLA21,PARENT=W6INLA11,PROCOPT=GR                        
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
* WDD3-PCB                                                                      
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=8,POS=S,      *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W60123                                       
         END                                                                    
