* DISP-MSG-PCB - FEL/KLAR MEDDELANDE TILL DISPATCHERN                           
         PCB   TYPE=TP,NAME=W0T693X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* PCB FÖR SUBPGM W006KOM                                                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDP8,PROCOPT=G,KEYLEN=28,POS=S                   
         SENSEG NAME=WDP801,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDP811,PARENT=WDP801,PROCOPT=GI                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK2,PROCOPT=G,KEYLEN=6,POS=S                    
         SENSEG NAME=WDK201,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDK211,PARENT=WDK201,PROCOPT=GIR                           
*                                                                               
         PCB TYPE=DB,DBDNAME=WDK6,PROCOPT=G,KEYLEN=06,POS=S                     
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601,PROCOPT=GIR                           
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=7,POS=S                    
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK712,PARENT=WDK701,PROCOPT=GIR                           
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W6018B                                       
         END                                                                    
