*                                                                               
*        -- USEA-PCB                                                            
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GIR,KEYLEN=08,POS=S               
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6G1,PROCOPT=G,KEYLEN=35,POS=S                   
         SENSEG NAME=W6G101,PARENT=0                                            
         SENSEG NAME=W6G130,PARENT=W6G101,PROCOPT=GIRD                          
         SENSEG NAME=W6GX6008,PARENT=W6G101,PROCOPT=GIRD                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6HANB,PROCOPT=GOT,KEYLEN=37,POS=S               
         SENSEG NAME=W6HANB01,PARENT=0                                          
         SENSEG NAME=W6HANB11,PARENT=W6HANB01                                   
         SENSEG NAME=W6HANB12,PARENT=W6HANB01                                   
         SENSEG NAME=W6HANB13,PARENT=W6HANB01                                   
         SENSEG NAME=W6HANB14,PARENT=W6HANB01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6INLA,PROCOPT=G,KEYLEN=4,POS=S,        *        
               PROCSEQ=W6D1E                                                    
         SENSEG NAME=W6INLA11,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6INLA,PROCOPT=G,KEYLEN=4,POS=S,        *        
               PROCSEQ=W6D1G                                                    
         SENSEG NAME=W6INLA11,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDP3,PROCOPT=GOT,KEYLEN=10,POS=S                 
         SENSEG NAME=WDP301,PARENT=0                                            
         SENSEG NAME=WDP311,PARENT=WDP301                                       
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W60106                                       
         END                                                                    
