*                                                                               
*        -- USEA-PCB                                                            
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GIR,KEYLEN=08,POS=S               
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6INLB,PROCOPT=G,KEYLEN=31,POS=S                 
         SENSEG NAME=W6INLB01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6INLA,PROCOPT=G,KEYLEN=25,POS=S                 
         SENSEG NAME=W6INLA01,PARENT=0,PROCOPT=GRD                              
         SENSEG NAME=W6INLA11,PARENT=W6INLA01,PROCOPT=GRD                       
         SENSEG NAME=W6INLA21,PARENT=W6INLA11,PROCOPT=GD                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6INLA,PROCOPT=G,KEYLEN=25,POS=S                 
         SENSEG NAME=W6INLA01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=W6INLA11,PARENT=W6INLA01,PROCOPT=GI                        
         SENSEG NAME=W6INLA21,PARENT=W6INLA11,PROCOPT=GI                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLLEVA,PROCOPT=GOT,KEYLEN=5,POS=S                
         SENSEG NAME=WLLEVA01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=6,POS=S                
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD9,PROCOPT=GOT,KEYLEN=19,POS=S                 
         SENSEG NAME=WDD901,PARENT=0                                            
         SENSEG NAME=WDD902,PARENT=WDD901                                       
         SENSEG NAME=WDD905,PARENT=WDD902                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTS,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG NAME=WLARTS01,PARENT=0                                          
         SENSEG NAME=WLARTS11,PARENT=WLARTS01                                   
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
*        PCB'ER FÖR SUBPGM W611REG                                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6INLA,PROCOPT=GOT,KEYLEN=34,POS=S,     *        
               PROCSEQ=W6D1A                                                    
         SENSEG NAME=W6INLA01,PARENT=0                                          
         SENSEG NAME=W6INLA11,PARENT=W6INLA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6INLA,PROCOPT=G,KEYLEN=25,POS=S                 
         SENSEG NAME=W6INLA01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=W6INLA11,PARENT=W6INLA01,PROCOPT=GI                        
         SENSEG NAME=W6INLA21,PARENT=W6INLA11,PROCOPT=GI                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6INLA,PROCOPT=G,KEYLEN=25,POS=S                 
         SENSEG NAME=W6INLA01,PARENT=0,PROCOPT=GRD                              
         SENSEG NAME=W6INLA11,PARENT=W6INLA01,PROCOPT=GRD                       
         SENSEG NAME=W6INLA21,PARENT=W6INLA11,PROCOPT=GD                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLLEVA,PROCOPT=GOT,KEYLEN=5,POS=S                
         SENSEG NAME=WLLEVA01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=19,POS=S               
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
         SENSEG NAME=WLARTC21,PARENT=WLARTC11                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=8,POS=S,      *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD9,PROCOPT=GOT,KEYLEN=19,POS=S                 
         SENSEG NAME=WDD901,PARENT=0                                            
         SENSEG NAME=WDD902,PARENT=WDD901                                       
         SENSEG NAME=WDD905,PARENT=WDD902                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=20,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK712,PARENT=WDK701                                       
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK724,PARENT=WDK711                                       
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
*                                                                               
*  PCB'ER FÖR SUBPGM W411SAP                                                    
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLSAPC,PROCOPT=GOT,KEYLEN=17,POS=S               
         SENSEG NAME=WLSAPC01,PARENT=0                                          
*                                                                               
*                                                                               
*  PCB FÖR SUB PGM W611LEVP                                                     
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLINLB,PROCOPT=G,KEYLEN=20,POS=S                 
         SENSEG NAME=WLINLB01,PARENT=0                                          
         SENSEG NAME=WLINLB11,PARENT=WLINLB01                                   
         SENSEG NAME=WLINLB24,PARENT=WLINLB11,PROCOPT=GIRD                      
*                                                                               
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W60114                                       
         END                                                                    
