*                                                                               
* 6192-PCB  - STARTAR OM SIG SJÄLV                                              
         PCB   TYPE=TP,NAME=W6T192X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* DISP-PCB  - KLAR MEDDELANDE TILL DISPATCHEN                                   
         PCB   TYPE=TP,NAME=W0T693X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* USEA-PCB  - USER-BAS BLA ANNAT FÖR LOKAL DATUM/ TID                           
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GOT,KEYLEN=08,POS=S               
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
* INLA-PCB  - INLEVERANSREGISTER W6D1                                           
         PCB   TYPE=DB,DBDNAME=W6INLA,PROCOPT=GOT,KEYLEN=22,POS=S               
         SENSEG NAME=W6INLA01,PARENT=0                                          
         SENSEG NAME=W6INLA11,PARENT=W6INLA01                                   
*                                                                               
* ARTC-PCB  - ARTIKELINFORMATION                                                
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=G,KEYLEN=19,POS=S                 
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01,PROCOPT=GR                        
         SENSEG NAME=WLARTC21,PARENT=WLARTC11,PROCOPT=GR                        
         SENSEG NAME=WLARTC23,PARENT=WLARTC11,PROCOPT=G                         
*                                                                               
* INLB-PCB  - LEVERANSPLAN                                                      
         PCB   TYPE=DB,DBDNAME=WLINLB,PROCOPT=G,KEYLEN=25,POS=S                 
         SENSEG NAME=WLINLB01,PARENT=0                                          
         SENSEG NAME=WLINLB11,PARENT=WLINLB01,PROCOPT=GR                        
         SENSEG NAME=WLINLB23,PARENT=WLINLB11,PROCOPT=GR                        
         SENSEG NAME=WLINLB31,PARENT=WLINLB23,PROCOPT=I                         
         SENSEG NAME=WLINLB32,PARENT=WLINLB23                                   
         SENSEG NAME=WLINLB24,PARENT=WLINLB11,PROCOPT=GRD                       
*                                                                               
* INLE-PCB  - INLEVERANS-HISTORIK                                               
         PCB   TYPE=DB,DBDNAME=WLINLE,PROCOPT=G,KEYLEN=21,POS=S                 
         SENSEG NAME=WLINLE01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLINLE11,PARENT=WLINLE01,PROCOPT=I                         
         SENSEG NAME=WLINLE21,PARENT=WLINLE11,PROCOPT=I                         
*                                                                               
* ZZAC-PCB  - LOGG WDG6                                                         
         PCB   TYPE=DB,DBDNAME=WLZZAC,PROCOPT=G,KEYLEN=18,POS=S                 
         SENSEG NAME=WLZZAC01,PARENT=0,PROCOPT=I                                
*                                                                               
* XXCS-PCB  - LARM ANSKAFFING 2239/2240                                         
         PCB   TYPE=DB,DBDNAME=WLXXCS,PROCOPT=G,KEYLEN=31,POS=S                 
         SENSEG NAME=WLXXCS01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLXXCS11,PARENT=WLXXCS01,PROCOPT=I                         
*                                                                               
* XXCT-PCB  - LARM ANSKAFFING 2241/2242                                         
         PCB   TYPE=DB,DBDNAME=WLXXCT,PROCOPT=G,KEYLEN=31,POS=S                 
         SENSEG NAME=WLXXCT01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLXXCT11,PARENT=WLXXCT01,PROCOPT=I                         
*                                                                               
* ARTS-PCB  - ARTIKELINFORMATION                                                
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=08,POS=S                   
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701,PROCOPT=GR                            
         SENSEG NAME=WDK722,PARENT=WDK711                                       
         SENSEG NAME=WDK712,PARENT=WDK701,PROCOPT=GR                            
*                                                                               
* INLC-PCB  - HISTORIK/ ORDER FÖR SDC/ NDC                                      
         PCB   TYPE=DB,DBDNAME=WLINLC,PROCOPT=G,KEYLEN=21,POS=S                 
         SENSEG NAME=WLINLC01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLINLC11,PARENT=WLINLC01,PROCOPT=GIR                       
         SENSEG NAME=WLINLC12,PARENT=WLINLC01,PROCOPT=GIR                       
*                                                                               
* FILC-PCB  - RY7-TRANSAR                                                       
         PCB   TYPE=DB,DBDNAME=WLFILC,PROCOPT=G,KEYLEN=27,POS=S                 
         SENSEG NAME=WLFILC01,PARENT=0,PROCOPT=GI                               
*                                                                               
* LEVA-PCB  - W218ETA-ANROP                                                     
         PCB   TYPE=DB,DBDNAME=WLLEVA,PROCOPT=GOT,KEYLEN=11,POS=S               
         SENSEG NAME=WLLEVA01,PARENT=0                                          
         SENSEG NAME=WLLEVA16,PARENT=WLLEVA01                                   
*                                                                               
* ARTC-PCB  - W218ETA-ANROP                                                     
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=06,POS=S               
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
*                                                                               
* ARTS-PCB  - W218ETA-ANROP                                                     
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK712,PARENT=WDK701                                       
*                                                                               
* INLC-PCB  - W218ETA-ANROP                                                     
         PCB   TYPE=DB,DBDNAME=WLINLC,PROCOPT=GOT,KEYLEN=21,POS=S               
         SENSEG NAME=WLINLC01,PARENT=0                                          
         SENSEG NAME=WLINLC11,PARENT=WLINLC01                                   
         SENSEG NAME=WLINLC12,PARENT=WLINLC01                                   
*                                                                               
* WDB6-PCB  - W218ETA-ANROP                                                     
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=4,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB616,PARENT=WDB601                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLLOGA,PROCOPT=G,KEYLEN=20,POS=S                 
         SENSEG NAME=WLLOGA01,PARENT=0,PROCOPT=GI                               
*                                                                               
* FILB-PCB  - EKOTRANSAR WDR8                                                   
         PCB   TYPE=DB,DBDNAME=WLFILB,PROCOPT=G,KEYLEN=27,POS=S                 
         SENSEG NAME=WLFILB01,PARENT=0,PROCOPT=GI                               
*                                                                               
* SAPA-PCB WDR9                                                                 
         PCB    TYPE=DB,DBDNAME=WLSAPA,PROCOPT=GI,KEYLEN=31,POS=S               
         SENSEG NAME=WLSAPA01,PARENT=0                                          
*                                                                               
* WDA9, BYTES - UPPFÖLJNINGSREGISTER                                            
         PCB   TYPE=DB,DBDNAME=WDA9,PROCOPT=G,KEYLEN=08,POS=S                   
         SENSEG NAME=WDA901,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDA911,PARENT=WDA901,PROCOPT=GIR                           
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=10,POS=S,       *        
               PROCSEQ=WDB2B                                                    
         SENSEG NAME=WDB201,PARENT=0                                            
* WDD4   LARM 235 TILL 2172                                                     
         PCB   TYPE=DB,DBDNAME=WDD4,PROCOPT=G,KEYLEN=13,POS=S                   
         SENSEG NAME=WDD401,PARENT=0,PROCOPT=GI                                 
* 2232                                                                          
         PCB   TYPE=DB,DBDNAME=WLXXBX,PROCOPT=GOT,KEYLEN=35,POS=S               
         SENSEG NAME=WLXXBX01,PARENT=0                                          
         SENSEG NAME=WLXXBX11,PARENT=WLXXBX01                                   
*                                                                               
* WDD9-PCB  - LEVERANSPLAN                                                      
         PCB   TYPE=DB,DBDNAME=WDD9,PROCOPT=GOT,KEYLEN=19,POS=S                 
         SENSEG NAME=WDD901,PARENT=0                                            
         SENSEG NAME=WDD902,PARENT=WDD901                                       
         SENSEG NAME=WDD905,PARENT=WDD902                                       
* LEV                                                                           
         PCB   TYPE=DB,DBDNAME=WDF1,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDF101,PARENT=0                                            
         SENSEG NAME=WDF102,PARENT=WDF101                                       
*                                                                               
* WDK7 ARTIKELREGISTER DC                                                       
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=20,POS=S                   
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK712,PARENT=WDK701,PROCOPT=GR                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK723,PARENT=WDK711                                       
         SENSEG NAME=WDK724,PARENT=WDK711,PROCOPT=GR                            
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=3,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB617,PARENT=WDB601                                       
*                                                                               
* WDG2-PCB/9305-PCB                                                             
         PCB   TYPE=DB,DBDNAME=WDG2,PROCOPT=GOT,KEYLEN=37,POS=S                 
         SENSEG NAME=WDG201,PARENT=0                                            
         SENSEG NAME=WDGX9306,PARENT=WDG201                                     
         SENSEG NAME=WDGX9308,PARENT=WDGX9306                                   
*                                                                               
        PSBGEN LANG=COBOL,PSBNAME=W60192                                        
        END                                                                     
