*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDP3,PROCOPT=G,KEYLEN=24,POS=S                   
         SENSEG NAME=WDP301,PARENT=0,PROCOPT=G                                  
         SENSEG NAME=WDP311,PARENT=WDP301,PROCOPT=G                             
         SENSEG NAME=WDP321,PARENT=WDP311,PROCOPT=GID                           
         SENSEG NAME=WDP322,PARENT=WDP311,PROCOPT=GID                           
         SENSEG NAME=WDP323,PARENT=WDP311,PROCOPT=GID                           
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDP3,PROCOPT=GOT,KEYLEN=24,POS=S                 
         SENSEG NAME=WDP301,PARENT=0                                            
         SENSEG NAME=WDP311,PARENT=WDP301                                       
         SENSEG NAME=WDP321,PARENT=WDP311                                       
         SENSEG NAME=WDP322,PARENT=WDP311                                       
         SENSEG NAME=WDP323,PARENT=WDP311                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=5,POS=S                  
         SENSEG NAME=WDK601,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6B,PROCOPT=GOT,KEYLEN=15,POS=S                
         SENSEG NAME=WDK6B1,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDF1,PROCOPT=GOT,KEYLEN=5,POS=S                  
         SENSEG NAME=WDF101,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDP3A,PROCOPT=GOT,KEYLEN=22,POS=S                
         SENSEG NAME=WDP3A1,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDP3B,PROCOPT=GOT,KEYLEN=20,POS=S                
         SENSEG NAME=WDP3B1,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDP3C,PROCOPT=GOT,KEYLEN=16,POS=S                
         SENSEG NAME=WDP3C1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W60217                                       
         END                                                                    
