*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=G,KEYLEN=19,POS=S                   
         SENSEG NAME=WDK601,PARENT=0,PROCOPT=G                                  
         SENSEG NAME=WDK611,PARENT=WDK601,PROCOPT=GR                            
         SENSEG NAME=WDK625,PARENT=WDK611,PROCOPT=GR                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=13,POS=S,     *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLKATN,PROCOPT=GOT,KEYLEN=13,POS=S               
         SENSEG NAME=WLKATN01,PARENT=0                                          
         SENSEG NAME=WLKATN11,PARENT=WLKATN01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6KVAH,PROCOPT=G,KEYLEN=20,POS=S                 
         SENSEG NAME=W6KVAH01,PARENT=0,PROCOPT=GIR                              
         SENSEG NAME=W6KVAH11,PARENT=W6KVAH01,PROCOPT=G                         
         SENSEG NAME=W6KVAH12,PARENT=W6KVAH01,PROCOPT=GR                        
         SENSEG NAME=W6KVAH13,PARENT=W6KVAH01,PROCOPT=GIRD                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6KVAG,PROCOPT=GOT,KEYLEN=24,POS=S               
         SENSEG NAME=W6KVAG01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6PROA,PROCOPT=G,KEYLEN=32,POS=S                 
         SENSEG NAME=W6PROA01,PARENT=0,PROCOPT=G                                
         SENSEG NAME=W6PROA11,PARENT=W6PROA01,PROCOPT=GIR                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6KVAE,PROCOPT=GOT,KEYLEN=05,POS=S               
         SENSEG NAME=W6KVAE01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD2,PROCOPT=GOT,KEYLEN=5,POS=S                  
         SENSEG NAME=WDD201,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W60211                                       
         END                                                                    
