*                                                                               
         PCB   TYPE=TP,NAME=W2T191X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* DISP-MSG-PCB - FEL/KLAR MEDDELANDE TILL DISPATCHERN                           
         PCB   TYPE=TP,NAME=W0T693X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*        PCB FÖR W006PRC1                                                       
         PCB   TYPE=TP,LTERM=,ALTRESP=NO,SAMETRM=NO,                   *        
               MODIFY=YES,EXPRESS=NO                                            
*                                                                               
*        -- USEA-PCB                                                            
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GOT,KEYLEN=08,POS=S               
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6KVAE,PROCOPT=G,KEYLEN=6,POS=S                  
         SENSEG NAME=W6KVAE01,PARENT=0,PROCOPT=GR                               
         SENSEG NAME=W6KVAE12,PARENT=W6KVAE01,PROCOPT=G                         
         SENSEG NAME=W6KVAE13,PARENT=W6KVAE01,PROCOPT=GI                        
         SENSEG NAME=W6KVAE14,PARENT=W6KVAE01,PROCOPT=GIR                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=8,POS=S,      *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLLEVA,PROCOPT=GOT,KEYLEN=8,POS=S                
         SENSEG NAME=WLLEVA01,PARENT=0                                          
         SENSEG NAME=WLLEVA11,PARENT=WLLEVA01                                   
         SENSEG NAME=WLLEVA14,PARENT=WLLEVA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDP3,PROCOPT=GOT,KEYLEN=10,POS=S                 
         SENSEG NAME=WDP301,PARENT=0                                            
         SENSEG NAME=WDP311,PARENT=WDP301                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=G,KEYLEN=06,POS=S                 
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01,PROCOPT=GR                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD8,PROCOPT=G,KEYLEN=22,POS=S                   
         SENSEG NAME=WDD801,PARENT=0                                            
         SENSEG NAME=WDD811,PARENT=WDD801,PROCOPT=GRD                           
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDJ9,PROCOPT=G,KEYLEN=25,POS=S                   
         SENSEG NAME=WDJ901,PARENT=0                                            
         SENSEG NAME=WDJ911,PARENT=WDJ901,PROCOPT=GR                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6LEVA,PROCOPT=GOT,KEYLEN=8,POS=S                
         SENSEG NAME=W6LEVA01,PARENT=0                                          
         SENSEG NAME=W6LEVA11,PARENT=W6LEVA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6UPFA,PROCOPT=G,KEYLEN=10,POS=S                 
         SENSEG NAME=W6UPFA01,PARENT=0,PROCOPT=GRI                              
         SENSEG NAME=W6UPFA11,PARENT=W6UPFA01,PROCOPT=G                         
         SENSEG NAME=W6UPFA12,PARENT=W6UPFA01,PROCOPT=G                         
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6KVAH,PROCOPT=G,KEYLEN=10,POS=S                 
         SENSEG NAME=W6KVAH01,PARENT=0,PROCOPT=G                                
         SENSEG NAME=W6KVAH12,PARENT=W6KVAH01,PROCOPT=GR                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6INLA,PROCOPT=G,KEYLEN=14,POS=S,       *        
               PROCSEQ=W6D1B                                                    
         SENSEG NAME=W6INLA11,PARENT=0,PROCOPT=GR                               
         SENSEG NAME=W6INLA21,PARENT=W6INLA11                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6PROA,PROCOPT=GOT,KEYLEN=32,POS=S               
         SENSEG NAME=W6PROA01,PARENT=0                                          
         SENSEG NAME=W6PROA11,PARENT=W6PROA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6KVAE,PROCOPT=GOT,KEYLEN=13,POS=S,     *        
               PROCSEQ=W6H7C                                                    
         SENSEG NAME=W6KVAE01,PARENT=0                                          
*                                                                               
* PCB FÖR W006KOM                                                               
*                                                                               
* KOM-KOMA-PCB                                                                  
         PCB   TYPE=DB,DBDNAME=WLKOMA,PROCOPT=G,KEYLEN=28,POS=S                 
         SENSEG NAME=WLKOMA01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLKOMA11,PARENT=WLKOMA01,PROCOPT=GI                        
*                                                                               
* PCB FÖR W602KRUP                                                              
*                                                                               
* W6H7-PCB                                                                      
         PCB   TYPE=DB,DBDNAME=W6H7,PROCOPT=G,KEYLEN=6,POS=S                    
         SENSEG NAME=W6H701,PARENT=0,PROCOPT=GR                                 
         SENSEG NAME=W6H712,PARENT=W6H701,PROCOPT=GIR                           
         SENSEG NAME=W6H721,PARENT=W6H712,PROCOPT=GI                            
*                                                                               
* WDG2-PCB/9305-PCB                                                             
         PCB   TYPE=DB,DBDNAME=WDG2,PROCOPT=GOT,KEYLEN=37,POS=S                 
         SENSEG NAME=WDG201,PARENT=0                                            
         SENSEG NAME=WDGX9306,PARENT=WDG201                                     
         SENSEG NAME=WDGX9308,PARENT=WDGX9306                                   
*                                                                               
* WDK6-PCB                                                                      
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=19,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
         SENSEG NAME=WDK621,PARENT=WDK611                                       
*                                                                               
* LOPB-PCB                                                                      
         PCB   TYPE=DB,DBDNAME=W6LOPB,PROCOPT=G,KEYLEN=30,POS=S                 
         SENSEG NAME=W6LOPB01,PARENT=0,PROCOPT=G                                
         SENSEG NAME=W6LOPB11,PARENT=W6LOPB01,PROCOPT=GR                        
*                                                                               
* FILC-PCB                                                                      
         PCB   TYPE=DB,DBDNAME=WLFILC,PROCOPT=G,KEYLEN=27,POS=S                 
         SENSEG NAME=WLFILC01,PARENT=0,PROCOPT=GI                               
*                                                                               
* WDK7-PCB                                                                      
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=21,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK722,PARENT=WDK711                                       
         SENSEG NAME=WDK724,PARENT=WDK711                                       
*                                                                               
* WDB6-PCB                                                                      
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=3,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB617,PARENT=WDB601                                       
*                                                                               
* WDF5 LEVERANTÖRSREGISTRET                                                     
         PCB   TYPE=DB,DBDNAME=WDF5,PROCOPT=GOT,KEYLEN=11,POS=S                 
         SENSEG NAME=WDF501,PARENT=0                                            
         SENSEG NAME=WDF502,PARENT=WDF501                                       
*                                                                               
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W60203                                       
         END                                                                    
