*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6KVAH,PROCOPT=G,KEYLEN=18,POS=S                 
         SENSEG NAME=W6KVAH01,PARENT=0                                          
         SENSEG NAME=W6KVAH11,PARENT=W6KVAH01,PROCOPT=GIRD                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6KVAH,PROCOPT=GOT,KEYLEN=12,POS=S               
         SENSEG NAME=W6KVAH01,PARENT=0                                          
         SENSEG NAME=W6KVAH12,PARENT=W6KVAH01                                   
         SENSEG NAME=W6KVAH22,PARENT=W6KVAH12                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=5,POS=S                
         SENSEG NAME=WLARTC01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDP3,PROCOPT=GOT,KEYLEN=10,POS=S                 
         SENSEG NAME=WDP301,PARENT=0                                            
         SENSEG NAME=WDP311,PARENT=WDP301                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W60212                                       
         END                                                                    
