*                                                                               
*        -- USEA-PCB                                                            
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GIR,KEYLEN=08,POS=S               
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6KVAE,PROCOPT=G,KEYLEN=10,POS=S                 
         SENSEG NAME=W6KVAE01,PARENT=0,PROCOPT=GRI                              
         SENSEG NAME=W6KVAE12,PARENT=W6KVAE01,PROCOPT=G                         
         SENSEG NAME=W6KVAE13,PARENT=W6KVAE01,PROCOPT=I                         
         SENSEG NAME=W6KVAE14,PARENT=W6KVAE01,PROCOPT=G                         
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6KVAE,PROCOPT=GOT,KEYLEN=13,POS=S,     *        
               PROCSEQ=W6H7C                                                    
         SENSEG NAME=W6KVAE01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6INLC,PROCOPT=GOT,KEYLEN=25,POS=S               
         SENSEG NAME=W6INLC01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=8,POS=S,      *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLLEVA,PROCOPT=GOT,KEYLEN=8,POS=S                
         SENSEG NAME=WLLEVA01,PARENT=0                                          
         SENSEG NAME=WLLEVA14,PARENT=WLLEVA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=6,POS=S                
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXLA,PROCOPT=GOT,KEYLEN=40,POS=S               
         SENSEG NAME=WLXXLA01,PARENT=0                                          
         SENSEG NAME=WLXXLA11,PARENT=WLXXLA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDP3,PROCOPT=GOT,KEYLEN=10,POS=S                 
         SENSEG NAME=WDP301,PARENT=0                                            
         SENSEG NAME=WDP311,PARENT=WDP301                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6LOPB,PROCOPT=G,KEYLEN=30,POS=S                 
         SENSEG NAME=W6LOPB01,PARENT=0,PROCOPT=G                                
         SENSEG NAME=W6LOPB11,PARENT=W6LOPB01,PROCOPT=GR                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLINLE,PROCOPT=GOT,KEYLEN=21,POS=S               
         SENSEG NAME=WLINLE01,PARENT=0                                          
         SENSEG NAME=WLINLE11,PARENT=WLINLE01                                   
         SENSEG NAME=WLINLE21,PARENT=WLINLE11                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6LEVA,PROCOPT=GOT,KEYLEN=8,POS=S                
         SENSEG NAME=W6LEVA01,PARENT=0                                          
         SENSEG NAME=W6LEVA11,PARENT=W6LEVA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6INLA,PROCOPT=GOT,KEYLEN=22,POS=S               
         SENSEG NAME=W6INLA01,PARENT=0                                          
         SENSEG NAME=W6INLA11,PARENT=W6INLA01                                   
*                                                                               
* W6L1 UPPFÖLJNINGSREGISTRET KVALITET                                           
         PCB   TYPE=DB,DBDNAME=W6UPFA,PROCOPT=GOT,KEYLEN=5,POS=S                
         SENSEG NAME=W6UPFA01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
* WDK7-PCB                                                                      
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
*                                                                               
* WDL6-PCB                                                                      
         PCB   TYPE=DB,DBDNAME=WDL6,PROCOPT=GOT,KEYLEN=21,POS=S                 
         SENSEG NAME=WDL601,PARENT=0                                            
         SENSEG NAME=WDL611,PARENT=WDL601                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W60202                                       
         END                                                                    
