         PCB    TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                 
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6D2,PROCOPT=GOT,KEYLEN=18,POS=S                 
         SENSEG NAME=W6D201,PARENT=0                                            
         SENSEG NAME=W6D211,PARENT=W6D201                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6D2,PROCOPT=G,KEYLEN=20,POS=S                   
         SENSEG NAME=W6D201,PARENT=0                                            
         SENSEG NAME=W6D211,PARENT=W6D201                                       
         SENSEG NAME=W6D221,PARENT=W6D211,PROCOPT=GR                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=06,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR2,PROCOPT=G,KEYLEN=40,POS=S                   
         SENSEG NAME=WDR201,PARENT=0                                            
         SENSEG NAME=WDGX6332,PARENT=WDR201                                     
         SENSEG NAME=WDGX6334,PARENT=WDGX6332                                   
* ALT PCB FÖR WDR2                                                              
         PCB   TYPE=DB,DBDNAME=WDR2,PROCOPT=G,KEYLEN=40,POS=S                   
         SENSEG NAME=WDR201,PARENT=0                                            
         SENSEG NAME=WDGX6332,PARENT=WDR201                                     
         SENSEG NAME=WDGX6334,PARENT=WDGX6332                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W60215                                       
         END                                                                    
