*                                                                               
*        USER DATABASE                                                          
         PCB    TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                 
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
*        STORAGE CODE REGISTER  WDR2                                            
         PCB   TYPE=DB,DBDNAME=WL6315,PROCOPT=G,KEYLEN=33,POS=S                 
         SENSEG NAME=WL631501,PARENT=0                                          
         SENSEG NAME=WL631511,PARENT=WL631501,PROCOPT=A                         
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W60342                                       
         END                                                                    
