         PCB   TYPE=TP,NAME=W6T344U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*        USER DATABASE                                                          
         PCB    TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                 
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
*        FREQUENCY CODE REGISTER  WDR2                                          
         PCB   TYPE=DB,DBDNAME=WL6313,PROCOPT=GOT,KEYLEN=33,POS=S               
         SENSEG NAME=WL631301,PARENT=0                                          
         SENSEG NAME=WL631311,PARENT=WL631301                                   
*                                                                               
*        STORAGE CODE REGISTER  WDR2                                            
         PCB   TYPE=DB,DBDNAME=WL6315,PROCOPT=GOT,KEYLEN=33,POS=S               
         SENSEG NAME=WL631501,PARENT=0                                          
         SENSEG NAME=WL631511,PARENT=WL631501                                   
*                                                                               
*        LOCATION DATABASE  WDJ8                                                
         PCB   TYPE=DB,DBDNAME=WLLOCA,PROCOPT=G,KEYLEN=11,POS=S                 
         SENSEG NAME=WLLOCA01,PARENT=0,PROCOPT=A                                
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W60344                                       
         END                                                                    
