*                                                                               
         PCB   TYPE=TP,NAME=W0T606U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=TP,NAME=W0T541X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*        TRANS TILL PGM W6032500                                                
         PCB   TYPE=TP,NAME=W6T325,ALTRESP=NO,SAMETRM=NO,              *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=TP,NAME=W1T113X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=G,KEYLEN=18,POS=S                   
         SENSEG NAME=WDK601                                                     
         SENSEG NAME=WDK611,PARENT=WDK601,PROCOPT=GR                            
         SENSEG NAME=WDK623,PARENT=WDK611,PROCOPT=G                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTS,PROCOPT=G,KEYLEN=7,POS=S                  
         SENSEG NAME=WLARTS01                                                   
         SENSEG NAME=WLARTS11,PARENT=WLARTS01,PROCOPT=GR                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=G,KEYLEN=70,POS=S                   
         SENSEG NAME=WDR501,PARENT=0                                            
         SENSEG NAME=WDGX6322,PARENT=WDR501,PROCOPT=GD                          
         SENSEG NAME=WDGX6324,PARENT=WDGX6322,PROCOPT=GIRD                      
         SENSEG NAME=WDGX6326,PARENT=WDGX6324,PROCOPT=GID                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=GOT,KEYLEN=45,POS=S                 
         SENSEG NAME=WDR501,PARENT=0                                            
         SENSEG NAME=WDGX6328,PARENT=WDR501                                     
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=G,KEYLEN=35,POS=S                   
         SENSEG NAME=WDR501,PARENT=0                                            
         SENSEG NAME=WDGX2402,PARENT=WDR501,PROCOPT=GI                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLFILC,PROCOPT=G,KEYLEN=27,POS=S                 
         SENSEG NAME=WLFILC01,PARENT=0,PROCOPT=GI                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD8,PROCOPT=G,KEYLEN=22,POS=S                   
         SENSEG NAME=WDD801,PARENT=0                                            
         SENSEG NAME=WDD811,PARENT=WDD801,PROCOPT=GRD                           
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDJ9,PROCOPT=G,KEYLEN=25,POS=S                   
         SENSEG NAME=WDJ901,PARENT=0                                            
         SENSEG NAME=WDJ911,PARENT=WDJ901,PROCOPT=GR                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=G,KEYLEN=70,POS=S                   
         SENSEG NAME=WDR501,PARENT=0                                            
         SENSEG NAME=WDGX6322,PARENT=WDR501,PROCOPT=GD                          
         SENSEG NAME=WDGX6324,PARENT=WDGX6322,PROCOPT=GIRD                      
         SENSEG NAME=WDGX6326,PARENT=WDGX6324,PROCOPT=GID                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=GOT,KEYLEN=70,POS=S                 
         SENSEG NAME=WDR501,PARENT=0                                            
         SENSEG NAME=WDGX6322,PARENT=WDR501                                     
         SENSEG NAME=WDGX6324,PARENT=WDGX6322                                   
         SENSEG NAME=WDGX6325,PARENT=WDGX6324                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLZZAC,PROCOPT=G,KEYLEN=18,POS=S                 
         SENSEG NAME=WLZZAC01,PARENT=0,PROCOPT=GI                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLZZAD,PROCOPT=G,KEYLEN=09,POS=S                 
         SENSEG NAME=WLZZAD01,PARENT=0,PROCOPT=GI                               
*                                                                               
*---DIRLEVBAS                                                                   
         PCB   TYPE=DB,DBDNAME=WDF2,PROCOPT=G,KEYLEN=20,POS=S                   
         SENSEG NAME=WDF201,PARENT=0                                            
         SENSEG NAME=WDF212,PARENT=WDF201,PROCOPT=GI                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=02,POS=S                 
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDT3,PROCOPT=G,KEYLEN=20,POS=S                   
         SENSEG NAME=WDT301,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDT311,PARENT=WDT301,PROCOPT=GI                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W60323                                       
         END                                                                    
