*                                                                               
*  -- ALT-OMSTART-PCB                                                           
         PCB   TYPE=TP,NAME=W6T301U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*  -- ALT-HOPP-PCB                                                              
         PCB   TYPE=TP,NAME=W6T302,ALTRESP=NO,SAMETRM=NO,              *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=TP,NAME=W0T606U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WL6301,PROCOPT=G,KEYLEN=42,POS=S                 
         SENSEG NAME=WL630101                                                   
         SENSEG NAME=WL630111,PARENT=WL630101,PROCOPT=GIRD                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLINLC,PROCOPT=G,KEYLEN=21,POS=S                 
         SENSEG NAME=WLINLC01                                                   
         SENSEG NAME=WLINLC11,PARENT=WLINLC01,PROCOPT=GR                        
         SENSEG NAME=WLINLC12,PARENT=WLINLC01,PROCOPT=G                         
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLINLD,PROCOPT=GOT,KEYLEN=42,POS=S               
         SENSEG NAME=WLINLD01                                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=7,POS=S                    
         SENSEG NAME=WDK701                                                     
         SENSEG NAME=WDK711,PARENT=WDK701,PROCOPT=GR                            
         SENSEG NAME=WDK712,PARENT=WDK701                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=G,KEYLEN=6,POS=S                  
         SENSEG NAME=WLARTC01                                                   
         SENSEG NAME=WLARTC11,PARENT=WLARTC01,PROCOPT=GR                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLLEVA,PROCOPT=GOT,KEYLEN=11,POS=S               
         SENSEG NAME=WLLEVA01,PARENT=0                                          
         SENSEG NAME=WLLEVA16,PARENT=WLLEVA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLLOGA,PROCOPT=G,KEYLEN=20,POS=S                 
         SENSEG NAME=WLLOGA01,PARENT=0,PROCOPT=GI                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=4,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB616,PARENT=WDB601                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6G1,PROCOPT=GOT,KEYLEN=35,POS=S                 
         SENSEG NAME=W6G101,PARENT=0                                            
         SENSEG NAME=W6G130,PARENT=W6G101                                       
*                                                                               
*        EKONOMIBASEN PEDAL , WDR9                                              
         PCB   TYPE=DB,DBDNAME=WDR9,PROCOPT=G,KEYLEN=31,POS=S                   
         SENSEG NAME=WDR901,PARENT=0,PROCOPT=GI                                 
*                                                                               
*        EKONOMIBASEN PEDAL , WDR8                                              
         PCB   TYPE=DB,DBDNAME=WDR8,PROCOPT=G,KEYLEN=27,POS=S                   
         SENSEG NAME=WDR801,PARENT=0,PROCOPT=GI                                 
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W60301                                       
         END                                                                    
