*  -- ALT-DISP-PCB - START AV DISPATCHER-PGM W0069300 ***********               
         PCB   TYPE=TP,NAME=W0T693X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*  -- ALT-HOPP-PCB                                                              
         PCB   TYPE=TP,NAME=W6T302,ALTRESP=NO,SAMETRM=NO,              *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WL6301,PROCOPT=G,KEYLEN=42,POS=S                 
         SENSEG NAME=WL630101                                                   
         SENSEG NAME=WL630111,PARENT=WL630101,PROCOPT=GRD                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLINLC,PROCOPT=G,KEYLEN=21,POS=S                 
         SENSEG NAME=WLINLC01,PROCOPT=GI                                        
         SENSEG NAME=WLINLC11,PARENT=WLINLC01,PROCOPT=GRI                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLINLD,PROCOPT=GOT,KEYLEN=42,POS=S               
         SENSEG NAME=WLINLD01                                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLINLE,PROCOPT=G,KEYLEN=21,POS=S                 
         SENSEG NAME=WLINLE01,PROCOPT=GI                                        
         SENSEG NAME=WLINLE11,PARENT=WLINLE01,PROCOPT=GI                        
         SENSEG NAME=WLINLE22,PARENT=WLINLE11,PROCOPT=GI                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=G,KEYLEN=19,POS=S                 
         SENSEG NAME=WLARTC01                                                   
         SENSEG NAME=WLARTC11,PARENT=WLARTC01,PROCOPT=GR                        
         SENSEG NAME=WLARTC21,PARENT=WLARTC11                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=7,POS=S                    
         SENSEG NAME=WDK701,PROCOPT=GI                                          
         SENSEG NAME=WDK711,PARENT=WDK701,PROCOPT=GRI                           
         SENSEG NAME=WDK712,PARENT=WDK701,PROCOPT=GI                            
*                                                                               
* PRIS-WDK7-PCB - ARTIKELINFO                                                   
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=20,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK724,PARENT=WDK711                                       
         SENSEG NAME=WDK712,PARENT=WDK701                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLFILB,PROCOPT=G,KEYLEN=27,POS=S                 
         SENSEG NAME=WLFILB01,PARENT=0,PROCOPT=GI                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=8,POS=S,      *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
        PCB   TYPE=DB,DBDNAME=W6LOPA,PROCOPT=G,KEYLEN=30,POS=S                  
        SENSEG NAME=W6LOPA01,PARENT=0                                           
        SENSEG NAME=W6LOPA11,PARENT=W6LOPA01,PROCOPT=GR                         
*                                                                               
*            KOMMUNIKATIONS DB  WDP8 ****************************               
         PCB   TYPE=DB,DBDNAME=WLKOMA,PROCOPT=G,KEYLEN=28,POS=S                 
         SENSEG NAME=WLKOMA01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLKOMA11,PARENT=WLKOMA01,PROCOPT=GI                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WL6305,PROCOPT=G,KEYLEN=60,POS=S                 
         SENSEG NAME=WL630501                                                   
         SENSEG NAME=WL630511,PARENT=WL630501,PROCOPT=GIR                       
         SENSEG NAME=WL630521,PARENT=WL630511,PROCOPT=GI                        
* W510AVG                                                                       
         PCB   TYPE=DB,DBDNAME=WDG2,PROCOPT=GOT,KEYLEN=37,POS=S                 
         SENSEG NAME=WDG201,PARENT=0                                            
         SENSEG NAME=WDGX9306,PARENT=WDG201                                     
         SENSEG NAME=WDGX9308,PARENT=WDGX9306                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=8,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB617,PARENT=WDB601                                       
         SENSEG NAME=WDB621,PARENT=WDB617                                       
         SENSEG NAME=WDB622,PARENT=WDB617                                       
*                                                                               
* PRIS            GODSMOTTAGARE     WDB2                                        
         PCB     TYPE=DB,DBDNAME=WLGMTA,PROCOPT=GOT,KEYLEN=07,POS=S             
         SENSEG  NAME=WLGMTA01                                                  
*                                                                               
*                 BETALAREREGISTRET WDB1                                        
         PCB     TYPE=DB,DBDNAME=WLBETC,PROCOPT=GOT,KEYLEN=11,POS=S             
         SENSEG  NAME=WLBETC01                                                  
*                                                                               
*                   PRISREGISTRET WDC1                                          
         PCB     TYPE=DB,DBDNAME=WLPRIA,PROCOPT=GOT,KEYLEN=06,POS=S             
         SENSEG  NAME=WLPRIA01                                                  
*                                                                               
*                   PRIS RABATT REGISTER WDC2                                   
         PCB     TYPE=DB,DBDNAME=WLPRIB,PROCOPT=GOT,KEYLEN=25,POS=S             
         SENSEG  NAME=WLPRIB01,PARENT=0                                         
         SENSEG  NAME=WLPRIB11,PARENT=WLPRIB01                                  
         SENSEG  NAME=WLPRIB12,PARENT=WLPRIB01                                  
         SENSEG  NAME=WLPRIB13,PARENT=WLPRIB01                                  
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLGMTB,PROCOPT=GOT,KEYLEN=9,POS=S                
         SENSEG NAME=WLGMTB01,PARENT=0                                          
*                                                                               
*             RO-TÄCKNING                                                       
         PCB   TYPE=DB,DBDNAME=WL4505,PROCOPT=G,KEYLEN=35,POS=S                 
         SENSEG NAME=WL450501,PARENT=0                                          
         SENSEG NAME=WL450511,PARENT=WL450501,PROCOPT=I                         
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLFILC,PROCOPT=G,KEYLEN=27,POS=S                 
         SENSEG NAME=WLFILC01,PARENT=0,PROCOPT=GI                               
*                                                                               
*WDL901                                                                         
         PCB   TYPE=DB,DBDNAME=WLLOGA,PROCOPT=G,KEYLEN=20,POS=S                 
         SENSEG NAME=WLLOGA01,PARENT=0,PROCOPT=GI                               
*                                                                               
* PCB FÖR PLATSREGISTRET (WDJ9)                                                 
         PCB   TYPE=DB,DBDNAME=WLLOCB,PROCOPT=GIR,KEYLEN=25,POS=S               
         SENSEG NAME=WLLOCB01,PARENT=0                                          
         SENSEG NAME=WLLOCB11,PARENT=WLLOCB01                                   
*                                                                               
         PCB    TYPE=DB,DBDNAME=WLSAPA,PROCOPT=GI,KEYLEN=31,POS=S               
         SENSEG NAME=WLSAPA01,PARENT=0                                          
*                                                                               
******** SUBMODUL    W411ORDN  UTTAG AUT. ORDERNUMMER ********                  
*                                                                               
* ORDN-XXKP-PCB - AUTOMATISKA ORDERNUMMER WDR1  IDHTYP=4525                     
         PCB   TYPE=DB,DBDNAME=WLXXKP,PROCOPT=G,KEYLEN=35,POS=S                 
         SENSEG NAME=WLXXKP01,PARENT=0                                          
         SENSEG NAME=WLXXKP11,PARENT=WLXXKP01,PROCOPT=GR                        
*                                                                               
* ORDN-ORQL-PCB - ORDERHUVUDSREG KÖ (WDQ2C)-SEK.INDEX                           
         PCB   TYPE=DB,DBDNAME=WLORQL,PROCOPT=GOT,KEYLEN=17,POS=S               
         SENSEG NAME=WLORQL01,PARENT=0                                          
*                                                                               
* ORDN-PROC-PCB - PROFORMAHUVUDREG    WDE8                                      
         PCB   TYPE=DB,DBDNAME=WLPROC,PROCOPT=GOT,KEYLEN=17,POS=S               
         SENSEG NAME=WLPROC01,PARENT=0                                          
*                                                                               
* ORDN-ORQI-PCB - ORDERHUVUDSREG KÖ (WDQ201)                                    
         PCB   TYPE=DB,DBDNAME=WLORQI,PROCOPT=GOT,KEYLEN=04,POS=S               
         SENSEG NAME=WLORQI01,PARENT=0                                          
*                                                                               
********** SUBMODUL W335COST**************************************              
*                                                                               
* PRIS-COST-WDK6-PCB - ARTIKELINFORMATION WDK6                                  
         PCB     TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=19,POS=S               
         SENSEG  NAME=WDK601,PARENT=0                                           
         SENSEG  NAME=WDK611,PARENT=WDK601                                      
         SENSEG  NAME=WDK621,PARENT=WDK611                                      
*                                                                               
* PRIS-COST-WDK7-PCB - ARTIKELINFORMATION WDK7                                  
         PCB     TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG  NAME=WDK701,PARENT=0                                           
         SENSEG  NAME=WDK711,PARENT=WDK701                                      
*                                                                               
* PRIS-COST-WDF1-PCB - LEVERANTÖRSINFO WDF1                                     
         PCB     TYPE=DB,DBDNAME=WDF1,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG  NAME=WDF101,PARENT=0                                           
         SENSEG  NAME=WDF102,PARENT=WDF101                                      
*                                                                               
* PRIS-COST-WDG2-PCB - VALUTAINFORMATION WDG2                                   
         PCB   TYPE=DB,DBDNAME=WDG2,PROCOPT=GOT,KEYLEN=37,POS=S                 
         SENSEG NAME=WDG201,PARENT=0                                            
         SENSEG NAME=WDGX9306,PARENT=WDG201                                     
         SENSEG NAME=WDGX9308,PARENT=WDGX9306                                   
*                                                                               
* PRIS-COST-WDK72-PCB - ARTIKELREGISTER DC                                      
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=20,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK724,PARENT=WDK711                                       
*                                                                               
* PRIS-COST-WDB6-PCB - DC-REGISTER  WDB6                                        
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=3,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB617,PARENT=WDB601                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
* WDL7 ORDERINGÅNGSREGISTER SDC                                                 
         PCB   TYPE=DB,DBDNAME=WLOIGA,PROCOPT=G,KEYLEN=25,POS=S                 
         SENSEG NAME=WLOIGA01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLOIGA11,PARENT=WLOIGA01,PROCOPT=GI                        
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W60303                                       
         END                                                                    
