*                                                                               
         PCB   TYPE=TP,NAME=W0T606U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*        USER DATABASE                                                          
         PCB    TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                 
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
********* LOCATION REGISTER  WDJ8                                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLLOCA,PROCOPT=GOT,KEYLEN=11,POS=S               
         SENSEG NAME=WLLOCA01,PARENT=0                                          
*                                                                               
********* CDC LOCATION - ARTIKEL INDEX WDK6E                                    
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6E,PROCOPT=GOT,KEYLEN=12,POS=S                
         SENSEG NAME=WDK6E1,PARENT=0                                            
*                                                                               
********* BUFFER LOCATION - ARTIKEL INDEX WDD8A                                 
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTD,PROCOPT=GOT,KEYLEN=22,POS=S,     *        
               PROCSEQ=WDD8A                                                    
         SENSEG NAME=WLARTD11,PARENT=0                                          
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W60347                                       
         END                                                                    
