*                                                                               
         PCB   TYPE=TP,NAME=W0T606U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*        USER DATABASE                                                          
         PCB    TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                 
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
********* LOCATION REGISTER  WDJ8                                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLLOCA,PROCOPT=GOT,KEYLEN=11,POS=S               
         SENSEG NAME=WLLOCA01,PARENT=0                                          
*                                                                               
********* SDC LOCATION - ARTIKEL INDEX PER SDC WDK7A                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTR,PROCOPT=GOT,KEYLEN=14,POS=S               
         SENSEG NAME=WLARTR01,PARENT=0                                          
*                                                                               
********* BUFFER LOCATION - ARTIKEL INDEX WDD8A                                 
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTD,PROCOPT=GOT,KEYLEN=22,POS=S,     *        
               PROCSEQ=WDD8A                                                    
         SENSEG NAME=WLARTD11,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W60316                                       
         END                                                                    
