*                                                                               
         PCB   TYPE=TP,NAME=W0T606U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB    TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                 
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=G,KEYLEN=07,POS=S                 
         SENSEG NAME=WLARTC01,PARENT=0,PROCOPT=G                                
         SENSEG NAME=WLARTC11,PARENT=WLARTC01,PROCOPT=GR                        
         SENSEG NAME=WLARTC25,PARENT=WLARTC11,PROCOPT=GIRD                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=G,KEYLEN=08,POS=S                   
         SENSEG NAME=WDK601,PARENT=0,PROCOPT=G                                  
         SENSEG NAME=WDK611,PARENT=WDK601,PROCOPT=G                             
         SENSEG NAME=WDK629,PARENT=WDK611,PROCOPT=GR                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTS,PROCOPT=G,KEYLEN=07,POS=S                 
         SENSEG NAME=WLARTS01,PARENT=0,PROCOPT=G                                
         SENSEG NAME=WLARTS11,PARENT=WLARTS01,PROCOPT=GR                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=07,POS=S                   
         SENSEG NAME=WDK701,PARENT=0,PROCOPT=G                                  
         SENSEG NAME=WDK711,PARENT=WDK701,PROCOPT=GR                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=13,POS=S,     *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WL4505,PROCOPT=G,KEYLEN=35,POS=S                 
         SENSEG NAME=WL450501,PARENT=0,PROCOPT=G                                
         SENSEG NAME=WL450511,PARENT=WL450501,PROCOPT=GI                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDP3,PROCOPT=GOT,KEYLEN=10,POS=S                 
         SENSEG NAME=WDP301,PARENT=0                                            
         SENSEG NAME=WDP311,PARENT=WDP301                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDP3A,PROCOPT=GOT,KEYLEN=22,POS=S                
         SENSEG NAME=WDP3A1,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6D2,PROCOPT=GOT,KEYLEN=18,POS=S                 
         SENSEG NAME=W6D201                                                     
         SENSEG NAME=W6D211,PARENT=W6D201                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDP3B,PROCOPT=GOT,KEYLEN=20,POS=S                
         SENSEG NAME=WDP3B1,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDP3C,PROCOPT=GOT,KEYLEN=16,POS=S                
         SENSEG NAME=WDP3C1,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR2,PROCOPT=GOT,KEYLEN=34,POS=S                 
         SENSEG NAME=WDR201,PARENT=0                                            
         SENSEG NAME=WDGX6332,PARENT=WDR201                                     
         SENSEG NAME=WDGX6334,PARENT=WDGX6332                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=G,KEYLEN=40,POS=S                   
         SENSEG NAME=WDR501,PARENT=0                                            
         SENSEG NAME=WDGX2404,PARENT=WDR501,PROCOPT=GRD                         
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W60308                                       
         END                                                                    
