*                                                                               
         PCB   TYPE=TP,NAME=W6T397,ALTRESP=NO,SAMETRM=NO,              *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB    TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                 
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDL6,PROCOPT=GOT,KEYLEN=21,POS=S                 
         SENSEG NAME=WDL601,PARENT=0                                            
         SENSEG NAME=WDL611,PARENT=WDL601                                       
         SENSEG NAME=WDL621,PARENT=WDL611                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=8,POS=S,      *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W60307                                       
         END                                                                    
