*                                                                               
*  -- ALT-HOPP-PCB                                                              
         PCB   TYPE=TP,NAME=W6T303,ALTRESP=NO,SAMETRM=NO,              *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*  -- ALT-DISP-PCB - START AV DISPATCHER-PGM W0069300 ***********               
         PCB   TYPE=TP,NAME=W0T693X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=TP,NAME=W0T606U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=TP,NAME=W6T303X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
* L6301-PCB                                                                     
         PCB   TYPE=DB,DBDNAME=WL6301,PROCOPT=G,KEYLEN=42,POS=S                 
         SENSEG NAME=WL630101                                                   
         SENSEG NAME=WL630111,PARENT=WL630101,PROCOPT=GRD                       
*                                                                               
* LINLC-PCB  SEK.INDEX  WDL6A                                                   
         PCB   TYPE=DB,DBDNAME=WLINLC,PROCOPT=GOT,KEYLEN=21,POS=S,     *        
               PROCSEQ=WDL6A                                                    
         SENSEG NAME=WLINLC11                                                   
*                                                                               
* LINLC-PCB                                                                     
         PCB   TYPE=DB,DBDNAME=WLINLC,PROCOPT=G,KEYLEN=21,POS=S                 
         SENSEG NAME=WLINLC01                                                   
         SENSEG NAME=WLINLC11,PARENT=WLINLC01,PROCOPT=GR                        
*                                                                               
* LINLD-PCB                                                                     
         PCB   TYPE=DB,DBDNAME=WLINLD,PROCOPT=GOT,KEYLEN=42,POS=S               
         SENSEG NAME=WLINLD01                                                   
*                                                                               
* LARTS-PCB                                                                     
         PCB   TYPE=DB,DBDNAME=WLARTS,PROCOPT=G,KEYLEN=7,POS=S                  
         SENSEG NAME=WLARTS01                                                   
         SENSEG NAME=WLARTS11,PARENT=WLARTS01,PROCOPT=GR                        
*                                                                               
* KOMA-PCB - KOMMUNIKATIONS DB  WDP8 ****************************               
         PCB   TYPE=DB,DBDNAME=WLKOMA,PROCOPT=G,KEYLEN=28,POS=S                 
         SENSEG NAME=WLKOMA01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLKOMA11,PARENT=WLKOMA01,PROCOPT=GI                        
*                                                                               
* FILB-PCB                                                                      
         PCB   TYPE=DB,DBDNAME=WLFILB,PROCOPT=G,KEYLEN=27,POS=S                 
         SENSEG NAME=WLFILB01,PARENT=0,PROCOPT=GI                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLGMTB,PROCOPT=GOT,KEYLEN=9,POS=S                
         SENSEG NAME=WLGMTB01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=G,KEYLEN=6,POS=S                  
         SENSEG NAME=WLARTC01                                                   
         SENSEG NAME=WLARTC11,PARENT=WLARTC01,PROCOPT=GR                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WL6305,PROCOPT=G,KEYLEN=60,POS=S                 
         SENSEG NAME=WL630501                                                   
         SENSEG NAME=WL630511,PARENT=WL630501,PROCOPT=GIR                       
         SENSEG NAME=WL630521,PARENT=WL630511,PROCOPT=GI                        
*                                                                               
*    WDL9, SALDOFÖRÄNDRINGAR                                                    
*                                                                               
         PCB    TYPE=DB,DBDNAME=WLLOGA,PROCOPT=GI,KEYLEN=20,POS=S               
         SENSEG NAME=WLLOGA01,PARENT=0                                          
*                                                                               
         PCB    TYPE=DB,DBDNAME=WLSAPA,PROCOPT=GI,KEYLEN=31,POS=S               
         SENSEG NAME=WLSAPA01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLFILC,PROCOPT=G,KEYLEN=27,POS=S                 
         SENSEG NAME=WLFILC01,PARENT=0,PROCOPT=GI                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6G1,PROCOPT=GOT,KEYLEN=35,POS=S                 
         SENSEG NAME=W6G101,PARENT=0                                            
         SENSEG NAME=W6G130,PARENT=W6G101                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W60302                                       
         END                                                                    
