*                                                                               
*        USER DATABASE                                                          
         PCB    TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                 
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
*        FREQUENCY CODE REGISTER  WDR2                                          
         PCB   TYPE=DB,DBDNAME=WL6313,PROCOPT=G,KEYLEN=32,POS=S                 
         SENSEG NAME=WL631301,PARENT=0                                          
         SENSEG NAME=WL631311,PARENT=WL631301,PROCOPT=A                         
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W60311                                       
         END                                                                    
