*                                                                               
         PCB   TYPE=DB,DBDNAME=W6LASA,PROCOPT=G,KEYLEN=45,POS=S                 
         SENSEG NAME=W6LASA01,PARENT=0                                          
         SENSEG NAME=W6LASA11,PARENT=W6LASA01,PROCOPT=GD                        
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W61186,CMPAT=YES                             
         END                                                                    
