*                                                                               
         PCB   TYPE=DB,DBDNAME=W6G1,PROCOPT=GOT,KEYLEN=35,POS=S                 
         SENSEG NAME=W6G101,PARENT=0                                            
         SENSEG NAME=W6G130,PARENT=W6G101                                       
         SENSEG NAME=W6GX6008,PARENT=W6G101                                     
*                                                                               
        PSBGEN LANG=COBOL,PSBNAME=W6115A                                        
        END                                                                     
