*                                                                               
         PCB   TYPE=DB,DBDNAME=WDT2,PROCOPT=G,KEYLEN=28,POS=S                   
         SENSEG NAME=WDT201,PARENT=0                                            
         SENSEG NAME=WDT211,PARENT=WDT201,PROCOPT=GD                            
         SENSEG NAME=WDT212,PARENT=WDT201,PROCOPT=GD                            
         SENSEG NAME=WDT213,PARENT=WDT201,PROCOPT=GD                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W6118B,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
