*                                                                               
         PCB   TYPE=DB,DBDNAME=W6FILA,PROCOPT=G,KEYLEN=27,POS=S                 
         SENSEG NAME=W6FILA01,PARENT=0,PROCOPT=GD                               
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W61185,CMPAT=YES                             
         END                                                                    
