*                                                                               
         PCB   TYPE=DB,DBDNAME=W6PLAA,PROCOPT=G,KEYLEN=35,POS=S                 
         SENSEG NAME=W6PLAA01,PARENT=0                                          
         SENSEG NAME=W6PLAA11,PARENT=W6PLAA01,PROCOPT=GR                        
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W61183,CMPAT=YES                             
         END                                                                    
