*                                                                               
         PCB   TYPE=DB,DBDNAME=WLFILA,PROCOPT=G,KEYLEN=27,POS=S                 
         SENSEG NAME=WLFILA01,PARENT=0,PROCOPT=GD                               
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W61107,CMPAT=YES                             
         END                                                                    
