* DISP-MSG-PCB - FEL/KLAR MEDDELANDE TILL DISPATCHERN                           
         PCB   TYPE=TP,NAME=W0T693X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=TP,NAME=W6T191X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=TP,NAME=W6T196X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=6,POS=S                
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=8,POS=S,      *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6INLA,PROCOPT=G,KEYLEN=25,POS=S                 
         SENSEG NAME=W6INLA01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=W6INLA11,PARENT=W6INLA01,PROCOPT=GI                        
         SENSEG NAME=W6INLA21,PARENT=W6INLA11,PROCOPT=GI                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6PLAA,PROCOPT=GOT,KEYLEN=35,POS=S               
         SENSEG NAME=W6PLAA01,PARENT=0                                          
         SENSEG NAME=W6PLAA11,PARENT=W6PLAA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6LOPA,PROCOPT=G,KEYLEN=31,POS=S                 
         SENSEG NAME=W6LOPA01,PARENT=0                                          
         SENSEG NAME=W6LOPA11,PARENT=W6LOPA01,PROCOPT=GR                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6CKPF,PROCOPT=G,KEYLEN=31,POS=S                 
         SENSEG NAME=W6CKPF01,PARENT=0,PROCOPT=GIR                              
         SENSEG NAME=W6CKPF11,PARENT=W6CKPF01,PROCOPT=GIR                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDJ2,PROCOPT=GOT,KEYLEN=4,POS=S                  
         SENSEG NAME=WDJ201,PARENT=0                                            
*                                                                               
* PCB FÖR SUBPGM W006KOM                                                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLKOMA,PROCOPT=G,KEYLEN=28,POS=S                 
         SENSEG NAME=WLKOMA01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLKOMA11,PARENT=WLKOMA01,PROCOPT=GI                        
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W61102,CMPAT=YES                             
         END                                                                    
