         PCB   TYPE=DB,DBDNAME=W6G1,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=W6G101,PARENT=0                                            
         SENSEG NAME=W6G123,PARENT=W6G101                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W61196                                       
         END                                                                    
