*          DATA SET W21160PII0 AT LEVEL 005 AS OF 88/12/09                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=06,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDL2,PROCOPT=GOT,KEYLEN=21,POS=S                 
         SENSEG NAME=WDL201,PARENT=0                                            
         SENSEG NAME=WDL211,PARENT=WDL201                                       
         SENSEG NAME=WDL221,PARENT=WDL211                                       
         SENSEG NAME=WDL222,PARENT=WDL211                                       
         SENSEG NAME=WDL223,PARENT=WDL211                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W61188                                       
         END                                                                    
