*                                                                               
         PCB    TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=19,POS=S                
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
         SENSEG NAME=WDK621,PARENT=WDK611                                       
*                                                                               
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W61167                                       
         END                                                                    
