*          DATA SET W21160PII0 AT LEVEL 005 AS OF 88/12/09                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDL2,PROCOPT=G,KEYLEN=21,POS=S                   
         SENSEG NAME=WDL201,PARENT=0                                            
         SENSEG NAME=WDL211,PARENT=WDL201,PROCOPT=GD                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W61189                                       
         END                                                                    
