*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=G,KEYLEN=6,POS=S                    
         SENSEG NAME=WDK601,PARENT=0,PROCOPT=G                                  
         SENSEG NAME=WDK611,PARENT=WDK601,PROCOPT=GR                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W61117,CMPAT=YES                             
         END                                                                    
