*                                                                               
         PCB   TYPE=DB,DBDNAME=W6UPFB,PROCOPT=G,KEYLEN=21,POS=S                 
         SENSEG NAME=W6UPFB01,PARENT=0,PROCOPT=GD                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6INLC,PROCOPT=GOT,KEYLEN=5,POS=S                
         SENSEG NAME=W6INLC01,PARENT=0                                          
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W61193,CMPAT=YES                             
         END                                                                    
