*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=G,KEYLEN=19,POS=S                   
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601,PROCOPT=GR                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDT3,PROCOPT=G,KEYLEN=20,POS=S                   
         SENSEG NAME=WDT301,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDT311,PARENT=WDT301,PROCOPT=GI                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W6116A                                       
         END                                                                    
