*                                                                               
         PCB   TYPE=DB,DBDNAME=W6D1,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=W6D101,PARENT=0                                            
         SENSEG NAME=W6D111,PARENT=W6D101                                       
         SENSEG NAME=W6D121,PARENT=W6D111                                       
*                                                                               
* PCBER FÖR W611STYR                                                            
         PCB   TYPE=DB,DBDNAME=W6HANB,PROCOPT=GOT,KEYLEN=37,POS=S               
         SENSEG NAME=W6HANB01,PARENT=0                                          
         SENSEG NAME=W6HANB11,PARENT=W6HANB01                                   
         SENSEG NAME=W6HANB12,PARENT=W6HANB01                                   
         SENSEG NAME=W6HANB13,PARENT=W6HANB01                                   
         SENSEG NAME=W6HANB14,PARENT=W6HANB01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6PLAA,PROCOPT=GOT,KEYLEN=35,POS=S               
         SENSEG NAME=W6PLAA01,PARENT=0                                          
         SENSEG NAME=W6PLAA11,PARENT=W6PLAA01                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W61110                                       
         END                                                                    
