*                                                                               
         PCB   TYPE=DB,DBDNAME=WLINLC,PROCOPT=GOT,KEYLEN=21,POS=S               
         SENSEG NAME=WLINLC01                                                   
         SENSEG NAME=WLINLC11,PARENT=WLINLC01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLINLD,PROCOPT=GOT,KEYLEN=42,POS=S               
         SENSEG NAME=WLINLD01                                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=13,POS=S,     *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WL6301,PROCOPT=GOT,KEYLEN=42,POS=S               
         SENSEG NAME=WL630101                                                   
         SENSEG NAME=WL630111,PARENT=WL630101                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W61202                                       
         END                                                                    
