*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR3,PROCOPT=GOT,KEYLEN=27,POS=S                 
         SENSEG NAME=WDR301,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=19,POS=S                 
         SENSEG NAME=WDK601                                                     
         SENSEG NAME=WDK611,PARENT=WDK601                                       
         SENSEG NAME=WDK621,PARENT=WDK611                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W61244                                       
         END                                                                    
