*                                                                               
         PCB   TYPE=DB,DBDNAME=WDJ8,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDJ801,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WL6313,PROCOPT=GOT,KEYLEN=32,POS=S               
         SENSEG NAME=WL631301,PARENT=0                                          
         SENSEG NAME=WL631311,PARENT=WL631301                                   
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W61211                                       
         END                                                                    
