*                                                                               
         PCB   TYPE=DB,DBDNAME=WLFILC,PROCOPT=GOT,KEYLEN=27,POS=S               
         SENSEG NAME=WLFILC01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=06,POS=S               
         SENSEG NAME=WLARTC01                                                   
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTS,PROCOPT=GOT,KEYLEN=07,POS=S               
         SENSEG NAME=WLARTS01                                                   
         SENSEG NAME=WLARTS11,PARENT=WLARTS01                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W61236                                       
         END                                                                    
