*                                                                               
*        EVENT 6301/WDGX6302                                                    
         PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=GOT,KEYLEN=42,POS=S                 
         SENSEG NAME=WDR501,PARENT=0                                            
         SENSEG NAME=WDGX6302,PARENT=WDR501                                     
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDM7,PROCOPT=GOT,KEYLEN=15,POS=S                 
         SENSEG NAME=WDM701,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDQ2,PROCOPT=GOT,KEYLEN=19,POS=S,       *        
               PROCSEQ=WDQ2C                                                    
         SENSEG NAME=WDQ201,PARENT=0                                            
         SENSEG NAME=WDQ212,PARENT=WDQ201                                       
*                                                                               
*        EVENT 4433/WDGX4434                                                    
         PCB   TYPE=DB,DBDNAME=WDR1,PROCOPT=GOT,KEYLEN=40,POS=S                 
         SENSEG NAME=WDR101,PARENT=0                                            
         SENSEG NAME=WDR130,PARENT=WDR101                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W61221                                       
         END                                                                    
