* EVENT 6301/WDGX6302                                                           
         PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=G,KEYLEN=42,POS=S                   
         SENSEG NAME=WDR501,PARENT=0                                            
         SENSEG NAME=WDGX6302,PARENT=WDR501,PROCOPT=GR                          
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W61227,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
