*                                                                               
         PCB   TYPE=DB,DBDNAME=WLINLC,PROCOPT=GOT,KEYLEN=21,POS=S               
         SENSEG NAME=WLINLC01                                                   
         SENSEG NAME=WLINLC11,PARENT=WLINLC01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDK701                                                     
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK712,PARENT=WDK701                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLINLD,PROCOPT=GOT,KEYLEN=42,POS=S               
         SENSEG NAME=WLINLD01                                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WL6301,PROCOPT=GOT,KEYLEN=42,POS=S               
         SENSEG NAME=WL630101                                                   
         SENSEG NAME=WL630111,PARENT=WL630101                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=8,POS=S                  
         SENSEG NAME=WDK601                                                     
         SENSEG NAME=WDK611,PARENT=WDK601                                       
         SENSEG NAME=WDK629,PARENT=WDK611                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=8,POS=S,      *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6KVAH,PROCOPT=GOT,KEYLEN=18,POS=S               
         SENSEG NAME=W6KVAH01                                                   
         SENSEG NAME=W6KVAH11,PARENT=W6KVAH01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=02,POS=S                 
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W61242                                       
         END                                                                    
