*                                                                               
         PCB   TYPE=DB,DBDNAME=WDJ9,PROCOPT=G,KEYLEN=25,POS=S                   
         SENSEG NAME=WDJ901,PARENT=0                                            
         SENSEG NAME=WDJ911,PARENT=WDJ901,PROCOPT=D                             
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W61299,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
