*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=8,POS=S                    
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701,PROCOPT=A                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDJ9,PROCOPT=G,KEYLEN=25,POS=S                   
         SENSEG NAME=WDJ901,PARENT=0                                            
         SENSEG NAME=WDJ911,PARENT=WDJ901,PROCOPT=A                             
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W61298,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
************************************                                            
