*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR3,PROCOPT=GOT,KEYLEN=27,POS=S                 
         SENSEG NAME=WDR301,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=6,POS=S                  
         SENSEG NAME=WDK601                                                     
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE4C,PROCOPT=GOT,KEYLEN=12,POS=S                
         SENSEG NAME=WDE4C1,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE4,PROCOPT=GOT,KEYLEN=23,POS=S                 
         SENSEG NAME=WDE401,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE4,PROCOPT=GOT,KEYLEN=33,POS=S,       *        
               PROCSEQ=WDE4A                                                    
         SENSEG NAME=WDE401,PARENT=0                                            
         SENSEG NAME=WDE411,PARENT=WDE401                                       
         SENSEG NAME=WDE421,PARENT=WDE411                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W61247                                       
         END                                                                    
