*                                                                               
         PCB   TYPE=DB,DBDNAME=WL6305,PROCOPT=G,KEYLEN=60,POS=S                 
         SENSEG NAME=WL630501                                                   
         SENSEG NAME=WL630511,PARENT=WL630501,PROCOPT=GD                        
         SENSEG NAME=WL630521,PARENT=WL630511,PROCOPT=GD                        
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W61224,CMPAT=YES                             
         END                                                                    
