*                                                                               
         PCB   TYPE=TP,NAME=,ALTRESP=NO,SAMETRM=NO,                    *        
               MODIFY=YES,EXPRESS=NO                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD8,PROCOPT=GOT,KEYLEN=22,POS=S,       *        
               PROCSEQ=WDD8A                                                    
         SENSEG NAME=WDD811,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7A,PROCOPT=GOT,KEYLEN=14,POS=S                
         SENSEG NAME=WDK7A1,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDJ8,PROCOPT=GOT,KEYLEN=11,POS=S                 
         SENSEG NAME=WDJ801,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W61293,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
