*                                                                               
* WDK7-PCB  - ARTIKEL S-LAGER                                                   
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
*                                                                               
* WDB6-PCB                                                                      
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=02,POS=S                 
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W61268                                       
         END                                                                    
