* EVENT 6301/WDGX6302                                                           
         PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=G,KEYLEN=42,POS=S                   
         SENSEG NAME=WDR501,PARENT=0                                            
         SENSEG NAME=WDGX6302,PARENT=WDR501,PROCOPT=GIRD                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDL6,PROCOPT=G,KEYLEN=21,POS=S                   
         SENSEG NAME=WDL601                                                     
         SENSEG NAME=WDL611,PARENT=WDL601,PROCOPT=GR                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDL6A,PROCOPT=GOT,KEYLEN=42,POS=S                
         SENSEG NAME=WDL6A1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W6122A,CMPAT=YES                             
         END                                                                    
