         PCB   TYPE=DB,DBDNAME=WDT1,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDT101,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W61322                                       
         END                                                                    
