*                                                                               
         PCB   TYPE=DB,DBDNAME=W6D2,PROCOPT=GOT,KEYLEN=18,POS=S                 
         SENSEG NAME=W6D201                                                     
         SENSEG NAME=W6D211,PARENT=W6D201                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDP3,PROCOPT=GOT,KEYLEN=10,POS=S                 
         SENSEG NAME=WDP301,PARENT=0                                            
         SENSEG NAME=WDP311,PARENT=WDP301                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W61420                                       
         END                                                                    
