*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=G,KEYLEN=40,POS=S                   
         SENSEG NAME=WDR501,PARENT=0,PROCOPT=GID                                
         SENSEG NAME=WDGX2404,PARENT=WDR501,PROCOPT=GID                         
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W61414,CMPAT=YES                             
         END                                                                    
