***                                                                             
         PCB   TYPE=DB,DBDNAME=WDR2,PROCOPT=G,KEYLEN=40,POS=S                   
         SENSEG NAME=WDR201,PARENT=0                                            
         SENSEG NAME=WDGX6342,PARENT=WDR201,PROCOPT=GIRD                        
         SENSEG NAME=WDGX6344,PARENT=WDGX6342,PROCOPT=GIRD                      
**                                                                              
         PSBGEN LANG=COBOL,PSBNAME=W61553                                       
         END                                                                    
