*                                                                               
         PCB   TYPE=DB,DBDNAME=WDJ9,PROCOPT=GOT,KEYLEN=25,POS=S                 
         SENSEG NAME=WDJ901,PARENT=0                                            
         SENSEG NAME=WDJ911,PARENT=WDJ901                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=8,POS=S,      *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W61536                                       
         END                                                                    
