*                                                                               
*        LOCATION REGISTER  WDJ8                                                
         PCB   TYPE=DB,DBDNAME=WDJ8,PROCOPT=GOT,KEYLEN=11,POS=S                 
         SENSEG NAME=WDJ801,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7A,PROCOPT=GOT,KEYLEN=14,POS=S                
         SENSEG NAME=WDK7A1,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD8A,PROCOPT=GOT,KEYLEN=22,POS=S                
         SENSEG NAME=WDD8A1,PARENT=0                                            
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W61552                                       
         END                                                                    
