*                                                                               
         PCB   TYPE=DB,DBDNAME=W6D1,PROCOPT=GOT,KEYLEN=210,POS=S                
*                                                                               
         SENSEG NAME=W6D101,PARENT=0                                            
         SENSEG NAME=W6D111,PARENT=W6D101                                       
         SENSEG NAME=W6D121,PARENT=W6D111                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W6D1BL                                       
         END                                                                    
