*                                                                               
         PCB   TYPE=DB,DBDNAME=W6D1B,PROCOPT=GOT,KEYLEN=210,POS=S               
*                                                                               
         SENSEG NAME=W6D1B1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W6D1BP                                       
         END                                                                    
