*        KVALITETSKONTROLL                                                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6D2,PROCOPT=GOT,KEYLEN=210,POS=S                
*                                                                               
         SENSEG NAME=W6D201,PARENT=0                                            
         SENSEG NAME=W6D211,PARENT=W6D201                                       
         SENSEG NAME=W6D221,PARENT=W6D211                                       
         SENSEG NAME=W6D212,PARENT=W6D201                                       
         SENSEG NAME=W6D222,PARENT=W6D212                                       
         SENSEG NAME=W6D213,PARENT=W6D201                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W6D2BL                                       
         END                                                                    
