*                                                                               
         PCB   TYPE=DB,DBDNAME=W6G1,PROCOPT=A,KEYLEN=37,POS=S                   
*                                                                               
         SENSEG NAME=W6G101,PARENT=0                                            
         SENSEG NAME=W6G110,PARENT=W6G101                                       
         SENSEG NAME=W6G121,PARENT=W6G101                                       
         SENSEG NAME=W6G122,PARENT=W6G101                                       
         SENSEG NAME=W6G123,PARENT=W6G101                                       
         SENSEG NAME=W6G124,PARENT=W6G101                                       
         SENSEG NAME=W6G130,PARENT=W6G101                                       
         SENSEG NAME=W6GX6008,PARENT=W6G101                                     
         SENSEG NAME=W6G140,PARENT=W6G101                                       
         SENSEG NAME=W6G150,PARENT=W6G101                                       
         SENSEG NAME=W6G160,PARENT=W6G101                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W6G1UP,CMPAT=YES                             
         END                                                                    
