*                                                                               
         PCB   TYPE=DB,DBDNAME=W6G2,PROCOPT=GOT,KEYLEN=210,POS=S                
*                                                                               
         SENSEG NAME=W6G201,PARENT=0                                            
         SENSEG NAME=W6G210,PARENT=W6G201                                       
         SENSEG NAME=W6G215,PARENT=W6G210                                       
         SENSEG NAME=W6G230,PARENT=W6G201                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W6G2BL                                       
         END                                                                    
