*        KVALITET LAGERINDELNING                                                
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6H5,PROCOPT=A,KEYLEN=15,POS=S                   
         SENSEG NAME=W6H501,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W6H5UP,CMPAT=YES                             
         END                                                                    
