*        KVALITET LAGERKONTROLL                                                 
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6H6,PROCOPT=A,KEYLEN=21,POS=S                   
         SENSEG NAME=W6H601,PARENT=0                                            
         SENSEG NAME=W6H611,PARENT=W6H601                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W6H6UP,CMPAT=YES                             
         END                                                                    
