*        KVALITET LAGERKONTROLL                                                 
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6H6A,PROCOPT=GOT,KEYLEN=15,POS=S                
         SENSEG NAME=W6H6A1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W6H6AP                                       
         END                                                                    
