*                                                                               
         PCB   TYPE=DB,DBDNAME=W6H7,PROCOPT=A,KEYLEN=8,POS=S                    
         SENSEG NAME=W6H701,PARENT=0                                            
         SENSEG NAME=W6H711,PARENT=W6H701                                       
         SENSEG NAME=W6H712,PARENT=W6H701                                       
         SENSEG NAME=W6H721,PARENT=W6H712                                       
         SENSEG NAME=W6H713,PARENT=W6H701                                       
         SENSEG NAME=W6H714,PARENT=W6H701                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W6H7UP,CMPAT=YES                             
         END                                                                    
