*                                                                               
         PCB   TYPE=DB,DBDNAME=W6H7A,PROCOPT=GOT,KEYLEN=23,POS=S                
         SENSEG NAME=W6H7A1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W6H7AP                                       
         END                                                                    
