*                                                                               
         PCB   TYPE=DB,DBDNAME=W6H7C,PROCOPT=GOT,KEYLEN=18,POS=S                
         SENSEG NAME=W6H7C1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W6H7CP                                       
         END                                                                    
