*                                                                               
         PCB   TYPE=DB,DBDNAME=W6L1,PROCOPT=GOT,KEYLEN=210,POS=S                
*                                                                               
         SENSEG NAME=W6L101,PARENT=0                                            
         SENSEG NAME=W6L111,PARENT=W6L101                                       
         SENSEG NAME=W6L112,PARENT=W6L101                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W6L1BL                                       
         END                                                                    
