*                                                                               
         PCB   TYPE=DB,DBDNAME=W6L2,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=W6L201,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W6L2BL                                       
         END                                                                    
