*                                                                               
* INLC-PCB  - INLEVERANS SEK.INDEX B (IDLOPNRM, ..)                             
         PCB   TYPE=DB,DBDNAME=W6INLC,PROCOPT=GOT,KEYLEN=25,POS=S               
         SENSEG NAME=W6INLC01,PARENT=0                                          
*                                                                               
* INLA-PCB  - INLEVERANS                                                        
         PCB   TYPE=DB,DBDNAME=W6INLA,PROCOPT=G,KEYLEN=25,POS=S                 
         SENSEG NAME=W6INLA01,PARENT=0                                          
         SENSEG NAME=W6INLA11,PARENT=W6INLA01,PROCOPT=GR                        
         SENSEG NAME=W6INLA21,PARENT=W6INLA11,PROCOPT=GR                        
*                                                                               
* ARTC-PCB  - ARTIKELINFORMATION WDK6                                           
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=G,KEYLEN=19,POS=S                 
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01,PROCOPT=GR                        
         SENSEG NAME=WLARTC21,PARENT=WLARTC11,PROCOPT=GR                        
         SENSEG NAME=WLARTC23,PARENT=WLARTC11,PROCOPT=G                         
*                                                                               
*                                                                               
* INLB-PCB  - LEVERANSPLAN WDD9                                                 
         PCB   TYPE=DB,DBDNAME=WLINLB,PROCOPT=GP,KEYLEN=25,POS=S                
         SENSEG NAME=WLINLB01,PARENT=0                                          
         SENSEG NAME=WLINLB11,PARENT=WLINLB01,PROCOPT=GR                        
         SENSEG NAME=WLINLB23,PARENT=WLINLB11,PROCOPT=GRP                       
         SENSEG NAME=WLINLB31,PARENT=WLINLB23,PROCOPT=GDP                       
*                                                                               
* INLE-PCB  - INLEVERANS-HISTORIK WDL2                                          
         PCB   TYPE=DB,DBDNAME=WLINLE,PROCOPT=G,KEYLEN=21,POS=S                 
         SENSEG NAME=WLINLE01,PARENT=0                                          
         SENSEG NAME=WLINLE11,PARENT=WLINLE01,PROCOPT=I                         
         SENSEG NAME=WLINLE21,PARENT=WLINLE11,PROCOPT=GIR                       
*                                                                               
* ZZAC-PCB  - LOGG WDG6                                                         
         PCB   TYPE=DB,DBDNAME=WLZZAC,PROCOPT=G,KEYLEN=18,POS=S                 
         SENSEG NAME=WLZZAC01,PARENT=0,PROCOPT=I                                
*                                                                               
* LASA-PCB                                                                      
         PCB   TYPE=DB,DBDNAME=W6LASA,PROCOPT=G,KEYLEN=68,POS=S                 
         SENSEG NAME=W6LASA01,PARENT=0                                          
         SENSEG NAME=W6LASA11,PARENT=W6LASA01,PROCOPT=G                         
         SENSEG NAME=W6LASA21,PARENT=W6LASA11,PROCOPT=GD                        
*                                                                               
* KVAE-PCB  - KR-REGISTER                                                       
         PCB   TYPE=DB,DBDNAME=W6KVAE,PROCOPT=GOT,KEYLEN=18,POS=S,     *        
               PROCSEQ=W6H7C                                                    
         SENSEG NAME=W6KVAE01,PARENT=0                                          
*                                                                               
* ARTS-PCB  - ARTIKELINFORMATION WDK7                                           
         PCB   TYPE=DB,DBDNAME=WLARTS,PROCOPT=G,KEYLEN=07,POS=S                 
         SENSEG NAME=WLARTS01,PARENT=0                                          
         SENSEG NAME=WLARTS11,PARENT=WLARTS01,PROCOPT=GR                        
*                                                                               
* INLC-PCB  - INLEVERANSHISTORIK WDL6                                           
         PCB   TYPE=DB,DBDNAME=WLINLC,PROCOPT=G,KEYLEN=21,POS=S                 
         SENSEG NAME=WLINLC01,PARENT=0                                          
         SENSEG NAME=WLINLC11,PARENT=WLINLC01,PROCOPT=GIR                       
         SENSEG NAME=WLINLC12,PARENT=WLINLC01,PROCOPT=GRD                       
*                                                                               
* SALDOFÖRÄNDRINGAR WDL9                                                        
         PCB     TYPE=DB,DBDNAME=WLLOGA,PROCOPT=GI,KEYLEN=20,POS=S              
         SENSEG  NAME=WLLOGA01,PARENT=0                                         
*                                                                               
* FILB-PCB  - EKOTRANSAR WDR8                                                   
         PCB   TYPE=DB,DBDNAME=WLFILB,PROCOPT=G,KEYLEN=27,POS=S                 
         SENSEG NAME=WLFILB01,PARENT=0,PROCOPT=GI                               
*                                                                               
* SAPA-PCB WDR9                                                                 
         PCB    TYPE=DB,DBDNAME=WLSAPA,PROCOPT=GI,KEYLEN=31,POS=S               
         SENSEG NAME=WLSAPA01,PARENT=0                                          
*                                                                               
**** W510CURR                                                                   
         PCB   TYPE=DB,DBDNAME=WDG2,PROCOPT=GOT,KEYLEN=37,POS=S                 
         SENSEG NAME=WDG201,PARENT=0                                            
         SENSEG NAME=WDGX9306,PARENT=WDG201                                     
         SENSEG NAME=WDGX9308,PARENT=WDGX9306                                   
**** W510AVG                                                                    
         PCB   TYPE=DB,DBDNAME=WDG2,PROCOPT=GOT,KEYLEN=37,POS=S                 
         SENSEG NAME=WDG201,PARENT=0                                            
         SENSEG NAME=WDGX9306,PARENT=WDG201                                     
         SENSEG NAME=WDGX9308,PARENT=WDGX9306                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=8,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB617,PARENT=WDB601                                       
         SENSEG NAME=WDB621,PARENT=WDB617                                       
         SENSEG NAME=WDB622,PARENT=WDB617                                       
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6  (LEV-PCB)                                       
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=3,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB617,PARENT=WDB601                                       
*                                                                               
* WDK7 ARTIKELREGISTER DC                                                       
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=20,POS=S                   
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK723,PARENT=WDK711                                       
         SENSEG NAME=WDK724,PARENT=WDK711,PROCOPT=GR                            
         SENSEG NAME=WDK712,PARENT=WDK701,PROCOPT=GR                            
*                                                                               
* LEV                                                                           
         PCB   TYPE=DB,DBDNAME=WDF1,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDF101,PARENT=0                                            
         SENSEG NAME=WDF102,PARENT=WDF101                                       
*                                                                               
* WDG2-PCB/9305-PCB                                                             
        PCB   TYPE=DB,DBDNAME=WDG2,PROCOPT=GOT,KEYLEN=37,POS=S                  
        SENSEG NAME=WDG201,PARENT=0                                             
        SENSEG NAME=WDGX9306,PARENT=WDG201                                      
        SENSEG NAME=WDGX9308,PARENT=WDGX9306                                    
*                                                                               
        PSBGEN LANG=COBOL,PSBNAME=W6W119                                        
        END                                                                     
