*                                                                               
         PCB   TYPE=DB,DBDNAME=W6KVAE,PROCOPT=G,KEYLEN=5,POS=S                  
         SENSEG NAME=W6KVAE01,PARENT=0                                          
         SENSEG NAME=W6KVAE14,PARENT=W6KVAE01,PROCOPT=GIRD                      
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W6W207                                       
         END                                                                    
