*                                                                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=G,KEYLEN=10,POS=S                 
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01,PROCOPT=GR                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=08,POS=S,     *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W90111                                       
         END                                                                    
