*                                                                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDP7,PROCOPT=G,KEYLEN=8,POS=S                    
         SENSEG NAME=WDP701,PARENT=0,PROCOPT=GIR                                
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD3,PROCOPT=GOT,KEYLEN=08,POS=S,       *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WDD301,PARENT=0                                            
         SENSEG NAME=WDD311,PARENT=WDD301                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD9,PROCOPT=GOT,KEYLEN=21,POS=S                 
         SENSEG NAME=WDD901,PARENT=0                                            
         SENSEG NAME=WDD902,PARENT=WDD901                                       
         SENSEG NAME=WDD925,PARENT=WDD902                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=06,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDL6,PROCOPT=GOT,KEYLEN=21,POS=S                 
         SENSEG NAME=WDL601,PARENT=0                                            
         SENSEG NAME=WDL611,PARENT=WDL601                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
* WDK9-PCB                                                                      
         PCB   TYPE=DB,DBDNAME=WDK9,PROCOPT=GOT,KEYLEN=5,POS=S                  
         SENSEG NAME=WDK901,PARENT=0                                            
*                                                                               
* WDA5 BACK ORDER                                                               
         PCB   TYPE=DB,DBDNAME=WDA5,PROCOPT=GOT,KEYLEN=24,POS=S,       *        
               PROCSEQ=WDA5A                                                    
         SENSEG NAME=WDA501,PARENT=0                                            
*                                                                               
* WDA6 VOR BO                                                                   
         PCB   TYPE=DB,DBDNAME=WDA6,PROCOPT=GOT,KEYLEN=16,POS=S,       *        
               PROCSEQ=WDA6J                                                    
         SENSEG NAME=WDA601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W90115                                       
         END                                                                    
