*                                                                               
*                                                                               
* WDK6-PCB - ARTIKELINFORMATION  WDK6                                           
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=06,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
* WDK7-PCB - ARTIKELINFORMATION  WDK7                                           
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
*                                                                               
* WDB6-PCB - DC-REGISTER WDB6                                                   
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
* WDL6-PCB - INLEV. HISTORIK  WDL6                                              
         PCB   TYPE=DB,DBDNAME=WDL6,PROCOPT=GOT,KEYLEN=21,POS=S                 
         SENSEG NAME=WDL601,PARENT=0                                            
         SENSEG NAME=WDL611,PARENT=WDL601                                       
*                                                                               
*---ORDERBEKRÄFTELSEBENÄMNINGAR WDR1                                            
         PCB    TYPE=DB,DBDNAME=WLXXKJ,PROCOPT=GOT,KEYLEN=35,POS=S              
         SENSEG NAME=WLXXKJ01,PARENT=0                                          
         SENSEG NAME=WLXXKJ11,PARENT=WLXXKJ01                                   
*                                                                               
* BENA-PCB - ARTIKELBENÄMNING  WDD3                                             
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=13,POS=S,     *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
* WDD7-PCB - ERSÄTTNINGSREGISTER  WDD7                                          
         PCB   TYPE=DB,DBDNAME=WDD7,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDD701,PARENT=0                                            
         SENSEG NAME=WDD702,PARENT=WDD701                                       
*                                                                               
* AREG-WDK6-PCB - ARTIKELINFORMATION  WDK6                                      
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=06,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
* AREG-WDK7-PCB - ARTIKELINFORMATION  WDK7                                      
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=08,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK722,PARENT=WDK711                                       
         SENSEG NAME=WDK712,PARENT=WDK701                                       
*                                                                               
* SPAR-WDF8-PCB SPÄRREGLER                                                      
         PCB   TYPE=DB,DBDNAME=WDF8,PROCOPT=GOT,KEYLEN=24,POS=S                 
         SENSEG NAME=WDF801,PARENT=0                                            
         SENSEG NAME=WDF811,PARENT=WDF801                                       
         SENSEG NAME=WDF812,PARENT=WDF801                                       
         SENSEG NAME=WDF813,PARENT=WDF801                                       
         SENSEG NAME=WDF814,PARENT=WDF801                                       
         SENSEG NAME=WDF815,PARENT=WDF801                                       
*                                                                               
* SPAR-WDF8A-PCB SPÄRREGLER (SEKUNDÄRINDEX DISTR/KUND INGÅNG)                   
         PCB   TYPE=DB,DBDNAME=WDF8A,PROCOPT=GOT,KEYLEN=24,POS=S                
         SENSEG NAME=WDF8A1,PARENT=0                                            
*                                                                               
* SPAR-WDK6-PCB - ARTIKELREGISTER                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=11,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
******** SUBMODUL    W218ETA   HÄMTA TIBERANK FÖR NDC:ER ***                    
*                                                                               
* ETA-ARTC-PCB - ARTIKELREGISTER         WDK6                                   
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=06,POS=S               
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
*                                                                               
* ETA-ARTS-PCB - ARTIKELREGISTRET WDK7                                          
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK712,PARENT=WDK701                                       
*                                                                               
* ETA-INLC-PCB - INLEV-HISTORIKREGISTRET WDL6                                   
         PCB   TYPE=DB,DBDNAME=WLINLC,PROCOPT=GOT,KEYLEN=21,POS=S               
         SENSEG NAME=WLINLC01,PARENT=0                                          
         SENSEG NAME=WLINLC11,PARENT=WLINLC01                                   
         SENSEG NAME=WLINLC12,PARENT=WLINLC01                                   
*                                                                               
* ETA-LEVA-PCB - LEVERANTÖRREGISTER      WDF1                                   
         PCB   TYPE=DB,DBDNAME=WLLEVA,PROCOPT=GOT,KEYLEN=11,POS=S               
         SENSEG NAME=WLLEVA01,PARENT=0                                          
         SENSEG NAME=WLLEVA16,PARENT=WLLEVA01                                   
*                                                                               
* ETA-WDB6-PCB - DC REGISTER             WDB6                                   
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=4,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB616,PARENT=WDB601                                       
* ETA-WDD9-PCB                                                                  
         PCB   TYPE=DB,DBDNAME=WDD9,PROCOPT=GOT,KEYLEN=20,POS=S                 
         SENSEG NAME=WDD901,PARENT=0                                            
         SENSEG NAME=WDD902,PARENT=WDD901                                       
         SENSEG NAME=WDD905,PARENT=WDD902                                       
         SENSEG NAME=WDD924,PARENT=WDD902                                       
*                                                                               
*******                                                    ********             
         PSBGEN LANG=COBOL,PSBNAME=W90118                                       
         END                                                                    
