*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=08,POS=S               
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLERSA,PROCOPT=GOTP,KEYLEN=12,POS=S,    *        
               PROCSEQ=WDD7A                                                    
         SENSEG NAME=WLERSA11,PARENT=0                                          
         SENSEG NAME=WLERSA01,PARENT=WLERSA11                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W90103                                       
         END                                                                    
