*                                                                               
         PCB   TYPE=DB,DBDNAME=WDJ1,PROCOPT=GOTP,KEYLEN=45,POS=S,      *        
               PROCSEQ=WDJ1C                                                    
         SENSEG NAME=WDJ111,PARENT=0                                            
         SENSEG NAME=WDJ101,PARENT=WDJ111                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD3,PROCOPT=GOT,KEYLEN=8,POS=S,        *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WDD301,PARENT=0                                            
         SENSEG NAME=WDD311,PARENT=WDD301                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=5,POS=S                  
         SENSEG NAME=WDK601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W90222                                       
         END                                                                    
