*                                                                               
*        TRANS TILL DISTRIBUTION & PRINT                                        
DISTRDOC PCB   TYPE=TP,NAME=WZ0420X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*------> SUBMODUL  W006KOM  - ALT-PCB TILL DISPACHERTRANS --------              
*                                                                               
         PCB   TYPE=TP,NAME=W0T693X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
ATAB     PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=GOT,KEYLEN=80,POS=S                 
         SENSEG NAME=WDR501,PARENT=0                                            
         SENSEG NAME=WDGX0102,PARENT=WDR501                                     
*                                                                               
*------> SUBMODUL W006KOM - DISPATCHERNS TRANSAKTIONS DB ---------              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDP8,PROCOPT=G,KEYLEN=28,POS=S                   
         SENSEG NAME=WDP801,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDP811,PARENT=WDP801,PROCOPT=GI                            
*                                                                               
*                                                                               
* WDB2-PCB - CUSTOMER DB WDB2                                                   
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
* WDF5-PCB - PART CROSS-TABLE                                                   
         PCB   TYPE=DB,DBDNAME=WDF5,PROCOPT=GOT,KEYLEN=44,POS=S,       *        
               PROCSEQ=WDF5B                                                    
         SENSEG NAME=WDF501,PARENT=0                                            
         SENSEG NAME=WDF502,PARENT=WDF501                                       
*                                                                               
*WDK6-PCB - VOLVO PART DB                                                       
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=G,KEYLEN=21,POS=S                   
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601,PROCOPT=GR                            
         SENSEG NAME=WDK621,PARENT=WDK611                                       
         SENSEG NAME=WDK629,PARENT=WDK611                                       
*                                                                               
*WDP7-PCB - USER INFO                                                           
         PCB   TYPE=DB,DBDNAME=WDP7,PROCOPT=GOT,KEYLEN=8,POS=S                  
         SENSEG NAME=WDP701,PARENT=0                                            
*                                                                               
*WDR5-PCB - POSTAL CODE  WDR5  IDHTYP=4133                                      
         PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=GOT,KEYLEN=52,POS=S                 
         SENSEG NAME=WDR501,PARENT=0                                            
         SENSEG NAME=WDGX4134,PARENT=WDR501                                     
*                                                                               
*WDQ2C-PCB  - ORDERHEAD REGISTER                                                
         PCB   TYPE=DB,DBDNAME=WDQ2C,PROCOPT=GOT,KEYLEN=17,POS=S                
         SENSEG NAME=WDQ2C1,PARENT=0                                            
*                                                                               
*WDK7-PCB - PARTS REGISTER SDC                                                  
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=7,POS=S                    
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701,PROCOPT=GR                            
*                                                                               
*WDB6-PCB - DC STYRREGISTER                                                     
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=4,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB616,PARENT=WDB601                                       
*                                                                               
*GMTC-PCB - CUSTOMER REGISTER                                                   
         PCB   TYPE=DB,DBDNAME=WDB5,PROCOPT=GOT,KEYLEN=11,POS=S                 
         SENSEG NAME=WDB501,PARENT=0                                            
*                                                                               
*                                                                               
******** SUBMODUL    W411ORDN  UTTAG AUT. ORDERNUMMER ********                  
*                                                                               
* ORDN-XXKP-PCB - AUTOMATISKA ORDERNUMMER WDR1  IDHTYP=4525                     
         PCB   TYPE=DB,DBDNAME=WLXXKP,PROCOPT=G,KEYLEN=35,POS=S                 
         SENSEG NAME=WLXXKP01,PARENT=0                                          
         SENSEG NAME=WLXXKP11,PARENT=WLXXKP01,PROCOPT=GR                        
*                                                                               
* ORDN-ORQL-PCB - ORDERHUVUDSREG KÖ (WDQ2C)-SEK.INDEX                           
         PCB   TYPE=DB,DBDNAME=WLORQL,PROCOPT=GOT,KEYLEN=17,POS=S               
         SENSEG NAME=WLORQL01,PARENT=0                                          
*                                                                               
* ORDN-PROC-PCB - PROFORMAHUVUDREG    WDE8                                      
         PCB   TYPE=DB,DBDNAME=WLPROC,PROCOPT=GOT,KEYLEN=17,POS=S               
         SENSEG NAME=WLPROC01,PARENT=0                                          
*                                                                               
* ORDN-ORQI-PCB - ORDERHUVUDSREG KÖ (WDQ201)                                    
         PCB   TYPE=DB,DBDNAME=WLORQI,PROCOPT=GOT,KEYLEN=04,POS=S               
         SENSEG NAME=WLORQI01,PARENT=0                                          
*                                                                               
*******                                                    ********             
         PSBGEN LANG=COBOL,PSBNAME=W90314                                       
         END                                                                    
