*                                                                               
DISTRDOC PCB   TYPE=TP,NAME=WZ0420X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*** DISP-PCB - START AV DISPATCHER-PGM W0069300                                 
         PCB   TYPE=TP,NAME=W0T693X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*** KUNDREG. GODSMOTTAG.                                                        
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
*** TILL MODUL W006KOM                                                          
         PCB   TYPE=DB,DBDNAME=WDP8,PROCOPT=G,KEYLEN=28,POS=S                   
         SENSEG NAME=WDP801,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDP811,PARENT=WDP801,PROCOPT=GI                            
*                                                                               
*WDI2    TACDISREGISTER WDI201                                                  
         PCB   TYPE=DB,DBDNAME=WDI2,PROCOPT=G,KEYLEN=17,POS=S                   
         SENSEG NAME=WDI201,PARENT=0,PROCOPT=I                                  
*                                                                               
*WDP7-PCB - USER INFO                                                           
         PCB   TYPE=DB,DBDNAME=WDP7,PROCOPT=GOT,KEYLEN=8,POS=S                  
         SENSEG NAME=WDP701,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W90313                                       
         END                                                                    
