*                                                                               
ATAB     PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=GOT,KEYLEN=80,POS=S                 
         SENSEG NAME=WDR501,PARENT=0                                            
         SENSEG NAME=WDGX0102,PARENT=WDR501                                     
*                                                                               
* WDQ2  ORDER HEAD                                                              
        PCB    TYPE=DB,DBDNAME=WDQ2,PROCOPT=GOT,KEYLEN=26,POS=S,       *        
               PROCSEQ=WDQ2C                                                    
        SENSEG NAME=WDQ201,PARENT=0                                             
        SENSEG NAME=WDQ211,PARENT=WDQ201                                        
        SENSEG NAME=WDQ212,PARENT=WDQ201                                        
*                                                                               
* WDB2  CUSTOMER                                                                
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
* WDQ4  ORDER LINE (REGISTRED)                                                  
         PCB   TYPE=DB,DBDNAME=WDQ4,PROCOPT=GOT,KEYLEN=20,POS=S                 
        SENSEG NAME=WDQ401,PARENT=0                                             
*                                                                               
* WDK6  CDC PARTS                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=06,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
* WDF5  PART CROSS TABLE                                                        
         PCB   TYPE=DB,DBDNAME=WDF5,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDF501,PARENT=0                                            
         SENSEG NAME=WDF502,PARENT=WDF501                                       
*                                                                               
* WDQ1  ORDER CONFIRMATIONS                                                     
         PCB TYPE=DB,DBDNAME=WDQ1,PROCOPT=GOT,KEYLEN=17,POS=S                   
         SENSEG NAME=WDQ101,PARENT=0                                            
*                                                                               
* WDQ1  ORDER CONFIRMATIONS BACK ORDER                                          
         PCB TYPE=DB,DBDNAME=WDQ1,PROCOPT=GOT,KEYLEN=17,POS=S                   
         SENSEG NAME=WDQ101,PARENT=0                                            
*                                                                               
* WDE4  ORDER LINE (PRINTED)                                                    
        PCB TYPE=DB,DBDNAME=WDE4,PROCOPT=GOT,KEYLEN=30,POS=S,          *        
               PROCSEQ=WDE4A                                                    
        SENSEG NAME=WDE401,PARENT=0                                             
        SENSEG NAME=WDE411,PARENT=WDE401                                        
        SENSEG NAME=WDE421,PARENT=WDE411                                        
*                                                                               
* WLBENA (PART DESCRIPTION)                                                     
        PCB TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=8,POS=S,         *        
               PROCSEQ=WDD3B                                                    
        SENSEG NAME=WLBENA01,PARENT=0                                           
        SENSEG NAME=WLBENA11,PARENT=WLBENA01                                    
*                                                                               
* WDE6   (CASE)                                                                 
        PCB TYPE=DB,DBDNAME=WDE6,PROCOPT=GOT,KEYLEN=7,POS=S                     
        SENSEG NAME=WDE601,PARENT=0                                             
        SENSEG NAME=WDE611,PARENT=WDE601                                        
*                                                                               
* WDF6   (DDGS)                                                                 
         PCB   TYPE=DB,DBDNAME=WDF6,PROCOPT=GOT,KEYLEN=4,POS=S                  
         SENSEG NAME=WDF601,PARENT=0                                            
*                                                                               
* WDA5   BACK ORDER                                                             
         PCB   TYPE=DB,DBDNAME=WDA5,PROCOPT=GOT,KEYLEN=24,POS=S                 
         SENSEG NAME=WDA501,PARENT=0                                            
*                                                                               
* WDA6   VOR REGISTER                                                           
         PCB   TYPE=DB,DBDNAME=WDA6A,PROCOPT=GOT,KEYLEN=40,POS=S                
         SENSEG NAME=WDA6A1,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA6,PROCOPT=GOT,KEYLEN=40,POS=S                 
         SENSEG NAME=WDA601,PARENT=0                                            
*                                                                               
*******                                                    ********             
         PSBGEN LANG=COBOL,PSBNAME=W90321                                       
         END                                                                    
