*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=6,POS=S                
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLGMTA,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG NAME=WLGMTA01,PARENT=0                                          
*                                                                               
* INLC-PCB      - ARTIKELREGISTER INFO WDL6                                     
         PCB   TYPE=DB,DBDNAME=WLINLC,PROCOPT=GOT,KEYLEN=21,POS=S               
         SENSEG NAME=WLINLC01,PARENT=0                                          
         SENSEG NAME=WLINLC11,PARENT=WLINLC01                                   
*                                                                               
******** SUBMODUL   W411DLEV  KONTROLL DIREKTLEVERANS ********                  
*                                                                               
* DLEV-LEVF-PCB - DIREKTLEVERANSREGISTRET   WDF2                                
         PCB   TYPE=DB,DBDNAME=WLLEVF,PROCOPT=GOT,KEYLEN=29,POS=S               
         SENSEG NAME=WLLEVF01,PARENT=0                                          
         SENSEG NAME=WLLEVF11,PARENT=WLLEVF01                                   
*                                                                               
* DLEV-LEVG-PCB - DIREKTLEVERANSREGISTRET VIA ASEQ   WDF2                       
         PCB   TYPE=DB,DBDNAME=WLLEVG,PROCOPT=GOT,KEYLEN=10,POS=S               
         SENSEG NAME=WLLEVG01,PARENT=0                                          
*                                                                               
* DLEV-LEVA-PCB - LEVERANTÖRSREGISTRET               WDF1                       
         PCB   TYPE=DB,DBDNAME=WLLEVA,PROCOPT=GOT,KEYLEN=13,POS=S               
         SENSEG NAME=WLLEVA01,PARENT=0                                          
         SENSEG NAME=WLLEVA18,PARENT=WLLEVA01                                   
*                                                                               
* DLEV-ARTS-PCB - ARTIKELINFORMATION  WDK7                                      
         PCB   TYPE=DB,DBDNAME=WLARTS,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG NAME=WLARTS01,PARENT=0                                          
         SENSEG NAME=WLARTS11,PARENT=WLARTS01                                   
*                                                                               
* DLEV-WDB6-PCB - DC-REGISTER WDB6                                              
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
******** SUBMODUL  W411RANS  BERÄKNA RANSONERING ********                       
*                                                                               
* RANS-XXKM-PCB - RANSONERINGSTABELL    WDR1  HTYP=4455                         
         PCB   TYPE=DB,DBDNAME=WLXXKM,PROCOPT=GOT,KEYLEN=40,POS=S               
         SENSEG NAME=WLXXKM01,PARENT=0                                          
         SENSEG NAME=WLXXKM11,PARENT=WLXXKM01                                   
*                                                                               
* RANS-ARTM-PCB - ARTIKELREGISTER ORDER ENTRY   WDK9                            
         PCB   TYPE=DB,DBDNAME=WLARTM,PROCOPT=GOT,KEYLEN=11,POS=S               
         SENSEG NAME=WLARTM01,PARENT=0                                          
         SENSEG NAME=WLARTM11,PARENT=WLARTM01                                   
*                                                                               
* RANS-ARTS-PCB - ARTIKELINFORMATION  WDK7                                      
         PCB   TYPE=DB,DBDNAME=WLARTS,PROCOPT=GOT,KEYLEN=07,POS=S               
         SENSEG NAME=WLARTS01,PARENT=0                                          
         SENSEG NAME=WLARTS11,PARENT=WLARTS01                                   
*                                                                               
******** WDF2A                                        ********                  
*                                                                               
*      LEVG-PCB - DIRKTLEVERANSREGISTRET   WDF2A                                
         PCB   TYPE=DB,DBDNAME=WLLEVG,PROCOPT=GOT,KEYLEN=10,POS=S               
         SENSEG NAME=WLLEVG01,PARENT=0                                          
*                                                                               
*                                                                               
******* WDK7                                               ********             
*                                                                               
*      ARTS-PCB - ARTIKELINFORMATION  WDK7                                      
         PCB   TYPE=DB,DBDNAME=WLARTS,PROCOPT=GOT,KEYLEN=07,POS=S               
         SENSEG NAME=WLARTS01,PARENT=0                                          
         SENSEG NAME=WLARTS11,PARENT=WLARTS01                                   
*                                                                               
******* WDB6                                          ********                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
*                                                                               
******** SUBMODUL    W218ETA   HÄMTA TIBERANK FÖR NDC:ER ***                    
*                                                                               
* ETA-ARTS-PCB - ARTIKELREGISTRET WDK7                                          
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK712,PARENT=WDK701                                       
*                                                                               
* ETA-INLC-PCB - INLEV-HISTORIKREGISTRET WDL6                                   
         PCB   TYPE=DB,DBDNAME=WLINLC,PROCOPT=GOT,KEYLEN=21,POS=S               
         SENSEG NAME=WLINLC01,PARENT=0                                          
         SENSEG NAME=WLINLC11,PARENT=WLINLC01                                   
         SENSEG NAME=WLINLC12,PARENT=WLINLC01                                   
*                                                                               
* ETA-WDB6-PCB - DC REGISTER             WDB6                                   
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=4,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB616,PARENT=WDB601                                       
*                                                                               
* ETA-WDD9-PCB                                                                  
         PCB   TYPE=DB,DBDNAME=WDD9,PROCOPT=GOT,KEYLEN=20,POS=S                 
         SENSEG NAME=WDD901,PARENT=0                                            
         SENSEG NAME=WDD902,PARENT=WDD901                                       
         SENSEG NAME=WDD905,PARENT=WDD902                                       
         SENSEG NAME=WDD924,PARENT=WDD902                                       
*                                                                               
******** SUBMODUL   W411SPAR  KONTROLL DIV SPÄRRAR    ********                  
*                                                                               
* SPAR-WDF8-PCB SPÄRREGLER                                                      
         PCB   TYPE=DB,DBDNAME=WDF8,PROCOPT=GOT,KEYLEN=24,POS=S                 
         SENSEG NAME=WDF801,PARENT=0                                            
         SENSEG NAME=WDF811,PARENT=WDF801                                       
         SENSEG NAME=WDF812,PARENT=WDF801                                       
         SENSEG NAME=WDF813,PARENT=WDF801                                       
         SENSEG NAME=WDF814,PARENT=WDF801                                       
         SENSEG NAME=WDF815,PARENT=WDF801                                       
*                                                                               
* SPAR-WDF8A-PCB SPÄRREGLER (SEKUNDÄRINDEX DISTR/KUND INGÅNG)                   
         PCB   TYPE=DB,DBDNAME=WDF8A,PROCOPT=GOT,KEYLEN=24,POS=S                
         SENSEG NAME=WDF8A1,PARENT=0                                            
*                                                                               
* SPAR-WDK6-PCB - ARTIKELREGISTER                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=11,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
*                                                                               
*******                                                    ********             
         PSBGEN LANG=COBOL,PSBNAME=W90331                                       
         END                                                                    
