*          DATA SET W90414PII0 AT LEVEL 002 AS OF 90/10/22                      
*       DATA SET W90414PII0 AT LEVEL 01 AS OF 90/05/02                          
*                                                                               
      PCB   TYPE=TP,NAME=W1T292X,MODIFY=NO                                      
*                                                                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
      PCB   TYPE=DB,DBDNAME=WLSATB,PROCOPT=GOT,KEYLEN=10,POS=S                  
      SENSEG NAME=WLSATB01,PARENT=0                                             
      SENSEG NAME=WLSATB11,PARENT=WLSATB01                                      
      SENSEG NAME=WLSATB22,PARENT=WLSATB11                                      
*                                                                               
      PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=34,POS=S,        *        
               PROCSEQ=WDD3A                                                    
      SENSEG NAME=WLBENA01,PARENT=0                                             
      SENSEG NAME=WLBENA11,PARENT=WLBENA01                                      
*                                                                               
      PSBGEN LANG=COBOL,PSBNAME=W90414                                          
      END                                                                       
