*                                                                               
         PCB    TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                 
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=G,KEYLEN=18,POS=S                   
         SENSEG NAME=WDK601,PARENT=0,PROCOPT=G                                  
         SENSEG NAME=WDK611,PARENT=WDK601,PROCOPT=GR                            
         SENSEG NAME=WDK613,PARENT=WDK601,PROCOPT=GIRD                          
*  FÖR KOPIERING                                                                
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=18,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
         SENSEG NAME=WDK613,PARENT=WDK601                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDT3,PROCOPT=GOT,KEYLEN=20,POS=S                 
         SENSEG NAME=WDT301,PARENT=0                                            
         SENSEG NAME=WDT311,PARENT=WDT301                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W90432                                       
         END                                                                    
