*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=8,POS=S                  
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
         SENSEG NAME=WDK623,PARENT=WDK611                                       
         SENSEG NAME=WDK613,PARENT=WDK601                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6F,PROCOPT=GOT,KEYLEN=15,POS=S                
         SENSEG NAME=WDK6F1,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDN6,PROCOPT=GOT,KEYLEN=5,POS=S                  
         SENSEG NAME=WDN601,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDP3,PROCOPT=GOT,KEYLEN=10,POS=S                 
         SENSEG NAME=WDP301,PARENT=0                                            
         SENSEG NAME=WDP311,PARENT=WDP301                                       
*                                                                               
         PCB TYPE=DB,DBDNAME=WDP3A,PROCOPT=GOT,KEYLEN=22,POS=S                  
         SENSEG NAME=WDP3A1,PARENT=0                                            
*                                                                               
         PCB TYPE=DB,DBDNAME=WDP3B,PROCOPT=GOT,KEYLEN=20,POS=S                  
         SENSEG NAME=WDP3B1,PARENT=0                                            
*                                                                               
         PCB TYPE=DB,DBDNAME=WDP3C,PROCOPT=GOT,KEYLEN=16,POS=S                  
         SENSEG NAME=WDP3C1,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD2,PROCOPT=GOT,KEYLEN=5,POS=S                  
         SENSEG NAME=WDD201,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD9,PROCOPT=GOT,KEYLEN=20,POS=S                 
         SENSEG NAME=WDD901,PARENT=0                                            
         SENSEG NAME=WDD902,PARENT=WDD901                                       
         SENSEG NAME=WDD924,PARENT=WDD902                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDL2,PROCOPT=GOT,KEYLEN=21,POS=S                 
         SENSEG NAME=WDL201,PARENT=0                                            
         SENSEG NAME=WDL211,PARENT=WDL201                                       
         SENSEG NAME=WDL221,PARENT=WDL211                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDF7,PROCOPT=GOT,KEYLEN=8,POS=S                  
         SENSEG NAME=WDF701,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W90471                                       
         END                                                                    
