* SPIE2    DATASAMLINGS-TRANS W90438T                                           
*                                                                               
* USEA                                                                          
       PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                    
       SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                                
*                                                                               
* WDK6  C-LAGER                                                                 
       PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=08,POS=S                   
       SENSEG NAME=WDK601,PARENT=0                                              
       SENSEG NAME=WDK611,PARENT=WDK601                                         
*                                                                               
* WDD9                                                                          
       PCB   TYPE=DB,DBDNAME=WDD9,PROCOPT=GOT,KEYLEN=19,POS=S                   
       SENSEG NAME=WDD901,PARENT=0                                              
       SENSEG NAME=WDD902,PARENT=WDD901                                         
       SENSEG NAME=WDD904,PARENT=WDD902                                         
       SENSEG NAME=WDD905,PARENT=WDD902                                         
*                                                                               
* WDF1 LEVERANTÖRSREGISTRET                                                     
       PCB     TYPE=DB,DBDNAME=WDF1,PROCOPT=GOT,KEYLEN=7,POS=S                  
       SENSEG NAME=WDF101,PARENT=0                                              
       SENSEG NAME=WDF106,PARENT=WDF101                                         
*                                                                               
* WDP3                                                                          
       PCB   TYPE=DB,DBDNAME=WDP3,PROCOPT=GOT,KEYLEN=10,POS=S                   
       SENSEG NAME=WDP301,PARENT=0                                              
       SENSEG NAME=WDP311,PARENT=WDP301                                         
*                                                                               
* WDP3A                                                                         
       PCB   TYPE=DB,DBDNAME=WDP3A,PROCOPT=GOT,KEYLEN=22,POS=S                  
       SENSEG NAME=WDP3A1,PARENT=0                                              
*                                                                               
* WDP3B                                                                         
       PCB   TYPE=DB,DBDNAME=WDP3B,PROCOPT=GOT,KEYLEN=20,POS=S                  
       SENSEG NAME=WDP3B1,PARENT=0                                              
*                                                                               
* WDP3C                                                                         
       PCB   TYPE=DB,DBDNAME=WDP3C,PROCOPT=GOT,KEYLEN=16,POS=S                  
       SENSEG NAME=WDP3C1,PARENT=0                                              
*                                                                               
* WDK9                                                                          
       PCB   TYPE=DB,DBDNAME=WDK9,PROCOPT=GOT,KEYLEN=11,POS=S                   
       SENSEG NAME=WDK901,PARENT=0                                              
       SENSEG NAME=WDK911,PARENT=WDK901                                         
*                                                                               
* WDL8 ORDERINGÅNGSREGISTER                                                     
       PCB   TYPE=DB,DBDNAME=WDL8,PROCOPT=GOT,KEYLEN=25,POS=S                   
       SENSEG NAME=WDL801,PARENT=0                                              
       SENSEG NAME=WDL811,PARENT=WDL801                                         
*                                                                               
* WDK7  SDC-NDC-LAGER                                                           
       PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=7,POS=S                    
       SENSEG NAME=WDK701,PARENT=0                                              
       SENSEG NAME=WDK711,PARENT=WDK701                                         
* WDB6                                                                          
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=4,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB616,PARENT=WDB601                                       
*                                                                               
******************************************************                          
*        DESSA PSB ANVÄNDS FÖR W222PBTO                                         
******************************************************                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=19,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
         SENSEG NAME=WDK621,PARENT=WDK611                                       
         SENSEG NAME=WDK624,PARENT=WDK611                                       
         SENSEG NAME=WDK626,PARENT=WDK611                                       
         SENSEG NAME=WDK629,PARENT=WDK611                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=8,POS=S                  
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK727,PARENT=WDK711                                       
         SENSEG NAME=WDK712,PARENT=WDK701                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTM,PROCOPT=GOT,KEYLEN=11,POS=S               
         SENSEG NAME=WLARTM01,PARENT=0                                          
         SENSEG NAME=WLARTM11,PARENT=WLARTM01                                   
*                                                                               
* W271REFL                                                                      
         PCB   TYPE=DB,DBDNAME=WL2501,PROCOPT=GOT,KEYLEN=31,POS=S               
         SENSEG NAME=WL250101,PARENT=0                                          
         SENSEG NAME=WL250111,PARENT=WL250101                                   
*                                                                               
* W271REFL                                                                      
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=4,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB616,PARENT=WDB601                                       
*                                                                               
* W271REFL                                                                      
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=8,POS=S                  
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK727,PARENT=WDK711                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=4,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB616,PARENT=WDB601                                       
*                                                                               
* WDD7A1      - ERSÄTTNINGSREGISTER                                             
         PCB   TYPE=DB,DBDNAME=WDD7A,PROCOPT=GOT,KEYLEN=12,POS=S                
         SENSEG NAME=WDD7A1,PARENT=0                                            
*                                                                               
* WDK7 ERSATT                                                                   
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
*                                                                               
* PBTO-W222-UTIL-WDK6-PCB                                                       
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOTP,KEYLEN=8,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
         SENSEG NAME=WDK626,PARENT=WDK611                                       
         SENSEG NAME=WDK629,PARENT=WDK611                                       
*                                                                               
* PBTO-W222-UTIL-WDK7-PCB                                                       
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=19,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK727,PARENT=WDK711                                       
*                                                                               
* PBTO-W222-UTIL-WDB6-PCB                                                       
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=4,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB616,PARENT=WDB601                                       
*                                                                               
* PBTO-W222-UTUP-WDK7-PCB                                                       
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=19,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
*                                                                               
* PBTO-W222-UTUP-WDB6-PCB                                                       
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=4,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB616,PARENT=WDB601                                       
*                                                                               
* PBTO-W222-UTUP-UTIL-WDK6-PCB                                                  
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOTP,KEYLEN=8,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
         SENSEG NAME=WDK626,PARENT=WDK611                                       
         SENSEG NAME=WDK629,PARENT=WDK611                                       
*                                                                               
* PBTO-W222-UTUP-UTIL-WDK7-PCB                                                  
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=19,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK727,PARENT=WDK711                                       
*                                                                               
* PBTO-W222-UTUP-UTIL-WDB6-PCB                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=4,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB616,PARENT=WDB601                                       
*                                                                               
*                                                                               
 PSBGEN LANG=COBOL,PSBNAME=W90438                                               
 END                                                                            
