*                                                                               
*        ALT-PCB                                                                
         PCB   TYPE=TP,NAME=W1T192X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*        MSGKOM-PCB                                                             
         PCB   TYPE=TP,NAME=W0T693X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GIR,KEYLEN=8,POS=S                
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=G,KEYLEN=7,POS=S                  
         SENSEG NAME=WLARTC01,PARENT=0,PROCOPT=GR                               
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
         SENSEG NAME=WLARTC25,PARENT=WLARTC11                                   
*                                                                               
* *************OBS !!! *********************************************            
* *************PROCOPT = R ANV. EJ I 1116, FINNS ENDAST MED                     
* *************FÖR ATT PGM SKA STOPPAS (DB-STO) NÄR WDD3 TAS NER PÅ             
* *************KVÄLLEN.                                                         
* *************DETTA FÖR ATT TRANSAR EJ SKA KÖAS UPP TILL PGM 1192.             
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=G,KEYLEN=29,POS=S,       *        
               PROCSEQ=WDD3A                                                    
         SENSEG NAME=WLBENA01,PARENT=0,PROCOPT=GR                               
         SENSEG NAME=WLBENA13,PARENT=WLBENA01                                   
* *************OBS !!! ********************************************             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=8,POS=S,      *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTG,PROCOPT=G,KEYLEN=5,POS=S                  
         SENSEG NAME=WLARTG01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTH,PROCOPT=GOT,KEYLEN=17,POS=S               
         SENSEG NAME=WLARTH01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXAQ,PROCOPT=GOT,KEYLEN=45,POS=S               
         SENSEG NAME=WLXXAQ01,PARENT=0                                          
         SENSEG NAME=WLXXAQ11,PARENT=WLXXAQ01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLSATB,PROCOPT=GOT,KEYLEN=09,POS=S               
         SENSEG NAME=WLSATB01,PARENT=0                                          
         SENSEG NAME=WLSATB11,PARENT=WLSATB01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLSATB,PROCOPT=GOT,KEYLEN=45,POS=S,     *        
               PROCSEQ=WDJ1C                                                    
         SENSEG NAME=WLSATB11,PARENT=0                                          
         SENSEG NAME=WLSATB01,PARENT=WLSATB11                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W90410                                       
         END                                                                    
