*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDF5,PROCOPT=GOT,KEYLEN=11,POS=S                 
         SENSEG NAME=WDF501,PARENT=0                                            
         SENSEG NAME=WDF502,PARENT=WDF501                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=8,POS=S                
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
         SENSEG NAME=WLARTC25,PARENT=WLARTC11                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLSATB,PROCOPT=G,KEYLEN=14,POS=S                 
         SENSEG NAME=WLSATB01,PARENT=0,PROCOPT=GRD                              
         SENSEG NAME=WLSATB11,PARENT=WLSATB01,PROCOPT=G                         
         SENSEG NAME=WLSATB22,PARENT=WLSATB11,PROCOPT=G                         
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLSATB,PROCOPT=G,KEYLEN=14,POS=S                 
         SENSEG NAME=WLSATB01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLSATB11,PARENT=WLSATB01,PROCOPT=GI                        
         SENSEG NAME=WLSATB22,PARENT=WLSATB11,PROCOPT=GI                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLSATB,PROCOPT=GOTP,KEYLEN=45,POS=S,    *        
               PROCSEQ=WDJ1C                                                    
         SENSEG NAME=WLSATB11,PARENT=0                                          
         SENSEG NAME=WLSATB01,PARENT=WLSATB11                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLSATB,PROCOPT=GOT,KEYLEN=20,POS=S,     *        
               PROCSEQ=WDJ1D                                                    
         SENSEG NAME=WLSATB01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=34,POS=S,     *        
               PROCSEQ=WDD3A                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=13,POS=S,     *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXAZ,PROCOPT=G,KEYLEN=82,POS=S                 
         SENSEG NAME=WLXXAZ01,PARENT=0,PROCOPT=G                                
         SENSEG NAME=WLXXAZ11,PARENT=WLXXAZ01,PROCOPT=GD                        
*                                                                               
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W90434                                       
         END                                                                    
