*          DATA SET W90416PII0 AT LEVEL 001 AS OF 90/10/02                      
*                                                                               
         PCB   TYPE=TP,NAME=W1T291X,MODIFY=NO                                   
*                                                                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=5,POS=S                
         SENSEG NAME=WLARTC01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=10,POS=S               
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
         SENSEG NAME=WLARTC25,PARENT=WLARTC11                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLSATB,PROCOPT=G,KEYLEN=10,POS=S                 
         SENSEG NAME=WLSATB01,PARENT=0,PROCOPT=GID                              
         SENSEG NAME=WLSATB11,PARENT=WLSATB01,PROCOPT=GID                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLSATB,PROCOPT=GOTP,KEYLEN=45,POS=S,    *        
               PROCSEQ=WDJ1C                                                    
         SENSEG NAME=WLSATB11,PARENT=0                                          
         SENSEG NAME=WLSATB01,PARENT=WLSATB11                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLSATB,PROCOPT=GOT,KEYLEN=20,POS=S,     *        
               PROCSEQ=WDJ1D                                                    
         SENSEG NAME=WLSATB01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=34,POS=S,     *        
               PROCSEQ=WDD3A                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=13,POS=S,     *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXAZ,PROCOPT=G,KEYLEN=83,POS=S                 
         SENSEG NAME=WLXXAZ01,PARENT=0,PROCOPT=G                                
         SENSEG NAME=WLXXAZ11,PARENT=WLXXAZ01,PROCOPT=GID                       
         SENSEG NAME=WLXXAZ21,PARENT=WLXXAZ11,PROCOPT=G                         
*                                                                               
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W90416                                       
         END                                                                    
