*                                                                               
*                                                                               
         PCB     TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GIR,KEYLEN=08,POS=S             
         SENSEG  NAME=WLUSEA01,PARENT=0                                         
*                                                                               
         PCB     TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=6,POS=S              
         SENSEG  NAME=WLARTC01,PARENT=0                                         
         SENSEG  NAME=WLARTC11,PARENT=WLARTC01                                  
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
         PCB     TYPE=DB,DBDNAME=WLXXCJ,PROCOPT=GOT,KEYLEN=31,POS=S             
         SENSEG  NAME=WLXXCJ01,PARENT=0                                         
         SENSEG  NAME=WLXXCJ11,PARENT=WLXXCJ01                                  
*                                                                               
         PCB     TYPE=DB,DBDNAME=WLPRIA,PROCOPT=GOT,KEYLEN=6,POS=S              
         SENSEG  NAME=WLPRIA01,PARENT=0                                         
*                                                                               
         PCB     TYPE=DB,DBDNAME=WLPRIB,PROCOPT=GOT,KEYLEN=16,POS=S             
         SENSEG  NAME=WLPRIB01,PARENT=0                                         
         SENSEG  NAME=WLPRIB11,PARENT=WLPRIB01                                  
         SENSEG  NAME=WLPRIB12,PARENT=WLPRIB01                                  
         SENSEG  NAME=WLPRIB13,PARENT=WLPRIB01                                  
*                                                                               
         PCB     TYPE=DB,DBDNAME=WDB1,PROCOPT=GOT,KEYLEN=11,POS=S               
         SENSEG  NAME=WDB101,PARENT=0                                           
*                                                                               
********** SUBMODUL W335COST**************************************              
*                                                                               
* COST-WDK6-PCB - ARTIKELINFORMATION WDK6                                       
         PCB     TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=19,POS=S               
         SENSEG  NAME=WDK601,PARENT=0                                           
         SENSEG  NAME=WDK611,PARENT=WDK601                                      
         SENSEG  NAME=WDK621,PARENT=WDK611                                      
*                                                                               
* COST-WDK7-PCB - ARTIKELINFORMATION WDK7                                       
         PCB     TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG  NAME=WDK701,PARENT=0                                           
         SENSEG  NAME=WDK711,PARENT=WDK701                                      
*                                                                               
* COST-WDF1-PCB - LEVERANTÖRSINFO WDF1                                          
         PCB     TYPE=DB,DBDNAME=WDF1,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG  NAME=WDF101,PARENT=0                                           
         SENSEG  NAME=WDF102,PARENT=WDF101                                      
*                                                                               
* COST-WDG2-PCB - VALUTAINFORMATION WDG2                                        
         PCB   TYPE=DB,DBDNAME=WDG2,PROCOPT=GOT,KEYLEN=37,POS=S                 
         SENSEG NAME=WDG201,PARENT=0                                            
         SENSEG NAME=WDGX9306,PARENT=WDG201                                     
         SENSEG NAME=WDGX9308,PARENT=WDGX9306                                   
*                                                                               
* COST-WDK72-PCB - ARTIKELREGISTER DC                                           
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=20,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK724,PARENT=WDK711                                       
*                                                                               
* COST-WDB6-PCB - DC-REGISTER  WDB6                                             
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=3,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB617,PARENT=WDB601                                       
*                                                                               
         PSBGEN  LANG=COBOL,PSBNAME=W90429                                      
         END                                                                    
