*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GIR,KEYLEN=08,POS=S               
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=16,POS=S               
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
         SENSEG NAME=WLARTC27,PARENT=WLARTC11                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTS,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG NAME=WLARTS01,PARENT=0                                          
         SENSEG NAME=WLARTS11,PARENT=WLARTS01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTM,PROCOPT=GOT,KEYLEN=11,POS=S               
         SENSEG NAME=WLARTM01,PARENT=0                                          
         SENSEG NAME=WLARTM11,PARENT=WLARTM01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXBU,PROCOPT=GOT,KEYLEN=40,POS=S               
         SENSEG NAME=WLXXBU01,PARENT=0                                          
         SENSEG NAME=WLXXBU11,PARENT=WLXXBU01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXBX,PROCOPT=GOT,KEYLEN=35,POS=S               
         SENSEG NAME=WLXXBX01,PARENT=0                                          
         SENSEG NAME=WLXXBX11,PARENT=WLXXBX01                                   
*                                                                               
*INLB-PCB (B-INDEX)                                                             
         PCB   TYPE=DB,DBDNAME=W6INLA,PROCOPT=GOT,KEYLEN=08,POS=S,     *        
               PROCSEQ=W6D1H                                                    
         SENSEG NAME=W6INLA11,PARENT=0                                          
         SENSEG NAME=W6INLA21,PARENT=W6INLA11                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD8,PROCOPT=GOT,KEYLEN=22,POS=S                 
         SENSEG NAME=WDD801,PARENT=0                                            
         SENSEG NAME=WDD811,PARENT=WDD801                                       
*                                                                               
*    WDA9, BYTES - UPPFÖLJNINGSREGISTER                                         
         PCB   TYPE=DB,DBDNAME=WDA9,PROCOPT=GOT,KEYLEN=08,POS=S                 
         SENSEG NAME=WDA901,PARENT=0                                            
         SENSEG NAME=WDA911,PARENT=WDA901                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
                                                                                
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W90423                                       
         END                                                                    
