*                                                                               
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=G,KEYLEN=8,POS=S                  
         SENSEG NAME=WLUSEA01,PARENT=0,PROCOPT=GIR                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=08,POS=S               
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
         SENSEG NAME=WLARTC25,PARENT=WLARTC11                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=13,POS=S,     *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLKATN,PROCOPT=GOT,KEYLEN=13,POS=S               
         SENSEG NAME=WLKATN01,PARENT=0                                          
         SENSEG NAME=WLKATN11,PARENT=WLKATN01                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W90422                                       
         END                                                                    
