*                                                                               
ATAB     PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=GOT,KEYLEN=80,POS=S                 
         SENSEG NAME=WDR501,PARENT=0                                            
         SENSEG NAME=WDGX0102,PARENT=WDR501                                     
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
*                                                                               
***------------------------------------------------------------                 
***      PCBS FOR SUB PGM W200DCST                                              
***------------------------------------------------------------                 
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK9,PROCOPT=GOT,KEYLEN=5,POS=S                  
         SENSEG NAME=WDK901,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDQ4C,PROCOPT=GOT,KEYLEN=20,POS=S                
         SENSEG NAME=WDQ4C1,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDM2A,PROCOPT=GOT,KEYLEN=11,POS=S                
         SENSEG NAME=WDM2A1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W90511                                       
         END                                                                    
