*                                                                               
ATAB     PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=GOT,KEYLEN=80,POS=S                 
         SENSEG NAME=WDR501,PARENT=0                                            
         SENSEG NAME=WDGX0102,PARENT=WDR501                                     
***------------------------------------------------------------                 
***      PCBS FOR SUB PGM W200PINF                                              
***------------------------------------------------------------                 
*                                                                               
*WDD3                                                                           
         PCB   TYPE=DB,DBDNAME=WDD3,PROCOPT=GOT,KEYLEN=8,POS=S,        *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WDD301,PARENT=0                                            
         SENSEG NAME=WDD311,PARENT=WDD301                                       
*WDK6                                                                           
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=6,POS=S                  
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*WDJ1                                                                           
         PCB   TYPE=DB,DBDNAME=WDJ1,PROCOPT=GOT,KEYLEN=9,POS=S                  
         SENSEG NAME=WDJ101,PARENT=0                                            
         SENSEG NAME=WDJ111,PARENT=WDJ101                                       
*WDP3                                                                           
         PCB   TYPE=DB,DBDNAME=WDP3,PROCOPT=GOT,KEYLEN=10,POS=S                 
         SENSEG NAME=WDP301,PARENT=0                                            
         SENSEG NAME=WDP311,PARENT=WDP301                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W90513                                       
         END                                                                    
