*          DATA SET W91028PII0 AT LEVEL 004 AS OF 87/09/02                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDN6,PROCOPT=GOT,KEYLEN=211,POS=S                
         SENSEG NAME=WDN601,PARENT=0                                            
         SENSEG NAME=WDN611,PARENT=WDN601                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W91028                                       
         END                                                                    
