******** SUBMODUL   W911SLDO  SALDOKONTROLL           ********                  
*                                                                               
*---LEVERANTÖRSBAS WDF1                                                         
         PCB   TYPE=DB,DBDNAME=WDF1,PROCOPT=GOT,KEYLEN=13,POS=S                 
         SENSEG NAME=WDF101,PARENT=0                                            
         SENSEG NAME=WDF118,PARENT=WDF101                                       
*                                                                               
* WDF2--DIRLEVBAS                                                               
         PCB   TYPE=DB,DBDNAME=WDF2,PROCOPT=GOT,KEYLEN=29,POS=S                 
         SENSEG NAME=WDF201,PARENT=0                                            
         SENSEG NAME=WDF211,PARENT=WDF201                                       
*                                                                               
* WDF2A                                                                         
         PCB   TYPE=DB,DBDNAME=WDF2A,PROCOPT=GOT,KEYLEN=10,POS=S                
         SENSEG NAME=WDF2A1,PARENT=0                                            
*                                                                               
*---ARTIKELDATABAS WDK7                                                         
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=8,POS=S                  
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
*                                                                               
*                                                                               
*---ARTIKELDATABAS WDK6                                                         
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=6,POS=S                  
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
*---ORDERBEKRÄFTELSEBENÄMNINGAR WDR1                                            
         PCB    TYPE=DB,DBDNAME=WLXXKJ,PROCOPT=GOT,KEYLEN=35,POS=S              
         SENSEG NAME=WLXXKJ01,PARENT=0                                          
         SENSEG NAME=WLXXKJ11,PARENT=WLXXKJ01                                   
*                                                                               
* WDD7-PCB - ERSÄTTNINGSREGISTER  WDD7                                          
         PCB   TYPE=DB,DBDNAME=WDD7,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDD701,PARENT=0                                            
         SENSEG NAME=WDD702,PARENT=WDD701                                       
*                                                                               
* BENA-PCB - ARTIKELBENÄMNING  WDD3                                             
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=13,POS=S,     *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
*        KUNDREGISTER LAGER-GODSMOTTAGARE                                       
         PCB   TYPE=DB,DBDNAME=WDB3,PROCOPT=GOT,KEYLEN=9,POS=S                  
         SENSEG NAME=WDB301,PARENT=0                                            
*                                                                               
* WDR6-PCB - LOG-TRANS TO BATCH                                                 
           PCB    TYPE=DB,DBDNAME=WDR6,PROCOPT=GOT,KEYLEN=27,POS=S              
           SENSEG NAME=WDR601,PARENT=0                                          
*                                                                               
* KREG-GMTA-PCB - KUNDREGISTER GODSMOTTAGARE WDB2                               
         PCB   TYPE=DB,DBDNAME=WLGMTA,PROCOPT=GOT,KEYLEN=07,POS=S               
         SENSEG NAME=WLGMTA01,PARENT=0                                          
*                                                                               
* KREG-GMTB-PCB - DC-REGISTER WDB3                                              
         PCB    TYPE=DB,DBDNAME=WLGMTB,PROCOPT=GOT,KEYLEN=9,POS=S               
         SENSEG NAME=WLGMTB01,PARENT=0                                          
*                                                                               
* KREG-GMTC-PCB - FK-REGISTER WDB5                                              
         PCB    TYPE=DB,DBDNAME=WLGMTC,PROCOPT=GOT,KEYLEN=11,POS=S              
         SENSEG NAME=WLGMTC01,PARENT=0                                          
*                                                                               
* KREG-BETC-PCB - BETALARREGISTER WDB1                                          
         PCB     TYPE=DB,DBDNAME=WLBETC,PROCOPT=GOT,KEYLEN=11,POS=S             
         SENSEG  NAME=WLBETC01                                                  
*                                                                               
*                                                                               
* KVAN-WDB2ASQ-PCB                                                              
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
* KVAN-WDC1-PCB - RETAILREGISTRET WDC1                                          
         PCB     TYPE=DB,DBDNAME=WDC1,PROCOPT=GOT,KEYLEN=6,POS=S                
         SENSEG  NAME=WDC101,PARENT=0                                           
*                                                                               
*                                                                               
* AREG-WDK6-PCB - ARTIKELINFORMATION  WDK6                                      
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=06,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
* AREG-WDK7-PCB - ARTIKELINFORMATION  WDK7                                      
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=08,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK722,PARENT=WDK711                                       
*                                                                               
*                                                                               
* DLEV-LEVF-PCB - DIREKTLEVERANSREGISTRET   WDF2                                
         PCB   TYPE=DB,DBDNAME=WLLEVF,PROCOPT=GOT,KEYLEN=29,POS=S               
         SENSEG NAME=WLLEVF01,PARENT=0                                          
         SENSEG NAME=WLLEVF11,PARENT=WLLEVF01                                   
*                                                                               
* DLEV-LEVG-PCB - DIREKTLEVERANSREGISTRET VIA ASEQ   WDF2                       
         PCB   TYPE=DB,DBDNAME=WLLEVG,PROCOPT=GOT,KEYLEN=10,POS=S               
         SENSEG NAME=WLLEVG01,PARENT=0                                          
*                                                                               
*                                                                               
* DLEV-LEVA-PCB - LEVERANTÖRSREGISTRET               WDF1                       
         PCB   TYPE=DB,DBDNAME=WLLEVA,PROCOPT=GOT,KEYLEN=13,POS=S               
         SENSEG NAME=WLLEVA01,PARENT=0                                          
         SENSEG NAME=WLLEVA18,PARENT=WLLEVA01                                   
*                                                                               
* DLEV-ARTS-PCB - ARTIKELINFORMATION  WDK7                                      
         PCB   TYPE=DB,DBDNAME=WLARTS,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG NAME=WLARTS01,PARENT=0                                          
         SENSEG NAME=WLARTS11,PARENT=WLARTS01                                   
*                                                                               
* DLEV-WDB6-PCB - DC-REGISTER WDB6                                              
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
* DLEV-FILA-PCB - RECORD TILL KONTR.LISTAN & SEKV.FILER  WDG6                   
         PCB   TYPE=DB,DBDNAME=WLFILA,PROCOPT=GOT,KEYLEN=27,POS=S               
         SENSEG NAME=WLFILA01,PARENT=0                                          
*                                                                               
*                                                                               
* SPAR-WDF8-PCB SPÄRREGLER                                                      
         PCB   TYPE=DB,DBDNAME=WDF8,PROCOPT=GOT,KEYLEN=24,POS=S                 
         SENSEG NAME=WDF801,PARENT=0                                            
         SENSEG NAME=WDF811,PARENT=WDF801                                       
         SENSEG NAME=WDF812,PARENT=WDF801                                       
         SENSEG NAME=WDF813,PARENT=WDF801                                       
         SENSEG NAME=WDF814,PARENT=WDF801                                       
         SENSEG NAME=WDF815,PARENT=WDF801                                       
*                                                                               
* SPAR-WDF8A-PCB SPÄRREGLER (SEKUNDÄRINDEX DISTR/KUND INGÅNG)                   
         PCB   TYPE=DB,DBDNAME=WDF8A,PROCOPT=GOT,KEYLEN=24,POS=S                
         SENSEG NAME=WDF8A1,PARENT=0                                            
*                                                                               
* SPAR-WDK6-PCB - ARTIKELREGISTER                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=11,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
*                                                                               
* SDCA-ARTS-PCB - ARTIKELINFORMATION  WDK7                                      
         PCB   TYPE=DB,DBDNAME=WLARTS,PROCOPT=GOT,KEYLEN=07,POS=S               
         SENSEG NAME=WLARTS01,PARENT=0                                          
         SENSEG NAME=WLARTS11,PARENT=WLARTS01                                   
*                                                                               
* SDCA-WDB6-PCB - DC-REGISTER  WDB6                                             
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=4,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB616,PARENT=WDB601                                       
*                                                                               
* SDCA-WDK9-PCB - DC-REGISTER WDK9                                              
         PCB   TYPE=DB,DBDNAME=WDK9,PROCOPT=GOT,KEYLEN=5,POS=S                  
         SENSEG NAME=WDK901,PARENT=0                                            
*                                                                               
* SDCA-WDR6-PCB - LOG-TRANS TO BATCH                                            
         PCB    TYPE=DB,DBDNAME=WDR6,PROCOPT=GOT,KEYLEN=27,POS=S                
         SENSEG NAME=WDR601,PARENT=0                                            
*                                                                               
* SDCA-WDK6-PCB - ARTIKELINFORMATION WDK6                                       
         PCB    TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=6,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
* SDCA-WDQ4B-PCB   ORDERRAD ARTIKEL                                             
         PCB   TYPE=DB,DBDNAME=WDQ4B,PROCOPT=GOT,KEYLEN=37,POS=S                
         SENSEG NAME=WDQ4B1,PARENT=0                                            
*                                                                               
* SDCA-WDQ2-PCB   ORDERHUVUD WDQ2                                               
         PCB    TYPE=DB,DBDNAME=WDQ2,PROCOPT=GOT,KEYLEN=4,POS=S                 
         SENSEG NAME=WDQ201,PARENT=0                                            
*                                                                               
* SDCA-WDQ4-PCB   ORDERRAD   WDQ4                                               
         PCB    TYPE=DB,DBDNAME=WDQ4,PROCOPT=GOT,KEYLEN=20,POS=S                
         SENSEG NAME=WDQ401,PARENT=0                                            
*                                                                               
******* SUBMODULE  W005WDK7  ADDING WDK711 FOR SDCA ****                        
* SDCA-WDB6-2-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
* SDCA-WDK6-2-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=6,POS=S                  
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
* SDCA-WDK7-2-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=7,POS=S                    
         SENSEG NAME=WDK701,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDK711,PARENT=WDK701,PROCOPT=GI                            
         SENSEG NAME=WDK712,PARENT=WDK701,PROCOPT=GI                            
*                                                                               
* SDCA-WDK7-3-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=08,POS=S                   
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK721,PARENT=WDK711,PROCOPT=GI                            
*                                                                               
*                                                                               
* NDCA-USEA-PCB - USER INFO WDP7                                                
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GOT,KEYLEN=8,POS=S                
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
* NDCA-WDK7-PCB - ARTIKELINFORMATION  WDK7                                      
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=08,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK722,PARENT=WDK711                                       
         SENSEG NAME=WDK712,PARENT=WDK701                                       
*                                                                               
* NDCA-WDL6-PCB - ARTIKELREGISTER INFO WDL6                                     
         PCB   TYPE=DB,DBDNAME=WDL6,PROCOPT=GOT,KEYLEN=21,POS=S                 
         SENSEG NAME=WDL601,PARENT=0                                            
         SENSEG NAME=WDL611,PARENT=WDL601                                       
*                                                                               
* NDCA-WDB6-PCB - DC-REGISTER INFO WDB6                                         
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
*                                                                               
* RANS-XXKM-PCB - RANSONERINGSTABELL    WDR1  HTYP=4455                         
         PCB   TYPE=DB,DBDNAME=WLXXKM,PROCOPT=GOT,KEYLEN=40,POS=S               
         SENSEG NAME=WLXXKM01,PARENT=0                                          
         SENSEG NAME=WLXXKM11,PARENT=WLXXKM01                                   
*                                                                               
* RANS-ARTM-PCB - ARTIKELREGISTER ORDER ENTRY   WDK9                            
         PCB   TYPE=DB,DBDNAME=WLARTM,PROCOPT=GOT,KEYLEN=11,POS=S               
         SENSEG NAME=WLARTM01,PARENT=0                                          
         SENSEG NAME=WLARTM11,PARENT=WLARTM01                                   
*                                                                               
* RANS-ARTS-PCB - ARTIKELINFORMATION  WDK7                                      
         PCB   TYPE=DB,DBDNAME=WLARTS,PROCOPT=GOT,KEYLEN=07,POS=S               
         SENSEG NAME=WLARTS01,PARENT=0                                          
         SENSEG NAME=WLARTS11,PARENT=WLARTS01                                   
*                                                                               
*                                                                               
******* SUBMODUL   W411CDCA  KONTROLL PRELIMINÄR AVBOKNING ********             
*                                                                               
* CDCA-ARTM-PCB - ARTIKELREGISTER ORDER ENTRY   WDK9                            
         PCB   TYPE=DB,DBDNAME=WLARTM,PROCOPT=GOT,KEYLEN=05,POS=S               
         SENSEG NAME=WLARTM01,PARENT=0                                          
*                                                                               
* CDCA-INLB-PCB - ARTIKELREGISTER INFO WDD9                                     
         PCB   TYPE=DB,DBDNAME=WLINLB,PROCOPT=GOT,KEYLEN=12,POS=S               
         SENSEG NAME=WLINLB01,PARENT=0                                          
         SENSEG NAME=WLINLB11,PARENT=WLINLB01                                   
*                                                                               
* CDCA-WDB2-PCB - KUNDREGISTER         WDB2                                     
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
* CDCA-WDC1-PCB - RETAILREGISTRET WDC1                                          
         PCB     TYPE=DB,DBDNAME=WDC1,PROCOPT=GOT,KEYLEN=6,POS=S                
         SENSEG  NAME=WDC101,PARENT=0                                           
*                                                                               
*                                                                               
******* SUBMODUL   W411CLDC  HÄMTAR AKTUELL WDB601-SEGMENT ********             
*                                                                               
* CLDC-WDB6-PCB - DC-REGISTER WDB6                                              
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
******** SUBMODUL    W218ETA   HÄMTA TIBERANK FÖR NDC:ER ***                    
*                                                                               
* ETA-ARTC-PCB - ARTIKELREGISTER         WDK6                                   
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=06,POS=S               
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
*                                                                               
* ETA-ARTS-PCB - ARTIKELREGISTRET WDK7                                          
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK712,PARENT=WDK701                                       
*                                                                               
* ETA-INLC-PCB - INLEV-HISTORIKREGISTRET WDL6                                   
         PCB   TYPE=DB,DBDNAME=WLINLC,PROCOPT=GOT,KEYLEN=21,POS=S               
         SENSEG NAME=WLINLC01,PARENT=0                                          
         SENSEG NAME=WLINLC11,PARENT=WLINLC01                                   
         SENSEG NAME=WLINLC12,PARENT=WLINLC01                                   
*                                                                               
* ETA-LEVA-PCB - LEVERANTÖRREGISTER      WDF1                                   
         PCB   TYPE=DB,DBDNAME=WLLEVA,PROCOPT=GOT,KEYLEN=11,POS=S               
         SENSEG NAME=WLLEVA01,PARENT=0                                          
         SENSEG NAME=WLLEVA16,PARENT=WLLEVA01                                   
*                                                                               
* ETA-WDB6-PCB - DC REGISTER             WDB6                                   
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=4,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB616,PARENT=WDB601                                       
* ETA-WDD9-PCB                                                                  
         PCB   TYPE=DB,DBDNAME=WDD9,PROCOPT=GOT,KEYLEN=20,POS=S                 
         SENSEG NAME=WDD901,PARENT=0                                            
         SENSEG NAME=WDD902,PARENT=WDD901                                       
         SENSEG NAME=WDD905,PARENT=WDD902                                       
         SENSEG NAME=WDD924,PARENT=WDD902                                       
                                                                                
******* SUBMODUL   W411XDCA  KONTROLL PRELIMINÄR AVBOKNING TEST ***             
*                                                                               
* XDCA-USEA-PCB - USER INFO WDP7                                                
         PCB   TYPE=DB,DBDNAME=WLUSEA,PROCOPT=GOT,KEYLEN=8,POS=S                
         SENSEG NAME=WLUSEA01,PARENT=0                                          
*                                                                               
* XDCA-WDB6-PCB - DC-REGISTER INFO WDB6                                         
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=09,POS=S                 
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB616,PARENT=WDB601                                       
*                                                                               
* XDCA-WDK6-PCB - PART INFO                                                     
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=6,POS=S                  
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
* XDCA-WDK7-PCB - PART INFO                                                     
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=08,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK722,PARENT=WDK711                                       
         SENSEG NAME=WDK712,PARENT=WDK701                                       
*                                                                               
* XDCA-WDK9-PCB PART INFO ORDER ENTRY                                           
         PCB   TYPE=DB,DBDNAME=WDK9,PROCOPT=GOT,KEYLEN=05,POS=S                 
         SENSEG NAME=WDK901,PARENT=0                                            
*                                                                               
* XDCA-WDL6-PCB - PART INFO                                                     
         PCB   TYPE=DB,DBDNAME=WDL6,PROCOPT=GOT,KEYLEN=21,POS=S                 
         SENSEG NAME=WDL601,PARENT=0                                            
         SENSEG NAME=WDL611,PARENT=WDL601                                       
*                                                                               
* XDCA-WDQ4B-PCB   ORDER LINE PART                                              
         PCB   TYPE=DB,DBDNAME=WDQ4B,PROCOPT=GOT,KEYLEN=37,POS=S                
         SENSEG NAME=WDQ4B1,PARENT=0                                            
*                                                                               
* XDCA-WDQ2-PCB   ORDER HEAD                                                    
         PCB    TYPE=DB,DBDNAME=WDQ2,PROCOPT=GOT,KEYLEN=4,POS=S                 
         SENSEG NAME=WDQ201,PARENT=0                                            
*                                                                               
* XDCA-WDQ4-PCB   ORDERRAD   WDQ4                                               
         PCB    TYPE=DB,DBDNAME=WDQ4,PROCOPT=GOT,KEYLEN=20,POS=S                
         SENSEG NAME=WDQ401,PARENT=0                                            
*                                                                               
* XDCA-WDR6-PCB - LOG-TRANS TO BATCH                                            
         PCB    TYPE=DB,DBDNAME=WDR6,PROCOPT=GOT,KEYLEN=27,POS=S                
         SENSEG NAME=WDR601,PARENT=0                                            
*                                                                               
******* SUBMODULE  W005WDK7  ADDING WDK711 ***                                  
*                                                                               
* XDCA-WDB6-2-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
* XDCA-WDK6-2-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=6,POS=S                  
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
* XDCA-WDK7-2-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=7,POS=S                    
         SENSEG NAME=WDK701,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDK711,PARENT=WDK701,PROCOPT=GI                            
         SENSEG NAME=WDK712,PARENT=WDK701,PROCOPT=GI                            
*                                                                               
* XDCA-WDK7-3-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=08,POS=S                   
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK721,PARENT=WDK711,PROCOPT=GI                            
*                                                                               
*******************************************************************             
******** SUBMODUL   W911ETD *** NEW ETA MODULE        ********                  
*                                                                               
*---LEVERANTÖRSBAS WDF1                                                         
         PCB   TYPE=DB,DBDNAME=WDF1,PROCOPT=GOT,KEYLEN=13,POS=S                 
         SENSEG NAME=WDF101,PARENT=0                                            
         SENSEG NAME=WDF118,PARENT=WDF101                                       
*                                                                               
*---ARTIKELDATABAS WDK6                                                         
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=8,POS=S                  
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
         SENSEG NAME=WDK629,PARENT=WDK611                                       
*                                                                               
*---ARTIKELDATABAS WDK7                                                         
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=8,POS=S                  
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
*                                                                               
*---ORDERBEKRÄFTELSEBENÄMNINGAR WDR1                                            
         PCB    TYPE=DB,DBDNAME=WLXXKJ,PROCOPT=GOT,KEYLEN=35,POS=S              
         SENSEG NAME=WLXXKJ01,PARENT=0                                          
         SENSEG NAME=WLXXKJ11,PARENT=WLXXKJ01                                   
*                                                                               
* WDD7-PCB - ERSÄTTNINGSREGISTER  WDD7                                          
         PCB   TYPE=DB,DBDNAME=WDD7,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDD701,PARENT=0                                            
         SENSEG NAME=WDD702,PARENT=WDD701                                       
*                                                                               
* BENA-PCB - ARTIKELBENÄMNING  WDD3                                             
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=13,POS=S,     *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
*        KUNDREGISTER LAGER-GODSMOTTAGARE                                       
         PCB   TYPE=DB,DBDNAME=WDB3,PROCOPT=GOT,KEYLEN=9,POS=S                  
         SENSEG NAME=WDB301,PARENT=0                                            
*                                                                               
* WDK9-PCB                                                                      
         PCB   TYPE=DB,DBDNAME=WDK9,PROCOPT=GOT,KEYLEN=5,POS=S                  
         SENSEG NAME=WDK901,PARENT=0                                            
*                                                                               
* WDA5 BACK ORDER                                                               
         PCB   TYPE=DB,DBDNAME=WDA5,PROCOPT=GOT,KEYLEN=24,POS=S,       *        
               PROCSEQ=WDA5A                                                    
         SENSEG NAME=WDA501,PARENT=0                                            
*                                                                               
* WDA6 VOR BO                                                                   
         PCB   TYPE=DB,DBDNAME=WDA6,PROCOPT=GOT,KEYLEN=16,POS=S,       *        
               PROCSEQ=WDA6J                                                    
         SENSEG NAME=WDA601,PARENT=0                                            
*                                                                               
* WDD9 SUPPLIER INFO                                                            
         PCB   TYPE=DB,DBDNAME=WDD9,PROCOPT=GOT,KEYLEN=27,POS=S                 
         SENSEG NAME=WDD901,PARENT=0                                            
         SENSEG NAME=WDD902,PARENT=WDD901                                       
         SENSEG NAME=WDD905,PARENT=WDD902                                       
         SENSEG NAME=WDD924,PARENT=WDD902                                       
                                                                                
* WDL6 SUPPLIER PART INFO                                                       
         PCB   TYPE=DB,DBDNAME=WDL6,PROCOPT=GOT,KEYLEN=21,POS=S                 
         SENSEG NAME=WDL601,PARENT=0                                            
         SENSEG NAME=WDL611,PARENT=WDL601                                       
* WDB6                                                                          
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=4,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB616,PARENT=WDB601                                       
*                                                                               
* WDF2--DIRLEVBAS                                                               
         PCB   TYPE=DB,DBDNAME=WDF2,PROCOPT=GOT,KEYLEN=29,POS=S                 
         SENSEG NAME=WDF201,PARENT=0                                            
         SENSEG NAME=WDF211,PARENT=WDF201                                       
*                                                                               
* WDF2A                                                                         
         PCB   TYPE=DB,DBDNAME=WDF2A,PROCOPT=GOT,KEYLEN=10,POS=S                
         SENSEG NAME=WDF2A1,PARENT=0                                            
*                                                                               
* KREG-GMTA-PCB - KUNDREGISTER GODSMOTTAGARE WDB2                               
         PCB   TYPE=DB,DBDNAME=WLGMTA,PROCOPT=GOT,KEYLEN=07,POS=S               
         SENSEG NAME=WLGMTA01,PARENT=0                                          
*                                                                               
* KREG-GMTB-PCB - DC-REGISTER WDB3                                              
         PCB    TYPE=DB,DBDNAME=WLGMTB,PROCOPT=GOT,KEYLEN=9,POS=S               
         SENSEG NAME=WLGMTB01,PARENT=0                                          
*                                                                               
* KREG-GMTC-PCB - FK-REGISTER WDB5                                              
         PCB    TYPE=DB,DBDNAME=WLGMTC,PROCOPT=GOT,KEYLEN=11,POS=S              
         SENSEG NAME=WLGMTC01,PARENT=0                                          
*                                                                               
* KREG-BETC-PCB - BETALARREGISTER WDB1                                          
         PCB     TYPE=DB,DBDNAME=WLBETC,PROCOPT=GOT,KEYLEN=11,POS=S             
         SENSEG  NAME=WLBETC01                                                  
*                                                                               
*                                                                               
* KVAN-WDB2ASQ-PCB                                                              
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
* KVAN-WDC1-PCB - RETAILREGISTRET WDC1                                          
         PCB     TYPE=DB,DBDNAME=WDC1,PROCOPT=GOT,KEYLEN=6,POS=S                
         SENSEG  NAME=WDC101,PARENT=0                                           
*                                                                               
*                                                                               
* AREG-WDK6-PCB - ARTIKELINFORMATION  WDK6                                      
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=06,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
* AREG-WDK7-PCB - ARTIKELINFORMATION  WDK7                                      
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=08,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK722,PARENT=WDK711                                       
*                                                                               
* SPAR-WDF8-PCB SPÄRREGLER                                                      
         PCB   TYPE=DB,DBDNAME=WDF8,PROCOPT=GOT,KEYLEN=24,POS=S                 
         SENSEG NAME=WDF801,PARENT=0                                            
         SENSEG NAME=WDF811,PARENT=WDF801                                       
         SENSEG NAME=WDF812,PARENT=WDF801                                       
         SENSEG NAME=WDF813,PARENT=WDF801                                       
         SENSEG NAME=WDF814,PARENT=WDF801                                       
         SENSEG NAME=WDF815,PARENT=WDF801                                       
*                                                                               
* SPAR-WDF8A-PCB SPÄRREGLER (SEKUNDÄRINDEX DISTR/KUND INGÅNG)                   
         PCB   TYPE=DB,DBDNAME=WDF8A,PROCOPT=GOT,KEYLEN=24,POS=S                
         SENSEG NAME=WDF8A1,PARENT=0                                            
*                                                                               
* SPAR-WDK6-PCB - ARTIKELREGISTER                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=11,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
* RANS-XXKM-PCB - RANSONERINGSTABELL    WDR1  HTYP=4455                         
         PCB   TYPE=DB,DBDNAME=WLXXKM,PROCOPT=GOT,KEYLEN=40,POS=S               
         SENSEG NAME=WLXXKM01,PARENT=0                                          
         SENSEG NAME=WLXXKM11,PARENT=WLXXKM01                                   
*                                                                               
* RANS-ARTM-PCB - ARTIKELREGISTER ORDER ENTRY   WDK9                            
         PCB   TYPE=DB,DBDNAME=WLARTM,PROCOPT=GOT,KEYLEN=11,POS=S               
         SENSEG NAME=WLARTM01,PARENT=0                                          
         SENSEG NAME=WLARTM11,PARENT=WLARTM01                                   
*                                                                               
* RANS-ARTS-PCB - ARTIKELINFORMATION  WDK7                                      
         PCB   TYPE=DB,DBDNAME=WLARTS,PROCOPT=GOT,KEYLEN=07,POS=S               
         SENSEG NAME=WLARTS01,PARENT=0                                          
         SENSEG NAME=WLARTS11,PARENT=WLARTS01                                   
**                                                                              
*******                                                    ********             
         PSBGEN LANG=COBOL,PSBNAME=W91091                                       
         END                                                                    
