*                                                                               
* WDG2-PCB/9305-PCB                                                             
         PCB   TYPE=DB,DBDNAME=WDG2,PROCOPT=G,KEYLEN=37,POS=S                   
         SENSEG NAME=WDG201,PARENT=0                                            
         SENSEG NAME=WDGX9306,PARENT=WDG201                                     
         SENSEG NAME=WDGX9308,PARENT=WDGX9306,PROCOPT=GD                        
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=W93008,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
