         PSBGEN LANG=COBOL,PSBNAME=W93003                                       
         END                                                                    
