*  FRÅN                                                                         
*  DB2 WEB-MPP WB0103  (ACCESSORIES FOLLOW UP)                                  
*  TRANS       WB0103T (CARPARTS.ACCE.CREATEXLSFILE)                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD2,PROCOPT=GOT,KEYLEN=09,POS=S                 
         SENSEG NAME=WDD201,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD9,PROCOPT=GOT,KEYLEN=20,POS=S                 
         SENSEG NAME=WDD901,PARENT=0                                            
         SENSEG NAME=WDD902,PARENT=WDD901                                       
         SENSEG NAME=WDD905,PARENT=WDD902                                       
         SENSEG NAME=WDD924,PARENT=WDD902                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=15,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
         SENSEG NAME=WDK623,PARENT=WDK611                                       
         SENSEG NAME=WDK613,PARENT=WDK601                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDC1,PROCOPT=GOT,KEYLEN=6,POS=S                  
         SENSEG NAME=WDC101,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDL2,PROCOPT=GOT,KEYLEN=21,POS=S                 
         SENSEG NAME=WDL201,PARENT=0                                            
         SENSEG NAME=WDL211,PARENT=WDL201                                       
         SENSEG NAME=WDL221,PARENT=WDL211                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WB1103,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
