*        STATUS                                                                 
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA2A,PROCOPT=GOT,KEYLEN=38,POS=S                
         SENSEG NAME=WDA2A1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDA2AP                                       
         END                                                                    
