*        KREDIT NOTA                                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA2F,PROCOPT=GOT,KEYLEN=26,POS=S                
         SENSEG NAME=WDA2F1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDA2FP                                       
         END                                                                    
