*        ARTIKEL                                                                
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA2D,PROCOPT=GOT,KEYLEN=24,POS=S                
         SENSEG NAME=WDA2D1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDA2DP                                       
         END                                                                    
