*        LEVERANSANMÄRKNING/RETUR                                               
*                                                                               
         PCB    TYPE=DB,DBDNAME=WDA2,PROCOPT=GOT,KEYLEN=210,POS=S               
         SENSEG NAME=WDA201,PARENT=0                                            
         SENSEG NAME=WDA211,PARENT=WDA201                                       
         SENSEG NAME=WDA221,PARENT=WDA211                                       
         SENSEG NAME=WDA222,PARENT=WDA211                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDA2BL                                       
         END                                                                    
