*        SÄNDNINGS REGISTER/RETUR                                               
*                                                                               
         PCB    TYPE=DB,DBDNAME=WDA3,PROCOPT=GOT,KEYLEN=210,POS=S               
         SENSEG NAME=WDA301,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDA3BL                                       
         END                                                                    
