*        SÄNDNINGS REGISTER                                                     
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA3E,PROCOPT=GOT,KEYLEN=32,POS=S                
         SENSEG NAME=WDA3E1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDA3EP                                       
         END                                                                    
