*        SÄNDNINGS REGISTER                                                     
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA3B,PROCOPT=GOT,KEYLEN=24,POS=S                
         SENSEG NAME=WDA3B1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDA3BP                                       
         END                                                                    
