*        SÄNDNINGS REGISTER/RETUR                                               
*                                                                               
         PCB    TYPE=DB,DBDNAME=WDA3,PROCOPT=A,KEYLEN=15,POS=S                  
         SENSEG NAME=WDA301,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDA3UP,CMPAT=YES                             
         END                                                                    
