*        SÄNDNINGS REGISTER                                                     
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA3G,PROCOPT=GOT,KEYLEN=43,POS=S                
         SENSEG NAME=WDA3G1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDA3GP                                       
         END                                                                    
