*        SÄNDNINGS REGISTER                                                     
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA3A,PROCOPT=GOT,KEYLEN=32,POS=S                
         SENSEG NAME=WDA3A1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDA3AP                                       
         END                                                                    
