*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA4,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDA401,PARENT=0                                            
         SENSEG NAME=WDA411,PARENT=WDA401                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDA4BL                                       
         END                                                                    
