*        RESTORDER-REGISTER INDEX=KDSTARAD=3                                    
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA5B,PROCOPT=GOT,KEYLEN=26,POS=S                
         SENSEG NAME=WDA5B1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDA5BP                                       
         END                                                                    
