*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA5,PROCOPT=A,KEYLEN=24,POS=S                   
         SENSEG NAME=WDA501,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDA5UP,CMPAT=YES                             
         END                                                                    
