*        RESTORDER-REGISTER INDEX=ARTIKEL                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA5A,PROCOPT=GOT,KEYLEN=40,POS=S                
         SENSEG NAME=WDA5A1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDA5AP                                       
         END                                                                    
