*          DATA SET WDA5EPPII0 AT LEVEL 001 AS OF 90/05/11                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA5E,PROCOPT=GOT,KEYLEN=38,POS=S                
         SENSEG NAME=WDA5E1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDA5EP                                       
         END                                                                    
