*        VOR REGISTER SEC INDEX                                                 
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA6H,PROCOPT=GOT,KEYLEN=17,POS=S                
         SENSEG NAME=WDA6H1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDA6HP                                       
         END                                                                    
