*        VOR REGISTER SEC INDEX                                                 
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA6G,PROCOPT=GOT,KEYLEN=21,POS=S                
         SENSEG NAME=WDA6G1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDA6GP                                       
         END                                                                    
