*        VOR REGISTER SEC INDEX                                                 
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA6B,PROCOPT=GOT,KEYLEN=40,POS=S                
         SENSEG NAME=WDA6B1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDA6BP                                       
         END                                                                    
