*        VOR REGISTER SEC INDEX                                                 
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA6I,PROCOPT=GOT,KEYLEN=11,POS=S                
         SENSEG NAME=WDA6I1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDA6IP                                       
         END                                                                    
