*        VOR REGISTER SEC INDEX                                                 
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA6E,PROCOPT=GOT,KEYLEN=12,POS=S                
         SENSEG NAME=WDA6E1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDA6EP                                       
         END                                                                    
