*        VOR REGISTER                                                           
*                                                                               
         PCB    TYPE=DB,DBDNAME=WDA6,PROCOPT=GOT,KEYLEN=210,POS=S               
         SENSEG NAME=WDA601,PARENT=0                                            
         SENSEG NAME=WDA611,PARENT=WDA601                                       
         SENSEG NAME=WDA612,PARENT=WDA601                                       
         SENSEG NAME=WDA613,PARENT=WDA601                                       
         SENSEG NAME=WDA614,PARENT=WDA601                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDA6BL                                       
         END                                                                    
