*        VOR REGISTER - ARTIKEL INGÅNG                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA6M,PROCOPT=GOT,KEYLEN=14,POS=S                
         SENSEG NAME=WDA6M1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDA6MP                                       
         END                                                                    
