*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA7,PROCOPT=A,KEYLEN=18,POS=S                   
         SENSEG NAME=WDA701,PARENT=0                                            
*                                                                               
         PSBGEN PSBNAME=WDA7UP,LANG=COBOL,CMPAT=YES                             
         END                                                                    
