*          DATA SET WDA7BLPII0 AT LEVEL 005 AS OF 90/06/26                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA7,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDA701,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDA7BL                                       
         END                                                                    
