*        TEELMT                                                                 
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA8A,PROCOPT=GOT,KEYLEN=52,POS=S                
         SENSEG NAME=WDA8A1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDA8AP                                       
         END                                                                    
