*        BESORTRT                                                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA8B,PROCOPT=GOT,KEYLEN=20,POS=S                
         SENSEG NAME=WDA8B1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDA8BP                                       
         END                                                                    
