*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA9,PROCOPT=A,KEYLEN=39,POS=S                   
         SENSEG NAME=WDA901,PARENT=0                                            
         SENSEG NAME=WDA911,PARENT=WDA901                                       
         SENSEG NAME=WDA921,PARENT=WDA911                                       
         SENSEG NAME=WDA931,PARENT=WDA921                                       
         SENSEG NAME=WDA912,PARENT=WDA901                                       
*                                                                               
         PSBGEN PSBNAME=WDA9UP,LANG=COBOL,CMPAT=YES                             
         END                                                                    
