*          DATA SET WDA9BLPII0 AT LEVEL 005 AS OF 90/06/26                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA9,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDA901,PARENT=0                                            
         SENSEG NAME=WDA911,PARENT=WDA901                                       
         SENSEG NAME=WDA921,PARENT=WDA911                                       
         SENSEG NAME=WDA931,PARENT=WDA921                                       
         SENSEG NAME=WDA912,PARENT=WDA901                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDA9BL                                       
         END                                                                    
