*        STATUS                                                                 
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA9A,PROCOPT=GOT,KEYLEN=8,POS=S                 
         SENSEG NAME=WDA9A1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDA9AP                                       
         END                                                                    
