*        KUNDREGISTER BETALARE SEC. IND. IDLAND                                 
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB1B,PROCOPT=GOT,KEYLEN=14,POS=S                
         SENSEG NAME=WDB1B1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDB1BP                                       
         END                                                                    
