*        KUND-REGISTER BETALARE                                                 
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB1,PROCOPT=A,KEYLEN=11,POS=S                   
         SENSEG NAME=WDB101,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDB1UP,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
