*        KUNDREGISTER GODSMOTTAGARE                                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDB2BL                                       
         END                                                                    
