*        KUND-REGISTER GODSMOTTAGARE                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=A,KEYLEN=7,POS=S                    
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDB2UP,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
