*        KUNDREGISTER LAGER-GODSMOTTAGARE                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB3,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDB301,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDB3BL                                       
         END                                                                    
