*        KUND-REGISTER LAGER-GODSMOTTAGARE                                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB3,PROCOPT=A,KEYLEN=9,POS=S                    
         SENSEG NAME=WDB301,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDB3UP,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
