*          DATA SET WDB4BLPII0 AT LEVEL 002 AS OF 90/06/26                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB4,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDB401,PARENT=0                                            
         SENSEG NAME=WDB414,PARENT=WDB401                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDB4BL                                       
         END                                                                    
