*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB4,PROCOPT=A,KEYLEN=10,POS=S                   
         SENSEG NAME=WDB401,PARENT=0                                            
         SENSEG NAME=WDB414,PARENT=WDB401                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDB4UP,CMPAT=YES                             
         END                                                                    
