*        KUND-REGISTER FRAKTKOD-GODSMOTTAGARE                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB5,PROCOPT=A,KEYLEN=11,POS=S                   
         SENSEG NAME=WDB501,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDB5UP,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
