*        KUNDREGISTER FRAKTKOD-GODSMOTTAGARE                                    
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB5,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDB501,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDB5BL                                       
         END                                                                    
