*        KUNDREGISTER DEALER INFO                                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB7,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDB701,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDB7BL                                       
         END                                                                    
