*        KUNDREGISTER DEALER INFO                                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB7A,PROCOPT=GOT,KEYLEN=15,POS=S                
         SENSEG NAME=WDB7A1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDB7AP                                       
         END                                                                    
