*        PARAMETERREGISTER DOK. UTSKRIFT IND. IDDISTR                           
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB9A,PROCOPT=GOT,KEYLEN=17,POS=S                
         SENSEG NAME=WDB9A1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDB9AP                                       
         END                                                                    
