*        PARAMETERREGISTER DOK. UTSKRIFT                                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB9,PROCOPT=A,KEYLEN=17,POS=S                   
         SENSEG NAME=WDB901,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDB9UP,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
