*        PARAMETERREGISTER DOK. UTSKRIFT                                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB9,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDB901,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDB9BL                                       
         END                                                                    
