*        PRISREGISTER AMC (NEW PRICE)                                           
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDC1,PROCOPT=A,KEYLEN=6,POS=S                    
         SENSEG NAME=WDC101,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDC1UP,CMPAT=YES                             
         END                                                                    
