*        PRISREGISTER AMC (NEW PRICE) SEC. IND. KAMPANJRABATT                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDC1A,PROCOPT=GOT,KEYLEN=11,POS=S                
         SENSEG NAME=WDC1A1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDC1AP                                       
         END                                                                    
