*        PRIS-RABATT REGISTER AMC (NEW PRICE)                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDC2,PROCOPT=A,KEYLEN=16,POS=S                   
         SENSEG NAME=WDC201,PARENT=0                                            
         SENSEG NAME=WDC211,PARENT=WDC201                                       
         SENSEG NAME=WDC212,PARENT=WDC201                                       
         SENSEG NAME=WDC213,PARENT=WDC201                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDC2UP,CMPAT=YES                             
         END                                                                    
