*                                                                               
         PCB   TYPE=DB,DBDNAME=WDC3,PROCOPT=A,KEYLEN=7,POS=S                    
         SENSEG NAME=WDC301,PARENT=0                                            
         SENSEG NAME=WDC311,PARENT=WDC301                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDC3UP,CMPAT=YES                             
         END                                                                    
