*        STANDARDPRISREGISTER (KOMMANDE)                                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDC6,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDC601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDC6BL                                       
         END                                                                    
