*        STANDARDPRISREGISTER (KOMMANDE)                                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDC6,PROCOPT=L,KEYLEN=5,POS=S                    
         SENSEG NAME=WDC601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDC6LD                                       
         END                                                                    
