*        PRISFRÅGA DDI INDEX=IDBUNDLE                                           
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDC7B,PROCOPT=GOT,KEYLEN=43,POS=S                
         SENSEG NAME=WDC7B1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDC7BP                                       
         END                                                                    
