*        PRISFRÅGA DDI                                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDC7,PROCOPT=A,KEYLEN=33,POS=S                   
         SENSEG NAME=WDC701,PARENT=0                                            
         SENSEG NAME=WDC711,PARENT=WDC701                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDC7UP,CMPAT=YES                             
         END                                                                    
