*                                                                               
         PCB   TYPE=DB,DBDNAME=WDC9,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDC901,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDC9BL                                       
         END                                                                    
