*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD1,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDD101,PARENT=0                                            
         SENSEG NAME=WDD111,PARENT=WDD101                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDD1BL                                       
         END                                                                    
