*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD2E,PROCOPT=GOT,KEYLEN=24,POS=S                
         SENSEG NAME=WDD2E1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDD2EP                                       
         END                                                                    
