*          DATA SET WDD2CPPII0 AT LEVEL 001 AS OF 88/07/04                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD2C,PROCOPT=GOT,KEYLEN=15,POS=S                
         SENSEG NAME=WDD2C1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDD2CP                                       
         END                                                                    
