*          DATA SET WDD2BLPII0 AT LEVEL 003 AS OF 90/06/26                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD2,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDD201,PARENT=0                                            
         SENSEG NAME=WDD211,PARENT=WDD201                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDD2BL                                       
         END                                                                    
