*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD3,PROCOPT=A,KEYLEN=9,POS=S                    
         SENSEG NAME=WDD301,PARENT=0                                            
         SENSEG NAME=WDD311,PARENT=WDD301                                       
         SENSEG NAME=WDD312,PARENT=WDD301                                       
         SENSEG NAME=WDD313,PARENT=WDD301                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDD3UP,CMPAT=YES                             
         END                                                                    
