*          DATA SET WDD3APPII0 AT LEVEL 003 AS OF 87/08/12                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD3A,PROCOPT=GOT,KEYLEN=32,POS=S                
         SENSEG NAME=WDD3A1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDD3AP                                       
         END                                                                    
