*          DATA SET WDD3BPPII0 AT LEVEL 003 AS OF 87/08/12                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD3B,PROCOPT=GOT,KEYLEN=5,POS=S                 
         SENSEG NAME=WDD3B1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDD3BP                                       
         END                                                                    
