*          DATA SET WDD3BLPII0 AT LEVEL 004 AS OF 90/06/26                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD3,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDD301,PARENT=0                                            
         SENSEG NAME=WDD311,PARENT=WDD301                                       
         SENSEG NAME=WDD312,PARENT=WDD301                                       
         SENSEG NAME=WDD313,PARENT=WDD301                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDD3BL                                       
         END                                                                    
