*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD4,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDD401,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDD4BL                                       
         END                                                                    
