*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD6,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDD601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDD6BL                                       
         END                                                                    
