*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD7,PROCOPT=GOT,KEYLEN=214,POS=S                
         SENSEG NAME=WDD701,PARENT=0                                            
         SENSEG NAME=WDD702,PARENT=WDD701                                       
         SENSEG NAME=WDD704,PARENT=WDD701                                       
         SENSEG NAME=WDD713,PARENT=WDD701                                       
         SENSEG NAME=WDD714,PARENT=WDD701                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDD7BL                                       
         END                                                                    
