*          DATA SET WDD7APPII0 AT LEVEL 004 AS OF 87/08/12                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD7A,PROCOPT=GOT,KEYLEN=12,POS=S                
         SENSEG NAME=WDD7A1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDD7AP                                       
         END                                                                    
