*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD7,PROCOPT=GOT,KEYLEN=10,POS=S,       *        
               PROCSEQ=WDD7A                                                    
         SENSEG NAME=WDD702,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDD7CB                                       
         END                                                                    
