*          DATA SET WDD8BLPII0 AT LEVEL 007 AS OF 90/06/26                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD8,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDD801,PARENT=0                                            
         SENSEG NAME=WDD811,PARENT=WDD801                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDD8BL                                       
         END                                                                    
