*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD8,PROCOPT=A,KEYLEN=22,POS=S                   
         SENSEG NAME=WDD801,PARENT=0                                            
         SENSEG NAME=WDD811,PARENT=WDD801                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDD8UP,CMPAT=YES                             
         END                                                                    
