*        BUFFERTREGISTER SEC. IND. DC/ARTIKEL                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD8A,PROCOPT=GOT,KEYLEN=22,POS=S                
         SENSEG NAME=WDD8A1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDD8BP                                       
         END                                                                    
