*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD9,PROCOPT=A,KEYLEN=25,POS=S                   
         SENSEG NAME=WDD901,PARENT=0                                            
         SENSEG NAME=WDD902,PARENT=WDD901                                       
         SENSEG NAME=WDD904,PARENT=WDD902                                       
         SENSEG NAME=WDD905,PARENT=WDD902                                       
         SENSEG NAME=WDD906,PARENT=WDD905                                       
         SENSEG NAME=WDD907,PARENT=WDD905                                       
         SENSEG NAME=WDD924,PARENT=WDD902                                       
         SENSEG NAME=WDD925,PARENT=WDD902                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDD9UP,CMPAT=YES                             
         END                                                                    
