*        LEVERANSPLANER INDEX=IDLEVNR                                           
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD9A,PROCOPT=GOT,KEYLEN=12,POS=S                
         SENSEG NAME=WDD9A1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDD9AP                                       
         END                                                                    
