*        TRANSPORTRELEASE INDEX=IDTRPTNR                                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE1A,PROCOPT=GOT,KEYLEN=210,POS=S               
         SENSEG NAME=WDE1A1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDE1AP                                       
         END                                                                    
