*        TRANSPORTRELEASE INDEX=IDDISTR                                         
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE1B,PROCOPT=GOT,KEYLEN=210,POS=S               
         SENSEG NAME=WDE1B1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDE1BP                                       
         END                                                                    
