*        TRANSPORTRELEASE                                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE1,PROCOPT=A,KEYLEN=49,POS=S                   
         SENSEG NAME=WDE101,PARENT=0                                            
         SENSEG NAME=WDE111,PARENT=WDE101                                       
         SENSEG NAME=WDE122,PARENT=WDE111                                       
         SENSEG NAME=WDE121,PARENT=WDE111                                       
         SENSEG NAME=WDE131,PARENT=WDE121                                       
         SENSEG NAME=WDE141,PARENT=WDE131                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDE1UP,CMPAT=YES                             
         END                                                                    
