*        TRANSPORTRELEASE DDI->BILL-ITINDEX=KDPRSTA = R                         
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE2A,PROCOPT=GOT,KEYLEN=210,POS=S               
         SENSEG NAME=WDE2A1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDE2AP                                       
         END                                                                    
