*        TRANSPORTRELEASE DDI->BILL                                             
*                                                                               
         PCB    TYPE=DB,DBDNAME=WDE2,PROCOPT=GOT,KEYLEN=210,POS=S               
         SENSEG NAME=WDE201,PARENT=0                                            
         SENSEG NAME=WDE211,PARENT=WDE201                                       
         SENSEG NAME=WDE221,PARENT=WDE211                                       
         SENSEG NAME=WDE231,PARENT=WDE221                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDE2BL                                       
         END                                                                    
