*        REFILL ORDERFÖRSLAG S-LAGER                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE3,PROCOPT=A,KEYLEN=13,POS=S                   
         SENSEG NAME=WDE301,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDE3UP,CMPAT=YES                             
         END                                                                    
