*        RESTORDER-REGISTER INDEX=ARTIKEL                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE3A,PROCOPT=GOT,KEYLEN=10,POS=S                
         SENSEG NAME=WDE3A1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDE3AP                                       
         END                                                                    
