*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE4F,PROCOPT=GOT,KEYLEN=29,POS=S                
         SENSEG NAME=WDE4F1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDE4FP                                       
         END                                                                    
