*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE4A,PROCOPT=GOT,KEYLEN=23,POS=S                
         SENSEG NAME=WDE4A1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDE4AP                                       
         END                                                                    
