*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE4E,PROCOPT=GOT,KEYLEN=23,POS=S                
         SENSEG NAME=WDE4E1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDE4EP                                       
         END                                                                    
