*          DATA SET WDE6CPPII0 AT LEVEL 003 AS OF 87/08/12                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE6C,PROCOPT=GOT,KEYLEN=42,POS=S                
         SENSEG NAME=WDE6C1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDE6CP                                       
         END                                                                    
