*SAMPACKNINGSKOLLI                                                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE6E,PROCOPT=GOT,KEYLEN=12,POS=S                
         SENSEG NAME=WDE6E1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDE6EP                                       
         END                                                                    
