*          DATA SET WDE6APPII0 AT LEVEL 004 AS OF 87/08/12                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE6A,PROCOPT=GOT,KEYLEN=16,POS=S                
         SENSEG NAME=WDE6A1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDE6AP                                       
         END                                                                    
