*                                                                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE6H,PROCOPT=GOT,KEYLEN=23,POS=S                
         SENSEG NAME=WDE6H1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDE6HP                                       
         END                                                                    
