*                                                                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE6F,PROCOPT=GOT,KEYLEN=30,POS=S                
         SENSEG NAME=WDE6F1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDE6FP                                       
         END                                                                    
