*        SAMKOLLI REG INDEX=IDKOLLIS                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE7B,PROCOPT=GOT,KEYLEN=210,POS=S               
         SENSEG NAME=WDE7B1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDE7BP                                       
         END                                                                    
