*        SAMKOLLI REG                                                           
*                                                                               
         PCB    TYPE=DB,DBDNAME=WDE7,PROCOPT=GOT,KEYLEN=210,POS=S               
         SENSEG NAME=WDE701,PARENT=0                                            
         SENSEG NAME=WDE711,PARENT=WDE701                                       
         SENSEG NAME=WDE721,PARENT=WDE711                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDE7BL                                       
         END                                                                    
