*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE8,PROCOPT=A,KEYLEN=17,POS=S                   
         SENSEG NAME=WDE801,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDE8UP,CMPAT=YES                             
         END                                                                    
