*          DATA SET WDE9BLPII0 AT LEVEL 001 AS OF 91/03/28                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE9,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDE901,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDE9BL                                       
         END                                                                    
