*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE9,PROCOPT=A,KEYLEN=12,POS=S                   
         SENSEG NAME=WDE901,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDE9UP,CMPAT=YES                             
         END                                                                    
