*                                                                               
         PCB   TYPE=DB,DBDNAME=WDF1,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDF101,PARENT=0                                            
         SENSEG NAME=WDF102,PARENT=WDF101                                       
         SENSEG NAME=WDF103,PARENT=WDF101                                       
         SENSEG NAME=WDF104,PARENT=WDF101                                       
         SENSEG NAME=WDF106,PARENT=WDF101                                       
         SENSEG NAME=WDF107,PARENT=WDF101                                       
         SENSEG NAME=WDF122,PARENT=WDF107                                       
         SENSEG NAME=WDF116,PARENT=WDF101                                       
         SENSEG NAME=WDF121,PARENT=WDF116                                       
         SENSEG NAME=WDF117,PARENT=WDF101                                       
         SENSEG NAME=WDF118,PARENT=WDF101                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDF1BL                                       
         END                                                                    
