*        STATUS                                                                 
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDF2A,PROCOPT=GOT,KEYLEN=10,POS=S                
         SENSEG NAME=WDF2A1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDF2AP                                       
         END                                                                    
