*                                                                               
         PCB   TYPE=DB,DBDNAME=WDF2,PROCOPT=A,KEYLEN=37,POS=S                   
         SENSEG NAME=WDF201,PARENT=0                                            
         SENSEG NAME=WDF211,PARENT=WDF201                                       
         SENSEG NAME=WDF212,PARENT=WDF201                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDF2UP,CMPAT=YES                             
         END                                                                    
