*        HELGDAGAR                                                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDF3A,PROCOPT=GOT,KEYLEN=10,POS=S                
         SENSEG NAME=WDF3A1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDF3AP                                       
         END                                                                    
