*                                                                               
         PCB   TYPE=DB,DBDNAME=WDF3,PROCOPT=A,KEYLEN=15,POS=S                   
         SENSEG NAME=WDF301,PARENT=0                                            
         SENSEG NAME=WDF311,PARENT=WDF301                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDF3UP,CMPAT=YES                             
         END                                                                    
