*                                                                               
         PCB   TYPE=DB,DBDNAME=WDF4,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDF401,PARENT=0                                            
         SENSEG NAME=WDF411,PARENT=WDF401                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDF4BL                                       
         END                                                                    
