*          DATA SET WDF5APPII0 AT LEVEL 003 AS OF 87/08/12                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDF5A,PROCOPT=GOT,KEYLEN=41,POS=S                
         SENSEG NAME=WDF5A1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDF5AP                                       
         END                                                                    
