*          DATA SET WDF5BLPII0 AT LEVEL 004 AS OF 90/06/26                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDF5,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDF501,PARENT=0                                            
         SENSEG NAME=WDF502,PARENT=WDF501                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDF5BL                                       
         END                                                                    
