*                                                                               
         PCB   TYPE=DB,DBDNAME=WDF7A,PROCOPT=GOT,KEYLEN=45,POS=S                
         SENSEG NAME=WDF7A1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDF7AP                                       
         END                                                                    
