*                                                                               
         PCB   TYPE=DB,DBDNAME=WDF7,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDF701,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDF7BL                                       
         END                                                                    
