*                                                                               
         PCB   TYPE=DB,DBDNAME=WDF7,PROCOPT=A,KEYLEN=8,POS=S                    
         SENSEG NAME=WDF701,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDF7UP,CMPAT=YES                             
         END                                                                    
