*        IDARTNR                                                                
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDF8C,PROCOPT=GOT,KEYLEN=15,POS=S                
         SENSEG NAME=WDF8C1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDF8CP                                       
         END                                                                    
