*        DIST/KUND                                                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDF8A,PROCOPT=GOT,KEYLEN=24,POS=S                
         SENSEG NAME=WDF8A1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDF8AP                                       
         END                                                                    
