*                                                                               
         PCB   TYPE=DB,DBDNAME=WDF8,PROCOPT=A,KEYLEN=24,POS=S                   
         SENSEG NAME=WDF801,PARENT=0                                            
         SENSEG NAME=WDF811,PARENT=WDF801                                       
         SENSEG NAME=WDF812,PARENT=WDF801                                       
         SENSEG NAME=WDF813,PARENT=WDF801                                       
         SENSEG NAME=WDF814,PARENT=WDF801                                       
         SENSEG NAME=WDF815,PARENT=WDF801                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDF8UP,CMPAT=YES                             
         END                                                                    
