*        IDSPRGRP                                                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDF8B,PROCOPT=GOT,KEYLEN=10,POS=S                
         SENSEG NAME=WDF8B1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDF8BP                                       
         END                                                                    
