*          DATA SET WDG2BLPII0 AT LEVEL 009 AS OF 90/06/26                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDG2,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDG201,PARENT=0                                            
         SENSEG NAME=WDG202,PARENT=WDG201                                       
         SENSEG NAME=WDG203,PARENT=WDG201                                       
         SENSEG NAME=WDG205,PARENT=WDG201                                       
         SENSEG NAME=WDG207,PARENT=WDG201                                       
         SENSEG NAME=WDG215,PARENT=WDG201                                       
         SENSEG NAME=WDG220,PARENT=WDG201                                       
         SENSEG NAME=WDG230,PARENT=WDG201                                       
         SENSEG NAME=WDG250,PARENT=WDG201                                       
         SENSEG NAME=WDG251,PARENT=WDG250                                       
         SENSEG NAME=WDG260,PARENT=WDG201                                       
         SENSEG NAME=WDGX1118,PARENT=WDG201                                     
         SENSEG NAME=WDGX1140,PARENT=WDG201                                     
         SENSEG NAME=WDGX1144,PARENT=WDG201                                     
         SENSEG NAME=WDGX3132,PARENT=WDG201                                     
         SENSEG NAME=WDGX5124,PARENT=WDG201                                     
         SENSEG NAME=WDGX9306,PARENT=WDG201                                     
         SENSEG NAME=WDGX9308,PARENT=WDGX9306                                   
         SENSEG NAME=WDGX9310,PARENT=WDG201                                     
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDG2BL                                       
         END                                                                    
