*          DATA SET WDG6BLPII0 AT LEVEL 004 AS OF 90/06/26                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDG6,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDG601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDG6BL                                       
         END                                                                    
