*                                                                               
         PCB   TYPE=DB,DBDNAME=WDG7,PROCOPT=A,KEYLEN=48,POS=S                   
         SENSEG NAME=WDG701,PARENT=0                                            
         SENSEG NAME=WDG717,PARENT=WDG701                                       
         SENSEG NAME=WDG718,PARENT=WDG717                                       
         SENSEG NAME=WDG730,PARENT=WDG701                                       
         SENSEG NAME=WDG740,PARENT=WDG701                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDG7UP,CMPAT=YES                             
         END                                                                    
