*        LISTÅTERSTART REGISTER                                                 
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDG8,PROCOPT=A,KEYLEN=19,POS=S                   
         SENSEG NAME=WDG801,PARENT=0                                            
         SENSEG NAME=WDG811,PARENT=WDG801                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDG8UP,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
