*        INVENTERINGS'REGISTER SEC. IND. DC + LAGERPLATS                        
*                                                                               
         PCB    TYPE=DB,DBDNAME=WDH1A,PROCOPT=GOT,KEYLEN=210,POS=S              
         SENSEG NAME=WDH1A1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDH1AP                                       
         END                                                                    
