*        INVENTERINGS-REGISTER                                                  
*                                                                               
         PCB    TYPE=DB,DBDNAME=WDH1,PROCOPT=A,KEYLEN=23,POS=S                  
         SENSEG NAME=WDH101,PARENT=0                                            
         SENSEG NAME=WDH111,PARENT=WDH101                                       
         SENSEG NAME=WDH121,PARENT=WDH111                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDH1UP,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
