*        INVENTERINGS'REGISTER                                                  
*                                                                               
         PCB    TYPE=DB,DBDNAME=WDH1,PROCOPT=GOT,KEYLEN=210,POS=S               
         SENSEG NAME=WDH101,PARENT=0                                            
         SENSEG NAME=WDH111,PARENT=WDH101                                       
         SENSEG NAME=WDH121,PARENT=WDH111                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDH1BL                                       
         END                                                                    
