*        INVENTERINGSHISTORIK                                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDH7,PROCOPT=L,KEYLEN=12,POS=S                   
         SENSEG NAME=WDH701,PARENT=0                                            
         SENSEG NAME=WDH711,PARENT=WDH701                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDH7LD                                       
         END                                                                    
