*        EKONOMI PRISÄNDRING                                                    
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDH8,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDH801,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDH8BL                                       
         END                                                                    
