*        EKONOMI PRISÄNDRING                                                    
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDH8,PROCOPT=A,KEYLEN=17,POS=S                   
         SENSEG NAME=WDH801,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDH8UP,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
