*        IDPIERAD                                                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDI1A,PROCOPT=GOT,KEYLEN=26,POS=S                
         SENSEG NAME=WDI1A1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDI1AP                                       
         END                                                                    
