*                                                                               
         PCB   TYPE=DB,DBDNAME=WDI2,PROCOPT=A,KEYLEN=17,POS=S                   
         SENSEG NAME=WDI201,PARENT=0                                            
*                                                                               
         PSBGEN PSBNAME=WDI2UP,LANG=COBOL,CMPAT=YES                             
         END                                                                    
