*          DATA SET WDJ1BPPII0 AT LEVEL 001 AS OF 90/04/27                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDJ1B,PROCOPT=GOT,KEYLEN=20,POS=S                
         SENSEG NAME=WDJ1B1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDJ1BP                                       
         END                                                                    
