*          DATA SET WDJ1APPII0 AT LEVEL 001 AS OF 90/04/27                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDJ1A,PROCOPT=GOT,KEYLEN=5,POS=S                 
         SENSEG NAME=WDJ1A1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDJ1AP                                       
         END                                                                    
