*                                                                               
         PCB   TYPE=DB,DBDNAME=WDJ2,PROCOPT=A,KEYLEN=17,POS=S                   
         SENSEG NAME=WDJ201,PARENT=0                                            
         SENSEG NAME=WDJ211,PARENT=WDJ201                                       
         SENSEG NAME=WDJ212,PARENT=WDJ201                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDJ2UP,CMPAT=YES                             
         END                                                                    
