*          DATA SET WDJ2CPPII0 AT LEVEL 001 AS OF 90/10/30                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDJ2C,PROCOPT=GOT,KEYLEN=17,POS=S                
         SENSEG NAME=WDJ2C1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDJ2CP                                       
         END                                                                    
