*          DATA SET WDJ2DPPII0 AT LEVEL 001 AS OF 90/10/30                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDJ2D,PROCOPT=GOT,KEYLEN=28,POS=S                
         SENSEG NAME=WDJ2D1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDJ2DP                                       
         END                                                                    
