*          DATA SET WDJ2EPPII0 AT LEVEL 001 AS OF 90/10/30                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDJ2E,PROCOPT=GOT,KEYLEN=10,POS=S                
         SENSEG NAME=WDJ2E1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDJ2EP                                       
         END                                                                    
