*          DATA SET WDJ3BLPII0 AT LEVEL 001 AS OF 90/12/10                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDJ3,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDJ301,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDJ3BL                                       
         END                                                                    
