*                                                                               
         PCB   TYPE=DB,DBDNAME=WDJ3,PROCOPT=A,KEYLEN=13,POS=S                   
         SENSEG NAME=WDJ301,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDJ3UP,CMPAT=YES                             
         END                                                                    
