*                                                                               
         PCB   TYPE=DB,DBDNAME=WDJ4,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDJ401,PARENT=0                                            
         SENSEG NAME=WDJ411,PARENT=WDJ401                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDJ4BL                                       
         END                                                                    
