*        INVENTERINGS REGISTER INDEX=IDACSNR-R                                  
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDJ7E,PROCOPT=GOT,KEYLEN=20,POS=S                
         SENSEG NAME=WDJ7E1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDJ7EP                                       
         END                                                                    
