*        INVENTERINGS REGISTER INDEX=USER PRIME COUNT                           
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDJ7B,PROCOPT=GOT,KEYLEN=32,POS=S                
         SENSEG NAME=WDJ7B1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDJ7BP                                       
         END                                                                    
