*                                                                               
         PCB   TYPE=DB,DBDNAME=WDJ7,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDJ701,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDJ7BL                                       
         END                                                                    
