*                                                                               
         PCB   TYPE=DB,DBDNAME=WDJ7,PROCOPT=A,KEYLEN=07,POS=S                   
         SENSEG NAME=WDJ701,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDJ7UP,CMPAT=YES                             
         END                                                                    
