*        PLATS REGISTER (WLLOCA)                                                
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDJ8,PROCOPT=A,KEYLEN=11,POS=S                   
         SENSEG NAME=WDJ801,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDJ8UP,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
