*        PLATS REGISTER (WLLOCA)                                                
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDJ8,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDJ801,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDJ8BL                                       
         END                                                                    
