*                                                                               
         PCB   TYPE=DB,DBDNAME=WDJ9,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDJ901,PARENT=0                                            
         SENSEG NAME=WDJ911,PARENT=WDJ901                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDJ9BL                                       
         END                                                                    
