*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK1,PROCOPT=A,KEYLEN=5,POS=S                    
         SENSEG NAME=WDK101,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDK1UP,CMPAT=YES                             
         END                                                                    
