*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK2,PROCOPT=A,KEYLEN=06,POS=S                   
         SENSEG NAME=WDK201,PARENT=0                                            
         SENSEG NAME=WDK211,PARENT=WDK201                                       
         SENSEG NAME=WDK212,PARENT=WDK201                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDK2UP,CMPAT=YES                             
         END                                                                    
