*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK4,PROCOPT=A,KEYLEN=05,POS=S                   
         SENSEG NAME=WDK401,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDK4UP,CMPAT=YES                             
         END                                                                    
