*          DATA SET WDK5BLPII0 AT LEVEL 004 AS OF 90/06/26                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK5,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDK501,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDK5BL                                       
         END                                                                    
