*        ARTIKELREGISTER SEC. IND. IDDC-REF                                     
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6H,PROCOPT=GOT,KEYLEN=07,POS=S                
         SENSEG NAME=WDK6H1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDK6HP                                       
         END                                                                    
