*        LEVNR-SHIP INDEX                                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6G,PROCOPT=GOT,KEYLEN=10,POS=S                
         SENSEG NAME=WDK6G1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDK6GP                                       
         END                                                                    
