*        LAGERADRESS INDEX                                                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6E,PROCOPT=GOT,KEYLEN=12,POS=S                
         SENSEG NAME=WDK6E1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDK6EP                                       
         END                                                                    
