*        ARTIKELREGISTER + CDC                                                  
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=AP,KEYLEN=19,POS=S                  
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
         SENSEG NAME=WDK621,PARENT=WDK611                                       
         SENSEG NAME=WDK622,PARENT=WDK611                                       
         SENSEG NAME=WDK623,PARENT=WDK611                                       
         SENSEG NAME=WDK624,PARENT=WDK611                                       
         SENSEG NAME=WDK625,PARENT=WDK611                                       
         SENSEG NAME=WDK626,PARENT=WDK611                                       
         SENSEG NAME=WDK627,PARENT=WDK611                                       
         SENSEG NAME=WDK628,PARENT=WDK611                                       
         SENSEG NAME=WDK613,PARENT=WDK601                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDK6U2,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
