*        ARTIKELREGISTER SEC. IND. EMBARTNR                                     
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6C,PROCOPT=GOT,KEYLEN=13,POS=S                
         SENSEG NAME=WDK6C1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDK6CP                                       
         END                                                                    
