*        LAGERADRESS INDEX                                                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6F,PROCOPT=GOT,KEYLEN=15,POS=S                
         SENSEG NAME=WDK6F1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDK6FP                                       
         END                                                                    
