*        ARTIKELREGISTER SEC. IND. IDFKNGRP+KDPRODSL                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6B,PROCOPT=GOT,KEYLEN=15,POS=S                
         SENSEG NAME=WDK6B1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDK6BP                                       
         END                                                                    
