*        ARTIKELREGISTER SEC. BYTES EXTRA RETURVECKOR                           
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6D,PROCOPT=GOT,KEYLEN=5,POS=S                 
         SENSEG NAME=WDK6D1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDK6DP                                       
         END                                                                    
