*        ARTIKEL S-LAGER SEC. IND. LAGERADRESS                                  
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7A,PROCOPT=GOT,KEYLEN=14,POS=S                
         SENSEG NAME=WDK7A1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDK7AP                                       
         END                                                                    
