*        ARTIKELREGISTER S-LAGER                                                
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK721,PARENT=WDK711                                       
         SENSEG NAME=WDK722,PARENT=WDK711                                       
         SENSEG NAME=WDK723,PARENT=WDK711                                       
         SENSEG NAME=WDK724,PARENT=WDK711                                       
         SENSEG NAME=WDK727,PARENT=WDK711                                       
         SENSEG NAME=WDK728,PARENT=WDK711                                       
         SENSEG NAME=WDK712,PARENT=WDK701                                       
         SENSEG NAME=WDK726,PARENT=WDK712                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDK7BL                                       
         END                                                                    
