*        LAGERSTYRNINGSREGISTER DSP/VR                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK8,PROCOPT=L,KEYLEN=13,POS=S                   
         SENSEG NAME=WDK801,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDK8LD                                       
         END                                                                    
