*        LAGERSTYRNINGSREGISTER DSP/VR                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK8,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDK801,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDK8BL                                       
         END                                                                    
