*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK9,PROCOPT=A,KEYLEN=11,POS=S                   
         SENSEG NAME=WDK901,PARENT=0                                            
         SENSEG NAME=WDK911,PARENT=WDK901                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDK9UP,CMPAT=YES                             
         END                                                                    
