*          DATA SET WDL1BLPII0 AT LEVEL 004 AS OF 90/11/13                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDL1,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDL101,PARENT=0                                            
         SENSEG NAME=WDL111,PARENT=WDL101                                       
         SENSEG NAME=WDL112,PARENT=WDL101                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDL1BL                                       
         END                                                                    
