*                                                                               
         PCB   TYPE=DB,DBDNAME=WDL3,PROCOPT=A,KEYLEN=20,POS=S                   
         SENSEG NAME=WDL301,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDL3UP,CMPAT=YES                             
         END                                                                    
