*                                                                               
         PCB   TYPE=DB,DBDNAME=WDL3,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDL301,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDL3BL                                       
         END                                                                    
