*        ORDERINGÅNGHISTORIK REGISTER XDC                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDL4,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDL401,PARENT=0                                            
         SENSEG NAME=WDL411,PARENT=WDL401                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDL4BL                                       
         END                                                                    
