*                                                                               
         PCB   TYPE=DB,DBDNAME=WDL5A,PROCOPT=GOT,KEYLEN=210,POS=S               
         SENSEG NAME=WDL5A1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDL5AP                                       
         END                                                                    
