*                                                                               
         PCB   TYPE=DB,DBDNAME=WDL5,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDL501,PARENT=0                                            
         SENSEG NAME=WDL511,PARENT=WDL501                                       
         SENSEG NAME=WDL521,PARENT=WDL511                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDL5BL                                       
         END                                                                    
