*        SDC INLEV HISTORIK REGISTER                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDL6,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDL601,PARENT=0                                            
         SENSEG NAME=WDL611,PARENT=WDL601                                       
         SENSEG NAME=WDL621,PARENT=WDL611                                       
         SENSEG NAME=WDL622,PARENT=WDL611                                       
         SENSEG NAME=WDL623,PARENT=WDL611                                       
         SENSEG NAME=WDL612,PARENT=WDL601                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDL6BL                                       
         END                                                                    
