*        SDC INLEV HISTORIK FAKTURA                                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDL6C,PROCOPT=GOT,KEYLEN=210,POS=S               
         SENSEG NAME=WDL6C1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDL6CP                                       
         END                                                                    
