*        XDC INLEV HISTORIK KOLLI                                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDL6D,PROCOPT=GOT,KEYLEN=43,POS=S                
         SENSEG NAME=WDL6D1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDL6DP                                       
         END                                                                    
