*        ORDERINGÅNGSTATISTIK REGISTER SDC                                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDL7,PROCOPT=A,KEYLEN=7,POS=S                    
         SENSEG NAME=WDL701,PARENT=0                                            
         SENSEG NAME=WDL711,PARENT=WDL701                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDL7UP,CMPAT=YES                             
         END                                                                    
