*        ORDERINGÅNGSTATISTIK CDC                                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDL8,PROCOPT=L,KEYLEN=9,POS=S                    
         SENSEG NAME=WDL801,PARENT=0                                            
         SENSEG NAME=WDL811,PARENT=WDL801                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDL8LD                                       
         END                                                                    
