*                                                                               
         PCB   TYPE=DB,DBDNAME=WDL9,PROCOPT=A,KEYLEN=20,POS=S                   
         SENSEG NAME=WDL901,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDL9UP,CMPAT=YES                             
         END                                                                    
