*                                                                               
         PCB   TYPE=DB,DBDNAME=WDM2,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDM201,PARENT=0                                            
         SENSEG NAME=WDM211,PARENT=WDM201                                       
         SENSEG NAME=WDM221,PARENT=WDM211                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDM2BL                                       
         END                                                                    
