*                                                                               
         PCB   TYPE=DB,DBDNAME=WDM3,PROCOPT=A,KEYLEN=26,POS=S                   
         SENSEG NAME=WDM301,PARENT=0                                            
         SENSEG NAME=WDM311,PARENT=WDM301                                       
         SENSEG NAME=WDM312,PARENT=WDM301                                       
         SENSEG NAME=WDM313,PARENT=WDM301                                       
         SENSEG NAME=WDM314,PARENT=WDM301                                       
         SENSEG NAME=WDM315,PARENT=WDM301                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDM3UP,CMPAT=YES                             
         END                                                                    
