*                                                                               
         PCB   TYPE=DB,DBDNAME=WDM5,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDM501,PARENT=0                                            
         SENSEG NAME=WDM511,PARENT=WDM501                                       
         SENSEG NAME=WDM521,PARENT=WDM511                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDM5BL                                       
         END                                                                    
