*                                                                               
         PCB   TYPE=DB,DBDNAME=WDM6A,PROCOPT=GOT,KEYLEN=18,POS=S                
         SENSEG NAME=WDM6A1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDM6AP                                       
         END                                                                    
