*                                                                               
         PCB   TYPE=DB,DBDNAME=WDM6,PROCOPT=A,KEYLEN=14,POS=S                   
         SENSEG NAME=WDM601,PARENT=0                                            
         SENSEG NAME=WDM611,PARENT=WDM601                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDM6UP,CMPAT=YES                             
         END                                                                    
