*                                                                               
         PCB   TYPE=DB,DBDNAME=WDM6B,PROCOPT=GOT,KEYLEN=18,POS=S                
         SENSEG NAME=WDM6B1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDM6BP                                       
         END                                                                    
