*                                                                               
         PCB   TYPE=DB,DBDNAME=WDM7A,PROCOPT=GOT,KEYLEN=210,POS=S               
         SENSEG NAME=WDM7A1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDM7AP                                       
         END                                                                    
