*                                                                               
         PCB   TYPE=DB,DBDNAME=WDM8,PROCOPT=A,KEYLEN=19,POS=S                   
         SENSEG NAME=WDM801,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDM8UP                                       
         END                                                                    
