*                                                                               
         PCB   TYPE=DB,DBDNAME=WDM9,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDM901,PARENT=0                                            
         SENSEG NAME=WDM911,PARENT=WDM901                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDM9BL                                       
         END                                                                    
