*                                                                               
         PCB   TYPE=DB,DBDNAME=WDM9B,PROCOPT=GOT,KEYLEN=22,POS=S                
         SENSEG NAME=WDM9B1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDM9BP                                       
         END                                                                    
