*                                                                               
         PCB   TYPE=DB,DBDNAME=WDM9A,PROCOPT=GOT,KEYLEN=22,POS=S                
         SENSEG NAME=WDM9A1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDM9AP                                       
         END                                                                    
