*        KATALOGREGISTER                                                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDN1,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDN101,PARENT=0                                            
         SENSEG NAME=WDN111,PARENT=WDN101                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDN1BL                                       
         END                                                                    
