*        KATALOG RUBRIK-LEXIKON                                                 
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDN2,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDN201,PARENT=0                                            
         SENSEG NAME=WDN211,PARENT=WDN201                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDN2BL                                       
         END                                                                    
