*        KATALOG RUBRIK-LEXIKON SEC. IND. IDSKYLT                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDN2A,PROCOPT=GOT,KEYLEN=7,POS=S                 
         SENSEG NAME=WDN2A1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDN2AP                                       
         END                                                                    
