*        KATALOG TILLÄGGSTEXT-LEXIKON SEC. IND. IDSKYLT                         
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDN4A,PROCOPT=GOT,KEYLEN=6,POS=S                 
         SENSEG NAME=WDN4A1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDN4AP                                       
         END                                                                    
