*        KATALOG TILLÄGGSTEXT-LEXIKON                                           
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDN4,PROCOPT=A,KEYLEN=6,POS=S                    
         SENSEG NAME=WDN401,PARENT=0                                            
         SENSEG NAME=WDN411,PARENT=WDN401                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDN4UP,CMPAT=YES                             
         END                                                                    
