*        KATALOG AVSNITTS-REGISTER RUBRIK                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDN5E,PROCOPT=GOT,KEYLEN=24,POS=S                
         SENSEG NAME=WDN5E1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDN5EP                                       
         END                                                                    
