*        KATALOG AVSNITTS-REGISTER                                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDN5B,PROCOPT=GOT,KEYLEN=26,POS=S                
         SENSEG NAME=WDN5B1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDN5BP                                       
         END                                                                    
