*        KATALOG AVSNITTS-REGISTER ILLUSTRATION                                 
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDN5C,PROCOPT=GOT,KEYLEN=20,POS=S                
         SENSEG NAME=WDN5C1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDN5CP                                       
         END                                                                    
