*        KATALOG AVSNITTS-REGISTER                                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDN5A,PROCOPT=GOT,KEYLEN=11,POS=S                
         SENSEG NAME=WDN5A1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDN5AP                                       
         END                                                                    
