*        KATALOG MASTER-REGISTER                                                
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDN6A,PROCOPT=GOT,KEYLEN=14,POS=S                
         SENSEG NAME=WDN6A1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDN6AP                                       
         END                                                                    
