*        KATALOG ILLUSTRATIONS-REGISTER                                         
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDN7,PROCOPT=A,KEYLEN=18,POS=S                   
         SENSEG NAME=WDN701,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDN7UP,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
