*          DATA SET WDP1BLPII0 AT LEVEL 004 AS OF 90/06/26                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDP1,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDP101,PARENT=0                                            
         SENSEG NAME=WDP111,PARENT=WDP101                                       
         SENSEG NAME=WDP112,PARENT=WDP101                                       
         SENSEG NAME=WDP113,PARENT=WDP101                                       
         SENSEG NAME=WDP114,PARENT=WDP101                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDP1BL                                       
         END                                                                    
