*                                                                               
         PCB   TYPE=DB,DBDNAME=WDP1,PROCOPT=A,KEYLEN=46,POS=S                   
         SENSEG NAME=WDP101,PARENT=0                                            
         SENSEG NAME=WDP111,PARENT=WDP101                                       
         SENSEG NAME=WDP112,PARENT=WDP101                                       
         SENSEG NAME=WDP113,PARENT=WDP101                                       
         SENSEG NAME=WDP114,PARENT=WDP101                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDP1UP,CMPAT=YES                             
         END                                                                    
