*        PERSONKODER INDEX=LEVERANTÖRSINTERVALL                                 
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDP3B,PROCOPT=GOT,KEYLEN=15,POS=S                
         SENSEG NAME=WDP3B1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDP3BP                                       
         END                                                                    
