*        PERSONKODER INDEX=FUNKTIONSGRUPPINTERVALL                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDP3C,PROCOPT=GOT,KEYLEN=16,POS=S                
         SENSEG NAME=WDP3C1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDP3CP                                       
         END                                                                    
