*                                                                               
         PCB   TYPE=DB,DBDNAME=WDP4A,PROCOPT=GOT,KEYLEN=11,POS=S                
         SENSEG NAME=WDP4A1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDP4AP                                       
         END                                                                    
