*                                                                               
         PCB   TYPE=DB,DBDNAME=WDP5A,PROCOPT=GOT,KEYLEN=19,POS=S                
         SENSEG NAME=WDP5A1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDP5AP                                       
         END                                                                    
