*                                                                               
         PCB   TYPE=DB,DBDNAME=WDP5,PROCOPT=A,KEYLEN=21,POS=S                   
         SENSEG NAME=WDP501,PARENT=0                                            
         SENSEG NAME=WDP512,PARENT=WDP501                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDP5UP,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
