*        DISPATCHER                                                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDP8A,PROCOPT=GOT,KEYLEN=25,POS=S                
         SENSEG NAME=WDP8A1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDP8AP                                       
         END                                                                    
