*        LOGG AV KVANTITETER                                                    
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDP9,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDP901,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDP9BL                                       
         END                                                                    
