*          DATA SET WDQ1BPPII0 AT LEVEL 002 AS OF 91/01/09                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDQ1B,PROCOPT=GOT,KEYLEN=42,POS=S                
         SENSEG NAME=WDQ1B1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDQ1BP                                       
         END                                                                    
