*          DATA SET WDQ1APPII0 AT LEVEL 002 AS OF 90/04/18                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDQ1A,PROCOPT=GOT,KEYLEN=39,POS=S                
         SENSEG NAME=WDQ1A1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDQ1AP                                       
         END                                                                    
