*                                                                               
         PCB   TYPE=DB,DBDNAME=WDQ2D,PROCOPT=GOT,KEYLEN=16,POS=S                
         SENSEG NAME=WDQ2D1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDQ2DP                                       
         END                                                                    
