*                                                                               
         PCB   TYPE=DB,DBDNAME=WDQ2,PROCOPT=A,KEYLEN=13,POS=S                   
         SENSEG NAME=WDQ201,PARENT=0                                            
         SENSEG NAME=WDQ211,PARENT=WDQ201                                       
         SENSEG NAME=WDQ212,PARENT=WDQ201                                       
         SENSEG NAME=WDQ221,PARENT=WDQ212                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDQ2UP,CMPAT=YES                             
         END                                                                    
