*          DATA SET WDQ2CPPII0 AT LEVEL 002 AS OF 90/04/12                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDQ2C,PROCOPT=GOT,KEYLEN=21,POS=S                
         SENSEG NAME=WDQ2C1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDQ2CP                                       
         END                                                                    
