*        ORDERDELSREG. PLANERING PRODUKTIONS-KANAL                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDQ3F,PROCOPT=GOT,KEYLEN=24,POS=S                
         SENSEG NAME=WDQ3F1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDQ3FP                                       
         END                                                                    
