*          DATA SET WDQ3APPII0 AT LEVEL 002 AS OF 90/04/18                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDQ3A,PROCOPT=GOT,KEYLEN=56,POS=S                
         SENSEG NAME=WDQ3A1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDQ3AP                                       
         END                                                                    
