*          DATA SET WDQ3BLPII0 AT LEVEL 002 AS OF 90/06/26                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDQ3,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDQ301,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDQ3BL                                       
         END                                                                    
