*          DATA SET WDQ3CPPII0 AT LEVEL 002 AS OF 90/04/18                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDQ3C,PROCOPT=GOT,KEYLEN=40,POS=S                
         SENSEG NAME=WDQ3C1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDQ3CP                                       
         END                                                                    
