*        ORDERDELSREG. TRANSPORT-PLANERING                                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDQ3E,PROCOPT=GOT,KEYLEN=25,POS=S                
         SENSEG NAME=WDQ3E1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDQ3EP                                       
         END                                                                    
