*          DATA SET WDQ3BPPII0 AT LEVEL 002 AS OF 90/04/18                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDQ3B,PROCOPT=GOT,KEYLEN=52,POS=S                
         SENSEG NAME=WDQ3B1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDQ3BP                                       
         END                                                                    
