*        PICK-ROUND PER PRINT DATE                                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDQ3J,PROCOPT=GOT,KEYLEN=26,POS=S                
         SENSEG NAME=WDQ3J1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDQ3JP                                       
         END                                                                    
