*        ORDERRADSREG.                                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDQ4B,PROCOPT=GOT,KEYLEN=37,POS=S                
         SENSEG NAME=WDQ4B1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDQ4BP                                       
         END                                                                    
