*                                                                               
         PCB   TYPE=DB,DBDNAME=WDQ5,PROCOPT=A,KEYLEN=17,POS=S                   
         SENSEG NAME=WDQ501,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDQ5UP,CMPAT=YES                             
         END                                                                    
