*                                                                               
         PCB   TYPE=DB,DBDNAME=WDQ5A,PROCOPT=GOT,KEYLEN=34,POS=S                
         SENSEG NAME=WDQ5A1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDQ5AP                                       
         END                                                                    
