*        TRANSAR TILL BATCH BER./ANSK. FRÅN ONLINE (WLFILC)                     
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR3,PROCOPT=A,KEYLEN=27,POS=S                   
         SENSEG NAME=WDR301,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDR3UP,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
