*        TRANSAR TILL BATCH DISTRIBUTION FRÅN ONLINE (WLFILA)                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR6,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDR601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDR6BL                                       
         END                                                                    
