*        TRANSAR TILL BATCH DISTRIBUTION-DDI FRÅN ONLINE                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR7,PROCOPT=A,KEYLEN=27,POS=S                   
         SENSEG NAME=WDR701,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDR7UP,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
