*        TRANSAR TILL BATCH EKONOMI FRÅN ONLINE (WLFILB)                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR8,PROCOPT=A,KEYLEN=27,POS=S                   
         SENSEG NAME=WDR801,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDR8UP,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
