*        EKONOMI TRANSAR TILL DIVERSE KLIENTER FRÅN PULS                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR9,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDR901,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDR9BL                                       
         END                                                                    
