*        PÅFYLLNING PLOCKSATS - SEC. IND. KDPRIOPF 'TOM'                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDT1H,PROCOPT=GOT,KEYLEN=23,POS=S                
         SENSEG NAME=WDT1H1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDT1HP                                       
         END                                                                    
