*        PÅFYLLNING PLOCKSATS - SEC. IND. IDUSER 'FOM'                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDT1E,PROCOPT=GOT,KEYLEN=30,POS=S                
         SENSEG NAME=WDT1E1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDT1EP                                       
         END                                                                    
