*        PÅFYLLNING PLOCKSATS                                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDT1,PROCOPT=A,KEYLEN=19,POS=S                   
         SENSEG NAME=WDT101,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDT1UP,CMPAT=YES                             
         END                                                                    
