*        PÅFYLLNING PLOCKSATS - SEC. IND. ADPLATS-FOM                           
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDT1C,PROCOPT=GOT,KEYLEN=21,POS=S                
         SENSEG NAME=WDT1C1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDT1CP                                       
         END                                                                    
