*        PÅFYLLNING PLOCKSATS - SEC. IND. IDUSER 'TOM'                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDT1F,PROCOPT=GOT,KEYLEN=30,POS=S                
         SENSEG NAME=WDT1F1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDT1FP                                       
         END                                                                    
