*        PÅFYLLNING PLOCKSATS - SEC. IND. LAGOMR-FOM                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDT1A,PROCOPT=GOT,KEYLEN=18,POS=S                
         SENSEG NAME=WDT1A1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDT1AP                                       
         END                                                                    
