*        GATE REGISTER                                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDT2,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDT201,PARENT=0                                            
         SENSEG NAME=WDT211,PARENT=WDT201                                       
         SENSEG NAME=WDT212,PARENT=WDT201                                       
         SENSEG NAME=WDT213,PARENT=WDT201                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDT2BL                                       
         END                                                                    
