*        KINA PART LABEL INFO                                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDT4,PROCOPT=A,KEYLEN=5,POS=S                    
         SENSEG NAME=WDT401,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDT4UP,CMPAT=YES                             
         END                                                                    
