*        ARTIKELURSPRUNG HISTORIK                                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDT5,PROCOPT=GOT,KEYLEN=210,POS=S                
         SENSEG NAME=WDT501,PARENT=0                                            
         SENSEG NAME=WDT511,PARENT=WDT501                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WDT5BL                                       
         END                                                                    
