         PSBGEN LANG=COBOL,PSBNAME=WF0287                                       
         END                                                                    
