         PSBGEN LANG=COBOL,PSBNAME=WF0282                                       
         END                                                                    
