         PSBGEN LANG=COBOL,PSBNAME=WF0279                                       
         END                                                                    
