         PSBGEN LANG=COBOL,PSBNAME=WF0252                                       
         END                                                                    
