*                                                                               
VALIDATE PCB   TYPE=TP,NAME=WF0202X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WF0201                                       
         END                                                                    
