         PSBGEN LANG=COBOL,PSBNAME=WF0286                                       
         END                                                                    
