         PSBGEN LANG=COBOL,PSBNAME=WF0273                                       
         END                                                                    
