         PSBGEN LANG=COBOL,PSBNAME=WF0274                                       
         END                                                                    
