         PSBGEN LANG=COBOL,PSBNAME=WF0285                                       
         END                                                                    
