         PSBGEN LANG=COBOL,PSBNAME=WF0272                                       
         END                                                                    
