         PSBGEN LANG=COBOL,PSBNAME=WF0258                                       
         END                                                                    
