*                                                                               
SOP      PCB   TYPE=TP,NAME=W0T606U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*                                                                               
         PCB   TYPE=TP,NAME=WF0204X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WF0204                                       
         END                                                                    
