         PSBGEN LANG=COBOL,PSBNAME=WF0262                                       
         END                                                                    
