         PSBGEN LANG=COBOL,PSBNAME=WF0251                                       
         END                                                                    
