         PSBGEN LANG=COBOL,PSBNAME=WF0257                                       
         END                                                                    
