         PSBGEN LANG=COBOL,PSBNAME=WF0277                                       
         END                                                                    
