         PSBGEN LANG=COBOL,PSBNAME=WF0268                                       
         END                                                                    
