*                                                                               
INSERT   PCB   TYPE=TP,NAME=WF0203X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WF0203                                       
         END                                                                    
