         PSBGEN LANG=COBOL,PSBNAME=WF0284                                       
         END                                                                    
