         PSBGEN LANG=COBOL,PSBNAME=WF0271                                       
         END                                                                    
