         PSBGEN LANG=COBOL,PSBNAME=WF0265                                       
         END                                                                    
