         PSBGEN LANG=COBOL,PSBNAME=WF0293                                       
         END                                                                    
