*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WF1030,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
