*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WF1020,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
