*                                                                               
SOP      PCB   TYPE=TP,NAME=W0T606U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
YEARCURR PCB   TYPE=TP,NAME=W93003T,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WF1033,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
