*                                                                               
RECEIVEC PCB   TYPE=TP,NAME=W50493X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WF2108,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
