*                                                                               
SAVEIT   PCB   TYPE=TP,NAME=W40634X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*------> GSAM FOR INPUT FILE                                                    
         PCB   TYPE=GSAM,DBDNAME=WDS3,PROCOPT=G                                 
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WF2104                                       
         END                                                                    
