*                                                                               
SOP      PCB   TYPE=TP,NAME=W0T606U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
FBCREDIT PCB   TYPE=TP,NAME=W41832T,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WF2105,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
