*                                                                               
ATAB     PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=GOT,KEYLEN=80,POS=S                 
         SENSEG NAME=WDR501,PARENT=0                                            
         SENSEG NAME=WDGX0102,PARENT=WDR501                                     
*                                                                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLKREE,PROCOPT=G,KEYLEN=22,POS=S                 
         SENSEG NAME=WLKREE01,PARENT=0,PROCOPT=GR                               
         SENSEG NAME=WLKREE11,PARENT=WLKREE01,PROCOPT=G                         
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLRETA,PROCOPT=G,KEYLEN=22,POS=S                 
         SENSEG NAME=WLRETA01,PARENT=0,PROCOPT=GD                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLRETC,PROCOPT=GOT,KEYLEN=24,POS=S               
         SENSEG NAME=WLRETC01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLRETA,PROCOPT=GOT,KEYLEN=16,POS=S,     *        
               PROCSEQ=WDA3F                                                    
         SENSEG NAME=WLRETA01,PARENT=0                                          
*                                                                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLRETG,PROCOPT=GOT,KEYLEN=38,POS=S               
         SENSEG NAME=WLRETG01,PARENT=0                                          
*                                                                               
* STATUS-PCB                                                                    
         PCB   TYPE=DB,DBDNAME=WLRETA,PROCOPT=G,KEYLEN=11,POS=S,       *        
               PROCSEQ=WDA3B                                                    
         SENSEG NAME=WLRETA01,PARENT=0,PROCOPT=GR                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLRETA,PROCOPT=G,KEYLEN=16,POS=S,       *        
               PROCSEQ=WDA3F                                                    
         SENSEG NAME=WLRETA01,PARENT=0,PROCOPT=GR                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA3,PROCOPT=G,KEYLEN=13,POS=S,         *        
               PROCSEQ=WDA3G                                                    
         SENSEG NAME=WDA301,PARENT=0,PROCOPT=GR                                 
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         PSBGEN LANG=COBOL,PSBNAME=WL0150                                       
*                                                                               
         END                                                                    
