*                                                                               
         PCB TYPE=DB,DBDNAME=WDH1,PROCOPT=G,KEYLEN=23,POS=S                     
         SENSEG NAME=WDH101,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDH111,PARENT=WDH101,PROCOPT=GIR                           
         SENSEG NAME=WDH121,PARENT=WDH111,PROCOPT=GIR                           
*                                                                               
         PCB TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=06,POS=S                   
         SENSEG NAME=WDK601                                                     
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
         PCB TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=07,POS=S                   
         SENSEG NAME=WDK701                                                     
         SENSEG NAME=WDK711,PARENT=WDK701                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WL0176                                       
         END                                                                    
