*        --  DISTRIBUTION & PRINT                                               
DISTRDOC PCB   TYPE=TP,NAME=WZ0420U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB    TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=15,POS=S                
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD8B,PROCOPT=GOT,KEYLEN=22,POS=S                
         SENSEG NAME=WDD8B1,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE4C,PROCOPT=GOT,KEYLEN=29,POS=S                
         SENSEG NAME=WDE4C1,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE4,PROCOPT=GOT,KEYLEN=26,POS=S                 
         SENSEG NAME=WDE401,PARENT=0                                            
         SENSEG NAME=WDE411,PARENT=WDE401                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDH1,PROCOPT=G,KEYLEN=23,POS=S                   
         SENSEG NAME=WDH101,PARENT=0                                            
         SENSEG NAME=WDH111,PARENT=WDH101,PROCOPT=GRID                          
         SENSEG NAME=WDH121,PARENT=WDH111,PROCOPT=GRID                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD3,PROCOPT=GOT,KEYLEN=8,POS=S,        *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WDD301,PARENT=0                                            
         SENSEG NAME=WDD311,PARENT=WDD301                                       
*                                                                               
         PCB    TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=15,POS=S                
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
*                                                                               
         PCB    TYPE=DB,DBDNAME=WDG3,PROCOPT=G,KEYLEN=31,POS=S                  
         SENSEG NAME=WDG301,PARENT=0                                            
         SENSEG NAME=WDGX5102,PARENT=WDG301,PROCOPT=GIR                         
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE6,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDE601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WL0174                                       
         END                                                                    
