*        --  DISTRIBUTION & PRINT                                               
DISTRDOC PCB   TYPE=TP,NAME=WZ0420U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7A,PROCOPT=GOT,KEYLEN=14,POS=S                
         SENSEG NAME=WDK7A1,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD8,PROCOPT=GOT,KEYLEN=22,POS=S                 
         SENSEG NAME=WDD801,PARENT=0                                            
         SENSEG NAME=WDD811,PARENT=WDD801                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=06,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
* BENA-PCB                                                                      
         PCB   TYPE=DB,DBDNAME=WDD3,PROCOPT=GOT,KEYLEN=9,POS=S                  
         SENSEG NAME=WDD301,PARENT=0,PROCOPT=G                                  
         SENSEG NAME=WDD311,PARENT=WDD301                                       
         SENSEG NAME=WDD312,PARENT=WDD301                                       
         SENSEG NAME=WDD313,PARENT=WDD301                                       
* BENA-SEQA                                                                     
         PCB   TYPE=DB,DBDNAME=WDD3,PROCOPT=GOT,KEYLEN=34,POS=S,       *        
               PROCSEQ=WDD3A                                                    
         SENSEG NAME=WDD301,PARENT=0                                            
         SENSEG NAME=WDD313,PARENT=WDD301                                       
* BENA-SEQB                                                                     
         PCB   TYPE=DB,DBDNAME=WDD3,PROCOPT=GOT,KEYLEN=13,POS=S,       *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WDD301,PARENT=0                                            
         SENSEG NAME=WDD311,PARENT=WDD301                                       
         SENSEG NAME=WDD312,PARENT=WDD301                                       
         SENSEG NAME=WDD313,PARENT=WDD301                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WL0196                                       
         END                                                                    
