*          DATA SET W50303PII0 AT LEVEL 003 AS OF 87/09/01                      
*                                                                               
*                                                                               
         PCB TYPE=DB,DBDNAME=WDH1A,PROCOPT=GOT,KEYLEN=23,POS=S                  
         SENSEG NAME=WDH1A1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WL0169                                       
         END                                                                    
