*                                                                               
         PCB   TYPE=DB,DBDNAME=WLKREE,PROCOPT=GOT,KEYLEN=22,POS=S               
         SENSEG NAME=WLKREE01,PARENT=0                                          
         SENSEG NAME=WLKREE11,PARENT=WLKREE01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLKREI,PROCOPT=GOT,KEYLEN=24,POS=S               
         SENSEG NAME=WLKREI01,PARENT=0                                          
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WL0139                                       
         END                                                                    
