*                                                                               
ATAB     PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=GOT,KEYLEN=80,POS=S                 
         SENSEG NAME=WDR501,PARENT=0                                            
         SENSEG NAME=WDGX0102,PARENT=WDR501                                     
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=6,POS=S                
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTD,PROCOPT=G,KEYLEN=22,POS=S                 
         SENSEG NAME=WLARTD01,PARENT=0,PROCOPT=GID                              
         SENSEG NAME=WLARTD11,PARENT=WLARTD01,PROCOPT=GRID                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=11,POS=S,     *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTS,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG NAME=WLARTS01,PARENT=0                                          
         SENSEG NAME=WLARTS11,PARENT=WLARTS01                                   
*                                                                               
* PCB FÖR PLATSREGISTRET                                                        
         PCB   TYPE=DB,DBDNAME=WLLOCB,PROCOPT=GIR,KEYLEN=25,POS=S               
         SENSEG NAME=WLLOCB01,PARENT=0                                          
         SENSEG NAME=WLLOCB11,PARENT=WLLOCB01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD8A,PROCOPT=GOT,KEYLEN=22,POS=S                
         SENSEG NAME=WDD8A1,PARENT=0                                            
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WL0105                                       
         END                                                                    
