*                                                                               
RETURNRE PCB   TYPE=TP,NAME=WL0158U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLRETA,PROCOPT=G,KEYLEN=11,POS=S,       *        
               PROCSEQ=WDA3B                                                    
         SENSEG NAME=WLRETA01,PARENT=0,PROCOPT=GR                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLRETD,PROCOPT=GOT,KEYLEN=44,POS=S               
         SENSEG NAME=WLRETD01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLRETF,PROCOPT=GOT,KEYLEN=32,POS=S               
         SENSEG NAME=WLRETF01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLRETG,PROCOPT=GOT,KEYLEN=38,POS=S               
         SENSEG NAME=WLRETG01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WL4111,PROCOPT=G,KEYLEN=30,POS=S                 
         SENSEG NAME=WL411101,PARENT=0                                          
         SENSEG NAME=WL411111,PARENT=WL411101,PROCOPT=GR                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA3G,PROCOPT=GOT,KEYLEN=43,POS=S                
         SENSEG NAME=WDA3G1,PARENT=0                                            
*                                                                               
*        SÄNDNINGS REGISTER                                                     
         PCB   TYPE=DB,DBDNAME=WDA3B,PROCOPT=GOT,KEYLEN=24,POS=S                
         SENSEG NAME=WDA3B1,PARENT=0                                            
*                                                                               
*        SÄNDNINGS REGISTER/RETUR                                               
         PCB    TYPE=DB,DBDNAME=WDA3,PROCOPT=GOT,KEYLEN=15,POS=S                
         SENSEG NAME=WDA301,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WL0158                                       
         END                                                                    
