*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE6,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDE601,PARENT=0                                            
         SENSEG NAME=WDE611,PARENT=WDE601                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE4A,PROCOPT=GOT,KEYLEN=23,POS=S                
         SENSEG NAME=WDE4A1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WL0143                                       
         END                                                                    
