*                                                                               
*        --  DISTRIBUTION & PRINT                                               
DISTRDOC PCB   TYPE=TP,NAME=WZ0420U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=TP,NAME=W0T541X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLKREE,PROCOPT=G,KEYLEN=24,POS=S                 
         SENSEG NAME=WLKREE01,PARENT=0,PROCOPT=GR                               
         SENSEG NAME=WLKREE11,PARENT=WLKREE01,PROCOPT=GR                        
         SENSEG NAME=WLKREE21,PARENT=WLKREE11                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDL5,PROCOPT=GOT,KEYLEN=19,POS=S                 
         SENSEG NAME=WDL501,PARENT=0                                            
         SENSEG NAME=WDL511,PARENT=WDL501                                       
         SENSEG NAME=WDL521,PARENT=WDL511                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=6,POS=S                
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTM,PROCOPT=GOT,KEYLEN=5,POS=S                
         SENSEG NAME=WLARTM01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=8,POS=S                  
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK722,PARENT=WDK711                                       
         SENSEG NAME=WDK712,PARENT=WDK701                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=13,POS=S,     *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WL4113,PROCOPT=G,KEYLEN=34,POS=S                 
         SENSEG NAME=WL411301,PARENT=0                                          
         SENSEG NAME=WL411311,PARENT=WL411301,PROCOPT=GIRD                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDP3,PROCOPT=GOT,KEYLEN=10,POS=S                 
         SENSEG NAME=WDP301,PARENT=0                                            
         SENSEG NAME=WDP311,PARENT=WDP301                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLKREI,PROCOPT=GOT,KEYLEN=24,POS=S               
         SENSEG NAME=WLKREI01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLEMBB,PROCOPT=GOT,KEYLEN=8,POS=S                
         SENSEG NAME=WLEMBB01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WL4115,PROCOPT=G,KEYLEN=34,POS=S                 
         SENSEG NAME=WL411501,PARENT=0                                          
         SENSEG NAME=WL411511,PARENT=WL411501,PROCOPT=GIRD                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WL4117,PROCOPT=G,KEYLEN=36,POS=S                 
         SENSEG NAME=WL411701,PARENT=0                                          
         SENSEG NAME=WL411711,PARENT=WL411701,PROCOPT=GIRD                      
*                                                                               
*              KUNDREG. BETALARINF.                                             
         PCB   TYPE=DB,DBDNAME=WDB1,PROCOPT=GOT,KEYLEN=11,POS=S                 
         SENSEG NAME=WDB101,PARENT=0                                            
*                                                                               
*              KUNDREG. GODSMOTTAG.                                             
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
* WDG2-PCB/9305-PCB                                                             
         PCB   TYPE=DB,DBDNAME=WDG2,PROCOPT=GOT,KEYLEN=37,POS=S                 
         SENSEG NAME=WDG201,PARENT=0                                            
         SENSEG NAME=WDGX9306,PARENT=WDG201                                     
         SENSEG NAME=WDGX9308,PARENT=WDGX9306                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WL0161                                       
         END                                                                    
