*                                                                               
ATAB     PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=GOT,KEYLEN=80,POS=S                 
         SENSEG NAME=WDR501,PARENT=0                                            
         SENSEG NAME=WDGX0102,PARENT=WDR501                                     
*                                                                               
         PCB TYPE=DB,DBDNAME=WLINVB,PROCOPT=GOT,KEYLEN=23,POS=S                 
         SENSEG NAME=WLINVB01,PARENT=0                                          
*                                                                               
         PCB TYPE=DB,DBDNAME=WDH1,PROCOPT=GOT,KEYLEN=31,POS=S                   
         SENSEG NAME=WDH101,PARENT=0                                            
         SENSEG NAME=WDH111,PARENT=WDH101                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WL0175                                       
         END                                                                    
