*                                                                               
*  -- ALT-DISP-PCB - START AV DISPATCHER-PGM W0069300 ***********               
         PCB   TYPE=TP,NAME=W0T693X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*                                                                               
ATAB     PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=GOT,KEYLEN=80,POS=S                 
         SENSEG NAME=WDR501,PARENT=0                                            
         SENSEG NAME=WDGX0102,PARENT=WDR501                                     
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLKREE,PROCOPT=G,KEYLEN=23,POS=S                 
         SENSEG NAME=WLKREE01,PARENT=0,PROCOPT=GR                               
         SENSEG NAME=WLKREE11,PARENT=WLKREE01,PROCOPT=GR                        
         SENSEG NAME=WLKREE21,PARENT=WLKREE11                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLKREJ,PROCOPT=GOT,KEYLEN=36,POS=S               
         SENSEG NAME=WLKREJ01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLRETA,PROCOPT=GOT,KEYLEN=19,POS=S,     *        
               PROCSEQ=WDA3F                                                    
         SENSEG NAME=WLRETA01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=13,POS=S,     *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WL4111,PROCOPT=G,KEYLEN=30,POS=S                 
         SENSEG NAME=WL411101,PARENT=0                                          
         SENSEG NAME=WL411111,PARENT=WL411101,PROCOPT=GR                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTS,PROCOPT=GOT,KEYLEN=07,POS=S               
         SENSEG NAME=WLARTS01,PARENT=0                                          
         SENSEG NAME=WLARTS11,PARENT=WLARTS01                                   
*                                                                               
* PCB FÖR SUBPGM W006KOM                                                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLKOMA,PROCOPT=G,KEYLEN=28,POS=S                 
         SENSEG NAME=WLKOMA01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLKOMA11,PARENT=WLKOMA01,PROCOPT=GI                        
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
* WDK6-PCB                                                                      
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=6,POS=S                
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6KVAH,PROCOPT=GOT,KEYLEN=18,POS=S               
         SENSEG NAME=W6KVAH01,PARENT=0                                          
         SENSEG NAME=W6KVAH11,PARENT=W6KVAH01                                   
         PSBGEN LANG=COBOL,PSBNAME=WL0152                                       
         END                                                                    
