*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE1B,PROCOPT=GOT,KEYLEN=20,POS=S                
         SENSEG NAME=WDE1B1,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE1,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDE101,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WL0181                                       
         END                                                                    
