*                                                                               
         PCB   TYPE=DB,DBDNAME=WDQ3F,PROCOPT=GOT,KEYLEN=24,POS=S                
         SENSEG NAME=WDQ3F1,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE6,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDE601,PARENT=0                                            
         SENSEG NAME=WDE611,PARENT=WDE601                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WL0185                                       
         END                                                                    
