*                                                                               
         PCB   TYPE=DB,DBDNAME=WLKREE,PROCOPT=G,KEYLEN=23,POS=S                 
         SENSEG NAME=WLKREE01,PARENT=0                                          
         SENSEG NAME=WLKREE11,PARENT=WLKREE01,PROCOPT=GR                        
         SENSEG NAME=WLKREE21,PARENT=WLKREE11,PROCOPT=GIR                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WL0162                                       
         END                                                                    
