*WL019700                                                                       
*CASEREPORT1                                                                    
CASEREPO PCB   TYPE=TP,NAME=WL0197U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* 2191PCB - START AV 2191-LARM ANSKAFFNING                                      
         PCB   TYPE=TP,NAME=W2T191X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* 4349PCB - START AV 4349-UTSKRIFT DEL NOTE NYA                                 
         PCB   TYPE=TP,NAME=W4T349X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*TMS ECOM                                                                       
*        TRANS TILL DISTRIBUTION & PRINT                                        
CREATEPA PCB   TYPE=TP,NAME=WZ0440X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*        TRANS TILL DISTRIBUTION & PRINT                                        
DELETEPA PCB   TYPE=TP,NAME=WZ0440X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* EVENT DB FOR API CALLS                                                        
ATAB     PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=GOT,KEYLEN=80,POS=S                 
         SENSEG NAME=WDR501,PARENT=0                                            
         SENSEG NAME=WDGX0104,PARENT=WDR501                                     
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK5,PROCOPT=GOT,KEYLEN=8,POS=S                  
         SENSEG NAME=WDK501,PARENT=0                                            
*                                                                               
*ORDD-PCB - ORDERDEL         WDE6                                               
         PCB TYPE=DB,DBDNAME=WDE6,PROCOPT=G,KEYLEN=27,POS=S                     
         SENSEG NAME=WDE601,PARENT=0,PROCOPT=GR                                 
         SENSEG NAME=WDE611,PARENT=WDE601,PROCOPT=GR                            
*                                                                               
*WDE6C1-PCB - ORDERHUVUDSREGISTER KÖ   WDE6C1                                   
         PCB   TYPE=DB,DBDNAME=WDE6C,PROCOPT=GOT,KEYLEN=43,POS=S                
         SENSEG NAME=WDE6C1,PARENT=0                                            
*                                                                               
*ORDB-PCB                                                                       
         PCB TYPE=DB,DBDNAME=WDE4,PROCOPT=G,KEYLEN=33,POS=S                     
         SENSEG NAME=WDE401,PARENT=0,PROCOPT=GR                                 
         SENSEG NAME=WDE411,PARENT=WDE401,PROCOPT=GR                            
         SENSEG NAME=WDE421,PARENT=WDE411,PROCOPT=GIR                           
*                                                                               
*OGAE-PCB - KOLLIREGISTER                                                       
         PCB TYPE=DB,DBDNAME=WDE4,PROCOPT=G,KEYLEN=26,POS=S                     
         SENSEG NAME=WDE401,PARENT=0,PROCOPT=GR                                 
         SENSEG NAME=WDE411,PARENT=WDE401,PROCOPT=GR                            
*                                                                               
*OGAE2-PCB                                                                      
         PCB TYPE=DB,DBDNAME=WDE4,PROCOPT=GOT,KEYLEN=23,POS=S,         *        
               PROCSEQ=WDE4A                                                    
         SENSEG NAME=WDE401,PARENT=0                                            
*                                                                               
*ORDB3-PCB                                                                      
         PCB TYPE=DB,DBDNAME=WDE4,PROCOPT=GOTP,KEYLEN=4,POS=S,         *        
               PROCSEQ=WDE4E                                                    
         SENSEG NAME=WDE401,PARENT=0                                            
*                                                                               
*WDQ301-PCB - ORDERHUVUDSREGISTER KÖ   WDQ301                                   
         PCB   TYPE=DB,DBDNAME=WDQ3,PROCOPT=G,KEYLEN=12,POS=S                   
         SENSEG NAME=WDQ301,PARENT=0,PROCOPT=GR                                 
*                                                                               
*WDQ3H-PCB - ORDERHUVUDSREGISTER KÖ   WDQ301                                    
         PCB TYPE=DB,DBDNAME=WDQ3,PROCOPT=GOT,KEYLEN=12,POS=S,         *        
               PROCSEQ=WDQ3H                                                    
         SENSEG NAME=WDQ301,PARENT=0                                            
*                                                                               
*WDQ3D1-PCB - ORDERHUVUDSREGISTER KÖ   WDQ3D1                                   
         PCB   TYPE=DB,DBDNAME=WDQ3D,PROCOPT=GOT,KEYLEN=12,POS=S                
         SENSEG NAME=WDQ3D1,PARENT=0                                            
*                                                                               
*XXDV-PCB - AUTOMATFAKTURERING        WDG7   HTYP=4726                          
         PCB TYPE=DB,DBDNAME=WLXXDV,PROCOPT=G,KEYLEN=54,POS=S                   
         SENSEG NAME=WLXXDV01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLXXDV11,PARENT=WLXXDV01,PROCOPT=GI                        
         SENSEG NAME=WLXXDV21,PARENT=WLXXDV11,PROCOPT=GI                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXKW,PROCOPT=G,KEYLEN=31,POS=S                 
         SENSEG NAME=WLXXKW01,PARENT=0                                          
         SENSEG NAME=WLXXKW11,PARENT=WLXXKW01,PROCOPT=GR                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXLB,PROCOPT=GOT,KEYLEN=40,POS=S               
         SENSEG NAME=WLXXLB01,PARENT=0                                          
         SENSEG NAME=WLXXLB11,PARENT=WLXXLB01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXJK,PROCOPT=G,KEYLEN=30,POS=S                 
         SENSEG NAME=WLXXJK01,PARENT=0                                          
         SENSEG NAME=WLXXJK11,PARENT=WLXXJK01,PROCOPT=GI                        
*                                                                               
         PCB TYPE=DB,DBDNAME=WLZZAC,PROCOPT=G,KEYLEN=18,POS=S                   
         SENSEG NAME=WLZZAC01,PARENT=0,PROCOPT=GI                               
*                                                                               
*WDQ2 - ORDERHUVUD                                                              
*ORQI-PCB - ORDERHUVUDSREGISTER KÖ        WDQ2                                  
         PCB   TYPE=DB,DBDNAME=WLORQI,PROCOPT=G,KEYLEN=6,POS=S                  
         SENSEG NAME=WLORQI01,PARENT=0                                          
         SENSEG NAME=WLORQI12,PARENT=WLORQI01,PROCOPT=GR                        
*                                                                               
*ORQL-PCB                                                                       
*        ORDERKÖN     WDQ2C, ORDERHUVUD  VIA SEKUNDÄR INDEX                     
         PCB   TYPE=DB,DBDNAME=WLORQI,PROCOPT=GOT,KEYLEN=34,POS=S,     *        
               PROCSEQ=WDQ2C                                                    
         SENSEG NAME=WLORQI01,PARENT=0                                          
*                                                                               
*WDQ2 - ORDERHUVUD C INDEX                                                      
*ORQICSQ-PCB - ORDERHUVUDSREGISTER KÖ        WDQ2                               
         PCB   TYPE=DB,DBDNAME=WLORQI,PROCOPT=GOT,KEYLEN=21,POS=S,     *        
               PROCSEQ=WDQ2C                                                    
         SENSEG NAME=WLORQI01,PARENT=0                                          
*                                                                               
*ORQM-PCB - ORDERHUVUDSREGISTER KÖ        WDQ2                                  
         PCB TYPE=DB,DBDNAME=WLORQM,PROCOPT=G,KEYLEN=17,POS=S                   
         SENSEG NAME=WLORQM01,PARENT=0,PROCOPT=GI                               
*                                                                               
*  KAMPANJREGISTER                                                              
         PCB    TYPE=DB,DBDNAME=WDM2,PROCOPT=G,KEYLEN=25,POS=S                  
         SENSEG NAME=WDM201,PARENT=0                                            
         SENSEG NAME=WDM211,PARENT=WDM201,PROCOPT=GR                            
         SENSEG NAME=WDM221,PARENT=WDM211,PROCOPT=GR                            
                                                                                
*ORQA2-PCB - ORDERDELSREGISTER KÖ        WDQ3                                   
         PCB   TYPE=DB,DBDNAME=WLORQA,PROCOPT=GOT,KEYLEN=12,POS=S               
         SENSEG NAME=WLORQA01,PARENT=0                                          
*                                                                               
*ORDP1-PCB                                                                      
         PCB TYPE=DB,DBDNAME=WLORDP,PROCOPT=G,KEYLEN=24,POS=S                   
         SENSEG NAME=WLORDP01,PARENT=0,PROCOPT=GIRD                             
*                                                                               
*ORDP2-PCB                                                                      
         PCB TYPE=DB,DBDNAME=WLORDP,PROCOPT=G,KEYLEN=24,POS=S                   
         SENSEG NAME=WLORDP01,PARENT=0,PROCOPT=GR                               
*                                                                               
*XXJN-PCB       - WDG2                                                          
         PCB TYPE=DB,DBDNAME=WLXXJN,PROCOPT=GOT,KEYLEN=40,POS=S                 
         SENSEG NAME=WLXXJN01,PARENT=0                                          
         SENSEG NAME=WLXXJN11,PARENT=WLXXJN01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXKH,PROCOPT=GOT,KEYLEN=35,POS=S               
         SENSEG NAME=WLXXKH01,PARENT=0                                          
         SENSEG NAME=WLXXKH11,PARENT=WLXXKH01                                   
*                                                                               
*ARTC-PCB -                                                                     
         PCB TYPE=DB,DBDNAME=WLARTC,PROCOPT=G,KEYLEN=7,POS=S                    
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01,PROCOPT=GR                        
*                                                                               
*ARTS-PCB -                                                                     
         PCB TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=8,POS=S                      
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701,PROCOPT=GR                            
         SENSEG NAME=WDK722,PARENT=WDK711                                       
         SENSEG NAME=WDK712,PARENT=WDK701                                       
*                                                                               
*ARTM-PCB -                                                                     
         PCB TYPE=DB,DBDNAME=WLARTM,PROCOPT=G,KEYLEN=05,POS=S                   
         SENSEG NAME=WLARTM01,PARENT=0,PROCOPT=GRI                              
*                                                                               
*AUTF-PCB                                                                       
         PCB TYPE=DB,DBDNAME=WLXXDV,PROCOPT=G,KEYLEN=54,POS=S                   
         SENSEG NAME=WLXXDV01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLXXDV11,PARENT=WLXXDV01,PROCOPT=GI                        
         SENSEG NAME=WLXXDV21,PARENT=WLXXDV11,PROCOPT=GI                        
*                                                                               
*HTYP-4487-4488-4490                                                            
         PCB TYPE=DB,DBDNAME=WDR4,PROCOPT=G,KEYLEN=53,POS=S                     
         SENSEG NAME=WDR401,PARENT=0                                            
         SENSEG NAME=WDGX4488,PARENT=WDR401                                     
         SENSEG NAME=WDGX4490,PARENT=WDGX4488,PROCOPT=GD                        
*                                                                               
         PCB TYPE=DB,DBDNAME=WL4541,PROCOPT=G,KEYLEN=50,POS=S                   
         SENSEG NAME=WL454101,PARENT=0                                          
         SENSEG NAME=WL454111,PARENT=WL454101,PROCOPT=GI                        
*                                                                               
         PCB TYPE=DB,DBDNAME=WLLOGA,PROCOPT=G,KEYLEN=20,POS=S                   
         SENSEG NAME=WLLOGA01,PARENT=0,PROCOPT=GI                               
*                                                                               
*        ARTIKELREGISTER WDK6                                                   
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=G,KEYLEN=6,POS=S                    
         SENSEG NAME=WDK601,PARENT=0,PROCOPT=G                                  
         SENSEG NAME=WDK611,PARENT=WDK601,PROCOPT=GR                            
*                                                                               
*                                                                               
*        VOR REGISTER NYTT                                                      
         PCB   TYPE=DB,DBDNAME=WDA6,PROCOPT=G,KEYLEN=40,POS=S,         *        
               PROCSEQ=WDA6B                                                    
         SENSEG NAME=WDA601,PARENT=0,PROCOPT=GR                                 
*                                                                               
*        VOR REGISTER NYTT                                                      
         PCB   TYPE=DB,DBDNAME=WDA6,PROCOPT=G,KEYLEN=40,POS=S                   
         SENSEG NAME=WDA601,PARENT=0,PROCOPT=GI                                 
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
******** SUBMODUL   W335PRQU  UPPDATERA PRISFRÅGA ********                      
*                                                                               
* PRQU-WDG2-PCB - VALUTAREGISTER       WDG2                                     
         PCB   TYPE=DB,DBDNAME=WDG2,PROCOPT=GOT,KEYLEN=37,POS=S                 
         SENSEG NAME=WDG201,PARENT=0                                            
         SENSEG NAME=WDGX9306,PARENT=WDG201                                     
         SENSEG NAME=WDGX9308,PARENT=WDGX9306                                   
*                                                                               
* PRQU-WDC7-PCB - UPPDATERA PRISFRÅGA WDC7                                      
         PCB   TYPE=DB,DBDNAME=WDC7,PROCOPT=G,KEYLEN=33,POS=S                   
         SENSEG NAME=WDC701,PARENT=0,PROCOPT=GIRD                               
         SENSEG NAME=WDC711,PARENT=WDC701,PROCOPT=GIRD                          
*                                                                               
* PRQU-SJKO-WDK6-PCB - ARTIKELINFORMATION       WDK6                            
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=06,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
* ROLL-WDP4A                                                                    
         PCB   TYPE=DB,DBDNAME=WDP4A,PROCOPT=GOT,KEYLEN=11,POS=S                
         SENSEG NAME=WDP4A1,PARENT=0                                            
*                                                                               
******** SUBMODUL   W335PRNO  PRISFRÅGENUMMER ************                      
*                                                                               
* PRNO-3107-PCB - PRISFRÅGENUMMER            WDR1  IDHTYP=3107                  
         PCB   TYPE=DB,DBDNAME=WDR1,PROCOPT=G,KEYLEN=31,POS=S                   
         SENSEG NAME=WDR101,PARENT=0                                            
         SENSEG NAME=WDGX3108,PARENT=WDR101,PROCOPT=GR                          
*                                                                               
******** SUBMODUL   W411DNOT  DATA TILL DELIVERY NOTE ********                  
* DNOT-ORQP-PCB - DELIVERY NOTEREGISTER    WDQ5                                 
         PCB   TYPE=DB,DBDNAME=WLORQP,PROCOPT=G,KEYLEN=17,POS=S                 
         SENSEG NAME=WLORQP01,PARENT=0,PROCOPT=GIRD                             
*                                                                               
* DNOT-ORQP2-PCB - DELIVERY NOTEREGISTER    WDQ5                                
         PCB   TYPE=DB,DBDNAME=WLORQP,PROCOPT=G,KEYLEN=17,POS=S                 
         SENSEG NAME=WLORQP01,PARENT=0,PROCOPT=GIR                              
*                                                                               
* DNOT-ORQP3-PCB - DELIVERY NOTEREGISTER    WDQ5                                
         PCB   TYPE=DB,DBDNAME=WLORQP,PROCOPT=G,KEYLEN=17,POS=S                 
         SENSEG NAME=WLORQP01,PARENT=0,PROCOPT=GIR                              
*                                                                               
* DNOT-4013-PCB - WDR4  HTYP=4013 VIPSORDERBEKR                                 
         PCB   TYPE=DB,DBDNAME=WL4013,PROCOPT=G,KEYLEN=58,POS=S                 
         SENSEG NAME=WL401301,PARENT=0,PROCOPT=GID                              
         SENSEG NAME=WL401311,PARENT=WL401301,PROCOPT=GID                       
         SENSEG NAME=WL401321,PARENT=WL401311,PROCOPT=GID                       
*                                                                               
* DNOT-BENA-PCB  BENÄMNINGSREGISTER                                             
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=13,POS=S,     *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
******** SUBMODULE  W403TMS SEND TMS EVENT    ************                      
*TMS-1165-PCB                                                                   
         PCB   TYPE=DB,DBDNAME=WL1165,PROCOPT=GOT,KEYLEN=32,POS=S               
         SENSEG NAME=WL116501,PARENT=0                                          
         SENSEG NAME=WL116511,PARENT=WL116501                                   
         SENSEG NAME=WL116512,PARENT=WL116501                                   
*                                                                               
*TMS-4141-PCB                                                                   
         PCB   TYPE=DB,DBDNAME=WDR2,PROCOPT=GOT,KEYLEN=46,POS=S                 
         SENSEG NAME=WDR201,PARENT=0                                            
         SENSEG NAME=WDGX4142,PARENT=WDR201                                     
*                                                                               
*TMS-WDB2-PCB                                                                   
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
*TMS-WDB6-PCB - DC-REGISTER  WDB6                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
*TMS-WDD3-PCB  DESCRIPTION DB                                                   
         PCB   TYPE=DB,DBDNAME=WDD3,PROCOPT=GOT,KEYLEN=8,POS=S,        *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WDD301,PARENT=0                                            
         SENSEG NAME=WDD311,PARENT=WDD301                                       
*                                                                               
*TMS-WDB1-PCB  KUNDREGISTER BETAL WDB1                                          
         PCB   TYPE=DB,DBDNAME=WDB1,PROCOPT=GOT,KEYLEN=11,POS=S                 
         SENSEG NAME=WDB101,PARENT=0                                            
*                                                                               
*TMS-WDE4A-PCB                                                                  
        PCB TYPE=DB,DBDNAME=WDE4,PROCOPT=GOT,KEYLEN=17,POS=S,          *        
               PROCSEQ=WDE4A                                                    
        SENSEG NAME=WDE401,PARENT=0                                             
*                                                                               
*TMS-WDE4F-PCB                                                                  
        PCB TYPE=DB,DBDNAME=WDE4,PROCOPT=GOTP,KEYLEN=30,POS=S,         *        
               PROCSEQ=WDE4F                                                    
        SENSEG NAME=WDE411,PARENT=0                                             
        SENSEG NAME=WDE401,PARENT=WDE411                                        
        SENSEG NAME=WDE421,PARENT=WDE411                                        
*                                                                               
*TMS-WDQ2-PCB                                                                   
        PCB   TYPE=DB,DBDNAME=WDQ2,PROCOPT=GOT,KEYLEN=4,POS=S                   
        SENSEG NAME=WDQ201,PARENT=0                                             
*                                                                               
*TMS-WDQ3-PCB                                                                   
        PCB   TYPE=DB,DBDNAME=WDQ3,PROCOPT=GOT,KEYLEN=12,POS=S                  
        SENSEG NAME=WDQ301,PARENT=0                                             
*                                                                               
*TMS-WDK6-PCB                                                                   
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=06,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
*TMS-WDE6-PCB                                                                   
         PCB   TYPE=DB,DBDNAME=WDE6,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDE601,PARENT=0                                            
         SENSEG NAME=WDE611,PARENT=WDE601                                       
*                                                                               
*TMS-WDK5-PCB                                                                   
        PCB   TYPE=DB,DBDNAME=WDK5,PROCOPT=GOT,KEYLEN=08,POS=S                  
        SENSEG NAME=WDK501,PARENT=0                                             
*                                                                               
*TMS-WDQ2C-PCB                                                                  
         PCB   TYPE=DB,DBDNAME=WDQ2,PROCOPT=GOT,KEYLEN=21,POS=S,       *        
               PROCSEQ=WDQ2C                                                    
         SENSEG NAME=WDQ201,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WL0197                                       
         END                                                                    
