*        UTREDNINGSSALDO                                                        
* ALT-2191PCB - START AV 2191-LARM ANSKAFFNING                                  
         PCB   TYPE=TP,NAME=W2T191X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
MQASYNC  PCB   TYPE=TP,NAME=WZ0431X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDH1,PROCOPT=G,KEYLEN=23,POS=S                   
         SENSEG NAME=WDH101,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDH111,PARENT=WDH101,PROCOPT=GIRD                          
         SENSEG NAME=WDH121,PARENT=WDH111,PROCOPT=GIRD                          
* ARTIKELREGISTER                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=G,KEYLEN=08,POS=S                   
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601,PROCOPT=GR                            
         SENSEG NAME=WDK629,PARENT=WDK611,PROCOPT=GR                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE4,PROCOPT=GOTP,KEYLEN=30,POS=S,      *        
               PROCSEQ=WDE4C                                                    
         SENSEG NAME=WDE411,PARENT=0                                            
         SENSEG NAME=WDE401,PARENT=WDE411                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTD,PROCOPT=GOT,KEYLEN=22,POS=S               
         SENSEG NAME=WLARTD01,PARENT=0                                          
         SENSEG NAME=WLARTD11,PARENT=WLARTD01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXEF,PROCOPT=G,KEYLEN=45,POS=S                 
         SENSEG NAME=WLXXEF01,PARENT=0                                          
         SENSEG NAME=WLXXEF11,PARENT=WLXXEF01,PROCOPT=GIR                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=8,POS=S                    
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701,PROCOPT=GR                            
         SENSEG NAME=WDK722,PARENT=WDK711                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLINLC,PROCOPT=GOT,KEYLEN=21,POS=S               
         SENSEG NAME=WLINLC01,PARENT=0                                          
         SENSEG NAME=WLINLC11,PARENT=WLINLC01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLINVC,PROCOPT=G,KEYLEN=13,POS=S                 
         SENSEG NAME=WLINVC01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLINVC11,PARENT=WLINVC01,PROCOPT=GI                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLLOGA,PROCOPT=G,KEYLEN=20,POS=S                 
         SENSEG NAME=WLLOGA01,PARENT=0,PROCOPT=GI                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLSAPA,PROCOPT=G,KEYLEN=31,POS=S                 
         SENSEG NAME=WLSAPA01,PARENT=0,PROCOPT=GI                               
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
* WDR8-PCB                                                                      
         PCB   TYPE=DB,DBDNAME=WDR8,PROCOPT=G,KEYLEN=27,POS=S                   
         SENSEG NAME=WDR801,PARENT=0,PROCOPT=GI                                 
*                                                                               
* WDE6-PCB                                                                      
         PCB   TYPE=DB,DBDNAME=WDE6,PROCOPT=GOT,KEYLEN=4,POS=S                  
         SENSEG NAME=WDE601,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDL2,PROCOPT=GOT,KEYLEN=21,POS=S                 
         SENSEG NAME=WDL201,PARENT=0                                            
         SENSEG NAME=WDL211,PARENT=WDL201                                       
         SENSEG NAME=WDL221,PARENT=WDL211                                       
         SENSEG NAME=WDL231,PARENT=WDL221                                       
         SENSEG NAME=WDL222,PARENT=WDL211                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WL0172                                       
         END                                                                    
