*                                                                               
* DISP-MSG-PCB - FEL/KLAR MEDDELANDE TILL DISPATCHERN                           
         PCB   TYPE=TP,NAME=W0T693X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*        --  DISTRIBUTION & PRINT                                               
DISTRDOC PCB   TYPE=TP,NAME=WZ0420U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*                                                                               
ATAB     PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=GOT,KEYLEN=80,POS=S                 
         SENSEG NAME=WDR501,PARENT=0                                            
         SENSEG NAME=WDGX0102,PARENT=WDR501                                     
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLRETA,PROCOPT=G,KEYLEN=15,POS=S                 
         SENSEG NAME=WLRETA01,PARENT=0,PROCOPT=GI                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLRETG,PROCOPT=GOT,KEYLEN=38,POS=S               
         SENSEG NAME=WLRETG01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLKREE,PROCOPT=GOT,KEYLEN=22,POS=S               
         SENSEG NAME=WLKREE01,PARENT=0                                          
         SENSEG NAME=WLKREE11,PARENT=WLKREE01                                   
*                                                                               
*   PCB FÖR SUBPROGRAM W418ANSV                                                 
*                                                                               
         PCB   TYPE=DB,DBDNAME=WL4113,PROCOPT=GOT,KEYLEN=34,POS=S               
         SENSEG NAME=WL411301,PARENT=0                                          
         SENSEG NAME=WL411311,PARENT=WL411301                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WL4115,PROCOPT=GOT,KEYLEN=34,POS=S               
         SENSEG NAME=WL411501,PARENT=0                                          
         SENSEG NAME=WL411511,PARENT=WL411501                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WL4117,PROCOPT=GOT,KEYLEN=36,POS=S               
         SENSEG NAME=WL411701,PARENT=0                                          
         SENSEG NAME=WL411711,PARENT=WL411701                                   
*                                                                               
*   PCB FÖR ATT HÄMTA IDRTLOP.                                                  
*                                                                               
         PCB   TYPE=DB,DBDNAME=WL4111,PROCOPT=G,KEYLEN=30,POS=S                 
         SENSEG NAME=WL411101,PARENT=0,PROCOPT=G                                
         SENSEG NAME=WL411111,PARENT=WL411101,PROCOPT=GR                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA3,PROCOPT=G,KEYLEN=11,POS=S,         *        
               PROCSEQ=WDA3B                                                    
         SENSEG NAME=WDA301,PARENT=0,PROCOPT=GR                                 
*                                                                               
* PCB FÖR SUBPGM W006KOM                                                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLKOMA,PROCOPT=G,KEYLEN=28,POS=S                 
         SENSEG NAME=WLKOMA01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLKOMA11,PARENT=WLKOMA01,PROCOPT=GI                        
                                                                                
         PCB   TYPE=DB,DBDNAME=WDA3B,PROCOPT=GOT,KEYLEN=24,POS=S                
         SENSEG NAME=WDA3B1,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WL0156                                       
         END                                                                    
