*        --  DISTRIBUTION & PRINT                                               
DISTRDOC PCB   TYPE=TP,NAME=WZ0420U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
********* SDC LOCATION - ARTIKEL INDEX PER SDC WDK7A                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTR,PROCOPT=GOT,KEYLEN=14,POS=S               
         SENSEG NAME=WLARTR01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
*                                                                               
*********ARTIKEL DESCRIPTION DATABASE WDD3                                      
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=8,POS=S,      *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD8,PROCOPT=GOT,KEYLEN=22,POS=S,       *        
               PROCSEQ=WDD8A                                                    
         SENSEG NAME=WDD811,PARENT=0                                            
         SENSEG NAME=WDD801,PARENT=WDD811                                       
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WL0106                                       
         END                                                                    
