*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=5,POS=S                  
         SENSEG NAME=WDK601,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDH7,PROCOPT=GOT,KEYLEN=12,POS=S                 
         SENSEG NAME=WDH701,PARENT=0                                            
         SENSEG NAME=WDH711,PARENT=WDH701                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WL0170                                       
         END                                                                    
