*          DATA SET W50309PII0 AT LEVEL 004 AS OF 90/01/15                      
*                                                                               
         PCB TYPE=DB,DBDNAME=WDH1,PROCOPT=GOT,KEYLEN=23,POS=S                   
         SENSEG NAME=WDH101,PARENT=0                                            
         SENSEG NAME=WDH111,PARENT=WDH101                                       
*                                                                               
*        SEQB LÄSNINGAR                                                         
         PCB   TYPE=DB,DBDNAME=WDH1,PROCOPT=GOT,KEYLEN=23,POS=S,       *        
               PROCSEQ=WDH1B                                                    
         SENSEG NAME=WDH111,PARENT=0                                            
         SENSEG NAME=WDH101,PARENT=WDH111                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WL0179                                       
         END                                                                    
