*                                                                               
*        TIME-TABLE WDGX HTYP=4437 (4437-4438)                                  
*                                                                               
         PCB   TYPE=DB,DBDNAME=WL4437,PROCOPT=GOT,KEYLEN=38,POS=S               
         SENSEG NAME=WL443701,PARENT=0                                          
         SENSEG NAME=WL443711,PARENT=WL443701                                   
*                                                                               
*        PRC-TABLE  WDGX HTYP=4447 (4447-4448)                                  
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXKH,PROCOPT=GOT,KEYLEN=35,POS=S               
         SENSEG NAME=WLXXKH01,PARENT=0                                          
         SENSEG NAME=WLXXKH11,PARENT=WLXXKH01                                   
*                                                                               
*        ORDERHEAD FILE WDQ212                                                  
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLORQI,PROCOPT=GOT,KEYLEN=06,POS=S               
         SENSEG NAME=WLORQI01,PARENT=0                                          
         SENSEG NAME=WLORQI12,PARENT=WLORQI01                                   
*                                                                               
*        ORDERPART FILE WDQ301                                                  
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLORQA,PROCOPT=GOT,KEYLEN=12,POS=S               
         SENSEG NAME=WLORQA01,PARENT=0                                          
*                                                                               
*        BY SECONDARY INDEX WDQ3A1                                              
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLORQB,PROCOPT=GOT,KEYLEN=56,POS=S               
         SENSEG NAME=WLORQB01,PARENT=0                                          
*                                                                               
*        SECONDARY INDEX WDQ3B1                                                 
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLORQC,PROCOPT=GOT,KEYLEN=52,POS=S               
         SENSEG NAME=WLORQC01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WL0125                                       
         END                                                                    
