*          DATA SET WL0128PII0 AT LEVEL 006 AS OF 90/10/10                      
*WDE4                                                                           
         PCB   TYPE=DB,DBDNAME=WDE4,PROCOPT=GOT,KEYLEN=30,POS=S                 
         SENSEG NAME=WDE401,PARENT=0                                            
         SENSEG NAME=WDE411,PARENT=WDE401                                       
*WDE4A                                                                          
         PCB   TYPE=DB,DBDNAME=WDE4,PROCOPT=GOT,KEYLEN=23,POS=S,       *        
               PROCSEQ=WDE4A                                                    
         SENSEG NAME=WDE401,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLORQI,PROCOPT=GOT,KEYLEN=6,POS=S                
         SENSEG NAME=WLORQI01,PARENT=0                                          
         SENSEG NAME=WLORQI12,PARENT=WLORQI01                                   
*                                                                               
*GMTA    KUNDREGISTER WDB201                                                    
         PCB   TYPE=DB,DBDNAME=WLGMTA,PROCOPT=GOT,KEYLEN=09,POS=S               
         SENSEG NAME=WLGMTA01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLORQA,PROCOPT=GOT,KEYLEN=12,POS=S               
         SENSEG NAME=WLORQA01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLGMTC,PROCOPT=GOT,KEYLEN=11,POS=S               
         SENSEG NAME=WLGMTC01,PARENT=0                                          
*OGAC                                                                           
         PCB   TYPE=DB,DBDNAME=WDE6,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDE601,PARENT=0                                            
         SENSEG NAME=WDE611,PARENT=WDE601                                       
*                                                                               
*ORDD                                                                           
         PCB   TYPE=DB,DBDNAME=WDE6,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDE601,PARENT=0                                            
         SENSEG NAME=WDE611,PARENT=WDE601                                       
*WDE4F                                                                          
         PCB   TYPE=DB,DBDNAME=WDE4,PROCOPT=GOTP,KEYLEN=30,POS=S,      *        
               PROCSEQ=WDE4F                                                    
         SENSEG NAME=WDE411,PARENT=0                                            
         SENSEG NAME=WDE401,PARENT=WDE411                                       
         SENSEG NAME=WDE421,PARENT=WDE411                                       
*WDE4E                                                                          
         PCB   TYPE=DB,DBDNAME=WDE4E,PROCOPT=G,KEYLEN=23,POS=S                  
         SENSEG NAME=WDE4E1,PARENT=0                                            
*                                                                               
*WDI2    TACDISREGISTER WDI201                                                  
         PCB   TYPE=DB,DBDNAME=WDI2,PROCOPT=GOT,KEYLEN=17,POS=S                 
         SENSEG NAME=WDI201,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WL0128                                       
         END                                                                    
