*                                                                               
DISTRDOC PCB   TYPE=TP,NAME=WZ0420U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
MQASYNC  PCB   TYPE=TP,NAME=WZ0431X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=TP,NAME=W0T606U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
DCGOODSR PCB   TYPE=TP,NAME=WL0101U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WL6301,PROCOPT=G,KEYLEN=42,POS=S                 
         SENSEG NAME=WL630101                                                   
         SENSEG NAME=WL630111,PARENT=WL630101,PROCOPT=GIRD                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLINLC,PROCOPT=G,KEYLEN=21,POS=S                 
         SENSEG NAME=WLINLC01                                                   
         SENSEG NAME=WLINLC11,PARENT=WLINLC01,PROCOPT=GR                        
         SENSEG NAME=WLINLC12,PARENT=WLINLC01,PROCOPT=G                         
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLINLD,PROCOPT=GOT,KEYLEN=42,POS=S               
         SENSEG NAME=WLINLD01                                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTS,PROCOPT=G,KEYLEN=7,POS=S                  
         SENSEG NAME=WLARTS01                                                   
         SENSEG NAME=WLARTS11,PARENT=WLARTS01,PROCOPT=GR                        
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLLOGA,PROCOPT=G,KEYLEN=20,POS=S                 
         SENSEG NAME=WLLOGA01,PARENT=0,PROCOPT=GI                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLINLC,PROCOPT=GOT,KEYLEN=21,POS=S,     *        
               PROCSEQ=WDL6A                                                    
         SENSEG NAME=WLINLC11                                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WL6301,PROCOPT=GOT,KEYLEN=42,POS=S               
         SENSEG NAME=WL630101                                                   
         SENSEG NAME=WL630111,PARENT=WL630101                                   
* WDR8-PCB                                                                      
         PCB   TYPE=DB,DBDNAME=WDR8,PROCOPT=G,KEYLEN=27,POS=S                   
         SENSEG NAME=WDR801,PARENT=0,PROCOPT=GI                                 
* WDR9-PCB                                                                      
         PCB   TYPE=DB,DBDNAME=WDR9,PROCOPT=G,KEYLEN=31,POS=S                   
         SENSEG NAME=WDR901,PARENT=0,PROCOPT=GI                                 
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=G,KEYLEN=6,POS=S                    
         SENSEG NAME=WDK601                                                     
         SENSEG NAME=WDK611,PARENT=WDK601,PROCOPT=GR                            
* WDL6-PCB                                                                      
         PCB   TYPE=DB,DBDNAME=WDL6,PROCOPT=G,KEYLEN=21,POS=S                   
         SENSEG NAME=WDL601,PARENT=0                                            
         SENSEG NAME=WDL611,PARENT=WDL601                                       
         SENSEG NAME=WDL623,PARENT=WDL611,PROCOPT=GIR                           
*                                                                               
         PCB   TYPE=DB,DBDNAME=W6G1,PROCOPT=GOT,KEYLEN=35,POS=S                 
         SENSEG NAME=W6G101,PARENT=0                                            
         SENSEG NAME=W6G130,PARENT=W6G101                                       
*                                                                               
*                                                                               
*********SUBMODUL W218ETA ESTIMATED TIME OF ARRIVAL                             
* W218-WDK6-PCB - PART INFO  WDK6                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=6,POS=S                  
         SENSEG NAME=WDK601                                                     
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
* W218-WDK7-PCB - PART INFO  WDK7                                               
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDK701                                                     
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK712,PARENT=WDK701                                       
*                                                                               
* W218-WDL6-PCB - PART INFO  WDL6                                               
         PCB   TYPE=DB,DBDNAME=WDL6,PROCOPT=GOT,KEYLEN=215,POS=S                
         SENSEG NAME=WDL601,PARENT=0                                            
         SENSEG NAME=WDL611,PARENT=WDL601                                       
         SENSEG NAME=WDL612,PARENT=WDL601                                       
*                                                                               
* W218-WDF1-PCB - SUPPLIER INFO  WDF1                                           
         PCB   TYPE=DB,DBDNAME=WDF1,PROCOPT=GOT,KEYLEN=11,POS=                  
         SENSEG NAME=WDF101,PARENT=0                                            
         SENSEG NAME=WDF116,PARENT=WDF101                                       
*                                                                               
* W218-WDB6-PCB - DC INFO                                                       
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=4,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB616,PARENT=WDB601                                       
* W218-WDD9-PCB                                                                 
         PCB   TYPE=DB,DBDNAME=WDD9,PROCOPT=GOT,KEYLEN=20,POS=S                 
         SENSEG NAME=WDD901,PARENT=0                                            
         SENSEG NAME=WDD902,PARENT=WDD901                                       
         SENSEG NAME=WDD905,PARENT=WDD902                                       
         SENSEG NAME=WDD924,PARENT=WDD902                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WL0101                                       
         END                                                                    
