*        TRANS TO DISTRIBUTION & PRINT                                          
DISTRDOC PCB   TYPE=TP,NAME=WZ0420X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLRETA,PROCOPT=G,KEYLEN=15,POS=S                 
         SENSEG NAME=WLRETA01,PARENT=0,PROCOPT=GD                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLRETA,PROCOPT=GOT,KEYLEN=17,POS=S,     *        
               PROCSEQ=WDA3F                                                    
         SENSEG NAME=WLRETA01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLRETG,PROCOPT=GOT,KEYLEN=38,POS=S               
         SENSEG NAME=WLRETG01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA2,PROCOPT=GOT,KEYLEN=22,POS=S                 
         SENSEG NAME=WDA201,PARENT=0                                            
         SENSEG NAME=WDA211,PARENT=WDA201                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA3,PROCOPT=GOT,KEYLEN=04,POS=S,       *        
               PROCSEQ=WDA3H                                                    
         SENSEG NAME=WDA301,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDA3,PROCOPT=GOT,KEYLEN=04,POS=S,       *        
               PROCSEQ=WDA3I                                                    
         SENSEG NAME=WDA301,PARENT=0                                            
*                                                                               
*        SÄNDNINGS REGISTER - IDRT                                              
         PCB   TYPE=DB,DBDNAME=WDA3H,PROCOPT=GOT,KEYLEN=24,POS=S                
         SENSEG NAME=WDA3H1,PARENT=0                                            
*                                                                               
*        SÄNDNINGS REGISTER - IDRT-TRANSIT                                      
         PCB   TYPE=DB,DBDNAME=WDA3I,PROCOPT=GOT,KEYLEN=24,POS=S                
         SENSEG NAME=WDA3I1,PARENT=0                                            
*                                                                               
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=02,POS=S                 
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=06,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDD3,PROCOPT=GOT,KEYLEN=08,POS=S,       *        
               PROCSEQ=WDD3B                                                    
         SENSEG  NAME=WDD301,PARENT=0                                           
         SENSEG  NAME=WDD311,PARENT=WDD301                                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDR4,PROCOPT=G,KEYLEN=30,POS=S                   
         SENSEG NAME=WDR401,PARENT=0                                            
         SENSEG NAME=WDGX3102,PARENT=WDR401                                     
*                                                                               
* WDG2-PCB/9305-PCB                                                             
         PCB   TYPE=DB,DBDNAME=WDG2,PROCOPT=GOT,KEYLEN=37,POS=S                 
         SENSEG NAME=WDG201,PARENT=0                                            
         SENSEG NAME=WDGX9306,PARENT=WDG201                                     
         SENSEG NAME=WDGX9308,PARENT=WDGX9306                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WL0159                                       
         END                                                                    
