*                                                                               
        PCB    TYPE=DB,DBDNAME=WLORQI,PROCOPT=GOT,KEYLEN=24,POS=S,     *        
               PROCSEQ=WDQ2C                                                    
        SENSEG NAME=WLORQI01,PARENT=0                                           
        SENSEG NAME=WLORQI11,PARENT=WLORQI01                                    
        SENSEG NAME=WLORQI12,PARENT=WLORQI01                                    
        SENSEG NAME=WLORQI21,PARENT=WLORQI12                                    
*                                                                               
        PCB    TYPE=DB,DBDNAME=WLORQA,PROCOPT=GOT,KEYLEN=12,POS=S               
        SENSEG NAME=WLORQA01,PARENT=0                                           
*                                                                               
        PCB    TYPE=DB,DBDNAME=WLORQA,PROCOPT=GOT,KEYLEN=6,POS=S,      *        
               PROCSEQ=WDQ3D                                                    
        SENSEG NAME=WLORQA01,PARENT=0                                           
*                                                                               
        PCB    TYPE=DB,DBDNAME=WDE6,PROCOPT=GOT,KEYLEN=4,POS=S                  
        SENSEG NAME=WDE601,PARENT=0                                             
*                                                                               
        PCB    TYPE=DB,DBDNAME=WLGMTA,PROCOPT=GOT,KEYLEN=7,POS=S                
        SENSEG NAME=WLGMTA01,PARENT=0                                           
*                                                                               
        PCB    TYPE=DB,DBDNAME=WLBETC,PROCOPT=GOT,KEYLEN=11,POS=S               
        SENSEG NAME=WLBETC01,PARENT=0                                           
*                                                                               
        PSBGEN LANG=COBOL,PSBNAME=WL0140                                        
        END                                                                     
