*                                                                               
         PCB   TYPE=DB,DBDNAME=WDL6,PROCOPT=GOT,KEYLEN=21,POS=S                 
         SENSEG NAME=WDL601,PARENT=0                                            
         SENSEG NAME=WDL611,PARENT=WDL601                                       
         SENSEG NAME=WDL621,PARENT=WDL611                                       
         SENSEG NAME=WDL623,PARENT=WDL611                                       
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=3,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=8,POS=S,      *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WL0107                                       
         END                                                                    
