*          DATA SET WL0134PII0 AT LEVEL 001 AS OF 04/06/03                      
*                                                                               
* DISP MPP                                                                      
         PCB   TYPE=TP,NAME=W0T693X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*  3410-ALT-PCB TRANS TILL PGM W2019100 K6                                      
         PCB   TYPE=TP,NAME=W2T191X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
                                                                                
*  3410-4397-PCB TRANS TILL PGM W4039700                                        
         PCB   TYPE=TP,NAME=W4T397X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
                                                                                
*  3420-PRNT-PCB DISTRIBUTION & PRINT                                           
DISTRDOC PCB   TYPE=TP,NAME=WZ0420U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
* SYNQ                                                                          
*        TRANSACTION TO DISTRIBUTION & PRINT                                    
ORDERCRE PCB   TYPE=TP,NAME=WZ0440X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*  DISTRIBUTION & PRINT PCB # 2                                                 
DISTRDO2 PCB   TYPE=TP,NAME=WZ0420U,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
*  WL013400                                                                     
                                                                                
*  ORQD  ORDERDELSKÖN SEKUNDÄRINDEX PRODNR-PLOCKLISTNR                          
         PCB   TYPE=DB,DBDNAME=WLORQA,PROCOPT=GOT,KEYLEN=6,POS=S,      *        
               PROCSEQ=WDQ3D                                                    
         SENSEG NAME=WLORQA01,PARENT=0                                          
                                                                                
*  XXKH  WDR1 PRODUKTIONSKANALSTABELL WDGX HTYP=4447,4448                       
         PCB    TYPE=DB,DBDNAME=WLXXKH,PROCOPT=GOT,KEYLEN=35,POS=S              
         SENSEG NAME=WLXXKH01,PARENT=0                                          
         SENSEG NAME=WLXXKH11,PARENT=WLXXKH01                                   
                                                                                
*  4403  WDR4 LÖPNR PLOCKSATS         WDGX HTYP=4403                            
         PCB    TYPE=DB,DBDNAME=WDR4,PROCOPT=G,KEYLEN=34,POS=S                  
         SENSEG NAME=WDR401,PARENT=0                                            
         SENSEG NAME=WDGX4404,PARENT=WDR401,PROCOPT=GRI                         
                                                                                
*  WDB2  KUNDREGISTER GODSMOTTAGARE WDB2                                        
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDB201,PARENT=0                                            
                                                                                
*  WDB6  DC-REGISTER                                                            
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
                                                                                
*  WDQ2  ORDERHUVUD DIREKTNYCKEL                                                
         PCB    TYPE=DB,DBDNAME=WDQ2,PROCOPT=GOT,KEYLEN=6,POS=S                 
         SENSEG NAME=WDQ201,PARENT=0                                            
                                                                                
*  WDQ3  ORDERDELSKÖN DIREKTNYCKEL                                              
         PCB   TYPE=DB,DBDNAME=WDQ3,PROCOPT=GOT,KEYLEN=12,POS=S                 
         SENSEG NAME=WDQ301,PARENT=0                                            
                                                                                
*  WDQ3  ORDERDELSKÖN DIREKTNYCKEL                                              
         PCB   TYPE=DB,DBDNAME=WDQ3,PROCOPT=G,KEYLEN=12,POS=S                   
         SENSEG NAME=WDQ301,PARENT=0,PROCOPT=GR                                 
                                                                                
*  WDQ3K ORDERDELSKÖN                                                           
         PCB   TYPE=DB,DBDNAME=WDQ3K,PROCOPT=GOT,KEYLEN=28,POS=S                
         SENSEG NAME=WDQ3K1,PARENT=0                                            
                                                                                
*  WDQ3H                                                                        
         PCB   TYPE=DB,DBDNAME=WDQ3H,PROCOPT=GOT,KEYLEN=14,POS=S                
         SENSEG NAME=WDQ3H1,PARENT=0                                            
                                                                                
*  4003-PCB PLOCKSATS ETIKETT       WDGX HTYP=4003                              
         PCB   TYPE=DB,DBDNAME=WL4003,PROCOPT=G,KEYLEN=49,POS=S                 
         SENSEG NAME=WL400301,PARENT=0,PROCOPT=GD                               
         SENSEG NAME=WL400311,PARENT=WL400301,PROCOPT=GR                        
         SENSEG NAME=WL400321,PARENT=WL400311                                   
                                                                                
*  4007-PCB PLOCKSATS PU            WDGX HTYP=4007                              
         PCB    TYPE=DB,DBDNAME=WL4007,PROCOPT=G,KEYLEN=53,POS=S                
         SENSEG NAME=WL400701,PARENT=0,PROCOPT=GD                               
         SENSEG NAME=WL400711,PARENT=WL400701,PROCOPT=GRD                       
         SENSEG NAME=WL400721,PARENT=WL400711,PROCOPT=GD                        
                                                                                
*  WDE6-PCB KOLLIREGISTER WDE6                                                  
         PCB   TYPE=DB,DBDNAME=WDE6,PROCOPT=G,KEYLEN=7,POS=S                    
         SENSEG NAME=WDE601,PARENT=0                                            
                                                                                
*  WL013410 PCB                                                                 
*                                                                               
*  3410-4003-PCB PLOCKSATS ETIKETT       WDGX HTYP=4003                         
         PCB   TYPE=DB,DBDNAME=WL4003,PROCOPT=G,KEYLEN=49,POS=S                 
         SENSEG NAME=WL400301,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WL400311,PARENT=WL400301,PROCOPT=GIR                       
         SENSEG NAME=WL400321,PARENT=WL400311,PROCOPT=I                         
                                                                                
*  3410-4007-PCB PLOCKSATS PU            WDGX HTYP=4007                         
         PCB   TYPE=DB,DBDNAME=WL4007,PROCOPT=G,KEYLEN=53,POS=S                 
         SENSEG NAME=WL400701,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WL400711,PARENT=WL400701,PROCOPT=GI                        
         SENSEG NAME=WL400721,PARENT=WL400711,PROCOPT=I                         
                                                                                
*  3410-4017-PCB WDR401 WDGX=4017, 4018                                         
         PCB    TYPE=DB,DBDNAME=WDR4,PROCOPT=G,KEYLEN=31,POS=S                  
         SENSEG NAME=WDR401,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDGX4018,PARENT=WDR401,PROCOPT=GIR                         
                                                                                
*  3410-4448-PCB WDR1 PRODUKTIONSKANALSTABELL WDGX HTYP=4447,4448               
         PCB    TYPE=DB,DBDNAME=WLXXKH,PROCOPT=GOT,KEYLEN=35,POS=S              
         SENSEG NAME=WLXXKH01,PARENT=0                                          
         SENSEG NAME=WLXXKH11,PARENT=WLXXKH01                                   
                                                                                
*  3410-4454  PRINTERTABELL PRC       WDGX HTYP=4453                            
         PCB   TYPE=DB,DBDNAME=WLXXKL,PROCOPT=GOT,KEYLEN=30,POS=S               
         SENSEG NAME=WLXXKL01,PARENT=0                                          
         SENSEG NAME=WLXXKL11,PARENT=WLXXKL01                                   
                                                                                
*  3410-4512-PCB STYRREG RADPRIORITET    WDGX HTYP=4511                         
         PCB   TYPE=DB,DBDNAME=WLXXJN,PROCOPT=GOT,KEYLEN=40,POS=S               
         SENSEG NAME=WLXXJN01,PARENT=0                                          
         SENSEG NAME=WLXXJN11,PARENT=WLXXJN01                                   
                                                                                
*  KAMPANJREGISTER                                                              
         PCB    TYPE=DB,DBDNAME=WDM2,PROCOPT=G,KEYLEN=25,POS=S                  
         SENSEG NAME=WDM201,PARENT=0                                            
         SENSEG NAME=WDM211,PARENT=WDM201,PROCOPT=GR                            
         SENSEG NAME=WDM221,PARENT=WDM211,PROCOPT=GR                            
                                                                                
*  3410-4536-PCB FÖRRÅDSDATATEXT/EMBALLAGEKOD WDGX HTYP=4535                    
         PCB   TYPE=DB,DBDNAME=WLXXKU,PROCOPT=GOT,KEYLEN=35,POS=S               
         SENSEG NAME=WLXXKU01,PARENT=0                                          
         SENSEG NAME=WLXXKU11,PARENT=WLXXKU01                                   
                                                                                
*  3410-WDA5-PCB RESTORDER                                                      
         PCB   TYPE=DB,DBDNAME=WDA5,PROCOPT=G,KEYLEN=24,POS=S                   
         SENSEG NAME=WDA501,PARENT=0,PROCOPT=GRI                                
                                                                                
*  3410-WDA6-PCB VOR REGISTER NYTT                                              
         PCB   TYPE=DB,DBDNAME=WDA6,PROCOPT=G,KEYLEN=40,POS=S                   
         SENSEG NAME=WDA601,PARENT=0,PROCOPT=GI                                 
                                                                                
*  3410-WDA6B-PCB VOR REGISTER NYTT                                             
         PCB   TYPE=DB,DBDNAME=WDA6,PROCOPT=G,KEYLEN=40,POS=S,         *        
               PROCSEQ=WDA6B                                                    
         SENSEG NAME=WDA601,PARENT=0,PROCOPT=GR                                 
                                                                                
*  3410-WDB2-PCB KUNDREGISTER GODSMOTTAGARE WDB2                                
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDB201,PARENT=0                                            
                                                                                
*  3410-WDB6-PCB DC-REGISTER BETAL WDB6                                         
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
                                                                                
*  3410-WDD3-PCB ARTIKELREGISTER SEKUNDÄRINDEX ARTIKELNR                        
         PCB   TYPE=DB,DBDNAME=WDD3,PROCOPT=GOT,KEYLEN=8,POS=S,        *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WDD301,PARENT=0                                            
         SENSEG NAME=WDD311,PARENT=WDD301                                       
                                                                                
*  3410-WDD5-PCB ARTIKELREGISTER WDD5                                           
         PCB   TYPE=DB,DBDNAME=WDD5,PROCOPT=GOT,KEYLEN=5,POS=S                  
         SENSEG NAME=WDD501,PARENT=0                                            
                                                                                
*  3410-WDG6-PCB RYE-TRANS PÅ WDG6                                              
         PCB   TYPE=DB,DBDNAME=WDG6,PROCOPT=G,KEYLEN=18,POS=S                   
         SENSEG NAME=WDG601,PARENT=0,PROCOPT=I                                  
                                                                                
*  3410-WDK6-PCB ARTIKELREGISTER WDK6                                           
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=G,KEYLEN=6,POS=S                    
         SENSEG NAME=WDK601,PARENT=0,PROCOPT=G                                  
         SENSEG NAME=WDK611,PARENT=WDK601,PROCOPT=GR                            
         SENSEG NAME=WDK627,PARENT=WDK611,PROCOPT=GRI                           
                                                                                
*  3410-WDK7-PCB ARTIKELREGISTER WDK7                                           
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=8,POS=S                    
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701,PROCOPT=GR                            
         SENSEG NAME=WDK722,PARENT=WDK711                                       
         SENSEG NAME=WDK712,PARENT=WDK701                                       
*                                                                               
*  3410-WDK9-PCB ARTIKELREGISTER WDK9                                           
         PCB   TYPE=DB,DBDNAME=WDK9,PROCOPT=G,KEYLEN=5,POS=S                    
         SENSEG NAME=WDK901,PARENT=0,PROCOPT=GR                                 
*                                                                               
*  3410-WDQ1-PCB ORDERBEKRÄFTELSE                                               
         PCB   TYPE=DB,DBDNAME=WDQ1,PROCOPT=G,KEYLEN=17,POS=S                   
         SENSEG NAME=WDQ101,PARENT=0,PROCOPT=GI                                 
                                                                                
*  3410-WDQ2-PCB ORDERHUVUD                                                     
         PCB   TYPE=DB,DBDNAME=WDQ2,PROCOPT=GP,KEYLEN=8,POS=S                   
         SENSEG NAME=WDQ201,PARENT=0,PROCOPT=GPR                                
         SENSEG NAME=WDQ212,PARENT=WDQ201,PROCOPT=GPR                           
         SENSEG NAME=WDQ221,PARENT=WDQ212,PROCOPT=GRD                           
                                                                                
*  3410-WDQ2C-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDQ2,PROCOPT=GOT,KEYLEN=21,POS=S,       *        
               PROCSEQ=WDQ2C                                                    
         SENSEG NAME=WDQ201,PARENT=0                                            
                                                                                
*  3410-WDQ3-PCB ORDERDELSKÖN DIREKTNYCKEL                                      
         PCB   TYPE=DB,DBDNAME=WDQ3,PROCOPT=G,KEYLEN=12,POS=S                   
         SENSEG NAME=WDQ301,PARENT=0,PROCOPT=GR                                 
                                                                                
*  3410-WDQ4-PCB ORDERRAD                                                       
         PCB   TYPE=DB,DBDNAME=WDQ4,PROCOPT=G,KEYLEN=20,POS=S                   
         SENSEG NAME=WDQ401,PARENT=0,PROCOPT=GD                                 
*                                                                               
*        VOR-KÖN                 WDGX HTYP=4541                                 
         PCB   TYPE=DB,DBDNAME=WDR4,PROCOPT=G,KEYLEN=46,POS=S                   
         SENSEG NAME=WDR401,PARENT=0                                            
         SENSEG NAME=WDGX4542,PARENT=WDR401,PROCOPT=GI                          
*                                                                               
*  3410-WDG3 ANSK. LEV.PLAN      WDGX HTYP=2203                                 
         PCB   TYPE=DB,DBDNAME=WDG3,PROCOPT=G,KEYLEN=30,POS=S                   
         SENSEG NAME=WDG301,PARENT=0                                            
         SENSEG NAME=WDG302,PARENT=WDG301,PROCOPT=GI                            
                                                                                
*  3410-WDP4A-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WDP4A,PROCOPT=GOT,KEYLEN=11,POS=S                
         SENSEG NAME=WDP4A1,PARENT=0                                            
                                                                                
*3410-ORQICSQ-PCB                                                               
         PCB   TYPE=DB,DBDNAME=WLORQI,PROCOPT=GOT,KEYLEN=21,POS=S,     *        
               PROCSEQ=WDQ2C                                                    
         SENSEG NAME=WLORQI01,PARENT=0                                          
*                                                                               
*  3410-LOGA-PCB WDL9  SALDOFÖRÄNDRINGAR                                        
*                                                                               
         PCB    TYPE=DB,DBDNAME=WLLOGA,PROCOPT=GI,KEYLEN=20,POS=S               
         SENSEG NAME=WLLOGA01,PARENT=0                                          
                                                                                
                                                                                
*  WL013410 SUBMODULER PCB                                                      
                                                                                
*  SUBPROGRAM W411DEAV                                                          
*  3410-DEAV-ARTM-PCB ARTIKELREGISTER - WDK9                                    
         PCB   TYPE=DB,DBDNAME=WLARTM,PROCOPT=G,KEYLEN=5,POS=S                  
         SENSEG NAME=WLARTM01,PARENT=0,PROCOPT=GR                               
                                                                                
*  3410-DEAV-WDK7-PCB ARTIKELREGISTER - WDK7                                    
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=G,KEYLEN=08,POS=S                   
         SENSEG NAME=WDK701,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDK711,PARENT=WDK701,PROCOPT=GIR                           
         SENSEG NAME=WDK722,PARENT=WDK711                                       
         SENSEG NAME=WDK712,PARENT=WDK701,PROCOPT=GI                            
                                                                                
*  3410-DEAV-WDB6-PCB DC-REGISTER  WDB6                                         
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
                                                                                
*  3410-DEAV-WDB2-PCB KUNDREGISTER GODSMOTTAGARE WDB2                           
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDB201,PARENT=0                                            
                                                                                
*  3410-DEAV-WDL7-PCB                                                           
         PCB   TYPE=DB,DBDNAME=WLOIGA,PROCOPT=G,KEYLEN=25,POS=S                 
         SENSEG NAME=WLOIGA01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLOIGA11,PARENT=WLOIGA01,PROCOPT=GI                        
*                                                                               
*  3410-DEAV-WDK7-PCB                                                           
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
*                                                                               
*  3410-DEAV-WDR2-PCB                                                           
         PCB   TYPE=DB,DBDNAME=WDR2,PROCOPT=GOT,KEYLEN=50,POS=S                 
         SENSEG NAME=WDR201,PARENT=0                                            
         SENSEG NAME=WDR220,PARENT=WDR201                                       
*                                                                               
*  3410-DEAV-WDR5-PCB                                                           
         PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=G,KEYLEN=40,POS=S                   
         SENSEG NAME=WDR501,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDR550,PARENT=WDR501,PROCOPT=GID                           
*                                                                               
*  3410-DEAV-WDC1-PCB - RETAILREGISTRET WDC1                                    
         PCB     TYPE=DB,DBDNAME=WDC1,PROCOPT=GOT,KEYLEN=6,POS=S                
         SENSEG  NAME=WDC101,PARENT=0                                           
*                                                                               
*---->   PCB TILL SUBPROGRAM W411RANS                                           
*  3410-RANS-                                                                   
*        RANSONERINGSTABELL      WDGX HTYP=4455                                 
         PCB   TYPE=DB,DBDNAME=WLXXKM,PROCOPT=GOT,KEYLEN=40,POS=S               
         SENSEG NAME=WLXXKM01,PARENT=0                                          
         SENSEG NAME=WLXXKM11,PARENT=WLXXKM01                                   
*  3410-RANS-                                                                   
*        ARTIKELREGISTER                                                        
         PCB   TYPE=DB,DBDNAME=WLARTM,PROCOPT=GOT,KEYLEN=11,POS=S               
         SENSEG NAME=WLARTM01,PARENT=0                                          
         SENSEG NAME=WLARTM11,PARENT=WLARTM01                                   
*  3410-RANS-                                                                   
*        ARTIKELINFORMATION  WDK7                                               
         PCB   TYPE=DB,DBDNAME=WLARTS,PROCOPT=GOT,KEYLEN=07,POS=S               
         SENSEG NAME=WLARTS01,PARENT=0                                          
         SENSEG NAME=WLARTS11,PARENT=WLARTS01                                   
*                                                                               
*  SUBPROGRAM W411AREG                                                          
*  3410-AREG-WDK6-PCB ARTIKELINFORMATION  WDK6                                  
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=06,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
                                                                                
*  3410-AREG-WDK7-PCB ARTIKELINFORMATION  WDK7                                  
         PCB   TYPE=DB,DBDNAME=WDK7,PROCOPT=GOT,KEYLEN=08,POS=S                 
         SENSEG NAME=WDK701,PARENT=0                                            
         SENSEG NAME=WDK711,PARENT=WDK701                                       
         SENSEG NAME=WDK722,PARENT=WDK711                                       
         SENSEG NAME=WDK712,PARENT=WDK701                                       
                                                                                
*  SUBPROGRAM W411SPAR  KONTROLL DIV SPÄRRAR                                    
* SPAR-WDF8-PCB SPÄRREGLER                                                      
         PCB   TYPE=DB,DBDNAME=WDF8,PROCOPT=GOT,KEYLEN=24,POS=S                 
         SENSEG NAME=WDF801,PARENT=0                                            
         SENSEG NAME=WDF811,PARENT=WDF801                                       
         SENSEG NAME=WDF812,PARENT=WDF801                                       
         SENSEG NAME=WDF813,PARENT=WDF801                                       
         SENSEG NAME=WDF814,PARENT=WDF801                                       
         SENSEG NAME=WDF815,PARENT=WDF801                                       
*                                                                               
* SPAR-WDF8A-PCB SPÄRREGLER (SEKUNDÄRINDEX DISTR/KUND INGÅNG)                   
         PCB   TYPE=DB,DBDNAME=WDF8A,PROCOPT=GOT,KEYLEN=24,POS=S                
         SENSEG NAME=WDF8A1,PARENT=0                                            
*                                                                               
* SPAR-WDK6-PCB - ARTIKELREGISTER                                               
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=11,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
                                                                                
*  SUBPROGRAM W335PRQU  UPPDATERA PRISFRÅGA ********                            
*  3410-PRQU-WDG2-PCB VALUTAREGISTER  WDG2                                      
         PCB   TYPE=DB,DBDNAME=WDG2,PROCOPT=GOT,KEYLEN=37,POS=S                 
         SENSEG NAME=WDG201,PARENT=0                                            
         SENSEG NAME=WDGX9306,PARENT=WDG201                                     
         SENSEG NAME=WDGX9308,PARENT=WDGX9306                                   
                                                                                
*  3410-PRQU-WDC7-PCB UPPDATERA PRISFRÅGA WDC7                                  
         PCB   TYPE=DB,DBDNAME=WDC7,PROCOPT=G,KEYLEN=33,POS=S                   
         SENSEG NAME=WDC701,PARENT=0,PROCOPT=GIRD                               
         SENSEG NAME=WDC711,PARENT=WDC701,PROCOPT=GIRD                          
                                                                                
*  3410-PRQU-WDK6-PCB  ARTIKELINFORMATION  WDK6                                 
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=06,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
                                                                                
*  SUBPROGRAM W335PRNO  PRISFRÅGENUMMER                                         
*  3410-PRNO-3107-PCB PRISFRÅGENUMMER       WDR1  IDHTYP=3107                   
         PCB   TYPE=DB,DBDNAME=WDR1,PROCOPT=G,KEYLEN=31,POS=S                   
         SENSEG NAME=WDR101,PARENT=0                                            
         SENSEG NAME=WDGX3108,PARENT=WDR101,PROCOPT=GR                          
*                                                                               
*- - - START PLATSMODULENS BASER PLATSMODULENS BASER                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXDM,PROCOPT=GOT,KEYLEN=50,POS=S               
         SENSEG NAME=WLXXDM01,PARENT=0                                          
         SENSEG NAME=WLXXDM11,PARENT=WLXXDM01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXDN,PROCOPT=GOT,KEYLEN=50,POS=S               
         SENSEG NAME=WLXXDN01,PARENT=0                                          
         SENSEG NAME=WLXXDN11,PARENT=WLXXDN01                                   
         SENSEG NAME=WLXXDN21,PARENT=WLXXDN11                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXDP,PROCOPT=G,KEYLEN=50,POS=S                 
         SENSEG NAME=WLXXDP01,PARENT=0,PROCOPT=GIRD                             
         SENSEG NAME=WLXXDP11,PARENT=WLXXDP01,PROCOPT=GIRD                      
         SENSEG NAME=WLXXDP21,PARENT=WLXXDP11,PROCOPT=GIRD                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLXXDO,PROCOPT=G,KEYLEN=50,POS=S                 
         SENSEG NAME=WLXXDO01,PARENT=0,PROCOPT=GIRD                             
         SENSEG NAME=WLXXDO11,PARENT=WLXXDO01,PROCOPT=GIRD                      
         SENSEG NAME=WLXXDO21,PARENT=WLXXDO11,PROCOPT=GIRD                      
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE6C,PROCOPT=GOT,KEYLEN=42,POS=S                
         SENSEG NAME=WDE6C1,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLGMTC,PROCOPT=GOT,KEYLEN=11,POS=S               
         SENSEG NAME=WLGMTC01,PARENT=0                                          
*                                                                               
* WDB6-PCB - DC-REGISTER  WDB6                                                  
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
*KOMA-PCB - KOMMUNIKATIONS DB  WDP8 ******************                          
         PCB   TYPE=DB,DBDNAME=WLKOMA,PROCOPT=G,KEYLEN=28,POS=S                 
         SENSEG NAME=WLKOMA01,PARENT=0,PROCOPT=GI                               
         SENSEG NAME=WLKOMA11,PARENT=WLKOMA01,PROCOPT=GI                        
*                                                                               
*- - - SLUT PLATSMODULENS BASER                                                 
                                                                                
*  WL013420 PCB                                                                 
*  3420-4003-PCB PLOCKSATS ETIKETT       WDGX HTYP=4003                         
WL4003   PCB   TYPE=DB,DBDNAME=WL4003,PROCOPT=G,KEYLEN=49,POS=S                 
         SENSEG NAME=WL400301,PARENT=0,PROCOPT=GD                               
         SENSEG NAME=WL400311,PARENT=WL400301,PROCOPT=GR                        
         SENSEG NAME=WL400321,PARENT=WL400311                                   
                                                                                
*  3420-WDQ3D ORDERDELSKÖN SEKUNDÄRINDEX PRODNR-PLOCKLISTNR                     
         PCB   TYPE=DB,DBDNAME=WLORQA,PROCOPT=GOT,KEYLEN=6,POS=S,      *        
               PROCSEQ=WDQ3D                                                    
         SENSEG NAME=WLORQA01,PARENT=0                                          
*                                                                               
*  3420-WDF5-PCB                                                                
         PCB   TYPE=DB,DBDNAME=WDF5,PROCOPT=GOT,KEYLEN=11,POS=S                 
         SENSEG NAME=WDF501,PARENT=0                                            
         SENSEG NAME=WDF502,PARENT=WDF501                                       
*                                                                               
*  3420-WDB6  DC-REGISTER                                                       
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=G,KEYLEN=6,POS=S                    
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB612,PARENT=WDB601                                       
                                                                                
*  3420-WDE6-PCB KOLLIREGISTER WDE6                                             
         PCB   TYPE=DB,DBDNAME=WDE6,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDE601,PARENT=0                                            
         SENSEG NAME=WDE611,PARENT=WDE601                                       
*                                                                               
*  3420-WDQ2-PCB ORDERHUVUD DIREKTNYCKEL                                        
         PCB    TYPE=DB,DBDNAME=WDQ2,PROCOPT=G,KEYLEN=6,POS=S                   
         SENSEG NAME=WDQ201,PARENT=0                                            
                                                                                
*  3420-4535-PCB FÖRRÅDSDATATEXT         WDGX HTYP=4535                         
         PCB    TYPE=DB,DBDNAME=WLXXKU,PROCOPT=GOT,KEYLEN=35,POS=S              
         SENSEG NAME=WLXXKU01,PARENT=0                                          
         SENSEG NAME=WLXXKU11,PARENT=WLXXKU01                                   
*                                                                               
******** SUBMODULE  W488ORCR SEND SYNQ EVENT    ************                    
*                                                                               
* SYNQ-ATAB-PCB                                                                 
* EVENT DB FOR API CALLS                                                        
         PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=GOT,KEYLEN=80,POS=S                 
         SENSEG NAME=WDR501,PARENT=0                                            
         SENSEG NAME=WDGX0104,PARENT=WDR501                                     
*                                                                               
*        ORDERDELSKÖN SEKUNDÄWINDEX PRODNR-PLOCKLISTNR                          
         PCB   TYPE=DB,DBDNAME=WDQ3,PROCOPT=GOT,KEYLEN=6,POS=S,        *        
               PROCSEQ=WDQ3D                                                    
         SENSEG NAME=WDQ301,PARENT=0                                            
*                                                                               
*  WL013430 PCB                                                                 
*  3430-4007-PCB PLOCKSATS PU            WDGX HTYP=4007                         
         PCB    TYPE=DB,DBDNAME=WL4007,PROCOPT=G,KEYLEN=53,POS=S                
         SENSEG NAME=WL400701,PARENT=0,PROCOPT=GRD                              
         SENSEG NAME=WL400711,PARENT=WL400701,PROCOPT=GR                        
         SENSEG NAME=WL400721,PARENT=WL400711                                   
                                                                                
*  3430-4447-PCB PRODUKTIONSKANALSTABELL WDGX HTYP=4447                         
         PCB    TYPE=DB,DBDNAME=WLXXKH,PROCOPT=GOT,KEYLEN=35,POS=S              
         SENSEG NAME=WLXXKH01,PARENT=0                                          
         SENSEG NAME=WLXXKH11,PARENT=WLXXKH01                                   
                                                                                
*  3430-4535-PCB FÖRRÅDSDATATEXT         WDGX HTYP=4535                         
         PCB    TYPE=DB,DBDNAME=WLXXKU,PROCOPT=GOT,KEYLEN=35,POS=S              
         SENSEG NAME=WLXXKU01,PARENT=0                                          
         SENSEG NAME=WLXXKU11,PARENT=WLXXKU01                                   
                                                                                
*  3430-4732-PCB FRAKTTEXT               WDGX HTYP=4732                         
         PCB    TYPE=DB,DBDNAME=WL4732,PROCOPT=GOT,KEYLEN=31,POS=S              
         SENSEG NAME=WL473201,PARENT=0                                          
         SENSEG NAME=WL473211,PARENT=WL473201                                   
                                                                                
*  3430-WDB2-PCB KUNDREGISTER                                                   
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDB201,PARENT=0                                            
                                                                                
*  3430-WDQ2-PCB ORDERHUVUD                                                     
         PCB   TYPE=DB,DBDNAME=WDQ2,PROCOPT=GP,KEYLEN=6,POS=S                   
         SENSEG NAME=WDQ201,PARENT=0,PROCOPT=GPR                                
         SENSEG NAME=WDQ212,PARENT=WDQ201,PROCOPT=GPR                           
                                                                                
*  3430-WDQ3-PCB ORDERDELSKÖN DIREKTNYCKEL                                      
         PCB   TYPE=DB,DBDNAME=WDQ3,PROCOPT=GOT,KEYLEN=12,POS=S                 
         SENSEG NAME=WDQ301,PARENT=0                                            
*                                                                               
*  3430-WDB6  DC-REGISTER                                                       
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=G,KEYLEN=6,POS=S                    
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB612,PARENT=WDB601                                       
                                                                                
*  3430-WDE6-PCB KOLLIREGISTER WDE6                                             
         PCB   TYPE=DB,DBDNAME=WDE6,PROCOPT=GOT,KEYLEN=7,POS=S                  
         SENSEG NAME=WDE601,PARENT=0                                            
         SENSEG NAME=WDE611,PARENT=WDE601                                       
*                                                                               
*  3430-WDI2-PCB TACDISREGISTER WDI201                                          
         PCB   TYPE=DB,DBDNAME=WDI2,PROCOPT=GOT,KEYLEN=17,POS=S                 
         SENSEG NAME=WDI201,PARENT=0                                            
*                                                                               
*  3430-WDF5-PCB                                                                
         PCB   TYPE=DB,DBDNAME=WDF5,PROCOPT=GOT,KEYLEN=11,POS=S                 
         SENSEG NAME=WDF501,PARENT=0                                            
         SENSEG NAME=WDF502,PARENT=WDF501                                       
*                                                                               
*  3430-WDK5  EMBALLAGE-REGISTER                                                
         PCB TYPE=DB,DBDNAME=WDK5,PROCOPT=GOT,KEYLEN=8,POS=S                    
         SENSEG NAME=WDK501,PARENT=0                                            
*                                                                               
                                                                                
*                                                                               
*  WL013440 PCB                                                                 
                                                                                
*  3440-4007-PCB PLOCKSATS PU            WDGX HTYP=4007                         
         PCB    TYPE=DB,DBDNAME=WL4007,PROCOPT=G,KEYLEN=53,POS=S                
         SENSEG NAME=WL400701,PARENT=0,PROCOPT=GD                               
         SENSEG NAME=WL400711,PARENT=WL400701,PROCOPT=GRD                       
         SENSEG NAME=WL400721,PARENT=WL400711,PROCOPT=GD                        
                                                                                
*  3440-4017-PCB WDR401,    WDGX=4017, 4018                                     
         PCB    TYPE=DB,DBDNAME=WDR4,PROCOPT=G,KEYLEN=31,POS=S                  
         SENSEG NAME=WDR401,PARENT=0,PROCOPT=GD                                 
         SENSEG NAME=WDGX4018,PARENT=WDR401,PROCOPT=GD                          
                                                                                
*  3440-4447-PCB PRODUKTIONSKANALSTABELL WDGX HTYP=4447                         
         PCB    TYPE=DB,DBDNAME=WLXXKH,PROCOPT=GOT,KEYLEN=35,POS=S              
         SENSEG NAME=WLXXKH01,PARENT=0                                          
         SENSEG NAME=WLXXKH11,PARENT=WLXXKH01                                   
                                                                                
*  3440-4487-PCB ORDERPLANERING/LAGRET WDR4 - HTYP 4487                         
         PCB   TYPE=DB,DBDNAME=WDR4,PROCOPT=G,KEYLEN=53,POS=S                   
         SENSEG NAME=WDR401,PARENT=0,PROCOPT=GI                                 
         SENSEG NAME=WDGX4488,PARENT=WDR401,PROCOPT=GI                          
         SENSEG NAME=WDGX4490,PARENT=WDGX4488,PROCOPT=GI                        
                                                                                
*  3440-4726-PCB AUTOMATFAKTURERING WDG7 - HTYP 4726                            
         PCB   TYPE=DB,DBDNAME=WLXXDV,PROCOPT=G,KEYLEN=44,POS=S                 
         SENSEG NAME=WLXXDV01,PARENT=0                                          
         SENSEG NAME=WLXXDV11,PARENT=WLXXDV01,PROCOPT=GI                        
         SENSEG NAME=WLXXDV21,PARENT=WLXXDV11,PROCOPT=GI                        
                                                                                
*  3440-WDE4-PCB KUNDORDERREGISTER WDE4                                         
         PCB   TYPE=DB,DBDNAME=WDE4,PROCOPT=G,KEYLEN=33,POS=S                   
         SENSEG NAME=WDE401,PARENT=0,PROCOPT=GIR                                
         SENSEG NAME=WDE411,PARENT=WDE401,PROCOPT=GI                            
         SENSEG NAME=WDE421,PARENT=WDE411,PROCOPT=GI                            
                                                                                
*  3440-WDE6-PCB KOLLIREGISTER WDE6                                             
         PCB   TYPE=DB,DBDNAME=WDE6,PROCOPT=G,KEYLEN=8,POS=S                    
         SENSEG NAME=WDE601,PARENT=0,PROCOPT=GIR                                
         SENSEG NAME=WDE611,PARENT=WDE601,PROCOPT=GIR                           
         SENSEG NAME=WDE621,PARENT=WDE611,PROCOPT=GI                            
                                                                                
*  3440-WDG6-PCB RECORD TILL KONTROLLLISTAN OCH ANDRA SEKV.FILER WDG6           
         PCB   TYPE=DB,DBDNAME=WDG6,PROCOPT=G,KEYLEN=18,POS=S                   
         SENSEG NAME=WDG601,PARENT=0,PROCOPT=GI                                 
                                                                                
*  3440-WDQ2-PCB ORDERHUVUDSREGISTER                                            
         PCB   TYPE=DB,DBDNAME=WDQ2,PROCOPT=G,KEYLEN=6,POS=S                    
         SENSEG NAME=WDQ201,PARENT=0                                            
         SENSEG NAME=WDQ212,PARENT=WDQ201,PROCOPT=GR                            
                                                                                
*  3440-WDQ2C-PCB ORDERHUVUD                                                    
         PCB   TYPE=DB,DBDNAME=WDQ2,PROCOPT=GOT,KEYLEN=17,POS=S,       *        
               PROCSEQ=WDQ2C                                                    
         SENSEG NAME=WDQ201,PARENT=0                                            
                                                                                
*  3440-WDQ3-PCB ORDERDELSKÖN DIREKTNYCKEL                                      
         PCB   TYPE=DB,DBDNAME=WDQ3,PROCOPT=G,KEYLEN=12,POS=S                   
         SENSEG NAME=WDQ301,PARENT=0,PROCOPT=GR                                 
*                                                                               
*  3440-WDB6  DC-REGISTER                                                       
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=G,KEYLEN=6,POS=S                    
         SENSEG NAME=WDB601,PARENT=0                                            
         SENSEG NAME=WDB612,PARENT=WDB601                                       
*                                                                               
*  3440-WDK5  EMBALLAGE-REGISTER                                                
         PCB   TYPE=DB,DBDNAME=WDK5,PROCOPT=GOT,KEYLEN=8,POS=S                  
         SENSEG NAME=WDK501,PARENT=0                                            
*                                                                               
******** SUBMODUL   W411DNOT  DATA TILL DELIVERY NOTE ********                  
* DNOT-ORQP-PCB - DELIVERY NOTEREGISTER    WDQ5                                 
         PCB   TYPE=DB,DBDNAME=WLORQP,PROCOPT=G,KEYLEN=17,POS=S                 
         SENSEG NAME=WLORQP01,PARENT=0,PROCOPT=GIRD                             
                                                                                
* DNOT-ORQP2-PCB - DELIVERY NOTEREGISTER    WDQ5                                
         PCB   TYPE=DB,DBDNAME=WLORQP,PROCOPT=G,KEYLEN=17,POS=S                 
         SENSEG NAME=WLORQP01,PARENT=0,PROCOPT=GIR                              
                                                                                
* DNOT-ORQP3-PCB - DELIVERY NOTEREGISTER    WDQ5                                
         PCB   TYPE=DB,DBDNAME=WLORQP,PROCOPT=G,KEYLEN=17,POS=S                 
         SENSEG NAME=WLORQP01,PARENT=0,PROCOPT=GIR                              
                                                                                
* DNOT-4013-PCB - WDR4  HTYP=4013 VIPSORDERBEKR                                 
         PCB   TYPE=DB,DBDNAME=WL4013,PROCOPT=G,KEYLEN=58,POS=S                 
         SENSEG NAME=WL401301,PARENT=0,PROCOPT=GID                              
         SENSEG NAME=WL401311,PARENT=WL401301,PROCOPT=GID                       
         SENSEG NAME=WL401321,PARENT=WL401311,PROCOPT=GID                       
                                                                                
* DNOT-BENA-PCB  BENÄMNINGSREGISTER                                             
         PCB   TYPE=DB,DBDNAME=WLBENA,PROCOPT=GOT,KEYLEN=13,POS=S,     *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WLBENA01,PARENT=0                                          
         SENSEG NAME=WLBENA11,PARENT=WLBENA01                                   
*                                                                               
*        PCB'ER FÖR SUBPROGRAM W612MRP                                          
*                                                                               
*BENA-PCB  ARTIKELREGISTER SEKUNDÄRINDEX ARTIKELNR                              
         PCB   TYPE=DB,DBDNAME=WDD3,PROCOPT=GOT,KEYLEN=8,POS=S,        *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WDD301,PARENT=0                                            
         SENSEG NAME=WDD311,PARENT=WDD301                                       
*                                                                               
*WDK6-PCB                                                                       
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=06,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
* WDG2-PCB/9305-PCB                                                             
         PCB   TYPE=DB,DBDNAME=WDG2,PROCOPT=GOT,KEYLEN=37,POS=S                 
         SENSEG NAME=WDG201,PARENT=0                                            
         SENSEG NAME=WDGX9306,PARENT=WDG201                                     
         SENSEG NAME=WDGX9308,PARENT=WDGX9306                                   
*                                                                               
*WDC3-PCB - SUGGESTED RETAIL PRICES                                             
         PCB   TYPE=DB,DBDNAME=WDC3,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDC301,PARENT=0                                            
         SENSEG NAME=WDC311,PARENT=WDC301                                       
*                                                                               
*WDJ1-PCB                                                                       
         PCB   TYPE=DB,DBDNAME=WDJ1,PROCOPT=GOT,KEYLEN=10,POS=S                 
         SENSEG NAME=WDJ101,PARENT=0                                            
         SENSEG NAME=WDJ111,PARENT=WDJ101                                       
         SENSEG NAME=WDJ122,PARENT=WDJ111                                       
*                                                                               
*WDJ4-PCB                                                                       
         PCB   TYPE=DB,DBDNAME=WDJ4,PROCOPT=GOT,KEYLEN=10,POS=S                 
         SENSEG NAME=WDJ401,PARENT=0                                            
         SENSEG NAME=WDJ411,PARENT=WDJ401                                       
*                                                                               
*WDD3A-PCB  ARTIKELREGISTER SEKUNDÄRINDEX ARTIKELNR                             
         PCB   TYPE=DB,DBDNAME=WDD3,PROCOPT=GOT,KEYLEN=34,POS=S,       *        
               PROCSEQ=WDD3A                                                    
         SENSEG NAME=WDD301,PARENT=0                                            
         SENSEG NAME=WDD311,PARENT=WDD301                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WL0134                                       
         END                                                                    
