*                                                                               
         PCB   TYPE=DB,DBDNAME=WLORQI,PROCOPT=GOT,KEYLEN=19,POS=S,     *        
               PROCSEQ=WDQ2C                                                    
         SENSEG NAME=WLORQI01,PARENT=0                                          
         SENSEG NAME=WLORQI12,PARENT=WLORQI01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLORQA,PROCOPT=GR,KEYLEN=12,POS=S                
         SENSEG NAME=WLORQA01,PARENT=0                                          
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLORQA,PROCOPT=GOT,KEYLEN=6,POS=S,      *        
               PROCSEQ=WDQ3D                                                    
         SENSEG NAME=WLORQA01,PARENT=0                                          
*                                                                               
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WL0124                                       
         END                                                                    
