*NOLLJAGNING                                                                    
*                                                                               
         PCB   TYPE=TP,NAME=W5T108X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE4,PROCOPT=G,KEYLEN=27,POS=S                   
         SENSEG NAME=WDE401,PARENT=0                                            
         SENSEG NAME=WDE411,PARENT=WDE401,PROCOPT=GR                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE4,PROCOPT=GOT,KEYLEN=23,POS=S,       *        
               PROCSEQ=WDE4A                                                    
         SENSEG NAME=WDE401,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE6,PROCOPT=GOT,KEYLEN=4,POS=S                  
         SENSEG NAME=WDE601,PARENT=0                                            
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTC,PROCOPT=GOT,KEYLEN=6,POS=S                
         SENSEG NAME=WLARTC01,PARENT=0                                          
         SENSEG NAME=WLARTC11,PARENT=WLARTC01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WLARTS,PROCOPT=GOT,KEYLEN=7,POS=S                
         SENSEG NAME=WLARTS01,PARENT=0                                          
         SENSEG NAME=WLARTS11,PARENT=WLARTS01                                   
*                                                                               
         PCB   TYPE=DB,DBDNAME=WDE4,PROCOPT=GOTP,KEYLEN=30,POS=S,      *        
               PROCSEQ=WDE4B                                                    
         SENSEG NAME=WDE411,PARENT=0                                            
         SENSEG NAME=WDE401,PARENT=WDE411                                       
*                                                                               
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WL0126                                       
         END                                                                    
