*                                                                               
         PCB   TYPE=TP,NAME=W4T397X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
* SYNQ                                                                          
*        TRANSACTION TO DISTRIBUTION & PRINT                                    
ORDERDEL PCB   TYPE=TP,NAME=WZ0440X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PCB TYPE=DB,DBDNAME=WDE4,PROCOPT=G,KEYLEN=26,POS=S                     
         SENSEG NAME=WDE401,PARENT=0,PROCOPT=GR                                 
         SENSEG NAME=WDE411,PARENT=WDE401                                       
*                                                                               
         PCB TYPE=DB,DBDNAME=WDE4,PROCOPT=GOT,KEYLEN=17,POS=S,         *        
               PROCSEQ=WDE4A                                                    
         SENSEG NAME=WDE401,PARENT=0                                            
*                                                                               
         PCB TYPE=DB,DBDNAME=WDE4,PROCOPT=GOTP,KEYLEN=30,POS=S,        *        
               PROCSEQ=WDE4B                                                    
         SENSEG NAME=WDE411,PARENT=0                                            
         SENSEG NAME=WDE401,PARENT=WDE411                                       
*                                                                               
         PCB TYPE=DB,DBDNAME=WDE6,PROCOPT=GOT,KEYLEN=04,POS=S                   
         SENSEG NAME=WDE601,PARENT=0                                            
*                                                                               
******** SUBMODULE  W488ORCN SEND SYNQ EVENT    ************                    
*                                                                               
* SYNQ-ATAB-PCB                                                                 
* EVENT DB FOR API CALLS                                                        
ATAB     PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=GOT,KEYLEN=80,POS=S                 
         SENSEG NAME=WDR501,PARENT=0                                            
         SENSEG NAME=WDGX0104,PARENT=WDR501                                     
*                                                                               
*        ORDERDELSKÖN SEKUNDÄRINDEX PRODNR-PLOCKLISTNR                          
         PCB   TYPE=DB,DBDNAME=WDQ3,PROCOPT=GOT,KEYLEN=6,POS=S,        *        
               PROCSEQ=WDQ3D                                                    
         SENSEG NAME=WDQ301,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WL0123                                       
         END                                                                    
