*                                                                               
*                                                                               
         PCB TYPE=DB,DBDNAME=WDE4,PROCOPT=GOT,KEYLEN=27,POS=S                   
         SENSEG NAME=WDE401,PARENT=0                                            
         SENSEG NAME=WDE411,PARENT=WDE401                                       
*                                                                               
         PCB TYPE=DB,DBDNAME=WDE4,PROCOPT=GOT,KEYLEN=23,POS=S,         *        
               PROCSEQ=WDE4A                                                    
         SENSEG NAME=WDE401,PARENT=0                                            
*                                                                               
         PCB TYPE=DB,DBDNAME=WDE4,PROCOPT=G,KEYLEN=14,POS=S,           *        
               PROCSEQ=WDE4B                                                    
         SENSEG NAME=WDE411,PARENT=0,PROCOPT=GR                                 
*                                                                               
         PCB TYPE=DB,DBDNAME=WDE6,PROCOPT=G,KEYLEN=4,POS=S                      
         SENSEG NAME=WDE601,PARENT=0,PROCOPT=G                                  
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WL0198                                       
         END                                                                    
