*                                                                               
*        LOCATION REGISTER  WDJ8                                                
         PCB   TYPE=DB,DBDNAME=WDJ8,PROCOPT=G,KEYLEN=11,POS=S                   
         SENSEG NAME=WDJ801,PARENT=0,PROCOPT=GIRD                               
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WL0601                                       
         END                                                                    
