*                                                                               
DISTRDOC PCB   TYPE=TP,NAME=WZ0420X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WQ0111                                       
         END                                                                    
