*---LEVERANSSPÄRREGISTER                                                        
         PCB   TYPE=DB,DBDNAME=WDF8,PROCOPT=GOT,KEYLEN=24,POS=S                 
         SENSEG NAME=WDF801,PARENT=0                                            
         SENSEG NAME=WDF811,PARENT=WDF801                                       
         SENSEG NAME=WDF812,PARENT=WDF801                                       
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WXTR81                                       
         END                                                                    
