*                                                                               
* WDR2 IDHTYP=5108                                                              
         PCB   TYPE=DB,DBDNAME=WDR2,PROCOPT=GOT,KEYLEN=35,POS=S                 
         SENSEG NAME=WDR201,PARENT=0                                            
         SENSEG NAME=WDGX5108,PARENT=WDR201                                     
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WYRST1                                       
         END                                                                    
