*        TRANS TILL DISTRIBUTION & PRINT                                        
PARCELTR PCB   TYPE=TP,NAME=WZ0440X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO,LIST=NO                                     
*                                                                               
CREATEPA PCB   TYPE=TP,NAME=WZ0440X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
DELETEPA PCB   TYPE=TP,NAME=WZ0440X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO                                             
*                                                                               
NSCINVOI PCB   TYPE=TP,NAME=WZ0440X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO,LIST=NO                                     
*                                                                               
MQASYNC  PCB   TYPE=TP,NAME=WZ0431X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO,LIST=NO                                     
*                                                                               
GCERRORN PCB   TYPE=TP,NAME=WZ0440X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO,LIST=NO                                     
*                                                                               
* SYNQ                                                                          
*        TRANSACTION TO DISTRIBUTION & PRINT                                    
PRODUCTM PCB   TYPE=TP,NAME=WZ0440X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO,LIST=NO                                     
*                                                                               
* VSIM                                                                          
*        TRANSACTION TO DISTRIBUTION & PRINT                                    
QUALITYR PCB   TYPE=TP,NAME=WZ0440X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO,LIST=NO                                     
*                                                                               
* SHIP2TMS                                                                      
*        TRANSACTION TO DISTRIBUTION & PRINT                                    
SHIP2TMS PCB   TYPE=TP,NAME=W40679X,ALTRESP=NO,SAMETRM=NO,             *        
               MODIFY=NO,EXPRESS=NO,LIST=NO                                     
*                                                                               
*                                                                               
ATAB     PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=GOT,KEYLEN=80,POS=S                 
         SENSEG NAME=WDR501,PARENT=0                                            
         SENSEG NAME=WDGX0102,PARENT=WDR501                                     
         SENSEG NAME=WDGX0104,PARENT=WDR501                                     
*                                                                               
*TMS-1165-PCB                                                                   
         PCB   TYPE=DB,DBDNAME=WL1165,PROCOPT=GOT,KEYLEN=32,POS=S               
         SENSEG NAME=WL116501,PARENT=0                                          
         SENSEG NAME=WL116511,PARENT=WL116501                                   
         SENSEG NAME=WL116512,PARENT=WL116501                                   
*                                                                               
*TMS-4141-PCB                                                                   
         PCB   TYPE=DB,DBDNAME=WDR2,PROCOPT=GOT,KEYLEN=46,POS=S                 
         SENSEG NAME=WDR201,PARENT=0                                            
         SENSEG NAME=WDGX4142,PARENT=WDR201                                     
*                                                                               
*TMS-WDB2-PCB                                                                   
         PCB   TYPE=DB,DBDNAME=WDB2,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDB201,PARENT=0                                            
*                                                                               
*TMS-WDB6-PCB - DC-REGISTER  WDB6                                               
         PCB   TYPE=DB,DBDNAME=WDB6,PROCOPT=GOT,KEYLEN=2,POS=S                  
         SENSEG NAME=WDB601,PARENT=0                                            
*                                                                               
*TMS-WDD3-PCB  DESCRIPTION DB                                                   
         PCB   TYPE=DB,DBDNAME=WDD3,PROCOPT=GOT,KEYLEN=8,POS=S,        *        
               PROCSEQ=WDD3B                                                    
         SENSEG NAME=WDD301,PARENT=0                                            
         SENSEG NAME=WDD311,PARENT=WDD301                                       
*                                                                               
*                                                                               
*TMS-WDB1-PCB  KUNDREGISTER BETAL WDB1                                          
         PCB   TYPE=DB,DBDNAME=WDB1,PROCOPT=GOT,KEYLEN=11,POS=S                 
         SENSEG NAME=WDB101,PARENT=0                                            
*                                                                               
*TMS-WDE4A-PCB                                                                  
        PCB TYPE=DB,DBDNAME=WDE4,PROCOPT=GOT,KEYLEN=17,POS=S,          *        
               PROCSEQ=WDE4A                                                    
        SENSEG NAME=WDE401,PARENT=0                                             
*                                                                               
*TMS-WDE4F-PCB                                                                  
        PCB TYPE=DB,DBDNAME=WDE4,PROCOPT=GOTP,KEYLEN=30,POS=S,         *        
               PROCSEQ=WDE4F                                                    
        SENSEG NAME=WDE411,PARENT=0                                             
        SENSEG NAME=WDE401,PARENT=WDE411                                        
        SENSEG NAME=WDE421,PARENT=WDE411                                        
*                                                                               
*TMS-WDQ2-PCB                                                                   
        PCB   TYPE=DB,DBDNAME=WDQ2,PROCOPT=GOT,KEYLEN=4,POS=S                   
        SENSEG NAME=WDQ201,PARENT=0                                             
*                                                                               
*TMS-WDQ3-PCB                                                                   
        PCB   TYPE=DB,DBDNAME=WDQ3,PROCOPT=GOT,KEYLEN=12,POS=S                  
        SENSEG NAME=WDQ301,PARENT=0                                             
*                                                                               
*TMS-WDK6-PCB                                                                   
         PCB   TYPE=DB,DBDNAME=WDK6,PROCOPT=GOT,KEYLEN=06,POS=S                 
         SENSEG NAME=WDK601,PARENT=0                                            
         SENSEG NAME=WDK611,PARENT=WDK601                                       
*                                                                               
*TMS-WDE6-PCB                                                                   
         PCB   TYPE=DB,DBDNAME=WDE6,PROCOPT=GOT,KEYLEN=07,POS=S                 
         SENSEG NAME=WDE601,PARENT=0                                            
         SENSEG NAME=WDE611,PARENT=WDE601                                       
*                                                                               
*TMS-WDK5-PCB                                                                   
        PCB   TYPE=DB,DBDNAME=WDK5,PROCOPT=GOT,KEYLEN=08,POS=S                  
        SENSEG NAME=WDK501,PARENT=0                                             
*                                                                               
*TMS-WDQ2C-PCB                                                                  
         PCB   TYPE=DB,DBDNAME=WDQ2,PROCOPT=GOT,KEYLEN=21,POS=S,       *        
               PROCSEQ=WDQ2C                                                    
         SENSEG NAME=WDQ201,PARENT=0                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WZ0110                                       
         END                                                                    
