*                                                                               
* EVENT DB FOR PARAMETERS                                                       
ATAB     PCB   TYPE=DB,DBDNAME=WDR5,PROCOPT=GIRD,KEYLEN=80,POS=S                
         SENSEG NAME=WDR501,PARENT=0                                            
         SENSEG NAME=WDGX0102,PARENT=WDR501                                     
         SENSEG NAME=WDGX0104,PARENT=WDR501                                     
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WZ0111                                       
         END                                                                    
