*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WZ0410                                       
         END                                                                    
