*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WZ0401                                       
         END                                                                    
