*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WZ0402                                       
         END                                                                    
