*        -- PCB FOR WZ04OUTX                                                    
OUT01    PCB   TYPE=TP,LTERM=,ALTRESP=NO,SAMETRM=NO,                   *        
               MODIFY=YES,EXPRESS=NO                                            
*                                                                               
         PSBGEN LANG=COBOL,PSBNAME=WZ1403,CMPAT=YES,LOCKMAX=2                   
         END                                                                    
