//W418D1RS JOB (650W4180100W418D1RS,W100),'RTN W418D1',                         
//             CLASS=K,USER=?,PASSWORD=?                                        
//PROC  JCLLIB ORDER=(W.QASE.PROCLIB)                                           
//ENV  INCLUDE MEMBER=ENVQASE                                                   
/*JOBPARM FORMS=1800,LINECT=0                                                   
/*ROUTE XEQ LOCAL                                                               
/*ROUTE PRINT LOCAL                                                             
//BLOCK   EXEC WBLOCK,NAME=W418D1                                               
//*                                                                             
//*********************************************************************         
//*                                                                             
//*        IDCAMS-DELETE AND IDCAMS-RENAME OF GDG:S                             
//*                                                                             
//*********************************************************************         
//*                                                                             
//RENAME01 EXEC WRTNINP,                                                        
//*                                                                             
//           F1='W803.W803B1.W80301',                                           
//           T1='W803.W418D1.W80301',RF1=VB,LR1=091,CP1=3,                      
//*                                                                             
//           F2='W476.W476D5.W4763B',                                           
//           T2='W476.W418D1.W4763B',RF2=VB,LR2=088,CP2=3,                      
//*                                                                             
//           F3='W612.W612D2.W61222',                                           
//           T3='W612.W418D1.W61222',RF3=VB,LR3=088,CP3=3                       
//*                                                                             
//*********************************************************************         
//*                                                                             
//*        IDCAMS-DELETE AND IDCAMS-RENAME OF GDG:S                             
//*                                                                             
//*********************************************************************         
//*                                                                             
//RENAME05 EXEC WRTNINP,                                                        
//*                                                                             
//           F1='W418.W418X1JP.W41809',                                         
//           T1='W418.W418D1JP.W41809',RF1=VB,LR1=351,CP1=3,                    
//*                                                                             
//           F2='W418.W418X2JP.W41802',                                         
//           T2='W418.W418D1JP.W41802',RF2=VB,LR2=033,CP2=3,                    
//*                                                                             
//           F9='W418.W418X1PT.W41809',                                         
//           T9='W418.W418D1PT.W41809',RF9=VB,LR9=351,CP9=3                     
//*                                                                             
//*********************************************************************         
//*                                                                             
//*        IDCAMS-DELETE AND IDCAMS-RENAME OF GDG:S                             
//*                                                                             
//*********************************************************************         
//*                                                                             
//RENAME06 EXEC WRTNINP,                                                        
//*                                                                             
//           F1='W418.W418X2PT.W41802',                                         
//           T1='W418.W418D1PT.W41802',RF1=VB,LR1=033,CP1=3,                    
//*                                                                             
//           F4='W418.W418X1TH.W41809',                                         
//           T4='W418.W418D1TH.W41809',RF4=VB,LR4=351,CP4=3,                    
//*                                                                             
//           F5='W418.W418X2TH.W41802',                                         
//           T5='W418.W418D1TH.W41802',RF5=VB,LR5=033,CP5=3,                    
//*                                                                             
//           F8='W418.W418X1BR.W41809',                                         
//           T8='W418.W418D1BR.W41809',RF8=VB,LR8=351,CP8=3,                    
//*                                                                             
//           F9='W418.W418X2BR.W41802',                                         
//           T9='W418.W418D1BR.W41802',RF9=VB,LR9=033,CP9=3                     
//*                                                                             
//*********************************************************************         
//*                                                                             
//*        IDCAMS-DELETE AND IDCAMS-RENAME OF GDG:S                             
//*                                                                             
//*********************************************************************         
//*                                                                             
//RENAME07 EXEC WRTNINP,                                                        
//*                                                                             
//           F5='W418.W418X1RU.W41809',                                         
//           T5='W418.W418D1RU.W41809',RF5=VB,LR5=351,CP5=3,                    
//*                                                                             
//           F6='W418.W418X2RU.W41802',                                         
//           T6='W418.W418D1RU.W41802',RF6=VB,LR6=033,CP6=3                     
//*                                                                             
//*********************************************************************         
//*                                                                             
//*        IDCAMS-DELETE AND IDCAMS-RENAME OF GDG:S                             
//*                                                                             
//*********************************************************************         
//*                                                                             
//RENAME09 EXEC WRTNINP,                                                        
//*                                                                             
//           F1='W418.W418X1MQ.W41809',                                         
//           T1='W418.W418D1MQ.W41809',RF1=VB,LR1=351,                          
//*                                                                             
//           F2='W418.W418X2MQ.W41802',                                         
//           T2='W418.W418D1MQ.W41802',RF2=VB,LR2=033                           
//*                                                                             
//SOP     EXEC WSOPEND,PROCESS=W418D1RS                                         
