//W461D1RS JOB (650W4610100W461D1RS,W100),'RTN W461D1',                         
//         CLASS=K,USER=?,PASSWORD=?                                            
//PROC  JCLLIB ORDER=(W.QASE.PROCLIB)                                           
//ENV  INCLUDE MEMBER=ENVQASE                                                   
/*JOBPARM FORMS=1800,LINECT=0                                                   
/*ROUTE XEQ LOCAL                                                               
/*ROUTE PRINT LOCAL                                                             
//BLOCK   EXEC WBLOCK,NAME=W461D1                                               
//*                                                                             
//*********************************************************************         
//*                                                                             
//*        IDCAMS-DELETE AND IDCAMS-RENAME OF GDG:S                             
//*                                                                             
//*********************************************************************         
//*                                                                             
//RENAME01 EXEC WRTNINP,                                                        
//*                                                                             
//           F1='W092.W092D6.W092ZP',                                           
//           T1='W092.W461D1.W092ZP',RF1=FB,LR1=040,CP1=3,                      
//*                                                                             
//           F2='W092.W092D6.W092ZQ',                                           
//           T2='W092.W461D1.W092ZQ',RF2=VB,LR2=132,CP2=3,                      
//*                                                                             
//           F3='W092.W092D6.W092ZF',                                           
//           T3='W092.W461D1.W092ZF',RF3=FB,LR3=067,CP3=3,                      
//*                                                                             
//           F4='W092.W092D6.W092X3',                                           
//           T4='W092.W461D1.W092X3',RF4=FB,LR4=053,CP4=3,                      
//*                                                                             
//           F5='W092.W092D6.W092X4',                                           
//           T5='W092.W461D1.W092X4',RF5=FB,LR5=091,CP5=3,                      
//*                                                                             
//           F6='W371.W371V1.W37109',                                           
//           T6='W371.W461D1.W37109',RF6=VB,LR6=177,CP6=3,                      
//*                                                                             
//           F7='W371.W371D1.W37119',                                           
//           T7='W371.W461D1.W37119',RF7=VB,LR7=078,CP7=3,                      
//*                                                                             
//           F8='W476.W476D1.W47630',                                           
//           T8='W476.W461D1.W47630',RF8=FB,LR8=041,CP8=3,                      
//*                                                                             
//           F9='W418.W418D2.W41837',                                           
//           T9='W418.W461D1.W41837',RF9=VB,LR9=143,CP9=3                       
//*                                                                             
//*********************************************************************         
//*                                                                             
//*        IDCAMS-DELETE AND IDCAMS-RENAME OF GDG:S                             
//*                                                                             
//*********************************************************************         
//*                                                                             
//RENAME02 EXEC WRTNINP,                                                        
//*                                                                             
//           F1='W418.W418D2.W4183A',                                           
//           T1='W418.W461D1.W4183A',RF1=VB,LR1=125,CP1=3,                      
//*                                                                             
//           F2='W418.W418D2.W4183B',                                           
//           T2='W418.W461D1.W4183B',RF2=VB,LR2=084,CP2=3,                      
//*                                                                             
//           F3='W418.W418D2.W41870',                                           
//           T3='W418.W461D1.W41870',RF3=VB,LR3=084,CP3=3,                      
//*                                                                             
//           F4='W418.W418D1.W41814',                                           
//           T4='W418.W461D1.W41814',RF4=VB,LR4=125,CP4=3,                      
//*                                                                             
//           F5='W418.W418D1.W41804',                                           
//           T5='W418.W461D1.W41804',RF5=VB,LR5=125,CP5=3,                      
//*                                                                             
//           F6='W418.W418S2.W418AK',                                           
//           T6='W418.W461D1.W418AK',RF6=VB,LR6=143,CP6=3,                      
//*                                                                             
//           F7='W440.W440D1.W44027',                                           
//           T7='W440.W461D1.W44027',RF7=VB,LR7=132,CP7=3,                      
//*                                                                             
//           F8='W414.W414D1.W41407',                                           
//           T8='W414.W461D1.W41407',RF8=FB,LR8=067,CP8=3,                      
//*                                                                             
//           F9='W414.W414D1.W41408',                                           
//           T9='W414.W461D1.W41408',RF9=FB,LR9=053,CP9=3                       
//*                                                                             
//*********************************************************************         
//*                                                                             
//*        IDCAMS-DELETE AND IDCAMS-RENAME OF GDG:S                             
//*                                                                             
//*********************************************************************         
//*                                                                             
//RENAME03 EXEC WRTNINP,                                                        
//*                                                                             
//           F1='W414.W414D1.W41409',                                           
//           T1='W414.W461D1.W41409',RF1=FB,LR1=091,CP1=3,                      
//*                                                                             
//           F2='W414.W414D1.W4140A',                                           
//           T2='W414.W461D1.W4140A',RF2=VB,LR2=132,CP2=3,                      
//*                                                                             
//           F3='W414.W414D1.W4140G',                                           
//           T3='W414.W461D1.W4140G',RF3=FB,LR3=040,CP3=3                       
//*                                                                             
//SOP     EXEC WSOPEND,PROCESS=W461D1RS                                         
