//W461D2RS JOB (640W4610100W461D2RS,W100),'RTN W461D2',                         
//             CLASS=K,USER=?,PASSWORD=?                                        
//PROC  JCLLIB ORDER=(W.QASE.PROCLIB)                                           
//ENV  INCLUDE MEMBER=ENVQASE                                                   
/*JOBPARM FORMS=1800,LINECT=0                                                   
/*ROUTE   XEQ LOCAL                                                             
/*ROUTE PRINT LOCAL                                                             
//BLOCK   EXEC WBLOCK,NAME=W461D2                                               
//*                                                                             
//*********************************************************************         
//*                                                                             
//*        IDCAMS-DELETE AND IDCAMS-RENAME OF GDG:S                             
//*                                                                             
//*********************************************************************         
//*                                                                             
//RENAME01 EXEC WRTNINP,                                                        
//*                                                                             
//           F1='W461.W461D1.W46127',                                           
//           T1='W461.W461D2.W46127',RF1=VB,LR1=215,                            
//*                                                                             
//           F2='W461.W461D1.W46129',                                           
//           T2='W461.W461D2.W46129',RF2=VB,LR2=215,                            
//*                                                                             
//           F3='W461.W461D1.W46130',                                           
//           T3='W461.W461D2.W46130',RF3=VB,LR3=215,                            
//*                                                                             
//           F4='W461.W461D1.W46172',                                           
//           T4='W461.W461D2.W46172',RF4=VB,LR4=215,                            
//*                                                                             
//           F5='W461.W461D1.W46138',                                           
//           T5='W461.W461D2.W46138',RF5=VB,LR5=215,                            
//*                                                                             
//           F6='W461.W461D1.W46171',                                           
//           T6='W461.W461D2.W46171',RF6=VB,LR6=215,                            
//*                                                                             
//           F7='W461.W461D1.W46161',                                           
//           T7='W461.W461D2.W46161',RF7=VB,LR7=215,                            
//*                                                                             
//           F8='W461.W461D1.W46179',                                           
//           T8='W461.W461D2.W46179',RF8=VB,LR8=215                             
//*                                                                             
//*********************************************************************         
//*                                                                             
//*        IDCAMS-DELETE AND IDCAMS-RENAME OF GDG:S                             
//*                                                                             
//*********************************************************************         
//*                                                                             
//RENAME02 EXEC WRTNINP,                                                        
//*                                                                             
//           F1='W461.W461D1.W46168',                                           
//           T1='W461.W461D2.W46168',RF1=VB,LR1=215,                            
//*                                                                             
//           F2='W461.W461D1.W46178',                                           
//           T2='W461.W461D2.W46178',RF2=VB,LR2=215,                            
//*                                                                             
//           F3='W461.W461D1.W46176',                                           
//           T3='W461.W461D2.W46176',RF3=VB,LR3=215,                            
//*                                                                             
//           F4='W461.W461D1.W46173',                                           
//           T4='W461.W461D2.W46173',RF4=VB,LR4=215,                            
//*                                                                             
//           F5='W461.W461D1.W46170',                                           
//           T5='W461.W461D2.W46170',RF5=VB,LR5=215,                            
//*                                                                             
//           F6='W461.W461D1.W46140',                                           
//           T6='W461.W461D2.W46140',RF6=VB,LR6=215,                            
//*                                                                             
//           F7='W461.W461D1.W46139',                                           
//           T7='W461.W461D2.W46139',RF7=VB,LR7=215,                            
//*                                                                             
//           F8='W461.W461D1.W46174',                                           
//           T8='W461.W461D2.W46174',RF8=VB,LR8=215,                            
//*                                                                             
//           F9='W461.W461D1.W46175',                                           
//           T9='W461.W461D2.W46175',RF9=VB,LR9=215                             
//*                                                                             
//*********************************************************************         
//*                                                                             
//*        IDCAMS-DELETE AND IDCAMS-RENAME OF GDG:S                             
//*                                                                             
//*********************************************************************         
//*                                                                             
//RENAME03 EXEC WRTNINP,                                                        
//*                                                                             
//           F1='W461.W461D1.W46131',                                           
//           T1='W461.W461D2.W46131',RF1=VB,LR1=215,                            
//*                                                                             
//           F2='W461.W461D1.W4612Z',                                           
//           T2='W461.W461D2.W4612Z',RF2=VB,LR2=215,                            
//*                                                                             
//           F3='W461.W461D1.W46134',                                           
//           T3='W461.W461D2.W46134',RF3=VB,LR3=215,                            
//*                                                                             
//           F4='W461.W461D1.W46128',                                           
//           T4='W461.W461D2.W46128',RF4=VB,LR4=215,                            
//*                                                                             
//           F6='W461.W461D1.W4612B',                                           
//           T6='W461.W461D2.W4612B',RF6=VB,LR6=215,                            
//*                                                                             
//           F7='W461.W461D1.W4612C',                                           
//           T7='W461.W461D2.W4612C',RF7=VB,LR7=215,                            
//*                                                                             
//           F8='W461.W461D1.W4612G',                                           
//           T8='W461.W461D2.W4612G',RF8=VB,LR8=215                             
//*                                                                             
//*********************************************************************         
//*                                                                             
//*        IDCAMS-DELETE AND IDCAMS-RENAME OF GDG:S                             
//*                                                                             
//*********************************************************************         
//*                                                                             
//RENAME04 EXEC WRTNINP,                                                        
//*                                                                             
//           F2='W461.W461D1.W4612K',                                           
//           T2='W461.W461D2.W4612K',RF2=VB,LR2=215,                            
//*                                                                             
//           F3='W461.W461D1.W4612L',                                           
//           T3='W461.W461D2.W4612L',RF3=VB,LR3=215,                            
//*                                                                             
//           F4='W461.W461D1.W4612N',                                           
//           T4='W461.W461D2.W4612N',RF4=VB,LR4=215,                            
//*                                                                             
//           F5='W461.W461D1.W4613A',                                           
//           T5='W461.W461D2.W4613A',RF5=VB,LR5=215,                            
//*                                                                             
//           F7='W476.W476D7.W476TR1',                                          
//           T7='W476.W461D2.W476TR1',RF7=VB,LR7=215,                           
//*                                                                             
//           F8='W476.W476D7.W476AT1',                                          
//           T8='W476.W461D2.W476AT1',RF8=VB,LR8=215,                           
//*                                                                             
//           F9='W476.W476D7.W476AU1',                                          
//           T9='W476.W461D2.W476AU1',RF9=VB,LR9=215                            
//*                                                                             
//*********************************************************************         
//*                                                                             
//*        IDCAMS-DELETE AND IDCAMS-RENAME OF GDG:S                             
//*                                                                             
//*********************************************************************         
//*                                                                             
//RENAME05 EXEC WRTNINP,                                                        
//*                                                                             
//           F1='W476.W476D7.W476BE1',                                          
//           T1='W476.W461D2.W476BE1',RF1=VB,LR1=215,                           
//*                                                                             
//           F2='W476.W476D7.W476BR1',                                          
//           T2='W476.W461D2.W476BR1',RF2=VB,LR2=215,                           
//*                                                                             
//           F3='W476.W476D7.W476BR2',                                          
//           T3='W476.W461D2.W476BR2',RF3=VB,LR3=215,                           
//*                                                                             
//           F4='W476.W476D7.W476CH1',                                          
//           T4='W476.W461D2.W476CH1',RF4=VB,LR4=215,                           
//*                                                                             
//           F5='W476.W476D7.W476CH2',                                          
//           T5='W476.W461D2.W476CH2',RF5=VB,LR5=215,                           
//*                                                                             
//           F6='W476.W476D7.W476UK1',                                          
//           T6='W476.W461D2.W476UK1',RF6=VB,LR6=215,                           
//*                                                                             
//           F7='W476.W476D7.W476DE1',                                          
//           T7='W476.W461D2.W476DE1',RF7=VB,LR7=215,                           
//*                                                                             
//           F8='W476.W476D7.W476DK1',                                          
//           T8='W476.W461D2.W476DK1',RF8=VB,LR8=215,                           
//*                                                                             
//           F9='W476.W476D7.W476ES1',                                          
//           T9='W476.W461D2.W476ES1',RF9=VB,LR9=215                            
//*                                                                             
//*********************************************************************         
//*                                                                             
//*        IDCAMS-DELETE AND IDCAMS-RENAME OF GDG:S                             
//*                                                                             
//*********************************************************************         
//*                                                                             
//RENAME06 EXEC WRTNINP,                                                        
//*                                                                             
//           F1='W476.W476D7.W476FI1',                                          
//           T1='W476.W461D2.W476FI1',RF1=VB,LR1=215,                           
//*                                                                             
//           F2='W476.W476D7.W476FI2',                                          
//           T2='W476.W461D2.W476FI2',RF2=VB,LR2=215,                           
//*                                                                             
//           F3='W476.W476D7.W476FR1',                                          
//           T3='W476.W461D2.W476FR1',RF3=VB,LR3=215,                           
//*                                                                             
//           F4='W476.W476D7.W476IR1',                                          
//           T4='W476.W461D2.W476IR1',RF4=VB,LR4=215,                           
//*                                                                             
//           F5='W476.W476D7.W476IT1',                                          
//           T5='W476.W461D2.W476IT1',RF5=VB,LR5=215,                           
//*                                                                             
//           F6='W476.W476D7.W476JP2',                                          
//           T6='W476.W461D2.W476JP2',RF6=VB,LR6=215,                           
//*                                                                             
//           F8='W476.W476D7.W476NL1',                                          
//           T8='W476.W461D2.W476NL1',RF8=VB,LR8=215                            
//*                                                                             
//*********************************************************************         
//*                                                                             
//*        IDCAMS-DELETE AND IDCAMS-RENAME OF GDG:S                             
//*                                                                             
//*********************************************************************         
//*                                                                             
//RENAME07 EXEC WRTNINP,                                                        
//*                                                                             
//           F1='W476.W476D7.W476NO1',                                          
//           T1='W476.W461D2.W476NO1',RF1=VB,LR1=215,                           
//*                                                                             
//           F2='W476.W476D7.W476PE1',                                          
//           T2='W476.W461D2.W476PE1',RF2=VB,LR2=215,                           
//*                                                                             
//           F3='W476.W476D7.W476PL1',                                          
//           T3='W476.W461D2.W476PL1',RF3=VB,LR3=215,                           
//*                                                                             
//           F4='W476.W476D7.W476PT1',                                          
//           T4='W476.W461D2.W476PT1',RF4=VB,LR4=215,                           
//*                                                                             
//           F5='W476.W476D7.W476RU1',                                          
//           T5='W476.W461D2.W476RU1',RF5=VB,LR5=215,                           
//*                                                                             
//           F6='W476.W476D7.W476SA1',                                          
//           T6='W476.W461D2.W476SA1',RF6=VB,LR6=215,                           
//*                                                                             
//           F7='W476.W476D7.W476SE1',                                          
//           T7='W476.W461D2.W476SE1',RF7=VB,LR7=215,                           
//*                                                                             
//           F8='W476.W476D7.W476PT2',                                          
//           T8='W476.W461D2.W476PT2',RF8=VB,LR8=215,                           
//*                                                                             
//           F9='W461.W461D1.W461PT3',                                          
//           T9='W461.W461D2.W461PT3',RF9=VB,LR9=215                            
//*                                                                             
//*********************************************************************         
//*                                                                             
//*        IDCAMS-DELETE AND IDCAMS-RENAME OF GDG:S                             
//*                                                                             
//*********************************************************************         
//*                                                                             
//RENAME08 EXEC WRTNINP,                                                        
//*                                                                             
//           F1='W461.W461D1.W4612M',                                           
//           T1='W461.W461D2.W4612M',RF1=VB,LR1=215,                            
//*                                                                             
//           F2='W476.W476D7.W476MX1',                                          
//           T2='W476.W461D2.W476MX1',RF2=VB,LR2=215,                           
//*                                                                             
//           F3='W461.W461D1.W46122',                                           
//           T3='W461.W461D2.W46122',RF3=VB,LR3=215,                            
//*                                                                             
//           F4='W476.W476D7.W476CZ1',                                          
//           T4='W476.W461D2.W476CZ1',RF4=VB,LR4=215,                           
//*                                                                             
//           F5='W461.W461D1.W46123',                                           
//           T5='W461.W461D2.W46123',RF5=VB,LR5=215,                            
//*                                                                             
//           F6='W476.W476D7.W476HU1',                                          
//           T6='W476.W461D2.W476HU1',RF6=VB,LR6=215                            
//*                                                                             
//*                                                                             
//SOPEND  EXEC WSOPEND,PROCESS=W461D2RS                                         
