*                                                                               
         DBD   NAME=W6CKPC,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=W6CKPC01,PARENT=0,SOURCE=((W6G201,,W6G2))                   
         SEGM  NAME=W6CKPC11,PARENT=W6CKPC01,SOURCE=((W6G230,,W6G2))            
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
