*                                                                               
         DBD   NAME=W6CKPB,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=W6CKPB01,PARENT=0,SOURCE=((W6G201,,W6G2))                   
         SEGM  NAME=W6CKPB11,PARENT=W6CKPB01,SOURCE=((W6G230,,W6G2))            
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
