*        INLEVERANSREGISTER INDEX ARTIKEL                                       
*                                                                               
         DBD   NAME=W6D1H,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=W6D1HK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=W6D1H1,PARENT=0,BYTES=27,PTR=T                              
         FIELD NAME=(W6D1H1KY,SEQ,U),BYTES=27,START=1,TYPE=X                    
         FIELD NAME=(IDARTNR),BYTES=5,START=1,TYPE=P                            
         FIELD NAME=(IDDC),BYTES=2,START=6,TYPE=X                               
         FIELD NAME=(IDLEVNR),BYTES=5,START=8,TYPE=X                            
         FIELD NAME=(IDFS),BYTES=8,START=13,TYPE=X                              
         FIELD NAME=(TIAVIDAT),BYTES=4,START=21,TYPE=P                          
         FIELD NAME=(IDRADNRI),BYTES=3,START=25,TYPE=P                          
         LCHILD NAME=(W6D111,W6D1),INDEX=W6D1HSEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
