*        INLEVERANSREGISTER INDEX INLEVERANSOMRÅDE                              
*                                                                               
         DBD   NAME=W6D1E,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=W6D1EK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=W6D1E1,PARENT=0,BYTES=39,PTR=T                              
         FIELD NAME=(W6D1E1KY,SEQ,U),BYTES=31,START=1,TYPE=X                    
         FIELD NAME=(ADINLOMR),BYTES=4,START=1,TYPE=X                           
         FIELD NAME=(KDINLPRI),BYTES=2,START=5,TYPE=P                           
         FIELD NAME=(IDRADNRI),BYTES=3,START=7,TYPE=P                           
         FIELD NAME=(IDDC),BYTES=2,START=10,TYPE=X                              
         FIELD NAME=(IDLEVNR),BYTES=5,START=12,TYPE=X                           
         FIELD NAME=(IDFS),BYTES=8,START=17,TYPE=X                              
         FIELD NAME=(TIAVIDAT),BYTES=4,START=25,TYPE=P                          
         FIELD NAME=(IDRADNR),BYTES=3,START=29,TYPE=P                           
         FIELD NAME=(FLINLFB),BYTES=1,START=32,TYPE=X                           
         FIELD NAME=(FLINLFP),BYTES=1,START=33,TYPE=X                           
         FIELD NAME=(KDINLSTA),BYTES=3,START=34,TYPE=X                          
         FIELD NAME=(IDINLVGN),BYTES=3,START=37,TYPE=X                          
         LCHILD NAME=(W6D111,W6D1),INDEX=W6D1ESEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
