*        INLEVERANSREGISTER INDEX LÖPNUMMERINGÅNG                               
*                                                                               
         DBD   NAME=W6D1B,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=W6D1BK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=W6D1B1,PARENT=0,BYTES=27,PTR=T                              
         FIELD NAME=(W6D1B1KY,SEQ,U),BYTES=05,START=1,TYPE=X                    
         FIELD NAME=(IDLOPNRM),BYTES=5,START=1,TYPE=P                           
         FIELD NAME=(IDRADNRI),BYTES=3,START=6,TYPE=P                           
         FIELD NAME=(IDDC),BYTES=2,START=9,TYPE=X                               
         FIELD NAME=(IDLEVNR),BYTES=5,START=11,TYPE=X                           
         FIELD NAME=(IDFS),BYTES=8,START=16,TYPE=X                              
         FIELD NAME=(TIAVIDAT),BYTES=4,START=24,TYPE=P                          
         LCHILD NAME=(W6D111,W6D1),INDEX=W6D1BSEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
