*        INLEVERANSREGISTER INDEX KOLLI                                         
*                                                                               
         DBD   NAME=W6D1C,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=W6D1CK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=W6D1C1,PARENT=0,BYTES=39,PTR=T                              
         FIELD NAME=(W6D1C1KY,SEQ,U),BYTES=39,START=1,TYPE=X                    
         FIELD NAME=(IDLEVNRK),BYTES=5,START=1,TYPE=X                           
         FIELD NAME=(IDOKOLLI),BYTES=9,START=6,TYPE=X                           
         FIELD NAME=(IDRADNRI),BYTES=3,START=15,TYPE=P                          
         FIELD NAME=(IDDC),BYTES=2,START=18,TYPE=X                              
         FIELD NAME=(IDLEVNR),BYTES=5,START=20,TYPE=X                           
         FIELD NAME=(IDFS),BYTES=8,START=25,TYPE=X                              
         FIELD NAME=(TIAVIDAT),BYTES=4,START=33,TYPE=P                          
         FIELD NAME=(IDRADNR),BYTES=3,START=37,TYPE=P                           
         LCHILD NAME=(W6D111,W6D1),INDEX=W6D1CSEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
