*        INLEVERANSREGISTER INDEX VAGNSINENTITET                                
*                                                                               
         DBD   NAME=W6D1F,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=W6D1FK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=W6D1F1,PARENT=0,BYTES=28,PTR=T                              
         FIELD NAME=(W6D1F1KY,SEQ,U),BYTES=28,START=1,TYPE=X                    
         FIELD NAME=(IDINLVGN),BYTES=3,START=1,TYPE=X                           
         FIELD NAME=(IDRADNRI),BYTES=3,START=4,TYPE=P                           
         FIELD NAME=(IDDC),BYTES=2,START=7,TYPE=X                               
         FIELD NAME=(IDLEVNR),BYTES=5,START=9,TYPE=X                            
         FIELD NAME=(IDFS),BYTES=8,START=14,TYPE=X                              
         FIELD NAME=(TIAVIDAT),BYTES=4,START=22,TYPE=P                          
         FIELD NAME=(IDRADNR),BYTES=3,START=26,TYPE=P                           
         LCHILD NAME=(W6D111,W6D1),INDEX=W6D1FSEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
