*        LEVERANTÖRSREGISTER KVALITET                                           
*                                                                               
         DBD   NAME=W6F1,RMNAME=(V12008,,1512),                        *        
               ACCESS=(HDAM,OSAM)                                               
         DATASET DD1=W6F1V,DEVICE=3390,SIZE=2048,SCAN=0                         
*                                                                               
         SEGM  NAME=W6F101,PARENT=0,BYTES=262,PTR=T                             
         FIELD NAME=(IDLEVNR,SEQ,U),BYTES=5,START=1,TYPE=X                      
*                                                                               
         SEGM  NAME=W6F111,PARENT=W6F101,BYTES=275,PTR=T                        
         FIELD NAME=(IDLEVG,SEQ,U),BYTES=3,START=1,TYPE=P                       
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
