*        HÄNDELSEREGISTER MED FAST (STYR) INFO. FÖR INLEVERANS                  
*                                                                               
         DBD   NAME=W6G1,RMNAME=(V12008,,90),                          *        
               ACCESS=(HDAM,OSAM)                                               
         DATASET DD1=W6G1V,DEVICE=3390,SIZE=8192,SCAN=0                         
*                                                                               
         SEGM  NAME=W6G101,PARENT=0,BYTES=30,PTR=T                              
         FIELD NAME=(W6GXKEY,SEQ,U),BYTES=30,START=1,TYPE=X                     
         FIELD NAME=(IDHTYP),BYTES=4,START=1,TYPE=X                             
*                                                                               
         SEGM  NAME=W6G110,PARENT=W6G101,BYTES=83,PTR=T                         
         FIELD NAME=(KDSEGKEY),BYTES=1,START=1,TYPE=X                           
*                                                                               
         SEGM  NAME=W6G121,PARENT=W6G101,BYTES=14,PTR=T                         
         FIELD NAME=(IDARTNRF,SEQ,U),BYTES=5,START=1,TYPE=P                     
         FIELD NAME=(IDARTNRT),BYTES=5,START=6,TYPE=P                           
         FIELD NAME=(ADINLOMR),BYTES=4,START=11,TYPE=X                          
*                                                                               
         SEGM  NAME=W6G122,PARENT=W6G101,BYTES=10,PTR=T                         
         FIELD NAME=(IDFKNGRF,SEQ,U),BYTES=3,START=1,TYPE=P                     
         FIELD NAME=(IDFKNGRT),BYTES=3,START=4,TYPE=P                           
         FIELD NAME=(ADINLOMR),BYTES=4,START=7,TYPE=X                           
*                                                                               
         SEGM  NAME=W6G123,PARENT=W6G101,BYTES=14,PTR=T                         
         FIELD NAME=(IDLEVNR,SEQ,U),BYTES=5,START=1,TYPE=X                      
         FIELD NAME=(ADINLOMR),BYTES=4,START=11,TYPE=X                          
*                                                                               
         SEGM  NAME=W6G124,PARENT=W6G101,BYTES=8,PTR=T                          
         FIELD NAME=(BEFTF,SEQ,U),BYTES=2,START=1,TYPE=P                        
         FIELD NAME=(BEFTT),BYTES=2,START=3,TYPE=P                              
         FIELD NAME=(ADINLOMR),BYTES=4,START=5,TYPE=X                           
*                                                                               
*HTR=6005                                                                       
         SEGM  NAME=W6G130,PARENT=W6G101,BYTES=87,PTR=T                         
         FIELD NAME=(W6GXKEY,SEQ,U),BYTES=5,START=1,TYPE=X                      
         FIELD NAME=(ADINLOMR),BYTES=4,START=1,TYPE=X                           
         FIELD NAME=(ADINLOMB),BYTES=4,START=10,TYPE=X                          
         FIELD NAME=(ADINLOML),BYTES=4,START=14,TYPE=X                          
         FIELD NAME=(ADINLOMP),BYTES=4,START=18,TYPE=X                          
         FIELD NAME=(KDINLOMR),BYTES=3,START=39,TYPE=X                          
         FIELD NAME=(KDINLUPF),BYTES=4,START=42,TYPE=X                          
*                                                                               
         SEGM  NAME=W6GX6008,PARENT=W6G101,BYTES=30,PTR=NT                      
*                                                                               
*                                                                               
         SEGM  NAME=W6G140,PARENT=W6G101,BYTES=64,PTR=T                         
         FIELD NAME=(W6GXKEY,SEQ,U),BYTES=2,START=1,TYPE=X                      
         FIELD NAME=(IDPROVPL),BYTES=1,START=1,TYPE=X                           
         FIELD NAME=(KDPROVPL),BYTES=1,START=2,TYPE=X                           
*                                                                               
         SEGM  NAME=W6G150,PARENT=W6G101,BYTES=110,PTR=T                        
         FIELD NAME=(KDSEGKEY),BYTES=1,START=1,TYPE=X                           
*                                                                               
         SEGM  NAME=W6G160,PARENT=W6G101,BYTES=11,PTR=T                         
         FIELD NAME=(IDLOPNRM,SEQ,U),BYTES=5,START=1,TYPE=P                     
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
