*        KVALITET LAGERINDELNING                                                
*                                                                               
         DBD   NAME=W6H5,ACCESS=(HISAM,VSAM)                                    
         DATASET DD1=W6H5K,DEVICE=3390,SIZE=4096                                
*                                                                               
         SEGM  NAME=W6H501,PARENT=0,BYTES=22                                    
         FIELD NAME=(W6H501KY,SEQ,U),BYTES=15,START=1,TYPE=X                    
         FIELD NAME=(IDDC),BYTES=2,START=1,TYPE=X                               
         FIELD NAME=(IDKVAOMR),BYTES=1,START=3,TYPE=X                           
         FIELD NAME=(IDKVATRG),BYTES=2,START=4,TYPE=X                           
         FIELD NAME=(IDKVAGRP),BYTES=3,START=6,TYPE=X                           
         FIELD NAME=(ADLAGOMR),BYTES=2,START=9,TYPE=P                           
         FIELD NAME=(ADGANG),BYTES=2,START=11,TYPE=P                            
         FIELD NAME=(ADPLATS),BYTES=3,START=13,TYPE=P                           
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
