*        KVALITET LAGERKONTROLL                                                 
*                                                                               
         DBD   NAME=W6H6,RMNAME=(V12008,1,1575),                       *        
               ACCESS=(HDAM,OSAM)                                               
         DATASET DD1=W6H6V,DEVICE=3390,SIZE=2048,SCAN=0                         
*                                                                               
         SEGM  NAME=W6H601,PARENT=0,BYTES=27,PTR=T                              
         FIELD NAME=(W6H601KY,SEQ,U),BYTES=14,START=1,TYPE=X                    
         FIELD NAME=(IDDC),BYTES=2,START=1,TYPE=X                               
         FIELD NAME=(IDKVAOMR),BYTES=1,START=3,TYPE=X                           
         FIELD NAME=(IDKVAGRP),BYTES=3,START=4,TYPE=X                           
         FIELD NAME=(DAREGDAT),BYTES=8,START=7,TYPE=X                           
         FIELD NAME=(KDKVASTA),BYTES=1,START=23,TYPE=X                          
         LCHILD NAME=(W6H6A1,W6H6A),PTR=INDX                                    
         XDFLD NAME=W6H6ASEQ,SEGMENT=W6H601,                           *        
               SRCH=(IDDC,IDKVAOMR,IDKVAGRP,DAREGDAT,KDKVASTA)                  
*                                                                               
         SEGM  NAME=W6H611,PARENT=W6H601,BYTES=7,PTR=T                          
         FIELD NAME=(W6H611KY,SEQ,U),BYTES=7,START=1,TYPE=X                     
         FIELD NAME=(IDARTNR),BYTES=5,START=1,TYPE=P                            
         FIELD NAME=(IDKVAFEL),BYTES=2,START=6,TYPE=X                           
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
