*                                                                               
         DBD   NAME=W6H7A,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=W6H7AK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=W6H7A1,PARENT=0,BYTES=23                                    
         FIELD NAME=(W6H7A1KY,SEQ,U),BYTES=23,START=1,TYPE=X                    
         FIELD NAME=(IDDC),BYTES=1,START=1,TYPE=X                               
         FIELD NAME=(DAREGDAT),BYTES=8,START=3,TYPE=X                           
         FIELD NAME=(KDKRSTA),BYTES=1,START=11,TYPE=X                           
         FIELD NAME=(IDLOPNRM),BYTES=5,START=12,TYPE=P                          
         FIELD NAME=(IDFTG),BYTES=2,START=17,TYPE=X                             
         FIELD NAME=(IDKR),BYTES=5,START=19,TYPE=X                              
         LCHILD NAME=(W6H701,W6H7),INDEX=W6H7ASEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
