*                                                                               
         DBD   NAME=W6H7C,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=W6H7CK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=W6H7C1,PARENT=0,BYTES=18                                    
         FIELD NAME=(W6H7C1KY,SEQ,U),BYTES=18,START=1,TYPE=X                    
         FIELD NAME=(IDLOPNRM),BYTES=5,START=1,TYPE=P                           
         FIELD NAME=(DAAVSDAT),BYTES=8,START=6,TYPE=X                           
         FIELD NAME=(IDKR),BYTES=5,START=14,TYPE=P                              
         LCHILD NAME=(W6H701,W6H7),INDEX=W6H7CSEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
