*        HÄNDELSEREGISTER HANTERINGSOMRÅDE IDHTYP=6031                          
*                                                                               
         DBD   NAME=W6HANB,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=W6HANB01,PARENT=0,SOURCE=((W6G101,,W6G1))                   
         SEGM  NAME=W6HANB11,PARENT=W6HANB01,SOURCE=((W6G121,,W6G1))            
         SEGM  NAME=W6HANB12,PARENT=W6HANB01,SOURCE=((W6G122,,W6G1))            
         SEGM  NAME=W6HANB13,PARENT=W6HANB01,SOURCE=((W6G123,,W6G1))            
         SEGM  NAME=W6HANB14,PARENT=W6HANB01,SOURCE=((W6G124,,W6G1))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
