*                                                                               
         DBD   NAME=W6INLG,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=W6INLG01,PARENT=0,SOURCE=((W6D1F1,,W6D1F))                  
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
