*                                                                               
         DBD   NAME=W6INLE,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=W6INLE01,PARENT=0,SOURCE=((W6D1D1,,W6D1D))                  
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
