*                                                                               
         DBD   NAME=W6INLC,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=W6INLC01,PARENT=0,SOURCE=((W6D1B1,,W6D1B))                  
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
