*                                                                               
         DBD   NAME=W6INLI,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=W6INLI01,PARENT=0,SOURCE=((W6D1H1,,W6D1H))                  
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
