*        KVALITETKONTROLL                                                       
*                                                                               
         DBD   NAME=W6KVAH,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=W6KVAH01,PARENT=0,SOURCE=((W6D201,,W6D2))                   
         SEGM  NAME=W6KVAH11,PARENT=W6KVAH01,SOURCE=((W6D211,,W6D2))            
         SEGM  NAME=W6KVAH12,PARENT=W6KVAH01,SOURCE=((W6D212,,W6D2))            
         SEGM  NAME=W6KVAH22,PARENT=W6KVAH12,SOURCE=((W6D222,,W6D2))            
         SEGM  NAME=W6KVAH13,PARENT=W6KVAH01,SOURCE=((W6D213,,W6D2))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
