*                                                                               
         DBD   NAME=W6KVAE,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=W6KVAE01,PARENT=0,SOURCE=((W6H701,,W6H7))                   
         SEGM  NAME=W6KVAE11,PARENT=W6KVAE01,SOURCE=((W6H711,,W6H7))            
         SEGM  NAME=W6KVAE12,PARENT=W6KVAE01,SOURCE=((W6H712,,W6H7))            
         SEGM  NAME=W6KVAE13,PARENT=W6KVAE01,SOURCE=((W6H713,,W6H7))            
         SEGM  NAME=W6KVAE14,PARENT=W6KVAE01,SOURCE=((W6H714,,W6H7))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
