*                                                                               
         DBD   NAME=W6KVAF,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=W6KVAF01,PARENT=0,SOURCE=((W6H7A1,,W6H7A))                  
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
