*                                                                               
         DBD   NAME=W6KVAG,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=W6KVAG01,PARENT=0,SOURCE=((W6H7B1,,W6H7B))                  
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
