*                                                                               
         DBD   NAME=W6KVAB,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=W6KVAB01,PARENT=0,SOURCE=((W6H601,,W6H6))                   
         SEGM  NAME=W6KVAB11,PARENT=W6KVAB01,SOURCE=((W6H611,,W6H6))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
