*                                                                               
         DBD   NAME=W6KVAA,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=W6KVAA01,PARENT=0,SOURCE=((W6H501,,W6H5))                   
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
