*  1575 BLOCK = 5 CYL                                                           
*                                                                               
         DBD   NAME=W6L1,RMNAME=(V12008,5,1575),                       *        
               ACCESS=(HDAM,OSAM)                                               
         DATASET DD1=W6L1V,DEVICE=3390,SIZE=2048,SCAN=0                         
*                                                                               
*                                                                               
         SEGM  NAME=W6L101,PARENT=0,BYTES=100,PTR=T                             
         FIELD NAME=(IDLOPNRM,SEQ,U),BYTES=5,START=1,TYPE=P                     
*                                                                               
         SEGM  NAME=W6L111,PARENT=W6L101,BYTES=294,PTR=T                        
         FIELD NAME=(IDKR,SEQ,U),BYTES=5,START=1,TYPE=P                         
*                                                                               
         SEGM  NAME=W6L112,PARENT=W6L101,BYTES=191,PTR=T                        
         FIELD NAME=(IDKVAINF,SEQ,U),BYTES=2,START=1,TYPE=P                     
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
