*                                                                               
         DBD   NAME=W6LASA,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=W6LASA01,PARENT=0,SOURCE=((W6G201,,W6G2))                   
         SEGM  NAME=W6LASA11,PARENT=W6LASA01,SOURCE=((W6G210,,W6G2))            
         SEGM  NAME=W6LASA21,PARENT=W6LASA11,SOURCE=((W6G215,,W6G2))            
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
