*                                                                               
         DBD   NAME=W6PLAA,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=W6PLAA01,PARENT=0,SOURCE=((W6G101,,W6G1))                   
         SEGM  NAME=W6PLAA11,PARENT=W6PLAA01,SOURCE=((W6G130,,W6G1))            
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
