*                                                                               
         DBD   NAME=W6PROA,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=W6PROA01,PARENT=0,SOURCE=((W6G101,,W6G1))                   
         SEGM  NAME=W6PROA11,PARENT=W6PROA01,SOURCE=((W6G140,,W6G1))            
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
