*                                                                               
         DBD   NAME=W6UPFB,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=W6UPFB01,PARENT=0,SOURCE=((W6L201,,W6L2))                   
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
