*        LEVERANSANMÄRKNING STATUS                                              
*                                                                               
         DBD   NAME=WDA2A,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDA2AK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDA2A1,PARENT=0,BYTES=51,PTR=T                              
         FIELD NAME=(WDA2A1KY,SEQ,U),BYTES=17,START=1,TYPE=X                    
         FIELD NAME=(KDLEVANM),BYTES=1,START=1,TYPE=X                           
         FIELD NAME=(IDFTG),BYTES=2,START=2,TYPE=X                              
         FIELD NAME=(IDLEVANM),BYTES=14,START=4,TYPE=X                          
         FIELD NAME=(IDDISTR),BYTES=3,START=4,TYPE=P                            
         FIELD NAME=(IDKUNDNR),BYTES=4,START=7,TYPE=P                           
         FIELD NAME=(IDRAPPNR),BYTES=7,START=11,TYPE=X                          
         FIELD NAME=(IDUSERAD),BYTES=8,START=18,TYPE=X                          
         FIELD NAME=(KDLEVATT),BYTES=1,START=26,TYPE=X                          
         FIELD NAME=(BEANST),BYTES=25,START=27,TYPE=X                           
         LCHILD NAME=(WDA201,WDA2),INDEX=WDA2ASEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
