*        LEVERANSANMÄRKNING ILISTA.                                             
*                                                                               
         DBD   NAME=WDA2E,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDA2EK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDA2E1,PARENT=0,BYTES=47,PTR=T                              
         FIELD NAME=(WDA2E1KY,SEQ,U),BYTES=36,START=1,TYPE=X                    
         FIELD NAME=(IDDCRET),BYTES=2,START=1,TYPE=X                            
         FIELD NAME=(IDILIST),BYTES=5,START=3,TYPE=X                            
         FIELD NAME=(ADLAGOMR),BYTES=2,START=8,TYPE=P                           
         FIELD NAME=(ADGANG),BYTES=2,START=10,TYPE=P                            
         FIELD NAME=(ADPLATS),BYTES=3,START=12,TYPE=P                           
         FIELD NAME=(IDLEVANM),BYTES=14,START=15,TYPE=X                         
         FIELD NAME=(IDDISTR),BYTES=3,START=15,TYPE=P                           
         FIELD NAME=(IDKUNDNR),BYTES=4,START=18,TYPE=P                          
         FIELD NAME=(IDRAPPNR),BYTES=7,START=22,TYPE=X                          
         FIELD NAME=(IDARTNR),BYTES=5,START=29,TYPE=X                           
         FIELD NAME=(IDRADNR),BYTES=3,START=34,TYPE=P                           
         LCHILD NAME=(WDA211,WDA2),INDEX=WDA2ESEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
