*        LEVERANSANMÄRKNING RADKÖ                                               
*                                                                               
         DBD   NAME=WDA2B,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDA2BK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDA2B1,PARENT=0,BYTES=62,PTR=T                              
         FIELD NAME=(WDA2B1KY,SEQ,U),BYTES=42,START=1,TYPE=X                    
         FIELD NAME=(IDFTG),BYTES=2,START=1,TYPE=X                              
         FIELD NAME=(KDARBTYP),BYTES=8,START=3,TYPE=X                           
         FIELD NAME=(IDPERSON),BYTES=2,START=11,TYPE=P                          
         FIELD NAME=(DALEVANM),BYTES=8,START=13,TYPE=X                          
         FIELD NAME=(IDLEVANM),BYTES=14,START=21,TYPE=X                         
         FIELD NAME=(IDDISTR),BYTES=3,START=21,TYPE=P                           
         FIELD NAME=(IDKUNDNR),BYTES=4,START=24,TYPE=P                          
         FIELD NAME=(IDRAPPNR),BYTES=7,START=28,TYPE=X                          
         FIELD NAME=(IDARTNR),BYTES=5,START=35,TYPE=P                           
         FIELD NAME=(IDRADNR),BYTES=3,START=40,TYPE=P                           
         FIELD NAME=(KDANMORS),BYTES=2,START=43,TYPE=X                          
         FIELD NAME=(KDKREBEH),BYTES=3,START=49,TYPE=X                          
         LCHILD NAME=(WDA211,WDA2),INDEX=WDA2BSEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
