*        RETUR REG, IDRT-TRANSIT INGÅNG                                         
*                                                                               
         DBD   NAME=WDA3I,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDA3IK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDA3I1,PARENT=0,BYTES=26,PTR=T                              
         FIELD NAME=(WDA3I1KY,SEQ,U),BYTES=24,START=1,TYPE=X                    
         FIELD NAME=(IDRTTR),BYTES=3,START=1,TYPE=X                             
         FIELD NAME=(KDRETSTA),BYTES=1,START=4,TYPE=X                           
         FIELD NAME=(DAREGDAT),BYTES=8,START=5,TYPE=X                           
         FIELD NAME=(TIKLOCK),BYTES=5,START=13,TYPE=P                           
         FIELD NAME=(IDDISTR),BYTES=3,START=18,TYPE=P                           
         FIELD NAME=(IDKUNDNR),BYTES=4,START=21,TYPE=P                          
         FIELD NAME=(IDDC),BYTES=2,START=25,TYPE=X                              
         LCHILD NAME=(WDA301,WDA3),INDEX=WDA3ISEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
