*        RETUR REG, EJ ANKOMNA SÄNDNINGAR                                       
*                                                                               
         DBD   NAME=WDA3C,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDA3CK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDA3C1,PARENT=0,BYTES=44,PTR=T                              
         FIELD NAME=(WDA3C1KY,SEQ,U),BYTES=44,START=1,TYPE=X                    
         FIELD NAME=(IDDC),BYTES=2,START=1,TYPE=X                               
         FIELD NAME=(KDRETSTA),BYTES=1,START=3,TYPE=X                           
         FIELD NAME=(DARETANK),BYTES=8,START=5,TYPE=X                           
         FIELD NAME=(IDRT),BYTES=3,START=12,TYPE=X                              
         FIELD NAME=(IDRTLOP),BYTES=3,START=15,TYPE=X                           
         FIELD NAME=(IDDISTR),BYTES=3,START=18,TYPE=P                           
         FIELD NAME=(IDKUNDNR),BYTES=4,START=21,TYPE=P                          
         FIELD NAME=(IDRAPPNR),BYTES=7,START=25,TYPE=X                          
         FIELD NAME=(DAREGDAT),BYTES=8,START=32,TYPE=X                          
         FIELD NAME=(TIKLOCK),BYTES=5,START=40,TYPE=P                           
         LCHILD NAME=(WDA301,WDA3),INDEX=WDA3CSEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
