*        BUY BACK REGISTER                                                      
*                                                                               
         DBD   NAME=WDA4,RMNAME=(V12008,4,900),                        *        
               ACCESS=(HDAM,OSAM)                                               
         DATASET DD1=WDA4V,DEVICE=3390,SIZE=16384,SCAN=0                        
*                                                                               
         SEGM  NAME=WDA401,PARENT=0,BYTES=38,PTR=T                              
         FIELD NAME=(WDA401KY,SEQ,U),BYTES=10,START=1,TYPE=X                    
         FIELD NAME=IDDISTR,BYTES=3,START=1,TYPE=P                              
         FIELD NAME=IDRAPPNR,BYTES=7,START=4,TYPE=X                             
         FIELD NAME=SUMINVD,BYTES=2,START=20,TYPE=P                             
*                                                                               
         SEGM  NAME=WDA411,PARENT=WDA401,BYTES=71,PTR=T                         
         FIELD NAME=(WDA411KY,SEQ,U),BYTES=7,START=1,TYPE=X                     
         FIELD NAME=FLMATCH,BYTES=1,START=1,TYPE=X                              
         FIELD NAME=FLPRGRNS,BYTES=1,START=2,TYPE=X                             
         FIELD NAME=IDARTNR,BYTES=5,START=3,TYPE=P                              
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
