*        RESTORDER-REGISTER INDEX=GODSMOTTAGARE                                 
*                                                                               
         DBD   NAME=WDA5B,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDA5BK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDA5B1,PARENT=0,BYTES=145                                   
         FIELD NAME=(WDA5B1KY,SEQ,U),BYTES=26,START=1,TYPE=X                    
         FIELD NAME=(IDDISTR),BYTES=3,START=1,TYPE=P                            
         FIELD NAME=(IDKUNDNR),BYTES=4,START=4,TYPE=P                           
         FIELD NAME=(IDDC),BYTES=2,START=8,TYPE=X                               
         FIELD NAME=(IDARTNR),BYTES=5,START=10,TYPE=P                           
         FIELD NAME=(IDKUNDRF),BYTES=10,START=15,TYPE=X                         
         FIELD NAME=(IDLOPNR),BYTES=2,START=25,TYPE=P                           
         FIELD NAME=(KDORDKL),BYTES=1,START=61,TYPE=P                           
         FIELD NAME=(KDPRODSL),BYTES=2,START=62,TYPE=P                          
         FIELD NAME=(KDTPOTYP),BYTES=1,START=68,TYPE=P                          
         LCHILD NAME=(WDA501,WDA5),INDEX=WDA5BSEQ,PTR=SYMB                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
