*        RESTORDER-REGISTER + TPO                                               
*                                                                               
         DBD   NAME=WDA5,                                              *        
               ACCESS=(HISAM,VSAM)                                              
         DATASET DD1=WDA5K,DEVICE=3390,SIZE=4096                                
*                                                                               
         SEGM  NAME=WDA501,PARENT=0,BYTES=327                                   
         FIELD NAME=(WDA501KY,SEQ,U),BYTES=24,START=1,TYPE=X                    
         FIELD NAME=(IDGMTREF),BYTES=17,START=1,TYPE=X                          
         FIELD NAME=(IDDISTR),BYTES=3,START=1,TYPE=P                            
         FIELD NAME=(IDKUNDNR),BYTES=4,START=4,TYPE=P                           
         FIELD NAME=(IDKUNDRF),BYTES=10,START=8,TYPE=X                          
         FIELD NAME=(IDARTNR),BYTES=5,START=18,TYPE=P                           
         FIELD NAME=(IDLOPNR),BYTES=2,START=23,TYPE=P                           
         FIELD NAME=(FILLERB1),BYTES=31,START=35,TYPE=X                         
         FIELD NAME=(IDANSK),BYTES=2,START=36,TYPE=P                            
         FIELD NAME=(IDANALYS),BYTES=12,START=38,TYPE=X                         
         FIELD NAME=(IDKONTO),BYTES=6,START=50,TYPE=P                           
         FIELD NAME=(IDKST),BYTES=10,START=56,TYPE=X                            
         FIELD NAME=(IDKNDRFL),BYTES=10,START=66,TYPE=X                         
         FIELD NAME=(IDDC),BYTES=2,START=76,TYPE=X                              
         FIELD NAME=(FILLERB2),BYTES=3,START=81,TYPE=X                          
         FIELD NAME=(FILLERB3),BYTES=61,START=88,TYPE=X                         
         FIELD NAME=(KDORDKL),BYTES=1,START=88,TYPE=P                           
         FIELD NAME=(KDPRODSL),BYTES=2,START=89,TYPE=P                          
         FIELD NAME=(KDRAPRIO),BYTES=2,START=91,TYPE=P                          
         FIELD NAME=(KDROO),BYTES=1,START=93,TYPE=P                             
         FIELD NAME=(FILLERB4),BYTES=6,START=94,TYPE=X                          
         FIELD NAME=(KDSTARAD),BYTES=1,START=94,TYPE=X                          
         FIELD NAME=(KDTPOTYP),BYTES=1,START=95,TYPE=P                          
         FIELD NAME=(KVART),BYTES=4,START=96,TYPE=P                             
         FIELD NAME=(DARODAT),BYTES=8,START=123,TYPE=X                          
         FIELD NAME=(TITPO),BYTES=4,START=131,TYPE=P                            
         FIELD NAME=(FLTPOBEK),BYTES=1,START=148,TYPE=X                         
         FIELD NAME=(IDSYSTEM),BYTES=4,START=173,TYPE=X                         
         FIELD NAME=(IDSYSTX3),BYTES=3,START=173,TYPE=X                         
         FIELD NAME=(TIREGTID),BYTES=4,START=181,TYPE=P                         
         FIELD NAME=(DASENBEK),BYTES=14,START=185,TYPE=X                        
         FIELD NAME=(KDORDTYP),BYTES=2,START=258,TYPE=X                         
         FIELD NAME=(TIREPDAT),BYTES=4,START=270,TYPE=P                         
         LCHILD NAME=(WDA5A1,WDA5A),PTR=SYMB                                    
         XDFLD NAME=WDA5ASEQ,SEGMENT=WDA501,                           *        
               SRCH=(IDARTNR,IDDC,KDRAPRIO),                           *        
               SUBSEQ=(DARODAT,TIREGTID,IDGMTREF,IDLOPNR),             *        
               DDATA=(FILLERB4,KDORDKL,IDSYSTEM,KDORDTYP,TIREPDAT)              
         LCHILD NAME=(WDA5B1,WDA5B),PTR=SYMB                                    
         XDFLD NAME=WDA5BSEQ,SEGMENT=WDA501,                           *        
               SRCH=(IDDISTR,IDKUNDNR,IDDC),                           *        
               SUBSEQ=(IDARTNR,IDKUNDRF,IDLOPNR),                      *        
               DDATA=(FILLERB1,FILLERB2,FILLERB3),                     *        
               EXTRTN=WDA5BEXT                                                  
*                                                                               
* EXIT FINNS NÄR KDSTARAD = 3                                                   
*                                                                               
         LCHILD NAME=(WDA5C1,WDA5C),PTR=SYMB                                    
         XDFLD NAME=WDA5CSEQ,SEGMENT=WDA501,                           *        
               SRCH=(IDANSK,KDROO),                                    *        
               SUBSEQ=(IDARTNR,IDDISTR,IDKUNDNR,IDKUNDRF,IDLOPNR),     *        
               DDATA=(KDSTARAD,KDTPOTYP)                                        
         LCHILD NAME=(WDA5D1,WDA5D),PTR=SYMB                                    
         XDFLD NAME=WDA5DSEQ,SEGMENT=WDA501,                           *        
               SRCH=(IDDISTR,IDKUNDNR),                                *        
               SUBSEQ=(IDARTNR,IDKUNDRF,IDLOPNR),                      *        
               DDATA=(IDDC,KDORDKL,KDPRODSL,KDSTARAD,KDTPOTYP)                  
         LCHILD NAME=(WDA5E1,WDA5E),PTR=SYMB                                    
         XDFLD NAME=WDA5ESEQ,SEGMENT=WDA501,                           *        
               SRCH=(DASENBEK),                                        *        
               SUBSEQ=(IDGMTREF,IDARTNR,IDLOPNR),                      *        
               EXTRTN=WDA5EEXT                                                  
*                                                                               
* EXIT FINNS NÄR KDSTARAD = 1 OCH KDTPOTYP = 2 EL 6 OCH FLTPOBEK = N            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
