*        VOR REGISTER SEC INDEX                                                 
*                                                                               
         DBD   NAME=WDA6L,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDA6LK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDA6L1,PARENT=0,BYTES=14,PTR=T                              
         FIELD NAME=(WDA6L1KY,SEQ,U),BYTES=14,START=1,TYPE=X                    
         FIELD NAME=(IDLEVNR),BYTES=5,START=1,TYPE=X                            
         FIELD NAME=(TIREGDA9),BYTES=4,START=6,TYPE=P                           
         FIELD NAME=(TIREGTI9),BYTES=5,START=10,TYPE=P                          
         LCHILD NAME=(WDA601,WDA6),INDEX=WDA6LSEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
