*        VOR REGISTER SEC INDEX                                                 
*                                                                               
         DBD   NAME=WDA6H,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDA6HK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDA6H1,PARENT=0,BYTES=17,PTR=T                              
         FIELD NAME=(WDA6H1KY,SEQ,U),BYTES=17,START=1,TYPE=X                    
         FIELD NAME=(IDDISTR),BYTES=3,START=1,TYPE=P                            
         FIELD NAME=(IDARTNR),BYTES=5,START=4,TYPE=P                            
         FIELD NAME=(TIREGDA9),BYTES=4,START=9,TYPE=P                           
         FIELD NAME=(TIREGTI9),BYTES=5,START=13,TYPE=P                          
         LCHILD NAME=(WDA601,WDA6),INDEX=WDA6HSEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
