*        VOR REGISTER SEC INDEX                                                 
*                                                                               
         DBD   NAME=WDA6K,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDA6KK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDA6K1,PARENT=0,BYTES=16,PTR=T                              
         FIELD NAME=(WDA6K1KY,SEQ,U),BYTES=16,START=1,TYPE=X                    
         FIELD NAME=(IDANSK),BYTES=2,START=1,TYPE=P                             
         FIELD NAME=(IDLEVNR),BYTES=5,START=3,TYPE=X                            
         FIELD NAME=(TIREGDA9),BYTES=4,START=8,TYPE=P                           
         FIELD NAME=(TIREGTI9),BYTES=5,START=12,TYPE=P                          
         LCHILD NAME=(WDA601,WDA6),INDEX=WDA6KSEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
