*        VOR REGISTER                                                           
*                                                                               
         DBD   NAME=WDA6,RMNAME=(V12008,4,72000),                      *        
               ACCESS=(HDAM,OSAM)                                               
         DATASET DD1=WDA6V,DEVICE=3390,SIZE=4096,SCAN=0                         
*                                                                               
         SEGM  NAME=WDA601,PARENT=0,BYTES=225,PTR=T                             
         FIELD NAME=(WDA601KY,SEQ,U),BYTES=40,START=1,TYPE=X                    
         FIELD NAME=(IDDISTR),BYTES=3,START=1,TYPE=P                            
         FIELD NAME=(IDKUNDNR),BYTES=4,START=4,TYPE=P                           
         FIELD NAME=(FILLERA),BYTES=7,START=1,TYPE=X                            
         FIELD NAME=(IDKUNDRF),BYTES=10,START=8,TYPE=X                          
         FIELD NAME=(TIREGDAT),BYTES=4,START=18,TYPE=P                          
         FIELD NAME=(IDARTNR),BYTES=5,START=22,TYPE=P                           
         FIELD NAME=(TIREGTID),BYTES=5,START=27,TYPE=P                          
         FIELD NAME=(TIREGDAV),BYTES=4,START=32,TYPE=P                          
         FIELD NAME=(TIREGTIV),BYTES=5,START=36,TYPE=P                          
         FIELD NAME=(FILLERB),BYTES=9,START=32,TYPE=X                           
         FIELD NAME=(TIREGDA9),BYTES=4,START=41,TYPE=P                          
         FIELD NAME=(TIREGTI9),BYTES=5,START=45,TYPE=P                          
         FIELD NAME=(IDKUNDRL),BYTES=10,START=50,TYPE=X                         
         FIELD NAME=(TIREGDAL),BYTES=4,START=60,TYPE=P                          
         FIELD NAME=(FILLERC),BYTES=14,START=50,TYPE=X                          
         FIELD NAME=(TIREGTIL),BYTES=5,START=64,TYPE=P                          
         FIELD NAME=(IDROLL),BYTES=5,START=69,TYPE=X                            
         FIELD NAME=(IDANSK),BYTES=2,START=74,TYPE=P                            
         FIELD NAME=(IDLEVNR),BYTES=5,START=76,TYPE=X                           
         FIELD NAME=(IDUSER),BYTES=8,START=109,TYPE=X                           
         FIELD NAME=(KDVORATG),BYTES=1,START=120,TYPE=X                         
         LCHILD NAME=(WDA6A1,WDA6A),PTR=INDX                                    
         XDFLD NAME=WDA6ASEQ,SEGMENT=WDA601,                           *        
               SRCH=(WDA601KY)                                                  
*                                                                               
         LCHILD NAME=(WDA6B1,WDA6B),PTR=INDX                                    
         XDFLD NAME=WDA6BSEQ,SEGMENT=WDA601,                           *        
               SRCH=(FILLERA,FILLERC,IDARTNR,TIREGTIL,FILLERB),        *        
               EXTRTN=WDA6BEXT                                                  
*                                                                               
         LCHILD NAME=(WDA6C1,WDA6C),PTR=INDX                                    
         XDFLD NAME=WDA6CSEQ,SEGMENT=WDA601,                           *        
               SRCH=(IDROLL,TIREGDA9,TIREGTI9),                        *        
               EXTRTN=WDA6CEXT                                                  
*                                                                               
         LCHILD NAME=(WDA6D1,WDA6D),PTR=INDX                                    
         XDFLD NAME=WDA6DSEQ,SEGMENT=WDA601,                           *        
               SRCH=(IDROLL,IDARTNR,TIREGDA9,TIREGTI9),                *        
               EXTRTN=WDA6CEXT                                                  
*                                                                               
         LCHILD NAME=(WDA6E1,WDA6E),PTR=INDX                                    
         XDFLD NAME=WDA6ESEQ,SEGMENT=WDA601,                           *        
               SRCH=(IDDISTR,TIREGDA9,TIREGTI9),                       *        
               EXTRTN=WDA6CEXT                                                  
*                                                                               
         LCHILD NAME=(WDA6F1,WDA6F),PTR=INDX                                    
         XDFLD NAME=WDA6FSEQ,SEGMENT=WDA601,                           *        
               SRCH=(IDDISTR,IDKUNDNR,TIREGDA9,TIREGTI9),              *        
               EXTRTN=WDA6CEXT,DDATA=(IDUSER,KDVORATG,IDKUNDRF)                 
*                                                                               
         LCHILD NAME=(WDA6G1,WDA6G),PTR=INDX                                    
         XDFLD NAME=WDA6GSEQ,SEGMENT=WDA601,                           *        
               SRCH=(IDDISTR,IDKUNDNR,IDARTNR,TIREGDA9,TIREGTI9),      *        
               EXTRTN=WDA6CEXT                                                  
*                                                                               
         LCHILD NAME=(WDA6H1,WDA6H),PTR=INDX                                    
         XDFLD NAME=WDA6HSEQ,SEGMENT=WDA601,                           *        
               SRCH=(IDDISTR,IDARTNR,TIREGDA9,TIREGTI9),               *        
               EXTRTN=WDA6CEXT                                                  
*                                                                               
         LCHILD NAME=(WDA6I1,WDA6I),PTR=INDX                                    
         XDFLD NAME=WDA6ISEQ,SEGMENT=WDA601,                           *        
               SRCH=(IDANSK,TIREGDA9,TIREGTI9),                        *        
               EXTRTN=WDA6CEXT                                                  
*                                                                               
         LCHILD NAME=(WDA6J1,WDA6J),PTR=INDX                                    
         XDFLD NAME=WDA6JSEQ,SEGMENT=WDA601,                           *        
               SRCH=(IDARTNR,TIREGDA9,TIREGTI9),                       *        
               EXTRTN=WDA6CEXT                                                  
*                                                                               
         LCHILD NAME=(WDA6K1,WDA6K),PTR=INDX                                    
         XDFLD NAME=WDA6KSEQ,SEGMENT=WDA601,                           *        
               SRCH=(IDANSK,IDLEVNR,TIREGDA9,TIREGTI9),                *        
               EXTRTN=WDA6CEXT                                                  
*                                                                               
         LCHILD NAME=(WDA6L1,WDA6L),PTR=INDX                                    
         XDFLD NAME=WDA6LSEQ,SEGMENT=WDA601,                           *        
               SRCH=(IDLEVNR,TIREGDA9,TIREGTI9),                       *        
               EXTRTN=WDA6CEXT                                                  
*                                                                               
         LCHILD NAME=(WDA6M1,WDA6M),PTR=INDX                                    
         XDFLD NAME=WDA6MSEQ,SEGMENT=WDA601,                           *        
               SRCH=(TIREGDAT,TIREGTID,IDARTNR),                       *        
               EXTRTN=WDA6CEXT                                                  
*                                                                               
* EXIT FINNS NÄR KDVORATG = 0, 1                                                
*                                                                               
         SEGM  NAME=WDA611,PARENT=WDA601,BYTES=231,PTR=T                        
         FIELD NAME=(KDSEGKEY,SEQ,U),BYTES=1,START=1,TYPE=X                     
*                                                                               
         SEGM  NAME=WDA612,PARENT=WDA601,BYTES=312,PTR=T                        
         FIELD NAME=(KDSEGKEY,SEQ,U),BYTES=1,START=1,TYPE=X                     
*                                                                               
         SEGM  NAME=WDA613,PARENT=WDA601,BYTES=312,PTR=T                        
         FIELD NAME=(KDSEGKEY,SEQ,U),BYTES=1,START=1,TYPE=X                     
*                                                                               
         SEGM  NAME=WDA614,PARENT=WDA601,BYTES=311,PTR=T                        
         FIELD NAME=(KDSEGKEY,SEQ,U),BYTES=1,START=1,TYPE=X                     
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
