*        VOR REGISTER SEC INDEX                                                 
*                                                                               
         DBD   NAME=WDA6B,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDA6BK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDA6B1,PARENT=0,BYTES=40,PTR=T                              
         FIELD NAME=(WDA6B1KY,SEQ,U),BYTES=40,START=1,TYPE=X                    
         FIELD NAME=(IDDISTR),BYTES=3,START=1,TYPE=P                            
         FIELD NAME=(IDKUNDNR),BYTES=4,START=4,TYPE=P                           
         FIELD NAME=(IDKUNDRL),BYTES=10,START=8,TYPE=X                          
         FIELD NAME=(TIREGDAL),BYTES=4,START=18,TYPE=P                          
         FIELD NAME=(IDARTNR),BYTES=5,START=22,TYPE=P                           
         FIELD NAME=(TIREGTIL),BYTES=5,START=27,TYPE=P                          
         FIELD NAME=(TIREGDAV),BYTES=4,START=32,TYPE=P                          
         FIELD NAME=(TIREGTIV),BYTES=5,START=36,TYPE=P                          
         LCHILD NAME=(WDA601,WDA6),INDEX=WDA6BSEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
