*        VOR REGISTER SEC INDEX                                                 
*                                                                               
         DBD   NAME=WDA6F,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDA6FK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDA6F1,PARENT=0,BYTES=35,PTR=T                              
         FIELD NAME=(WDA6F1KY,SEQ,U),BYTES=16,START=1,TYPE=X                    
         FIELD NAME=(IDDISTR),BYTES=3,START=1,TYPE=P                            
         FIELD NAME=(IDKUNDNR),BYTES=4,START=4,TYPE=P                           
         FIELD NAME=(TIREGDA9),BYTES=4,START=8,TYPE=P                           
         FIELD NAME=(TIREGTI9),BYTES=5,START=12,TYPE=P                          
         FIELD NAME=(IDUSER),BYTES=8,START=17,TYPE=P                            
         FIELD NAME=(KDVORATG),BYTES=1,START=25,TYPE=P                          
         FIELD NAME=(IDKUNDRF),BYTES=10,START=26,TYPE=X                         
         LCHILD NAME=(WDA601,WDA6),INDEX=WDA6FSEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
