*        VOR REGISTER SEC INDEX                                                 
*                                                                               
         DBD   NAME=WDA6G,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDA6GK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDA6G1,PARENT=0,BYTES=21,PTR=T                              
         FIELD NAME=(WDA6G1KY,SEQ,U),BYTES=21,START=1,TYPE=X                    
         FIELD NAME=(IDDISTR),BYTES=3,START=1,TYPE=P                            
         FIELD NAME=(IDKUNDNR),BYTES=4,START=4,TYPE=P                           
         FIELD NAME=(IDARTNR),BYTES=5,START=8,TYPE=P                            
         FIELD NAME=(TIREGDA9),BYTES=4,START=13,TYPE=P                          
         FIELD NAME=(TIREGTI9),BYTES=5,START=17,TYPE=P                          
         LCHILD NAME=(WDA601,WDA6),INDEX=WDA6GSEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
