*        VOR REGISTER SEC INDEX                                                 
*                                                                               
         DBD   NAME=WDA6M,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDA6MK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDA6M1,PARENT=0,BYTES=14,PTR=T                              
         FIELD NAME=(WDA6M1KY,SEQ,U),BYTES=14,START=1,TYPE=X                    
         FIELD NAME=(TIREGDAT),BYTES=4,START=1,TYPE=P                           
         FIELD NAME=(TIREGTID),BYTES=5,START=5,TYPE=P                           
         FIELD NAME=(IDARTNR),BYTES=5,START=10,TYPE=P                           
         LCHILD NAME=(WDA601,WDA6),INDEX=WDA6MSEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
