*        VOR REGISTER SEC INDEX                                                 
*                                                                               
         DBD   NAME=WDA6I,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDA6IK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDA6I1,PARENT=0,BYTES=11,PTR=T                              
         FIELD NAME=(WDA6I1KY,SEQ,U),BYTES=11,START=1,TYPE=X                    
         FIELD NAME=(IDANSK),BYTES=2,START=1,TYPE=P                             
         FIELD NAME=(TIREGDA9),BYTES=4,START=3,TYPE=P                           
         FIELD NAME=(TIREGTI9),BYTES=5,START=7,TYPE=P                           
         LCHILD NAME=(WDA601,WDA6),INDEX=WDA6ISEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
