*        RETUR SPÄRRAR BESORTRT INGÅNG                                          
*                                                                               
         DBD   NAME=WDA8B,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDA8BK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDA8B1,PARENT=0,BYTES=20,PTR=T                              
         FIELD NAME=(BESORTRT,SEQ,U),BYTES=20,START=1,TYPE=X                    
         LCHILD NAME=(WDA801,WDA8),INDEX=WDA8BSEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
