*        RETUR SPÄRRAR                                                          
*                                                                               
         DBD   NAME=WDA8,RMNAME=(V12008,,1800),                        *        
               ACCESS=(HDAM,OSAM)                                               
         DATASET DD1=WDA8V,DEVICE=3390,SIZE=4096,SCAN=0                         
*                                                                               
         SEGM  NAME=WDA801,PARENT=0,BYTES=62,PTR=T                              
         FIELD NAME=(BESORTRT,SEQ,U),BYTES=20,START=1,TYPE=X                    
         LCHILD NAME=(WDA8B1,WDA8B),PTR=INDX                                    
         XDFLD NAME=WDA8BSEQ,SEGMENT=WDA801,                           *        
               SRCH=(BESORTRT)                                                  
*                                                                               
         SEGM  NAME=WDA811,PARENT=WDA801,BYTES=32,PTR=T                         
         FIELD NAME=(WDA811KY,SEQ,U),BYTES=32,START=1,TYPE=X                    
         FIELD NAME=TEELMT,BYTES=16,START=1,TYPE=X                              
         FIELD NAME=IDELMT,BYTES=16,START=17,TYPE=X                             
         FIELD NAME=(/CKBESOR),BYTES=20,START=1,TYPE=X                          
         LCHILD NAME=(WDA8A1,WDA8A),PTR=INDX                                    
         XDFLD NAME=WDA8ASEQ,SEGMENT=WDA811,                           *        
               SRCH=(TEELMT,IDELMT),                                   *        
               SUBSEQ=(/CKBESOR)                                                
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
