*        RETUR SPÄRRAR TEELMT INGÅNG                                            
*                                                                               
         DBD   NAME=WDA8A,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDA8AK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDA8A1,PARENT=0,BYTES=52,PTR=T                              
         FIELD NAME=(WDA8A1KY,SEQ,U),BYTES=52,START=1,TYPE=X                    
         FIELD NAME=(TEELMT),BYTES=16,START=1,TYPE=X                            
         FIELD NAME=(IDELMT),BYTES=16,START=17,TYPE=X                           
         FIELD NAME=(BESORTRT),BYTES=20,START=33,TYPE=X                         
         LCHILD NAME=(WDA811,WDA8),INDEX=WDA8ASEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
