*        BYTES UPPFÖLJNING DUSTRIKT                                             
*                                                                               
         DBD   NAME=WDA9B,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDA9BK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDA9B1,PARENT=0,BYTES=8,PTR=T                               
         FIELD NAME=(WDA9B1KY,SEQ,U),BYTES=8,START=1,TYPE=X                     
         FIELD NAME=(IDFNKGRP),BYTES=3,START=1,TYPE=P                           
         FIELD NAME=(IDARTNR),BYTES=5,START=4,TYPE=P                            
         LCHILD NAME=(WDA901,WDA9),INDEX=WDA9BSEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
