*        KUNDREGISTER BETALARE                                                  
*                                                                               
         DBD   NAME=WDB1,                                              *        
               ACCESS=(HISAM,VSAM)                                              
         DATASET DD1=WDB1K,DEVICE=3390,SIZE=4096                                
*                                                                               
         SEGM  NAME=WDB101,PARENT=0,BYTES=290                                   
         FIELD NAME=(WDB101KY,SEQ,U),BYTES=11,START=1,TYPE=X                    
         FIELD NAME=(IDPARTNR),BYTES=9,START=1,TYPE=X                           
         FIELD NAME=(IDFTG),BYTES=2,START=10,TYPE=X                             
         FIELD NAME=(IDLANDX2),BYTES=2,START=12,TYPE=X                          
         FIELD NAME=(IDPROMR),BYTES=3,START=66,TYPE=X                           
         FIELD NAME=(IDMARKBO),BYTES=1,START=66,TYPE=X                          
         FIELD NAME=(BEBETRAD),BYTES=35,START=174,TYPE=X                        
         LCHILD NAME=(WDB1A1,WDB1A),PTR=SYMB                                    
         XDFLD NAME=WDB1ASEQ,SEGMENT=WDB101,                           *        
               SRCH=(IDPROMR),                                         *        
               SUBSEQ=(IDPARTNR,IDFTG)                                          
         LCHILD NAME=(WDB1B1,WDB1B),PTR=SYMB                                    
         XDFLD NAME=WDB1BSEQ,SEGMENT=WDB101,                           *        
               SRCH=(IDLANDX2),                                        *        
               SUBSEQ=(IDMARKBO,IDPARTNR,IDFTG),DDATA=(BEBETRAD)                
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
