*        KUNDREGISTER BETALARE SEC. IND. PRISOMRÅDE                             
*                                                                               
         DBD   NAME=WDB1B,                                             *        
               ACCESS=(INDEX,VSAM)                                              
         DATASET DD1=WDB1BK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDB1B1,PARENT=0,BYTES=60                                    
         FIELD NAME=(WDB1B1KY,SEQ,U),BYTES=14,START=1,TYPE=X                    
         FIELD NAME=(IDLANDX2),BYTES=2,START=1,TYPE=X                           
         FIELD NAME=(IDMARKBO),BYTES=1,START=3,TYPE=X                           
         FIELD NAME=(IDPARTNR),BYTES=9,START=4,TYPE=X                           
         FIELD NAME=(IDFTG),BYTES=2,START=13,TYPE=X                             
         LCHILD NAME=(WDB101,WDB1),INDEX=WDB1BSEQ,PTR=SYMB                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
