*        KUNDREGISTER BETALARE SEC. IND. PRISOMRÅDE                             
*                                                                               
         DBD   NAME=WDB1A,                                             *        
               ACCESS=(INDEX,VSAM)                                              
         DATASET DD1=WDB1AK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDB1A1,PARENT=0,BYTES=25                                    
         FIELD NAME=(WDB1A1KY,SEQ,U),BYTES=14,START=1,TYPE=X                    
         FIELD NAME=(IDPROMR),BYTES=3,START=1,TYPE=X                            
         FIELD NAME=(IDPARTNR),BYTES=9,START=4,TYPE=X                           
         FIELD NAME=(IDFTG),BYTES=2,START=13,TYPE=X                             
         LCHILD NAME=(WDB101,WDB1),INDEX=WDB1ASEQ,PTR=SYMB                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
