*        KUNDREGISTER SEC. IND. BETALARE                                        
*                                                                               
         DBD   NAME=WDB2B,                                             *        
               ACCESS=(INDEX,VSAM)                                              
         DATASET DD1=WDB2BK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDB2B1,PARENT=0,BYTES=19                                    
         FIELD NAME=(WDB2B1KY,SEQ,U),BYTES=12,START=1,TYPE=X                    
         FIELD NAME=(IDLEVNR),BYTES=5,START=1,TYPE=X                            
         FIELD NAME=(IDDISTR),BYTES=3,START=6,TYPE=P                            
         FIELD NAME=(IDKUNDNR),BYTES=4,START=9,TYPE=P                           
         LCHILD NAME=(WDB201,WDB2),INDEX=WDB2BSEQ,PTR=SYMB                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
