*        KUNDREGISTER SEC. IND. BETALARE                                        
*                                                                               
         DBD   NAME=WDB2A,                                             *        
               ACCESS=(INDEX,VSAM)                                              
         DATASET DD1=WDB2AK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDB2A1,PARENT=0,BYTES=25                                    
         FIELD NAME=(WDB2A1KY,SEQ,U),BYTES=18,START=1,TYPE=X                    
         FIELD NAME=(IDPARTNR),BYTES=9,START=1,TYPE=X                           
         FIELD NAME=(IDFTG),BYTES=2,START=10,TYPE=X                             
         FIELD NAME=(IDDISTR),BYTES=3,START=12,TYPE=P                           
         FIELD NAME=(IDKUNDNR),BYTES=4,START=15,TYPE=P                          
         LCHILD NAME=(WDB201,WDB2),INDEX=WDB2ASEQ,PTR=SYMB                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
