*        KUNDREGISTER FRAKTKOD-GODAMOTTAGARE                                    
*                                                                               
         DBD   NAME=WDB5,                                              *        
               ACCESS=(HISAM,VSAM)                                              
         DATASET DD1=WDB5K,DEVICE=3390,SIZE=4096                                
*                                                                               
         SEGM  NAME=WDB501,PARENT=0,BYTES=110,PTR=T                             
         FIELD NAME=(WDB501KY,SEQ,U),BYTES=11,START=1,TYPE=X                    
         FIELD NAME=(IDDC),BYTES=2,START=1,TYPE=X                               
         FIELD NAME=(IDFRAKT),BYTES=2,START=3,TYPE=P                            
         FIELD NAME=(IDGMT),BYTES=7,START=5,TYPE=X                              
         FIELD NAME=(IDDISTR),BYTES=3,START=5,TYPE=P                            
         FIELD NAME=(IDKUNDNR),BYTES=4,START=8,TYPE=P                           
         FIELD NAME=(KDFKTYP),BYTES=1,START=99,TYPE=X                           
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
