*        DC STYRPARAMETRAR                                                      
                                                                                
         DBD   NAME=WDB6,RMNAME=(V12008,1,315),                        *        
               ACCESS=(HDAM,OSAM)                                               
         DATASET DD1=WDB6V,DEVICE=3390,SIZE=2048,SCAN=0                         
*                                                                               
         SEGM  NAME=WDB601,PARENT=0,BYTES=657,PTR=T                             
         FIELD NAME=(IDDC,SEQ,U),BYTES=2,START=1,TYPE=X                         
         FIELD NAME=(IDFTG),BYTES=2,START=339,TYPE=X                            
         FIELD NAME=(IDLEVNDC),BYTES=5,START=357,TYPE=X                         
         FIELD NAME=(FLMAINDC),BYTES=1,START=559,TYPE=X                         
         FIELD NAME=(IDLEGSEL),BYTES=4,START=571,TYPE=X                         
         FIELD NAME=(KDTRADP),BYTES=4,START=575,TYPE=X                          
         LCHILD NAME=(WDB6A1,WDB6A),PTR=INDX                                    
         XDFLD NAME=WDB6ASEQ,SEGMENT=WDB601,                           *        
               SRCH=(IDDC)                                                      
*                                                                               
         SEGM  NAME=WDB611,PARENT=WDB601,BYTES=36,PTR=T                         
         FIELD NAME=(WDB611KY,SEQ,U),BYTES=36,START=1,TYPE=X                    
         FIELD NAME=(TEELMT),BYTES=16,START=1,TYPE=X                            
         FIELD NAME=(IDELMTGR),BYTES=20,START=17,TYPE=X                         
*                                                                               
         SEGM  NAME=WDB612,PARENT=WDB601,BYTES=15,PTR=T                         
         FIELD NAME=(IDPRC,SEQ,U),BYTES=4,START=1,TYPE=X                        
*                                                                               
         SEGM  NAME=WDB613,PARENT=WDB601,BYTES=41,PTR=T                         
         FIELD NAME=(WDB613KY,SEQ,U),BYTES=23,START=1,TYPE=X                    
*                                                                               
         SEGM  NAME=WDB614,PARENT=WDB601,BYTES=45,PTR=T                         
         FIELD NAME=(WDB614KY,SEQ,U),BYTES=25,START=1,TYPE=X                    
*                                                                               
         SEGM  NAME=WDB615,PARENT=WDB601,BYTES=20,PTR=T                         
         FIELD NAME=(WDB615KY,SEQ,U),BYTES=6,START=1,TYPE=X                     
         FIELD NAME=(IDTRANS),BYTES=4,START=1,TYPE=X                            
         FIELD NAME=(IDDCREF),BYTES=2,START=5,TYPE=X                            
*                                                                               
         SEGM  NAME=WDB616,PARENT=WDB601,BYTES=170,PTR=T                        
         FIELD NAME=(IDDCREF,SEQ,U),BYTES=2,START=1,TYPE=X                      
*                                                                               
         SEGM  NAME=WDB617,PARENT=WDB601,BYTES=59,PTR=T                         
         FIELD NAME=(KDSEGKEY,SEQ,U),BYTES=1,START=1,TYPE=X                     
*                                                                               
         SEGM  NAME=WDB621,PARENT=WDB617,BYTES=26,PTR=T                         
         FIELD NAME=(KDPRODSL,SEQ,U),BYTES=2,START=1,TYPE=P                     
*                                                                               
         SEGM  NAME=WDB622,PARENT=WDB617,BYTES=51,PTR=T                         
         FIELD NAME=(IDFKNGRP,SEQ,U),BYTES=3,START=1,TYPE=P                     
*                                                                               
         SEGM  NAME=WDB618,PARENT=WDB601,BYTES=73,PTR=T                         
         FIELD NAME=(KDPROGOI,SEQ,U),BYTES=1,START=1,TYPE=X                     
*                                                                               
         SEGM  NAME=WDB619,PARENT=WDB601,BYTES=04,PTR=T                         
         FIELD NAME=(IDPERSBU,SEQ,U),BYTES=2,START=1,TYPE=P                     
*                                                                               
         SEGM  NAME=WDB629,PARENT=WDB619,BYTES=35,PTR=NT                        
*                                                                               
         SEGM  NAME=WDB602,PARENT=WDB601,BYTES=175,PTR=NT                       
*                                                                               
         SEGM  NAME=WDB603,PARENT=WDB601,BYTES=11,PTR=T                         
         FIELD NAME=(KDANSKSG,SEQ,U),BYTES=3,START=1,TYPE=P                     
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
