*        KUNDREGISTER DEALER INFO                                               
*                                                                               
         DBD   NAME=WDB7,                                              *        
               ACCESS=(HISAM,VSAM)                                              
         DATASET DD1=WDB7K,DEVICE=3390,SIZE=4096                                
*                                                                               
         SEGM  NAME=WDB701,PARENT=0,BYTES=294                                   
         FIELD NAME=(IDGMT,SEQ,U),BYTES=7,START=1,TYPE=X                        
         FIELD NAME=(IDDISTR),BYTES=3,START=1,TYPE=P                            
         FIELD NAME=(IDKUNDNR),BYTES=4,START=4,TYPE=P                           
         FIELD NAME=(IDDEALER),BYTES=6,START=8,TYPE=X                           
         FIELD NAME=(IDLANDX2),BYTES=2,START=287,TYPE=X                         
         LCHILD NAME=(WDB7A1,WDB7A),PTR=SYMB                                    
         XDFLD NAME=WDB7ASEQ,SEGMENT=WDB701,                           *        
               SRCH=(IDDEALER,IDLANDX2),                               *        
               SUBSEQ=(IDDISTR,IDKUNDNR)                                        
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
