*        KUNDREGISTER DEALER INFO.                                              
*                                                                               
         DBD   NAME=WDB7A,                                             *        
               ACCESS=(INDEX,VSAM)                                              
         DATASET DD1=WDB7AK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDB7A1,PARENT=0,BYTES=22                                    
         FIELD NAME=(WDB7A1KY,SEQ,U),BYTES=15,START=1,TYPE=X                    
         FIELD NAME=(IDDEALER),BYTES=6,START=1,TYPE=X                           
         FIELD NAME=(IDLANDX2),BYTES=2,START=7,TYPE=X                           
         FIELD NAME=(IDDISTR),BYTES=3,START=9,TYPE=P                            
         FIELD NAME=(IDKUNDNR),BYTES=4,START=12,TYPE=P                          
         LCHILD NAME=(WDB701,WDB7),INDEX=WDB7ASEQ,PTR=SYMB                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
