*                                                                               
         DBD   NAME=WDB8A,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDB8AK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDB8A1,PARENT=0,BYTES=9                                     
         FIELD NAME=(WDB8A1KY,SEQ,U),BYTES=9,START=1,TYPE=X                     
         FIELD NAME=(IDDISTR),BYTES=3,START=1,TYPE=P                            
         FIELD NAME=(IDKUNDNR),BYTES=4,START=4,TYPE=P                           
         FIELD NAME=(IDDC),BYTES=2,START=8,TYPE=X                               
         LCHILD NAME=(WDB811,WDB8),INDEX=WDB8ASEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
