*        LDC REGISTER                                                           
*                                                                               
         DBD   NAME=WDB8,RMNAME=(V12008,5,180),                        *        
               ACCESS=(HDAM,OSAM)                                               
         DATASET DD1=WDB8V,DEVICE=3390,SIZE=4096,SCAN=0                         
*                                                                               
         SEGM  NAME=WDB801,PARENT=0,BYTES=212,PTR=T                             
         FIELD NAME=(IDDC,SEQ,U),BYTES=2,START=1,TYPE=X                         
*                                                                               
         SEGM  NAME=WDB811,PARENT=WDB801,BYTES=25,PTR=T                         
         FIELD NAME=(IDGMT,SEQ,U),BYTES=7,START=1,TYPE=X                        
         FIELD NAME=(IDDISTR),BYTES=3,START=1,TYPE=P                            
         FIELD NAME=(IDKUNDNR),BYTES=4,START=4,TYPE=P                           
         FIELD NAME=(/CK01),BYTES=2,START=1,TYPE=X                              
         LCHILD NAME=(WDB8A1,WDB8A),PTR=INDX                                    
         XDFLD NAME=WDB8ASEQ,SEGMENT=WDB811,                           *        
               SRCH=(IDDISTR,IDKUNDNR),                                *        
               SUBSEQ=(/CK01)                                                   
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
