*        PARAMETERREGISTER DOK. UTSKRIFT                                        
*                                                                               
         DBD   NAME=WDB9,                                              *        
               ACCESS=(HISAM,VSAM)                                              
         DATASET DD1=WDB9K,DEVICE=3390,SIZE=4096                                
*                                                                               
         SEGM  NAME=WDB901,PARENT=0,BYTES=50                                    
         FIELD NAME=(WDB901KY,SEQ,U),BYTES=17,START=1,TYPE=X                    
         FIELD NAME=(IDDC),BYTES=2,START=1,TYPE=X                               
         FIELD NAME=(IDDISTR),BYTES=3,START=3,TYPE=P                            
         FIELD NAME=(IDKUND),BYTES=10,START=6,TYPE=P                            
         FIELD NAME=(IDDCREC),BYTES=2,START=16,TYPE=X                           
         FIELD NAME=(KVCOPGMT),BYTES=1,START=34,TYPE=X                          
         FIELD NAME=(KVCOPKLI),BYTES=1,START=35,TYPE=X                          
         FIELD NAME=(KVCOPPAC),BYTES=1,START=36,TYPE=X                          
         FIELD NAME=(KVCOPSPE),BYTES=1,START=37,TYPE=X                          
         FIELD NAME=(KVCOPSTA),BYTES=1,START=38,TYPE=X                          
         FIELD NAME=(KVCOPVER),BYTES=1,START=39,TYPE=X                          
         FIELD NAME=(KVDAGAR),BYTES=2,START=44,TYPE=X                           
         FIELD NAME=(KVCOPKUL),BYTES=1,START=47,TYPE=X                          
         FIELD NAME=(KVCOPNAP),BYTES=1,START=48,TYPE=X                          
         FIELD NAME=(KVCOPBLA),BYTES=1,START=49,TYPE=X                          
         FIELD NAME=(KVCOPTRP),BYTES=1,START=50,TYPE=X                          
         LCHILD NAME=(WDB9A1,WDB9A),PTR=SYMB                                    
         XDFLD NAME=WDB9ASEQ,SEGMENT=WDB901,                           *        
               SRCH=(IDDISTR),                                         *        
               SUBSEQ=(IDDC,IDKUND,IDDCREC),                           *        
               DDATA=(KVDAGAR)                                                  
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
