*        PRISREGISTER AMC (NEW PRICE)                                           
*                                                                               
         DBD   NAME=WDC1,RMNAME=(V12008,20,51030),                     *        
               ACCESS=(HDAM,OSAM)                                               
         DATASET DD1=WDC1V,DEVICE=3390,SIZE=2048,SCAN=0                         
*                                                                               
         SEGM  NAME=WDC101,PARENT=0,BYTES=25,PTR=T                              
         FIELD NAME=(WDC101KY,SEQ,U),BYTES=6,START=1,TYPE=X                     
         FIELD NAME=(IDARTNR),BYTES=5,START=1,TYPE=P                            
         FIELD NAME=(IDMARKBO),BYTES=1,START=6,TYPE=X                           
         FIELD NAME=(KDARTKAM),BYTES=5,START=7,TYPE=X                           
         FIELD NAME=(KDARTRAB),BYTES=2,START=12,TYPE=X                          
*                                                                               
         LCHILD NAME=(WDC1A1,WDC1A),PTR=INDX                                    
         XDFLD NAME=WDC1ASEQ,SEGMENT=WDC101,                           *        
               SRCH=(KDARTKAM),                                        *        
               SUBSEQ=(IDARTNR,IDMARKBO)                                        
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
