*        PRISINFO FRÅN SC                                                       
*                                                                               
         DBD   NAME=WDC3,RMNAME=(V12008,20,31500),                     *        
               ACCESS=(HDAM,OSAM)                                               
         DATASET DD1=WDC3V,DEVICE=3390,SIZE=2048,SCAN=0                         
*                                                                               
         SEGM  NAME=WDC301,PARENT=0,BYTES=05,PTR=T                              
         FIELD NAME=(IDARTNR,SEQ,U),BYTES=5,START=1,TYPE=P                      
*                                                                               
         SEGM  NAME=WDC311,PARENT=WDC301,BYTES=15,PTR=T                         
         FIELD NAME=(IDLANDX2,SEQ,U),BYTES=2,START=1,TYPE=X                     
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
