*        STANDARDPRISREGISTER (KOMMANDE)                                        
*                                                                               
         DBD   NAME=WDC6,RMNAME=(V12008,10,31500),                     *        
               ACCESS=(HDAM,OSAM)                                               
         DATASET DD1=WDC6V,DEVICE=3390,SIZE=2048,SCAN=0                         
*                                                                               
         SEGM  NAME=WDC601,PARENT=0,BYTES=165,PTR=T                             
         FIELD NAME=(IDARTNR,SEQ,U),BYTES=5,START=1,TYPE=P                      
         FIELD NAME=(IDLEVNR),BYTES=5,START=12,TYPE=X                           
         FIELD NAME=(KDPRBEH),BYTES=1,START=27,TYPE=X                           
         FIELD NAME=(REAENDR),BYTES=3,START=105,TYPE=P                          
*                                                                               
         LCHILD NAME=(WDC6A1,WDC6A),PTR=INDX                                    
         XDFLD NAME=WDC6ASEQ,SEGMENT=WDC601,                           *        
               SRCH=(IDLEVNR),                                         *        
               SUBSEQ=(IDARTNR),                                       *        
               DDATA=(KDPRBEH,REAENDR)                                          
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
