*        DDI PRISFRÅGA                                                          
*                                                                               
         DBD   NAME=WDC7,RMNAME=(V12008,,36000),                       *        
               ACCESS=(HDAM,OSAM)                                               
         DATASET DD1=WDC7V,DEVICE=3390,SIZE=4096,SCAN=0                         
*                                                                               
         SEGM  NAME=WDC701,PARENT=0,BYTES=26,PTR=T                              
         FIELD NAME=(WDC701KY,SEQ,U),BYTES=26,START=1,TYPE=X                    
         FIELD NAME=(IDDISTR),BYTES=4,START=1,TYPE=X                            
         FIELD NAME=(IDKUNDNR),BYTES=7,START=5,TYPE=X                           
         FIELD NAME=(IDBUNDLE),BYTES=15,START=12,TYPE=X                         
         LCHILD NAME=(WDC7A1,WDC7A),PTR=INDX                                    
         XDFLD NAME=WDC7ASEQ,SEGMENT=WDC711,                           *        
               SRCH=(KDSEGKEY),                                        *        
               SUBSEQ=(/CKDISTR,/CKBUNDL,IDARTNR,IDPRQUES),            *        
               DDATA=(KDPRSTA,FILLER2)                                          
         LCHILD NAME=(WDC7B1,WDC7B),PTR=INDX                                    
         XDFLD NAME=WDC7BSEQ,SEGMENT=WDC711,                           *        
               SRCH=(KDPRSTA),                                         *        
               SUBSEQ=(/CKDISTR,/CKBUNDL,IDARTNR,IDPRQUES),            *        
               DDATA=(FILLER2)                                                  
*                                                                               
         SEGM  NAME=WDC711,PARENT=WDC701,BYTES=212,PTR=T                        
         FIELD NAME=(IDPRQUES,SEQ,U),BYTES=7,START=1,TYPE=X                     
         FIELD NAME=(KDPRSTA),BYTES=1,START=58,TYPE=X                           
         FIELD NAME=(/CKDISTR),BYTES=11,START=1,TYPE=X                          
         FIELD NAME=(/CKBUNDL),BYTES=15,START=12,TYPE=X                         
         FIELD NAME=(IDARTNR),BYTES=9,START=60,TYPE=X                           
         FIELD NAME=(PBLOLOC),BYTES=5,START=75,TYPE=P                           
         FIELD NAME=(PNTOLOC),BYTES=5,START=80,TYPE=P                           
         FIELD NAME=(KVRAB),BYTES=5,START=85,TYPE=X                             
         FIELD NAME=(KDVALISO),BYTES=3,START=90,TYPE=X                          
         FIELD NAME=(FILLER2),BYTES=18,START=75,TYPE=X                          
         FIELD NAME=(KDSEGKEY),BYTES=1,START=189,TYPE=X                         
                                                                                
                                                                                
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
