*        PRISFRÅGA - DISTRIKT + KUND                                            
*                                                                               
         DBD   NAME=WDC7A,                                             *        
               ACCESS=(INDEX,VSAM)                                              
         DATASET DD1=WDC7AK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDC7A1,PARENT=0,BYTES=62                                    
         FIELD NAME=(WDC7A1KY,SEQ,U),BYTES=43,START=1,TYPE=X                    
         FIELD NAME=(IDDISTR),BYTES=4,START=2,TYPE=X                            
         FIELD NAME=(IDKUNDNR),BYTES=7,START=6,TYPE=X                           
         FIELD NAME=(IDBUNDLE),BYTES=15,START=13,TYPE=X                         
         FIELD NAME=(IDARTNR),BYTES=9,START=28,TYPE=X                           
         FIELD NAME=(KDPRSTA),BYTES=1,START=37,TYPE=X                           
         LCHILD NAME=(WDC701,WDC7),INDEX=WDC7ASEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
