*        FÖRPACKNINGSINSTRUKTION                                                
*                                                                               
         DBD   NAME=WDD1,RMNAME=(V12008,4,1800),                       *        
               ACCESS=(HDAM,OSAM)                                               
         DATASET DD1=WDD1V,DEVICE=3390,SIZE=4096,SCAN=0                         
*                                                                               
         SEGM  NAME=WDD101,PARENT=0,BYTES=840,PTR=T                             
         FIELD NAME=(IDFPINST,SEQ,U),BYTES=4,START=1,TYPE=P                     
         FIELD NAME=IDLEVNR,BYTES=5,START=5,TYPE=X                              
*                                                                               
         LCHILD NAME=(WDD1A1,WDD1A),PTR=INDX                                    
         XDFLD NAME=WDD1ASEQ,SEGMENT=WDD111,                           *        
               SRCH=(IDARTNR),                                         *        
               SUBSEQ=(/CKFPI)                                                  
*                                                                               
         LCHILD NAME=(WDD1B1,WDD1B),PTR=INDX                                    
         XDFLD NAME=WDD1BSEQ,SEGMENT=WDD101,                           *        
               SRCH=(IDLEVNR),                                         *        
               SUBSEQ=(IDFPINST)                                                
*                                                                               
         SEGM  NAME=WDD111,PARENT=WDD101,BYTES=5,PTR=T                          
         FIELD NAME=(IDARTNR,SEQ,U),BYTES=5,START=1,TYPE=P                      
         FIELD NAME=(/CKFPI),BYTES=4,START=1,TYPE=P                             
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
