*        LEVERANTÖRSNUMMER INGÅNG                                               
*                                                                               
         DBD   NAME=WDD1B,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDD1BK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDD1B1,PARENT=0,BYTES=9,PTR=T                               
         FIELD NAME=(WDD1B1KY,SEQ,U),BYTES=9,START=1,TYPE=X                     
         LCHILD NAME=(WDD101,WDD1),INDEX=WDD1BSEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
