*        ARTIKEL INGÅNG                                                         
*                                                                               
         DBD   NAME=WDD1A,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDD1AK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDD1A1,PARENT=0,BYTES=9,PTR=T                               
         FIELD NAME=(WDD1A1KY,SEQ,U),BYTES=9,START=1,TYPE=P                     
         LCHILD NAME=(WDD101,WDD1),INDEX=WDD1ASEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
