*        ANSKAFFARKÖ                                                            
*                                                                               
         DBD   NAME=WDD2B,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDD2BK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDD2B1,PARENT=0,BYTES=35,PTR=T                              
         FIELD NAME=(WDD2B1KY,SEQ,U),BYTES=30,START=1,TYPE=X                    
         FIELD NAME=(FLPISK),BYTES=1,START=1,TYPE=X                             
         FIELD NAME=(IDANSK),BYTES=2,START=2,TYPE=P                             
         FIELD NAME=(DAFINLEV),BYTES=8,START=4,TYPE=X                           
         FIELD NAME=(IDAO),BYTES=10,START=12,TYPE=X                             
         FIELD NAME=(IDPROJ),BYTES=4,START=22,TYPE=X                            
         FIELD NAME=(IDARTNR),BYTES=5,START=26,TYPE=P                           
         FIELD NAME=(KDANSKQ),BYTES=1,START=31,TYPE=X                           
         FIELD NAME=(TIMOTSI),BYTES=4,START=32,TYPE=P                           
         LCHILD NAME=(WDD201,WDD2),INDEX=WDD2BSEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
