*        FLPISK - INGÅNG                                                        
*                                                                               
         DBD   NAME=WDD2E,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDD2EK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDD2E1,PARENT=0,BYTES=25,PTR=T                              
         FIELD NAME=(WDD2E1KY,SEQ,U),BYTES=24,START=1,TYPE=X                    
         FIELD NAME=(FLPISK),BYTES=1,START=1,TYPE=X                             
         FIELD NAME=(IDANSK),BYTES=2,START=2,TYPE=P                             
         FIELD NAME=(DAFINLEV),BYTES=8,START=4,TYPE=X                           
         FIELD NAME=(IDINK),BYTES=4,START=12,TYPE=X                             
         FIELD NAME=(IDPROJ),BYTES=4,START=16,TYPE=X                            
         FIELD NAME=(IDARTNR),BYTES=5,START=20,TYPE=P                           
         FIELD NAME=(KDANSKQ),BYTES=1,START=25,TYPE=X                           
         LCHILD NAME=(WDD201,WDD2),INDEX=WDD2ESEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
