*        BEREDARKÖ                                                              
*                                                                               
         DBD   NAME=WDD2A,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDD2AK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDD2A1,PARENT=0,BYTES=29,PTR=T                              
         FIELD NAME=(WDD2A1KY,SEQ,U),BYTES=17,START=1,TYPE=X                    
         FIELD NAME=(IDBERED),BYTES=2,START=1,TYPE=P                            
         FIELD NAME=(IDAO),BYTES=10,START=3,TYPE=X                              
         FIELD NAME=(IDARTNR),BYTES=5,START=13,TYPE=P                           
         FIELD NAME=(IDPROJ),BYTES=4,START=18,TYPE=X                            
         FIELD NAME=(IDPROJK),BYTES=4,START=22,TYPE=X                           
         FIELD NAME=(TISLUBER),BYTES=4,START=26,TYPE=P                          
         LCHILD NAME=(WDD201,WDD2),INDEX=WDD2ASEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
