*        IDSKYLT+BEART INGÅNG                                                   
*                                                                               
         DBD   NAME=WDD3A,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDD3AK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDD3A1,PARENT=0,BYTES=32,PTR=T                              
         FIELD NAME=(WDD3A1KY,SEQ,U),BYTES=32,START=1,TYPE=X                    
         FIELD NAME=(IDSKYLT),BYTES=3,START=1,TYPE=X                            
         FIELD NAME=(BEART),BYTES=25,START=4,TYPE=X                             
         FIELD NAME=(IDBENNR),BYTES=4,START=29,TYPE=P                           
         LCHILD NAME=(WDD301,WDD3),INDEX=WDD3ASEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
