*                                                                               
         DBD   NAME=WDD3,RMNAME=(V12008,,126000,10000),                *        
               ACCESS=(HDAM,OSAM)                                               
         DATASET DD1=WDD3V,DEVICE=3390,SIZE=2048,SCAN=0                         
*                                                                               
         SEGM  NAME=WDD301,PARENT=0,BYTES=15,PTR=T                              
         FIELD NAME=(IDBENNR,SEQ,U),BYTES=4,START=1,TYPE=P                      
         LCHILD NAME=(WDD3A1,WDD3A),PTR=INDX                                    
         XDFLD NAME=WDD3ASEQ,SEGMENT=WDD311,                           *        
               SRCH=(IDSKYLT,BEART),                                   *        
               SUBSEQ=(/CKBENNR),                                      *        
               EXTRTN=WDD3AEXT                                                  
*                                                                               
* EXIT FINNS NÄR IDSKYLT = S ELLER GB                                           
*                                                                               
         LCHILD NAME=(WDD3B1,WDD3B),PTR=INDX                                    
         XDFLD NAME=WDD3BSEQ,SEGMENT=WDD312,                           *        
               SRCH=(IDARTNR)                                                   
*                                                                               
         SEGM  NAME=WDD311,PARENT=WDD301,BYTES=120,PTR=T                        
         FIELD NAME=(IDSKYLT,SEQ,U),BYTES=3,START=1,TYPE=X                      
         FIELD NAME=(BEART),BYTES=25,START=4,TYPE=X                             
         FIELD NAME=(/CKBENNR),BYTES=4,START=1,TYPE=P                           
*                                                                               
         SEGM  NAME=WDD312,PARENT=WDD301,BYTES=6,PTR=T                          
         FIELD NAME=(IDARTNR,SEQ,U),BYTES=5,START=1,TYPE=P                      
*                                                                               
         SEGM  NAME=WDD313,PARENT=WDD301,BYTES=61,PTR=T                         
         FIELD NAME=(IDSEGMNR,SEQ,U),BYTES=1,START=1,TYPE=P                     
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
