*        LARMKÖ LEVERANSREGISTER                                                
*                                                                               
         DBD   NAME=WDD4,                                              *        
               ACCESS=(HISAM,VSAM)                                              
         DATASET DD1=WDD4K,DEVICE=3390,SIZE=4096                                
*                                                                               
         SEGM  NAME=WDD401,PARENT=0,BYTES=52                                    
         FIELD NAME=(WDD401KY,SEQ,U),BYTES=13,START=1,TYPE=X                    
         FIELD NAME=(DAREGDAT),BYTES=8,START=1,TYPE=X                           
         FIELD NAME=(TIKLOCK),BYTES=5,START=9,TYPE=P                            
         FIELD NAME=(IDARTNR),BYTES=5,START=14,TYPE=P                           
         FIELD NAME=(IDDC),BYTES=2,START=19,TYPE=X                              
         FIELD NAME=(IDANSK),BYTES=2,START=21,TYPE=P                            
         FIELD NAME=(IDLEVNR),BYTES=5,START=23,TYPE=X                           
         FIELD NAME=(KDLARM),BYTES=2,START=28,TYPE=P                            
         LCHILD NAME=(WDD4A1,WDD4A),PTR=SYMB                                    
         XDFLD NAME=WDD4ASEQ,SEGMENT=WDD401,                           *        
               SRCH=(IDANSK,IDLEVNR,IDARTNR,DAREGDAT,TIKLOCK),         *        
               DDATA=(IDDC)                                                     
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
