*        KÖ LEVERANSPLANEFÖRSLAG                                                
*                                                                               
         DBD   NAME=WDD6,                                              *        
               ACCESS=(HISAM,VSAM)                                              
         DATASET DD1=WDD6K,DEVICE=3390,SIZE=4096                                
*                                                                               
         SEGM  NAME=WDD601,PARENT=0,BYTES=63                                    
         FIELD NAME=(WDD601KY,SEQ,U),BYTES=14,START=1,TYPE=X                    
         FIELD NAME=(IDDC),BYTES=2,START=1,TYPE=X                               
         FIELD NAME=(IDLEVNR),BYTES=5,START=3,TYPE=X                            
         FIELD NAME=(IDARTNR),BYTES=5,START=8,TYPE=P                            
         FIELD NAME=(IDANSK),BYTES=2,START=13,TYPE=P                            
         FIELD NAME=(KDLPORS1),BYTES=2,START=15,TYPE=P                          
         FIELD NAME=(KDLPORS2),BYTES=2,START=17,TYPE=P                          
         FIELD NAME=(KDLPORS3),BYTES=2,START=19,TYPE=P                          
         FIELD NAME=(KDLEVPLF),BYTES=1,START=21,TYPE=X                          
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
