*        ERSÄTTNING TILLKOMMANDE ARTIKLAR                                       
*                                                                               
         DBD   NAME=WDD7A,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDD7AK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDD7A1,PARENT=0,BYTES=12,PTR=T                              
         FIELD NAME=(WDD7A1KY,SEQ,U),BYTES=12,START=1,TYPE=X                    
         FIELD NAME=(IDARTNR),BYTES=5,START=1,TYPE=P                            
         FIELD NAME=(IDARTNRE),BYTES=5,START=6,TYPE=P                           
         FIELD NAME=(IDKORTNR),BYTES=2,START=11,TYPE=P                          
         LCHILD NAME=(WDD702,WDD7),INDEX=WDD7ASEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
