*        BUFFERT REGISTER SEC IND. DC/ARTIKEL                                   
*                                                                               
         DBD   NAME=WDD8B,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDD8BK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDD8B1,PARENT=0,BYTES=36                                    
         FIELD NAME=(WDD8B1KY,SEQ,U),BYTES=22,START=1,TYPE=X                    
         FIELD NAME=(IDDC),BYTES=2,START=1,TYPE=X                               
         FIELD NAME=(IDARTNR),BYTES=5,START=3,TYPE=P                            
         FIELD NAME=(ADBUFFOM),BYTES=2,START=8,TYPE=P                           
         FIELD NAME=(ADBUFGAN),BYTES=2,START=10,TYPE=P                          
         FIELD NAME=(ADBUFPL),BYTES=3,START=12,TYPE=P                           
         FIELD NAME=(DABUFPAF),BYTES=8,START=15,TYPE=P                          
         LCHILD NAME=(WDD811,WDD8),INDEX=WDD8BSEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
