*        SEC INDEX IDLEVNR                                                      
*                                                                               
         DBD   NAME=WDD9A,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDD9AK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDD9A1,PARENT=0,BYTES=12                                    
         FIELD NAME=(WDD9A1KY,SEQ,U),BYTES=12,START=1,TYPE=X                    
         FIELD NAME=(IDLEVNR),BYTES=5,START=1,TYPE=X                            
         FIELD NAME=(IDARTNR),BYTES=5,START=6,TYPE=P                            
         FIELD NAME=(IDDC),BYTES=2,START=11,TYPE=X                              
         LCHILD NAME=(WDD902,WDD9),INDEX=WDD9ASEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
