*        LEVERANSPLAN-REGISTER                                                  
*                                                                               
         DBD   NAME=WDD9,RMNAME=(V12008,10,31500),                     *        
               ACCESS=(HDAM,OSAM)                                               
         DATASET DD1=WDD9V,DEVICE=3390,SIZE=2048,SCAN=0                         
*                                                                               
         SEGM  NAME=WDD901,PARENT=0,BYTES=7,PTR=T                               
         FIELD NAME=(WDD901KY,SEQ,U),BYTES=7,START=1,TYPE=X                     
         FIELD NAME=(IDARTNR),BYTES=5,START=1,TYPE=P                            
         FIELD NAME=(IDDC),BYTES=2,START=6,TYPE=X                               
*                                                                               
         SEGM  NAME=WDD902,PARENT=WDD901,BYTES=20,PTR=T                         
         FIELD NAME=(IDLEVNR,SEQ,U),BYTES=5,START=1,TYPE=X                      
         FIELD NAME=(/CK01),BYTES=7,START=1,TYPE=X                              
         LCHILD NAME=(WDD9A1,WDD9A),PTR=INDX                                    
         XDFLD NAME=WDD9ASEQ,SEGMENT=WDD902,                           *        
               SRCH=(IDLEVNR),SUBSEQ=(/CK01)                                    
*                                                                               
         SEGM  NAME=WDD904,PARENT=WDD902,BYTES=17,PTR=NT                        
         FIELD NAME=(DASPECST),BYTES=6,START=1,TYPE=X                           
*                                                                               
         SEGM  NAME=WDD905,PARENT=WDD902,BYTES=20,PTR=T                         
         FIELD NAME=(WDD905KY,SEQ,M),BYTES=7,START=2,TYPE=X                     
         FIELD NAME=(DAAVROP),BYTES=6,START=2,TYPE=X                            
         FIELD NAME=(TILEVDAG),BYTES=1,START=8,TYPE=P                           
         FIELD NAME=(KDAVROP),BYTES=1,START=1,TYPE=P                            
*                                                                               
         SEGM  NAME=WDD906,PARENT=WDD905,BYTES=9,PTR=T                          
         FIELD NAME=(IDLOPNRM,SEQ,M),BYTES=5,START=1,TYPE=P                     
*                                                                               
         SEGM  NAME=WDD907,PARENT=WDD905,BYTES=6,PTR=NT                         
         FIELD NAME=(IDORDNSB,SEQ,U),BYTES=3,START=1,TYPE=P                     
*                                                                               
         SEGM  NAME=WDD924,PARENT=WDD902,BYTES=34,PTR=T                         
         FIELD NAME=(DALEVBSK,SEQ,U),BYTES=8,START=1,TYPE=X                     
*                                                                               
         SEGM  NAME=WDD925,PARENT=WDD902,BYTES=93,PTR=T                         
         FIELD NAME=(IDLEVBSK,SEQ,U),BYTES=1,START=1,TYPE=P                     
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
