*        TRANSPORT DDI - IDDISTR                                                
*                                                                               
         DBD   NAME=WDE1B,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDE1BK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDE1B1,PARENT=0,BYTES=20                                    
         FIELD NAME=(WDE1B1KY,SEQ,U),BYTES=20,START=1,TYPE=X                    
         FIELD NAME=(IDDC),BYTES=2,START=1,TYPE=X                               
         FIELD NAME=(IDDISTR),BYTES=3,START=3,TYPE=P                            
         FIELD NAME=(TISKEPP9),BYTES=4,START=6,TYPE=P                           
         FIELD NAME=(IDSHIPM),BYTES=7,START=10,TYPE=X                           
         FIELD NAME=(IDKUNDNR),BYTES=4,START=17,TYPE=P                          
         LCHILD NAME=(WDE101,WDE1),INDEX=WDE1BSEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
