*        TRANSPORTRELEASE DDI->BILL (KDPRSTA = R)                               
*                                                                               
         DBD   NAME=WDE2A,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDE2AK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDE2A1,PARENT=0,BYTES=7                                     
         FIELD NAME=(WDE2A1KY,SEQ,U),BYTES=7,START=1,TYPE=X                     
         FIELD NAME=(IDPRODNR),BYTES=4,START=1,TYPE=P                           
         FIELD NAME=(IDKOLLI),BYTES=3,START=5,TYPE=P                            
         LCHILD NAME=(WDE221,WDE2),INDEX=WDE2ASEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
