*        REFILL ORDERFÖRSLAG S-LAGER - REFTYP INGÅNG                            
*                                                                               
         DBD   NAME=WDE3A,                                             *        
               ACCESS=(INDEX,VSAM)                                              
         DATASET DD1=WDE3AK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDE3A1,PARENT=0,BYTES=24                                    
         FIELD NAME=(WDE3A1KY,SEQ,U),BYTES=10,START=1,TYPE=X                    
         FIELD NAME=(KDREFTYP),BYTES=1,START=1,TYPE=X                           
         FIELD NAME=(IDPERSON),BYTES=2,START=2,TYPE=P                           
         FIELD NAME=(IDARTNR),BYTES=5,START=4,TYPE=P                            
         FIELD NAME=(IDDC),BYTES=2,START=9,TYPE=X                               
         LCHILD NAME=(WDE301,WDE3),INDEX=WDE3ASEQ,PTR=SYMB                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
