*        KUNDORDER INDEX=PRODNUMMER                                             
*                                                                               
         DBD   NAME=WDE4E,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDE4EK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDE4E1,PARENT=0,BYTES=23,PTR=T                              
         FIELD NAME=(WDE4E1KY,SEQ,U),BYTES=23,START=1,TYPE=X                    
         FIELD NAME=(IDPRODNR),BYTES=4,START=1,TYPE=P                           
         FIELD NAME=(IDGMTREF),BYTES=17,START=5,TYPE=X                          
         FIELD NAME=(IDDISTR),BYTES=3,START=5,TYPE=P                            
         FIELD NAME=(IDKUNDNR),BYTES=4,START=8,TYPE=P                           
         FIELD NAME=(IDKUNDRF),BYTES=10,START=12,TYPE=X                         
         FIELD NAME=(IDPLKLST),BYTES=2,START=22,TYPE=P                          
         LCHILD NAME=(WDE401,WDE4),INDEX=WDE4ESEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
