*        PRODUKTIONSORDERRADER                                                  
*                                                                               
         DBD   NAME=WDE4B,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDE4BK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDE4B1,PARENT=0,BYTES=21,PTR=T                              
         FIELD NAME=(WDE4B1KY,SEQ,U),BYTES=7,START=1,TYPE=X                     
         FIELD NAME=(IDPRODNR),BYTES=4,START=1,TYPE=P                           
         FIELD NAME=(IDPURAD),BYTES=3,START=5,TYPE=P                            
         LCHILD NAME=(WDE411,WDE4),INDEX=WDE4BSEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
