*        FYSISKA AVVIKELSER                                                     
*                                                                               
         DBD   NAME=WDE4D,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDE4DK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDE4D1,PARENT=0,BYTES=37,PTR=T                              
         FIELD NAME=(WDE4D1KY,SEQ,U),BYTES=27,START=1,TYPE=X                    
         FIELD NAME=(FLFYSAVV),BYTES=1,START=1,TYPE=X                           
         FIELD NAME=(IDGMTREF),BYTES=17,START=2,TYPE=X                          
         FIELD NAME=(IDDISTR),BYTES=3,START=2,TYPE=P                            
         FIELD NAME=(IDKUNDNR),BYTES=4,START=5,TYPE=P                           
         FIELD NAME=(IDKUNDRF),BYTES=10,START=9,TYPE=X                          
         FIELD NAME=(IDPRODNR),BYTES=4,START=19,TYPE=P                          
         FIELD NAME=(IDPLKLST),BYTES=2,START=23,TYPE=P                          
         FIELD NAME=(IDPURAD),BYTES=3,START=25,TYPE=P                           
         FIELD NAME=(IDARTNR),BYTES=5,START=28,TYPE=P                           
         FIELD NAME=(REKSIFFR),BYTES=1,START=33,TYPE=P                          
         FIELD NAME=(KVLEVART),BYTES=4,START=34,TYPE=P                          
         LCHILD NAME=(WDE411,WDE4),INDEX=WDE4DSEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
