*        KOLLI REGISTER INDEX=ANSVARIG PERSON                                   
*                                                                               
         DBD   NAME=WDE6B,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDE6BK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDE6B1,PARENT=0,BYTES=15,PTR=T                              
         FIELD NAME=(WDE6B1KY,SEQ,U),BYTES=15,START=1,TYPE=X                    
         FIELD NAME=(KDPERSON),BYTES=2,START=1,TYPE=P                           
         FIELD NAME=(DABEGPAC),BYTES=8,START=3,TYPE=X                           
         FIELD NAME=(KDORDSTA),BYTES=1,START=11,TYPE=P                          
         FIELD NAME=(IDPRODNR),BYTES=4,START=12,TYPE=P                          
         LCHILD NAME=(WDE601,WDE6),INDEX=WDE6BSEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
