*        KOLLI-REGISTER INDEX=DIST+DC                                           
*                                                                               
         DBD   NAME=WDE6F,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDE6FK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDE6F1,PARENT=0,BYTES=37,PTR=T                              
         FIELD NAME=(WDE6F1KY,SEQ,U),BYTES=30,START=1,TYPE=X                    
         FIELD NAME=(IDLEVNR),BYTES=5,START=1,TYPE=X                            
         FIELD NAME=(DASUPREF),BYTES=8,START=6,TYPE=X                           
         FIELD NAME=(IDSUPREF),BYTES=10,START=14,TYPE=X                         
         FIELD NAME=(IDPRODNR),BYTES=4,START=24,TYPE=P                          
         FIELD NAME=(IDKOLLI),BYTES=3,START=28,TYPE=P                           
         FIELD NAME=(IDDISTR),BYTES=3,START=35,TYPE=P                           
         LCHILD NAME=(WDE611,WDE6),INDEX=WDE6FSEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
