*        KOLLI-REGISTER INDEX=DIST+DC                                           
*                                                                               
         DBD   NAME=WDE6A,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDE6AK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDE6A1,PARENT=0,BYTES=16,PTR=T                              
         FIELD NAME=(WDE6A1KY,SEQ,U),BYTES=16,START=1,TYPE=X                    
         FIELD NAME=(IDDISTR),BYTES=3,START=1,TYPE=P                            
         FIELD NAME=(IDDC),BYTES=2,START=4,TYPE=X                               
         FIELD NAME=(KDFRAKT),BYTES=2,START=6,TYPE=P                            
         FIELD NAME=(KDORDSTA),BYTES=1,START=8,TYPE=P                           
         FIELD NAME=(IDKUNDNR),BYTES=4,START=9,TYPE=P                           
         FIELD NAME=(IDPRODNR),BYTES=4,START=13,TYPE=P                          
         LCHILD NAME=(WDE601,WDE6),INDEX=WDE6ASEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
