*        KOLLI-REGISTER INDEX=DC+DISTR                                          
*                                                                               
         DBD   NAME=WDE6G,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDE6GK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDE6G1,PARENT=0,BYTES=25,PTR=T                              
         FIELD NAME=(WDE6G1KY,SEQ,U),BYTES=25,START=1,TYPE=X                    
         FIELD NAME=(IDDC),BYTES=2,START=1,TYPE=X                               
         FIELD NAME=(IDDISTR),BYTES=3,START=3,TYPE=P                            
         FIELD NAME=(DARFS),BYTES=12,START=6,TYPE=P                             
         FIELD NAME=(IDKUNDNR),BYTES=4,START=18,TYPE=P                          
         FIELD NAME=(IDPRODNR),BYTES=4,START=22,TYPE=P                          
         LCHILD NAME=(WDE601,WDE6),INDEX=WDE6GSEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
