*        KOLLI-REGISTER INDEX=SAMPACKNINGSKOLLI                                 
*                                                                               
         DBD   NAME=WDE6E,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDE6EK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDE6E1,PARENT=0,BYTES=14,PTR=T                              
         FIELD NAME=(WDE6E1KY,SEQ,U),BYTES=12,START=1,TYPE=X                    
         FIELD NAME=(IDDC),BYTES=2,START=1,TYPE=X                               
         FIELD NAME=(IDKOLLIS),BYTES=3,START=3,TYPE=P                           
         FIELD NAME=(IDPRODNR),BYTES=4,START=6,TYPE=P                           
         FIELD NAME=(IDKOLLI),BYTES=3,START=10,TYPE=P                           
         FIELD NAME=(IDTRPTNR),BYTES=2,START=13,TYPE=P                          
         LCHILD NAME=(WDE611,WDE6),INDEX=WDE6ESEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
