*        PROFORMA ORDERHUVUD                                                    
*                                                                               
         DBD   NAME=WDE8,                                              *        
               ACCESS=(HISAM,VSAM)                                              
         DATASET DD1=WDE8K,DEVICE=3390,SIZE=4096                                
*                                                                               
         SEGM  NAME=WDE801,PARENT=0,BYTES=1997                                  
         FIELD NAME=(WDE801KY,SEQ,U),BYTES=17,START=1,TYPE=X                    
         FIELD NAME=(IDGMTREF),BYTES=17,START=1,TYPE=X                          
         FIELD NAME=(IDDISTR),BYTES=3,START=1,TYPE=P                            
         FIELD NAME=(IDKUNDNR),BYTES=4,START=4,TYPE=P                           
         FIELD NAME=(IDKUNDRF),BYTES=10,START=8,TYPE=X                          
         FIELD NAME=(IDORDER),BYTES=4,START=440,TYPE=P                          
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
