*        PROFORMARADER                                                          
*                                                                               
         DBD   NAME=WDE9,                                              *        
               ACCESS=(HISAM,VSAM)                                              
         DATASET DD1=WDE9K,DEVICE=3390,SIZE=4096                                
*                                                                               
         SEGM  NAME=WDE901,PARENT=0,BYTES=180                                   
         FIELD NAME=(WDE901KY,SEQ,U),BYTES=11,START=1,TYPE=X                    
         FIELD NAME=(IDORDER),BYTES=4,START=1,TYPE=P                            
         FIELD NAME=(IDARTNR),BYTES=5,START=5,TYPE=P                            
         FIELD NAME=(IDLOPNR),BYTES=2,START=10,TYPE=P                           
         FIELD NAME=(IDPRQUES),BYTES=7,START=114,TYPE=X                         
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
