*        HELGDAGAR/LAND                                                         
*                                                                               
         DBD   NAME=WDF3,RMNAME=(V12008,,180),                         *        
               ACCESS=(HDAM,OSAM)                                               
         DATASET DD1=WDF3V,DEVICE=3390,SIZE=4096,SCAN=0                         
*                                                                               
         SEGM  NAME=WDF301,PARENT=0,BYTES=20,PTR=T                              
         FIELD NAME=(WDF301KY,SEQ,U),BYTES=10,START=1,TYPE=X                    
         FIELD NAME=(IDLANDX2),BYTES=2,START=1,TYPE=X                           
         FIELD NAME=(DADATUM),BYTES=8,START=3,TYPE=X                            
         FIELD NAME=(FLHELG),BYTES=1,START=11,TYPE=X                            
         LCHILD NAME=(WDF3A1,WDF3A),PTR=INDX                                    
         XDFLD NAME=WDF3ASEQ,SEGMENT=WDF301,                           *        
               SRCH=(IDLANDX2,DADATUM),                                *        
               DDATA=(FLHELG)                                                   
*                                                                               
         SEGM  NAME=WDF311,PARENT=WDF301,BYTES=15,PTR=T                         
         FIELD NAME=(IDLEVNR,SEQ,U),BYTES=5,START=1,TYPE=X                      
*                                                                               
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
