*        ORDERRADER HOS DIREKTLEVERANTÖR                                        
*                                                                               
         DBD   NAME=WDF4,RMNAME=(V12008,4,1800),                       *        
               ACCESS=(HDAM,OSAM)                                               
         DATASET DD1=WDF4V,DEVICE=3390,SIZE=8192,SCAN=0                         
*                                                                               
         SEGM  NAME=WDF401,PARENT=0,BYTES=08,PTR=T                              
         FIELD NAME=(IDLEVNR,SEQ,U),BYTES=05,START=1,TYPE=X                     
*                                                                               
         SEGM  NAME=WDF411,PARENT=WDF401,BYTES=54,PTR=T                         
         FIELD NAME=(WDF411KY,SEQ,U),BYTES=11,START=1,TYPE=X                    
         FIELD NAME=IDPRODNR,BYTES=4,START=1,TYPE=P                             
         FIELD NAME=IDPURAD,BYTES=3,START=5,TYPE=P                              
         FIELD NAME=TIUTSKR,BYTES=4,START=8,TYPE=P                              
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
