*        LEV.BET+ART                                                            
*                                                                               
         DBD   NAME=WDF5B,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDF5BK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDF5B1,PARENT=0,BYTES=41,PTR=T                              
         FIELD NAME=(WDF5B1KY,SEQ,U),BYTES=41,START=1,TYPE=X                    
         FIELD NAME=IDLEVART,BYTES=30,START=1,TYPE=X                            
         FIELD NAME=IDARTNR,BYTES=5,START=31,TYPE=P                             
         FIELD NAME=IDLEVNR,BYTES=5,START=36,TYPE=X                             
         FIELD NAME=IDBENR,BYTES=1,START=41,TYPE=P                              
         LCHILD NAME=(WDF501,WDF5),INDEX=WDF5BSEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
