*                                                                               
         DBD   NAME=WDF6,RMNAME=(V12008,,315),                         *        
               ACCESS=(HDAM,OSAM)                                               
         DATASET DD1=WDF6V,DEVICE=3390,SIZE=2048,SCAN=0                         
*                                                                               
         SEGM  NAME=WDF601,PARENT=0,BYTES=377,PTR=T                             
         FIELD NAME=(IDPRODNR,SEQ,U),BYTES=4,START=1,TYPE=P                     
         FIELD NAME=(DASNDDAT),BYTES=8,START=13,TYPE=X                          
         FIELD NAME=(IDDISTR),BYTES=3,START=33,TYPE=P                           
         FIELD NAME=(IDKUNDNR),BYTES=4,START=36,TYPE=P                          
         FIELD NAME=(IDLEVNR),BYTES=5,START=40,TYPE=X                           
         FIELD NAME=(KDORDKL),BYTES=1,START=78,TYPE=P                           
         LCHILD NAME=(WDF6A1,WDF6A),PTR=INDX                                    
         XDFLD NAME=WDF6ASEQ,SEGMENT=WDF601,                           *        
               SRCH=(IDLEVNR,IDDISTR,KDORDKL,IDKUNDNR),                *        
               SUBSEQ=(IDPRODNR),                                      *        
               EXTRTN=WDF6AEXT                                                  
*                                                                               
* EXIT FINNS NÄR TIREPDAT ELLER TITPO > ZERO                                    
*                                                                               
         SEGM  NAME=WDF611,PARENT=WDF601,BYTES=120,PTR=T                        
         FIELD NAME=(IDPURAD,SEQ,U),BYTES=3,START=1,TYPE=P                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
