*        LEV-DISTR-KL INGÅNG                                                    
*                                                                               
         DBD   NAME=WDF6A,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDF6AK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDF6A1,PARENT=0,BYTES=17                                    
         FIELD NAME=(WDF6A1KY,SEQ,U),BYTES=17,START=1,TYPE=X                    
         FIELD NAME=(IDLEVNR),BYTES=5,START=1,TYPE=X                            
         FIELD NAME=(IDDISTR),BYTES=3,START=6,TYPE=P                            
         FIELD NAME=(KDORDKL),BYTES=1,START=9,TYPE=P                            
         FIELD NAME=(IDKUNDNR),BYTES=4,START=10,TYPE=P                          
         FIELD NAME=(IDPRODNR),BYTES=4,START=14,TYPE=P                          
         LCHILD NAME=(WDF601,WDF6),INDEX=WDF6ASEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
