*        SPÄRRAR STYRNING INDEX=IDARTNR                                         
*                                                                               
         DBD   NAME=WDF8C,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDF8CK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDF8C1,PARENT=0,BYTES=15                                    
         FIELD NAME=(WDF8C1KY,SEQ,U),BYTES=15,START=1,TYPE=X                    
         FIELD NAME=(IDARTNR),BYTES=5,START=1,TYPE=P                            
         FIELD NAME=(IDSPRGRP),BYTES=10,START=06,TYPE=X                         
         LCHILD NAME=(WDF801,WDF8),INDEX=WDF8CSEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
