*        STYRNING SPÄRREGLER                                                    
*                                                                               
         DBD   NAME=WDF8,RMNAME=(V12008,1,540),                        *        
               ACCESS=(HDAM,OSAM)                                               
         DATASET DD1=WDF8V,DEVICE=3390,SIZE=8192,SCAN=0                         
*                                                                               
         SEGM  NAME=WDF801,PARENT=0,BYTES=125,PTR=T                             
         FIELD NAME=(IDSPRGRP,SEQ,U),BYTES=10,START=1,TYPE=X                    
         FIELD NAME=(TISTADAT),BYTES=4,START=114,TYPE=P                         
         LCHILD NAME=(WDF8A1,WDF8A),PTR=INDX                                    
         XDFLD NAME=WDF8ASEQ,SEGMENT=WDF811,                           *        
               SRCH=(IDDISTRF,IDDISTRT,IDKUNDNF,IDKUNDNT),             *        
               SUBSEQ=(/CKSPRGR),                                      *        
               DDATA=(TISTDAT0,TISTDAT1,TISTDAT2,TISTDAT3,TISTDAT4)             
         LCHILD NAME=(WDF8B1,WDF8B),PTR=INDX                                    
         XDFLD NAME=WDF8BSEQ,SEGMENT=WDF801,                           *        
               SRCH=(IDSPRGRP)                                                  
         LCHILD NAME=(WDF8C1,WDF8C),PTR=INDX                                    
         XDFLD NAME=WDF8CSEQ,SEGMENT=WDF812,                           *        
               SRCH=(IDARTNR),                                         *        
               SUBSEQ=(/CKSPRGR)                                                
*                                                                               
         SEGM  NAME=WDF811,PARENT=WDF801,BYTES=39,PTR=T                         
         FIELD NAME=(WDF811KY,SEQ,U),BYTES=14,START=1,TYPE=X                    
         FIELD NAME=(IDDISTRF),BYTES=3,START=1,TYPE=P                           
         FIELD NAME=(IDDISTRT),BYTES=3,START=4,TYPE=P                           
         FIELD NAME=(IDKUNDNF),BYTES=4,START=7,TYPE=P                           
         FIELD NAME=(IDKUNDNT),BYTES=4,START=11,TYPE=P                          
         FIELD NAME=(TISTDAT0),BYTES=4,START=16,TYPE=P                          
         FIELD NAME=(TISTDAT1),BYTES=4,START=21,TYPE=P                          
         FIELD NAME=(TISTDAT2),BYTES=4,START=26,TYPE=P                          
         FIELD NAME=(TISTDAT3),BYTES=4,START=31,TYPE=P                          
         FIELD NAME=(TISTDAT4),BYTES=4,START=36,TYPE=P                          
         FIELD NAME=(/CKSPRGR),BYTES=10,START=1,TYPE=X                          
*                                                                               
         SEGM  NAME=WDF812,PARENT=WDF801,BYTES=09,PTR=T                         
         FIELD NAME=(IDARTNR,SEQ,U),BYTES=5,START=1,TYPE=P                      
         FIELD NAME=(TISTADAT),BYTES=4,START=6,TYPE=P                           
         FIELD NAME=(/CKSPRGR),BYTES=10,START=1,TYPE=X                          
*                                                                               
         SEGM  NAME=WDF813,PARENT=WDF801,BYTES=06,PTR=T                         
         FIELD NAME=(KDARTURS,SEQ,U),BYTES=2,START=1,TYPE=X                     
         FIELD NAME=(TISTADAT),BYTES=4,START=3,TYPE=P                           
*                                                                               
         SEGM  NAME=WDF814,PARENT=WDF801,BYTES=08,PTR=T                         
         FIELD NAME=(WDF814KY,SEQ,U),BYTES=04,START=1,TYPE=X                    
         FIELD NAME=(KDPRODSF),BYTES=2,START=1,TYPE=P                           
         FIELD NAME=(KDPRODST),BYTES=2,START=3,TYPE=P                           
         FIELD NAME=(TISTADAT),BYTES=4,START=5,TYPE=P                           
*                                                                               
         SEGM  NAME=WDF815,PARENT=WDF801,BYTES=10,PTR=T                         
         FIELD NAME=(WDF815KY,SEQ,U),BYTES=06,START=1,TYPE=X                    
         FIELD NAME=(IDFKNGRF),BYTES=3,START=1,TYPE=P                           
         FIELD NAME=(IDFKNGRT),BYTES=3,START=4,TYPE=P                           
         FIELD NAME=(TISTADAT),BYTES=4,START=7,TYPE=P                           
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
