*        SPÄRRAR STYRNING INDEX=IDDISTR/IDKUNDNR                                
*                                                                               
         DBD   NAME=WDF8A,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDF8AK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDF8A1,PARENT=0,BYTES=44                                    
         FIELD NAME=(WDF8A1KY,SEQ,U),BYTES=24,START=1,TYPE=X                    
         FIELD NAME=(IDDISTRF),BYTES=3,START=1,TYPE=P                           
         FIELD NAME=(IDDISTRT),BYTES=3,START=4,TYPE=P                           
         FIELD NAME=(IDKUNDNF),BYTES=4,START=7,TYPE=P                           
         FIELD NAME=(IDKUNDNT),BYTES=4,START=11,TYPE=P                          
         FIELD NAME=(IDSPRGRP),BYTES=10,START=15,TYPE=X                         
         FIELD NAME=(TISTDAT0),BYTES=4,START=25,TYPE=P                          
         FIELD NAME=(TISTDAT1),BYTES=4,START=29,TYPE=P                          
         FIELD NAME=(TISTDAT2),BYTES=4,START=33,TYPE=P                          
         FIELD NAME=(TISTDAT3),BYTES=4,START=37,TYPE=P                          
         FIELD NAME=(TISTDAT4),BYTES=4,START=41,TYPE=P                          
         LCHILD NAME=(WDF801,WDF8),INDEX=WDF8ASEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
