*                                                                               
         DBD   NAME=WDG2,RMNAME=(V12008,,900),                         *        
               ACCESS=(HDAM,OSAM)                                               
         DATASET DD1=WDG2V,DEVICE=3390,SIZE=4096,SCAN=0                         
*                                                                               
         SEGM  NAME=WDG201,PARENT=0,BYTES=30,PTR=T                              
         FIELD NAME=(WDGXKEY,SEQ,U),BYTES=30,START=1,TYPE=X                     
         FIELD NAME=(IDHTYP),BYTES=4,START=1,TYPE=X                             
*                                                                               
         SEGM  NAME=WDG202,PARENT=WDG201,BYTES=10,PTR=T,RULES=(,HERE)           
         FIELD NAME=(KDSEGKEY),BYTES=1,START=1,TYPE=X                           
         FIELD NAME=(IDARTNR),BYTES=5,START=2,TYPE=P                            
         FIELD NAME=(IDPRODNR),BYTES=4,START=1,TYPE=P                           
         FIELD NAME=(IDKOLLI),BYTES=3,START=5,TYPE=P                            
*                                                                               
         SEGM  NAME=WDG203,PARENT=WDG201,BYTES=40,PTR=T,RULES=(,HERE)           
         FIELD NAME=(KDSEGKEY),BYTES=1,START=1,TYPE=X                           
         FIELD NAME=(IDLOPNRF),BYTES=3,START=2,TYPE=P                           
         FIELD NAME=(TIAAMMDD),BYTES=4,START=15,TYPE=P                          
         FIELD NAME=(IDPSB),BYTES=6,START=17,TYPE=X                             
         FIELD NAME=(KDTRSTAT),BYTES=1,START=22,TYPE=P                          
         FIELD NAME=(KOERKEY),BYTES=6,START=23,TYPE=X                           
         FIELD NAME=(KOERTYP),BYTES=4,START=23,TYPE=X                           
         FIELD NAME=(KOERTYP2),BYTES=3,START=23,TYPE=X                          
         FIELD NAME=(KOERTYP4),BYTES=1,START=26,TYPE=X                          
         FIELD NAME=(IDLOPNR),BYTES=2,START=27,TYPE=P                           
         FIELD NAME=(IDLBBET),BYTES=12,START=29,TYPE=X                          
*                                                                               
         SEGM  NAME=WDG205,PARENT=WDG201,BYTES=100,PTR=T,RULES=(,HERE)          
         FIELD NAME=(KDSEGKEY),BYTES=1,START=1,TYPE=X                           
         FIELD NAME=(KDLEX),BYTES=1,START=1,TYPE=X                              
         FIELD NAME=(IDKATNR),BYTES=3,START=2,TYPE=P                            
         FIELD NAME=(IDLEXNR),BYTES=3,START=5,TYPE=P                            
*                                                                               
         SEGM  NAME=WDG207,PARENT=WDG201,BYTES=10,PTR=T                         
         FIELD NAME=(WDGXKEY,SEQ,U),BYTES=10,START=1,TYPE=X                     
         FIELD NAME=(KDRAPRIO),BYTES=2,START=1,TYPE=P                           
         FIELD NAME=(KDTPOTYP),BYTES=1,START=3,TYPE=P                           
         FIELD NAME=(KDORDKL),BYTES=1,START=4,TYPE=P                            
         FIELD NAME=(IDDISTRF),BYTES=3,START=5,TYPE=P                           
         FIELD NAME=(IDDISTRT),BYTES=3,START=8,TYPE=P                           
*                                                                               
         SEGM  NAME=WDG215,PARENT=WDG201,BYTES=21,PTR=T                         
         FIELD NAME=(WDGXKEY,SEQ,U),BYTES=7,START=1,TYPE=X                      
         FIELD NAME=(IDAVINR),BYTES=4,START=4,TYPE=P                            
*                                                                               
         SEGM  NAME=WDG220,PARENT=WDG201,BYTES=25,PTR=T                         
         FIELD NAME=(WDGXKEY,SEQ,U),BYTES=5,START=1,TYPE=X                      
         FIELD NAME=(KDVALUTA),BYTES=2,START=1,TYPE=P                           
         FIELD NAME=(IDFKNGRP),BYTES=3,START=6,TYPE=P                           
         FIELD NAME=(IDUSER),BYTES=8,START=11,TYPE=X                            
         FIELD NAME=(KDVALISO),BYTES=3,START=16,TYPE=X                          
*                                                                               
         SEGM  NAME=WDG230,PARENT=WDG201,BYTES=65,PTR=T                         
         FIELD NAME=(WDGXKEY,SEQ,U),BYTES=15,START=1,TYPE=X                     
         FIELD NAME=(IDAVD),BYTES=3,START=3,TYPE=P                              
         FIELD NAME=(IDPROJK),BYTES=4,START=1,TYPE=X                            
         FIELD NAME=(IDPROJOB),BYTES=4,START=5,TYPE=X                           
         FIELD NAME=(IDPROJ),BYTES=4,START=9,TYPE=X                             
         FIELD NAME=(IDTRPTNR),BYTES=2,START=36,TYPE=P                          
         FIELD NAME=(KDCLAGER),BYTES=1,START=38,TYPE=P                          
*                                                                               
         SEGM  NAME=WDG250,PARENT=WDG201,BYTES=70,PTR=T                         
         FIELD NAME=(WDGXKEY,SEQ,U),BYTES=10,START=1,TYPE=X                     
         FIELD NAME=(IDUSER),BYTES=8,START=11,TYPE=X                            
*                                                                               
         SEGM  NAME=WDG251,PARENT=WDG250,BYTES=40,PTR=T                         
         FIELD NAME=(WDGXKEY,SEQ,U),BYTES=10,START=1,TYPE=X                     
         FIELD NAME=(FLRUTFUL),BYTES=1,START=11,TYPE=X                          
         FIELD NAME=(TESPAERR),BYTES=20,START=13,TYPE=X                         
         FIELD NAME=(KDBEHAND),BYTES=1,START=15,TYPE=P                          
*                                                                               
         SEGM  NAME=WDG260,PARENT=WDG201,BYTES=370,PTR=T,RULES=(,LAST)          
         FIELD NAME=(WDGXKEY,SEQ,M),BYTES=20,START=1,TYPE=X                     
         FIELD NAME=(IDPRODNR),BYTES=4,START=1,TYPE=P                           
         FIELD NAME=(IDPTYP),BYTES=3,START=5,TYPE=X                             
         FIELD NAME=(IDKOLLI),BYTES=3,START=8,TYPE=P                            
         FIELD NAME=(KDTRSTAT),BYTES=1,START=21,TYPE=P                          
*                                                                               
*HTR=1117                                                                       
         SEGM  NAME=WDGX1118,PARENT=WDG201,BYTES=7,PTR=T                        
         FIELD NAME=(IDARTNR,SEQ,U),BYTES=5,START=1,TYPE=P                      
*                                                                               
*HTR=1139                                                                       
         SEGM  NAME=WDGX1140,PARENT=WDG201,BYTES=10,PTR=T                       
         FIELD NAME=(KY1140,SEQ,U),BYTES=8,START=1,TYPE=X                       
         FIELD NAME=(IDLANDX2),BYTES=2,START=1,TYPE=X                           
         FIELD NAME=(IDFKNGRF),BYTES=3,START=3,TYPE=P                           
         FIELD NAME=(IDFKNGRT),BYTES=3,START=6,TYPE=P                           
*                                                                               
*HTR=1143                                                                       
         SEGM  NAME=WDGX1144,PARENT=WDG201,BYTES=8,PTR=T                        
         FIELD NAME=(KY1144,SEQ,U),BYTES=6,START=1,TYPE=X                       
         FIELD NAME=(IDFKNGRF),BYTES=3,START=1,TYPE=P                           
         FIELD NAME=(IDFKNGRT),BYTES=3,START=4,TYPE=P                           
*                                                                               
*HTR=3131                                                                       
         SEGM  NAME=WDGX3132,PARENT=WDG201,BYTES=36,PTR=T                       
         FIELD NAME=(KY3132,SEQ,U),BYTES=14,START=1,TYPE=X                      
         FIELD NAME=(IDARTNR),BYTES=5,START=1,TYPE=P                            
         FIELD NAME=(IDDISTR),BYTES=3,START=6,TYPE=P                            
         FIELD NAME=(DAFSGVV),BYTES=6,START=9,TYPE=X                            
*                                                                               
*HTR=5123                                                                       
         SEGM  NAME=WDGX5124,PARENT=WDG201,BYTES=40,PTR=T                       
         FIELD NAME=(KY5124,SEQ,U),BYTES=07,START=1,TYPE=X                      
         FIELD NAME=(IDDISTR),BYTES=3,START=1,TYPE=P                            
         FIELD NAME=(IDKUNDNR),BYTES=4,START=4,TYPE=P                           
*                                                                               
*HTR=9305                                                                       
         SEGM  NAME=WDGX9306,PARENT=WDG201,BYTES=3,PTR=T                        
         FIELD NAME=(KDVALISO,SEQ,U),BYTES=03,START=1,TYPE=X                    
*                                                                               
         SEGM  NAME=WDGX9308,PARENT=WDGX9306,BYTES=25,PTR=T                     
         FIELD NAME=(TISTADA9,SEQ,U),BYTES=04,START=1,TYPE=P                    
         FIELD NAME=(TISTADAT),BYTES=4,START=13,TYPE=P                          
*                                                                               
*HTR=9309                                                                       
         SEGM  NAME=WDGX9310,PARENT=WDG201,BYTES=89,PTR=T                       
         FIELD NAME=(KY9310,SEQ,U),BYTES=4,START=1,TYPE=X                       
         FIELD NAME=(IDLANDX2),BYTES=2,START=1,TYPE=X                           
         FIELD NAME=(KDVAT),BYTES=2,START=3,TYPE=X                              
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
