*        HÄNDELSEREGISTER GENERELLA (ALLMÄNNA) SYSTEM                           
*                                                                               
         DBD   NAME=WDG3,RMNAME=(V12008,,900),                         *        
               ACCESS=(HDAM,OSAM)                                               
         DATASET DD1=WDG3V,DEVICE=3390,SIZE=4096,SCAN=0                         
*                                                                               
         SEGM  NAME=WDG301,PARENT=0,BYTES=30,PTR=T                              
         FIELD NAME=(WDG3KEY,SEQ,U),BYTES=30,START=1,TYPE=X                     
         FIELD NAME=(IDHTYP),BYTES=4,START=1,TYPE=X                             
*                                                                               
         SEGM  NAME=WDG302,PARENT=WDG301,BYTES=10,PTR=T,RULES=(,HERE)           
         FIELD NAME=(FILLER),BYTES=1,START=1,TYPE=X                             
         FIELD NAME=(IDARTNR),BYTES=5,START=1,TYPE=P                            
*                                                                               
         SEGM  NAME=WDG303,PARENT=WDG301,BYTES=25,PTR=T,RULES=(,HERE)           
         FIELD NAME=(IDARTNR),BYTES=5,START=1,TYPE=P                            
         FIELD NAME=(IDLOPNR),BYTES=2,START=24,TYPE=P                           
         FIELD NAME=(KDTRSTAT),BYTES=1,START=19,TYPE=P                          
*                                                                               
         SEGM  NAME=WDG304,PARENT=WDG301,BYTES=50,PTR=T,RULES=(,HERE)           
         FIELD NAME=(FILLER),BYTES=1,START=1,TYPE=X                             
*                                                                               
         SEGM  NAME=WDG320,PARENT=WDG301,BYTES=25,PTR=T                         
         FIELD NAME=(WDGXKEY,SEQ,U),BYTES=5,START=1,TYPE=X                      
*                                                                               
*HTR=2253                                                                       
         SEGM  NAME=WDGX2254,PARENT=WDG301,BYTES=21,PTR=T                       
         FIELD NAME=(KY2254,SEQ,U),BYTES=7,START=1,TYPE=X                       
         FIELD NAME=(IDDC),BYTES=2,START=1,TYPE=X                               
         FIELD NAME=(IDARTNR),BYTES=5,START=3,TYPE=P                            
*                                                                               
*HTR=2255                                                                       
         SEGM  NAME=WDGX2256,PARENT=WDG301,BYTES=7,PTR=T                        
         FIELD NAME=(KY2256,SEQ,U),BYTES=7,START=1,TYPE=X                       
         FIELD NAME=(IDDC),BYTES=2,START=1,TYPE=X                               
         FIELD NAME=(IDLEVNR),BYTES=5,START=3,TYPE=X                            
*                                                                               
*HTR=2257                                                                       
         SEGM  NAME=WDGX2258,PARENT=WDG301,BYTES=5,PTR=T                        
         FIELD NAME=(IDLEVNRS,SEQ,U),BYTES=5,START=1,TYPE=X                     
*                                                                               
*HTR=2257                                                                       
         SEGM  NAME=WDGX2260,PARENT=WDGX2258,BYTES=22,PTR=T                     
         FIELD NAME=(KY2260,SEQ,U),BYTES=16,START=1,TYPE=X                      
         FIELD NAME=(DAAVROPF),BYTES=6,START=1,TYPE=X                           
         FIELD NAME=(DAAVROPT),BYTES=6,START=7,TYPE=X                           
         FIELD NAME=(IDANSKF),BYTES=2,START=13,TYPE=P                           
         FIELD NAME=(IDANSKT),BYTES=2,START=15,TYPE=P                           
*                                                                               
*HTR=2301                                                                       
         SEGM  NAME=WDGX2302,PARENT=WDG301,BYTES=10,PTR=T                       
         FIELD NAME=(IDARTNRS),BYTES=5,START=1,TYPE=P                           
*                                                                               
*HTR=2303                                                                       
         SEGM  NAME=WDGX2304,PARENT=WDG301,BYTES=17,PTR=T                       
         FIELD NAME=(IDARTNRS),BYTES=5,START=1,TYPE=P                           
*                                                                               
*HTR=5101                                                                       
         SEGM  NAME=WDGX5102,PARENT=WDG301,BYTES=4,PTR=T                        
         FIELD NAME=(KDSEGKEY,SEQ,U),BYTES=1,START=1,TYPE=X                     
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
