*                                                                               
         DBD   NAME=WDG7,RMNAME=(V12008,5,360),                        *        
               ACCESS=(HDAM,OSAM)                                               
         DATASET DD1=WDG7V,DEVICE=3390,SIZE=4096,SCAN=0                         
*                                                                               
         SEGM  NAME=WDG701,PARENT=0,BYTES=30,PTR=T                              
         FIELD NAME=(WDGXKEY,SEQ,U),BYTES=30,START=1,TYPE=X                     
         FIELD NAME=(IDHTYP),BYTES=4,START=1,TYPE=X                             
*                                                                               
*HTR=4726                                                                       
         SEGM  NAME=WDG717,PARENT=WDG701,BYTES=10,PTR=T                         
         FIELD NAME=(WDGXKEY,SEQ,U),BYTES=10,START=1,TYPE=X                     
*HTR=4726                                                                       
         SEGM  NAME=WDG718,PARENT=WDG717,BYTES=14,PTR=T                         
         FIELD NAME=(IDPRODNR,SEQ,U),BYTES=4,START=1,TYPE=P                     
*HTR=4731                                                                       
         SEGM  NAME=WDG730,PARENT=WDG701,BYTES=51,PTR=T                         
         FIELD NAME=(KDSEGKEY,SEQ,M),BYTES=1,START=1,TYPE=X                     
*HTR=4701 + 4747                                                                
         SEGM  NAME=WDG740,PARENT=WDG701,BYTES=100,PTR=T                        
         FIELD NAME=(KDSEGKEY,SEQ,M),BYTES=1,START=1,TYPE=X                     
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
