*        TERMINAL+DATUM+TID                                                     
*                                                                               
         DBD   NAME=WDG8A,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDG8AK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDG8A1,PARENT=0,BYTES=37                                    
         FIELD NAME=(WDG8A1KY,SEQ,U),BYTES=17,START=1,TYPE=X                    
         FIELD NAME=(IDLTERM),BYTES=8,START=1,TYPE=X                            
         FIELD NAME=(TIREGDAT),BYTES=4,START=9,TYPE=P                           
         FIELD NAME=(TIKLOCK),BYTES=5,START=13,TYPE=P                           
         FIELD NAME=(BELISTNR),BYTES=10,START=18,TYPE=X                         
         FIELD NAME=(IDPRTLST),BYTES=8,START=28,TYPE=X                          
         FIELD NAME=(FLSKRIV),BYTES=1,START=36,TYPE=X                           
         FIELD NAME=(KVANTEX),BYTES=1,START=37,TYPE=P                           
         LCHILD NAME=(WDG801,WDG8),INDEX=WDG8ASEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
