*        DATAREG ANSKAFFNING                                                    
*                                                                               
         DBD   NAME=WDG9,                                              *        
               ACCESS=(HISAM,VSAM)                                              
         DATASET DD1=WDG9K,DEVICE=3380,SIZE=4096                                
*                                                                               
         SEGM  NAME=WDG901,PARENT=0,BYTES=119                                   
         FIELD NAME=(WDG901KY,SEQ,U),BYTES=9,START=1,TYPE=X                     
         FIELD NAME=(TIREGDAT),BYTES=4,START=1,TYPE=P                           
         FIELD NAME=(TIKLOCK),BYTES=5,START=5,TYPE=P                            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
