*        INVENTERING                                                            
*                                                                               
         DBD   NAME=WDH1,RMNAME=(V12008,,1890),                        *        
               ACCESS=(HDAM,OSAM)                                               
         DATASET DD1=WDH1V,DEVICE=3390,SIZE=2048,SCAN=0                         
*                                                                               
         SEGM  NAME=WDH101,PARENT=0,BYTES=5,PTR=T                               
         FIELD NAME=(IDARTNR,SEQ,U),BYTES=5,START=1,TYPE=P                      
         LCHILD NAME=(WDH1A1,WDH1A),PTR=INDX                                    
         XDFLD NAME=WDH1ASEQ,SEGMENT=WDH111,                           *        
               SRCH=(IDDC,ADART,KDINVPRI,KDVVKL),                      *        
               SUBSEQ=(/CKARTNR,KDINVKAT,TISEGKEY),                    *        
               DDATA=(FLINVBEH,FLINVSKR,IDFKNGRP,KDPRODSL)                      
*                                                                               
         SEGM  NAME=WDH111,PARENT=WDH101,BYTES=150,PTR=T                        
         FIELD NAME=(WDH111KY,SEQ,U),BYTES=17,START=1,TYPE=X                    
         FIELD NAME=(IDDC),BYTES=2,START=1,TYPE=X                               
         FIELD NAME=(KDINVKAT),BYTES=2,START=3,TYPE=P                           
         FIELD NAME=(TISEGKEY),BYTES=5,START=5,TYPE=P                           
         FIELD NAME=(DAREGDAS),BYTES=8,START=10,TYPE=X                          
         FIELD NAME=(ADART),BYTES=7,START=18,TYPE=X                             
         FIELD NAME=(ADLAGOMR),BYTES=2,START=18,TYPE=P                          
         FIELD NAME=(ADGANG),BYTES=2,START=20,TYPE=P                            
         FIELD NAME=(ADPLATS),BYTES=3,START=22,TYPE=P                           
         FIELD NAME=(FLINVBEH),BYTES=1,START=25,TYPE=X                          
         FIELD NAME=(FLINVSKR),BYTES=1,START=26,TYPE=X                          
         FIELD NAME=(IDFKNGRP),BYTES=3,START=39,TYPE=P                          
         FIELD NAME=(KDINVPRI),BYTES=1,START=42,TYPE=P                          
         FIELD NAME=(KDPRODSL),BYTES=2,START=73,TYPE=P                          
         FIELD NAME=(KDVVKL),BYTES=1,START=43,TYPE=P                            
         FIELD NAME=(IDPRTINV),BYTES=4,START=69,TYPE=X                          
         FIELD NAME=(IDPRTOMG),BYTES=1,START=69,TYPE=P                          
         FIELD NAME=(IDLOPNR),BYTES=3,START=70,TYPE=P                           
         FIELD NAME=(DAREG),BYTES=5,START=93,TYPE=P                             
         FIELD NAME=(DAREG1),BYTES=5,START=98,TYPE=P                            
         FIELD NAME=(DAREG2),BYTES=5,START=103,TYPE=P                           
         FIELD NAME=(DAREG3),BYTES=5,START=108,TYPE=P                           
         FIELD NAME=(DAREGC),BYTES=5,START=113,TYPE=P                           
         FIELD NAME=(/CKARTNR),BYTES=5,START=1,TYPE=P                           
         FIELD NAME=(/CKTISEQ),BYTES=5,START=10,TYPE=P                          
*                                                                               
         LCHILD NAME=(WDH1B1,WDH1B),PTR=INDX                                    
         XDFLD NAME=WDH1BSEQ,SEGMENT=WDH111,                           *        
               SRCH=(IDDC,DAREG,ADART,IDPRTINV),                       *        
               SUBSEQ=(/CKARTNR,KDINVKAT),                             *        
               EXTRTN=WDH1BEXT                                                  
*                                                                               
* EXIT FINNS NÄR IDPRTOMG > 0                                                   
*                                                                               
*                                                                               
         LCHILD NAME=(WDH1C1,WDH1C),PTR=INDX                                    
         XDFLD NAME=WDH1CSEQ,SEGMENT=WDH111,                           *        
               SRCH=(IDDC,KDINVKAT,DAREGDAS),                          *        
               SUBSEQ=(/CKARTNR,/CKTISEQ),                             *        
               DDATA=(DAREG,DAREG1,DAREG2,DAREG3,DAREGC)                        
*                                                                               
*                                                                               
         LCHILD NAME=(WDH1D1,WDH1D),PTR=INDX                                    
         XDFLD NAME=WDH1DSEQ,SEGMENT=WDH121,                           *        
               SRCH=(IDUSER),                                          *        
               SUBSEQ=(/CKIDDC,/CKDAREG,/CKINVK,/CKARTNR,KDSEGKEY)              
*                                                                               
*                                                                               
         LCHILD NAME=(WDH1E1,WDH1E),PTR=INDX                                    
         XDFLD NAME=WDH1ESEQ,SEGMENT=WDH111,                           *        
               SRCH=(IDDC,DAREGDAS),                                   *        
               SUBSEQ=(KDINVKAT,/CKARTNR,/CKTISEQ),                    *        
               DDATA=(DAREG,DAREG1,DAREG2,DAREG3,DAREGC)                        
*                                                                               
         LCHILD NAME=(WDH1F1,WDH1F),PTR=INDX                                    
         XDFLD NAME=WDH1FSEQ,SEGMENT=WDH121,                           *        
               SRCH=(IDUSER),                                          *        
               SUBSEQ=(/CKIDDC2,/CKDAREG,/CKTISEQ,/CKARTNR,KDSEGKEY)            
*                                                                               
         SEGM  NAME=WDH121,PARENT=WDH111,BYTES=9,PTR=T                          
         FIELD NAME=(KDSEGKEY,SEQ,U),BYTES=1,START=1,TYPE=X                     
         FIELD NAME=(IDUSER),BYTES=8,START=2,TYPE=X                             
         FIELD NAME=(/CKARTNR),BYTES=5,START=1,TYPE=P                           
         FIELD NAME=(/CKIDDC),BYTES=2,START=6,TYPE=X                            
         FIELD NAME=(/CKINVK),BYTES=7,START=8,TYPE=X                            
         FIELD NAME=(/CKIDDC2),BYTES=4,START=6,TYPE=X                           
         FIELD NAME=(/CKTISEQ),BYTES=5,START=10,TYPE=P                          
         FIELD NAME=(/CKDAREG),BYTES=8,START=15,TYPE=X                          
*                                                                               
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
