*        INVENTERINGS-REGISTER SEC. IND. LAGERADRESS                            
*                                                                               
         DBD   NAME=WDH1A,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDH1AK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDH1A1,PARENT=0,BYTES=30                                    
         FIELD NAME=(WDH1A1KY,SEQ,U),BYTES=23,START=1,TYPE=X                    
         FIELD NAME=(IDDC),BYTES=2,START=1,TYPE=X                               
         FIELD NAME=(ADART),BYTES=7,START=3,TYPE=X                              
         FIELD NAME=(ADLAGOMR),BYTES=2,START=3,TYPE=P                           
         FIELD NAME=(ADGANG),BYTES=2,START=5,TYPE=P                             
         FIELD NAME=(ADPLATS),BYTES=3,START=7,TYPE=P                            
         FIELD NAME=(KDINVPRI),BYTES=1,START=10,TYPE=P                          
         FIELD NAME=(KDVVKL),BYTES=1,START=11,TYPE=P                            
         FIELD NAME=(IDARTNR),BYTES=5,START=12,TYPE=P                           
         FIELD NAME=(KDINVKAT),BYTES=2,START=17,TYPE=P                          
         FIELD NAME=(TISEGKEY),BYTES=5,START=19,TYPE=P                          
         LCHILD NAME=(WDH101,WDH1),INDEX=WDH1ASEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
