*        INVENTERINGS-REGISTER SEC. IND. PRINTID                                
*                                                                               
         DBD   NAME=WDH1E,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDH1EK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDH1E1,PARENT=0,BYTES=57                                    
         FIELD NAME=(WDH1E1KY,SEQ,U),BYTES=22,START=1,TYPE=X                    
         FIELD NAME=(IDDC),BYTES=2,START=1,TYPE=X                               
         FIELD NAME=(DAREGDAT),BYTES=8,START=3,TYPE=X                           
         FIELD NAME=(KDINVKAT),BYTES=2,START=11,TYPE=P                          
         FIELD NAME=(IDARTNR),BYTES=5,START=13,TYPE=P                           
         FIELD NAME=(TISEGKEY),BYTES=5,START=18,TYPE=P                          
         LCHILD NAME=(WDH111,WDH1),INDEX=WDH1ESEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
