*        INVENTERINGS-REGISTER SEC. IND. PRINTID                                
*                                                                               
         DBD   NAME=WDH1B,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDH1BK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDH1B1,PARENT=0,BYTES=25                                    
         FIELD NAME=(WDH1B1KY,SEQ,U),BYTES=25,START=1,TYPE=X                    
         FIELD NAME=(IDDC),BYTES=2,START=1,TYPE=X                               
         FIELD NAME=(DAREGDAT),BYTES=5,START=3,TYPE=P                           
         FIELD NAME=(ADART),BYTES=7,START=8,TYPE=X                              
         FIELD NAME=(IDPRTINV),BYTES=4,START=15,TYPE=X                          
         FIELD NAME=(IDARTNR),BYTES=5,START=19,TYPE=P                           
         FIELD NAME=(KDINVKAT),BYTES=2,START=24,TYPE=P                          
         LCHILD NAME=(WDH111,WDH1),INDEX=WDH1BSEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
