*        SAP KONTROLLREGISTER                                                   
*                                                                               
         DBD   NAME=WDH3,                                              *        
               ACCESS=(HISAM,VSAM)                                              
         DATASET DD1=WDH3K,DEVICE=3390,SIZE=4096                                
*                                                                               
         SEGM  NAME=WDH301,PARENT=0,BYTES=30                                    
         FIELD NAME=(WDH301KY,SEQ,U),BYTES=17,START=1,TYPE=X                    
         FIELD NAME=(KDSEGKEY),BYTES=1,START=1,TYPE=X                           
         FIELD NAME=(KDTRADP),BYTES=4,START=2,TYPE=X                            
         FIELD NAME=(IDANALYS),BYTES=12,START=6,TYPE=X                          
         FIELD NAME=(IDKONTO),BYTES=6,START=6,TYPE=P                            
         FIELD NAME=(IDKST),BYTES=10,START=6,TYPE=X                             
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
