*        EKONOMI HÄNDELSER                                                      
*                                                                               
         DBD   NAME=WDH5,RMNAME=(V12008,4,315),                        *        
               ACCESS=(HDAM,OSAM)                                               
         DATASET DD1=WDH5V,DEVICE=3390,SIZE=2048,SCAN=0                         
*                                                                               
         SEGM  NAME=WDH501,PARENT=0,BYTES=30,PTR=T                              
         FIELD NAME=(WDH501KY,SEQ,U),BYTES=5,START=1,TYPE=X                     
         FIELD NAME=(IDFTG),BYTES=2,START=1,TYPE=X                              
         FIELD NAME=(KDEKHHT),BYTES=3,START=3,TYPE=X                            
*                                                                               
         SEGM  NAME=WDH511,PARENT=WDH501,BYTES=28,PTR=T                         
         FIELD NAME=(KDEKSHT,SEQ,U),BYTES=3,START=1,TYPE=X                      
*                                                                               
         SEGM  NAME=WDH521,PARENT=WDH511,BYTES=29,PTR=T                         
         FIELD NAME=(KDEKNIVA,SEQ,U),BYTES=5,START=1,TYPE=X                     
*                                                                               
         SEGM  NAME=WDH531,PARENT=WDH521,BYTES=64,PTR=T                         
         FIELD NAME=(WDH531KY,SEQ,U),BYTES=11,START=1,TYPE=X                    
         FIELD NAME=(IDSYSMOT),BYTES=6,START=1,TYPE=X                           
         FIELD NAME=(IDPTYP),BYTES=3,START=7,TYPE=X                             
         FIELD NAME=(IDSEKVNR),BYTES=2,START=10,TYPE=P                          
         FIELD NAME=(/CKKDEKH),BYTES=13,START=1,TYPE=X                          
         LCHILD NAME=(WDH5A1,WDH5A),PTR=INDX                                    
         XDFLD NAME=WDH5ASEQ,SEGMENT=WDH531,                           *        
               SRCH=(IDSYSMOT,IDPTYP,IDSEKVNR),                        *        
               SUBSEQ=(/CKKDEKH)                                                
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
