*        EKONOMIHÄNDELSER INDEX=IDSYSMOT                                        
*                                                                               
         DBD   NAME=WDH5A,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDH5AK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDH5A1,PARENT=0,BYTES=24                                    
         FIELD NAME=(WDH5A1KY,SEQ,U),BYTES=24,START=1,TYPE=X                    
         FIELD NAME=(IDSYSMOT),BYTES=6,START=1,TYPE=X                           
         FIELD NAME=(IDPTYP),BYTES=3,START=7,TYPE=X                             
         FIELD NAME=(IDSEKVNR),BYTES=2,START=10,TYPE=P                          
         FIELD NAME=(IDFTG),BYTES=2,START=12,TYPE=X                             
         FIELD NAME=(KDEKHHT),BYTES=3,START=14,TYPE=X                           
         FIELD NAME=(KDEKSHT),BYTES=3,START=17,TYPE=X                           
         FIELD NAME=(KDEKNIVA),BYTES=5,START=20,TYPE=X                          
         LCHILD NAME=(WDH531,WDH5),INDEX=WDH5ASEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
