*        SOFTWARE-PIE HISTORIK, INDEX=IDPIERAD                                  
*                                                                               
         DBD   NAME=WDI1A,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDI1AK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDI1A1,PARENT=0,BYTES=26                                    
         FIELD NAME=(WDI1A1KY,SEQ,U),BYTES=26,START=1,TYPE=X                    
         FIELD NAME=(IDPIERAD),BYTES=20,START=1,TYPE=X                          
         FIELD NAME=(TIREGDAT),BYTES=6,START=21,TYPE=X                          
         LCHILD NAME=(WDI111,WDI1),INDEX=WDI1ASEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
