*        SOFTWARE-PIE HISTORIK                                                  
*                                                                               
         DBD   NAME=WDI1,RMNAME=(V12008,,36000),                       *        
               ACCESS=(HDAM,OSAM)                                               
         DATASET DD1=WDI1V,DEVICE=3390,SIZE=4096,SCAN=0                         
*                                                                               
         SEGM  NAME=WDI101,PARENT=0,BYTES=20,PTR=T                              
         FIELD NAME=(WDI101KY,SEQ,U),BYTES=13,START=1,TYPE=X                    
         FIELD NAME=TIREGDAT,BYTES=6,START=1,TYPE=X                             
         FIELD NAME=IDDISTR,BYTES=3,START=7,TYPE=P                              
         FIELD NAME=IDKUNDNR,BYTES=4,START=10,TYPE=P                            
*                                                                               
         SEGM  NAME=WDI111,PARENT=WDI101,BYTES=27,PTR=T                         
         FIELD NAME=(IDPIERAD,SEQ,U),BYTES=20,START=1,TYPE=X                    
         FIELD NAME=(/CKTIREG),BYTES=6,START=1,TYPE=X                           
         LCHILD NAME=(WDI1A1,WDI1A),PTR=INDX                                    
         XDFLD NAME=WDI1ASEQ,SEGMENT=WDI111,                           *        
               SRCH=(IDPIERAD),                                        *        
               SUBSEQ=(/CKTIREG)                                                
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
