*        ARTNR                                                                  
*                                                                               
         DBD   NAME=WDJ1A,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDJ1AK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDJ1A1,PARENT=0,BYTES=18                                    
         FIELD NAME=(WDJ1A1KY,SEQ,U),BYTES=5,START=1,TYPE=X                     
         FIELD NAME=(IDARTNR),BYTES=5,START=1,TYPE=P                            
         FIELD NAME=(IDLEVNR),BYTES=5,START=6,TYPE=X                            
         FIELD NAME=(TIREGDAT),BYTES=4,START=11,TYPE=P                          
         FIELD NAME=(TIUPPDAT),BYTES=4,START=15,TYPE=P                          
         LCHILD NAME=(WDJ101,WDJ1),INDEX=WDJ1ASEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
