*        USER+ARTNR                                                             
*                                                                               
         DBD   NAME=WDJ1D,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDJ1DK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDJ1D1,PARENT=0,BYTES=13                                    
         FIELD NAME=(WDJ1D1KY,SEQ,U),BYTES=13,START=1,TYPE=X                    
         FIELD NAME=(IDUSER),BYTES=8,START=1,TYPE=X                             
         FIELD NAME=(IDARTNR),BYTES=5,START=9,TYPE=P                            
         LCHILD NAME=(WDJ101,WDJ1),INDEX=WDJ1DSEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
