*        CLAGER+PRC                                                             
*                                                                               
         DBD   NAME=WDJ2A,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDJ2AK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDJ2A1,PARENT=0,BYTES=32                                    
         FIELD NAME=(WDJ2A1KY,SEQ,U),BYTES=32,START=1,TYPE=X                    
         FIELD NAME=(KDCLAGER),BYTES=1,START=1,TYPE=P                           
         FIELD NAME=(IDPRC),BYTES=4,START=2,TYPE=X                              
         FIELD NAME=(KVRORAD9),BYTES=3,START=6,TYPE=P                           
         FIELD NAME=(RELSKVOL),BYTES=3,START=9,TYPE=P                           
         FIELD NAME=(FLSATPRI),BYTES=1,START=12,TYPE=X                          
         FIELD NAME=(RELSKVOS),BYTES=3,START=13,TYPE=P                          
         FIELD NAME=(IDARTNR),BYTES=5,START=16,TYPE=P                           
         FIELD NAME=(DAREGDAT),BYTES=8,START=21,TYPE=X                          
         FIELD NAME=(IDORDNST),BYTES=4,START=29,TYPE=X                          
         LCHILD NAME=(WDJ201,WDJ2),INDEX=WDJ2ASEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
