*    180 BLOCK = 1 CYL                                                          
         DBD   NAME=WDJ2,RMNAME=(V12008,,900),                         *        
               ACCESS=(HDAM,OSAM)                                               
         DATASET DD1=WDJ2V,DEVICE=3390,SIZE=4096,SCAN=0                         
*                                                                               
         SEGM  NAME=WDJ201,PARENT=0,BYTES=140,PTR=T                             
         FIELD NAME=(IDORDNST,SEQ,U),BYTES=4,START=1,TYPE=X                     
         FIELD NAME=(IDORDNSB),BYTES=3,START=1,TYPE=P                           
         FIELD NAME=(IDORDNSS),BYTES=1,START=3,TYPE=P                           
         FIELD NAME=(FLBYGGB),BYTES=1,START=5,TYPE=X                            
         FIELD NAME=(IDANSK),BYTES=2,START=20,TYPE=P                            
         FIELD NAME=(IDARTNR),BYTES=5,START=22,TYPE=P                           
         FIELD NAME=(IDPRC),BYTES=4,START=55,TYPE=X                             
         FIELD NAME=(KDCLAGER),BYTES=1,START=71,TYPE=P                          
         FIELD NAME=(KDSATSTA),BYTES=1,START=81,TYPE=X                          
         FIELD NAME=(DAREGDAT),BYTES=8,START=103,TYPE=X                         
         FIELD NAME=(FILLERA),BYTES=10,START=123,TYPE=X                         
         FIELD NAME=(KVRORAD9),BYTES=3,START=123,TYPE=P                         
         FIELD NAME=(RELSKVOL),BYTES=3,START=126,TYPE=P                         
         FIELD NAME=(FLSATPRI),BYTES=1,START=129,TYPE=X                         
         FIELD NAME=(RELSKVOS),BYTES=3,START=130,TYPE=P                         
         LCHILD NAME=(WDJ2A1,WDJ2A),PTR=INDX                                    
         XDFLD NAME=WDJ2ASEQ,SEGMENT=WDJ201,                           *        
               SRCH=(KDCLAGER,IDPRC,FILLERA,IDARTNR,DAREGDAT),         *        
               SUBSEQ=(IDORDNST),                                      *        
               EXTRTN=WDJ2AEXT                                                  
*                                                                               
* EXIT FINNS NÄR FLBYGGB = J OCH KDSATSTA = R                                   
*                                                                               
         LCHILD NAME=(WDJ2B1,WDJ2B),PTR=INDX                                    
         XDFLD NAME=WDJ2BSEQ,SEGMENT=WDJ201,                           *        
               SRCH=(IDANSK,FLBYGGB,IDARTNR,DAREGDAT),                 *        
               SUBSEQ=(IDORDNST)                                                
         LCHILD NAME=(WDJ2C1,WDJ2C),PTR=INDX                                    
         XDFLD NAME=WDJ2CSEQ,SEGMENT=WDJ201,                           *        
               SRCH=(IDARTNR,DAREGDAT),                                *        
               SUBSEQ=(IDORDNST)                                                
         LCHILD NAME=(WDJ2D1,WDJ2D),PTR=INDX                                    
         XDFLD NAME=WDJ2DSEQ,SEGMENT=WDJ201,                           *        
               SRCH=(KDCLAGER,FILLERA,IDARTNR,DAREGDAT),               *        
               SUBSEQ=(IDORDNST),                                      *        
               EXTRTN=WDJ2DEXT                                                  
*                                                                               
* EXIT FINNS NÄR KDSATSTA = R                                                   
*                                                                               
         SEGM  NAME=WDJ211,PARENT=WDJ201,BYTES=74,PTR=T                         
         FIELD NAME=(IDARTNR,SEQ,U),BYTES=5,START=1,TYPE=P                      
         FIELD NAME=(FLSATUTS),BYTES=1,START=7,TYPE=X                           
         FIELD NAME=(KDCLAGER),BYTES=1,START=36,TYPE=P                          
         FIELD NAME=(KDSATKMB),BYTES=1,START=40,TYPE=X                          
         FIELD NAME=(/CKIDORD),BYTES=4,START=1,TYPE=X                           
         LCHILD NAME=(WDJ2E1,WDJ2E),PTR=INDX                                    
         XDFLD NAME=WDJ2ESEQ,SEGMENT=WDJ211,                           *        
               SRCH=(KDCLAGER,IDARTNR),                                *        
               SUBSEQ=(/CKIDORD),                                      *        
               EXTRTN=WDJ2EEXT                                                  
*                                                                               
* EXIT FINNS NÄR FLSATUTS = N                                                   
*                                                                               
         SEGM  NAME=WDJ212,PARENT=WDJ201,BYTES=95,PTR=T                         
         FIELD NAME=(WDJ212KY,SEQ,U),BYTES=13,START=1,TYPE=X                    
         FIELD NAME=(KDSATLI),BYTES=1,START=1,TYPE=X                            
         FIELD NAME=(ADLAGOMR),BYTES=2,START=2,TYPE=P                           
         FIELD NAME=(ADGANG),BYTES=2,START=4,TYPE=P                             
         FIELD NAME=(ADPLATS),BYTES=3,START=6,TYPE=P                            
         FIELD NAME=(IDARTNR),BYTES=5,START=9,TYPE=P                            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
