*        ARTNR                                                                  
*                                                                               
         DBD   NAME=WDJ2E,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDJ2EK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDJ2E1,PARENT=0,BYTES=10                                    
         FIELD NAME=(WDJ2E1KY,SEQ,U),BYTES=10,START=1,TYPE=X                    
         FIELD NAME=(KDCLAGER),BYTES=1,START=1,TYPE=P                           
         FIELD NAME=(IDARTNR),BYTES=5,START=2,TYPE=P                            
         FIELD NAME=(IDORDNST),BYTES=4,START=7,TYPE=X                           
         LCHILD NAME=(WDJ211,WDJ2),INDEX=WDJ2ESEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
