*        ANSKAFFARE                                                             
*                                                                               
         DBD   NAME=WDJ2B,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDJ2BK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDJ2B1,PARENT=0,BYTES=20                                    
         FIELD NAME=(WDJ2B1KY,SEQ,U),BYTES=20,START=1,TYPE=X                    
         FIELD NAME=(IDANSK),BYTES=2,START=1,TYPE=P                             
         FIELD NAME=(FLBYGGB),BYTES=1,START=3,TYPE=X                            
         FIELD NAME=(IDARTNR),BYTES=5,START=4,TYPE=P                            
         FIELD NAME=(DAREGDAT),BYTES=8,START=9,TYPE=X                           
         FIELD NAME=(IDORDNST),BYTES=4,START=17,TYPE=X                          
         LCHILD NAME=(WDJ201,WDJ2),INDEX=WDJ2BSEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
