*        INVENTERINGSREGISTER ACS INGÅNG ADART                                  
*                                                                               
         DBD   NAME=WDJ7A,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDJ7AK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDJ7A1,PARENT=0,BYTES=23                                    
         FIELD NAME=(WDJ7A1KY,SEQ,U),BYTES=16,START=1,TYPE=X                    
         FIELD NAME=(IDDC),BYTES=2,START=1,TYPE=X                               
         FIELD NAME=(ADART),BYTES=9,START=3,TYPE=X                              
         FIELD NAME=(IDARTNR),BYTES=5,START=12,TYPE=P                           
         LCHILD NAME=(WDJ701,WDJ7),INDEX=WDJ7ASEQ,PTR=SYMB                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
