*        INVENTERINGSREGISTER INGÅNG ACSNR PRIMECOUNT                           
*                                                                               
         DBD   NAME=WDJ7D,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDJ7DK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDJ7D1,PARENT=0,BYTES=56                                    
         FIELD NAME=(WDJ7D1KY,SEQ,U),BYTES=20,START=1,TYPE=X                    
         FIELD NAME=(IDDC),BYTES=2,START=1,TYPE=X                               
         FIELD NAME=(IDACSNRP),BYTES=4,START=3,TYPE=P                           
         FIELD NAME=(ADART),BYTES=9,START=07,TYPE=X                             
         FIELD NAME=(IDARTNR),BYTES=5,START=16,TYPE=P                           
         FIELD NAME=(BEART),BYTES=25,START=21,TYPE=X                            
         FIELD NAME=(KVLS),BYTES=4,START=46,TYPE=P                              
         LCHILD NAME=(WDJ701,WDJ7),INDEX=WDJ7DSEQ,PTR=SYMB                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
