*        LAGERPLATS REGISTER (WLLOCA)                                           
*                                                                               
         DBD   NAME=WDJ8,                                              *        
               ACCESS=(HISAM,VSAM)                                              
         DATASET DD1=WDJ8K,DEVICE=3390,SIZE=4096                                
*                                                                               
         SEGM  NAME=WDJ801,PARENT=0,BYTES=41                                    
         FIELD NAME=(WDJ801KY,SEQ,U),BYTES=11,START=1,TYPE=X                    
         FIELD NAME=(IDDC),BYTES=2,START=1,TYPE=X                               
         FIELD NAME=(ADLAGOMR),BYTES=2,START=3,TYPE=X                           
         FIELD NAME=(ADGANG),BYTES=2,START=5,TYPE=X                             
         FIELD NAME=(ADPLATS),BYTES=5,START=7,TYPE=X                            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
