*        FJOLÅRETS ARTIKELINFORMATION                                           
*                                                                               
         DBD   NAME=WDK1,RMNAME=(V12008,10,71280),                     *        
               ACCESS=(HDAM,OSAM)                                               
         DATASET DD1=WDK1V,DEVICE=3390,SIZE=4096,SCAN=0                         
*                                                                               
         SEGM  NAME=WDK101,PARENT=0,BYTES=435,PTR=T                             
         FIELD NAME=(IDARTNR,SEQ,U),BYTES=5,START=1,TYPE=P                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
