*        ETIKETT REGISTER                                                       
*                                                                               
         DBD   NAME=WDK3,RMNAME=(V12008,4,5400),                       *        
               ACCESS=(HDAM,OSAM)                                               
         DATASET DD1=WDK3V,DEVICE=3390,SIZE=4096,SCAN=0                         
*                                                                               
         SEGM  NAME=WDK301,PARENT=0,BYTES=103,PTR=T                             
         FIELD NAME=(IDARTNR,SEQ,U),BYTES=05,START=1,TYPE=P                     
*                                                                               
         SEGM  NAME=WDK311,PARENT=WDK301,BYTES=63,PTR=T                         
         FIELD NAME=(IDRADNR,SEQ,U),BYTES=3,START=1,TYPE=P                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
