*        RENSADE ARTIKLAR                                                       
*                                                                               
         DBD   NAME=WDK4,RMNAME=(V12008,,9450),                        *        
               ACCESS=(HDAM,OSAM)                                               
         DATASET DD1=WDK4V,DEVICE=3390,SIZE=2048,SCAN=0                         
*                                                                               
         SEGM  NAME=WDK401,PARENT=0,BYTES=89,PTR=T                              
         FIELD NAME=(IDARTNR,SEQ,U),BYTES=05,START=1,TYPE=P                     
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
