*        ARTIKELREGISTER SEC. IND. IDDC-REF                                     
*                                                                               
         DBD   NAME=WDK6H,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDK6HK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDK6H1,PARENT=0,BYTES=09                                    
         FIELD NAME=(WDK6H1KY,SEQ,U),BYTES=07,START=1,TYPE=X                    
         FIELD NAME=(IDDCREF),BYTES=2,START=1,TYPE=X                            
         FIELD NAME=(IDARTNR),BYTES=5,START=3,TYPE=P                            
         FIELD NAME=(IDPERSB),BYTES=2,START=8,TYPE=P                            
         LCHILD NAME=(WDK629,WDK6),INDEX=WDK6HSEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
