*        ARTIKELREGISTER SEC. IND. LEVERANTÖR-SHIP                              
*                                                                               
         DBD   NAME=WDK6G,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDK6GK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDK6G1,PARENT=0,BYTES=10                                    
         FIELD NAME=(WDK6G1KY,SEQ,U),BYTES=10,START=1,TYPE=X                    
         FIELD NAME=(IDLEVNRS),BYTES=5,START=1,TYPE=X                           
         FIELD NAME=(IDARTNR),BYTES=5,START=6,TYPE=P                            
         LCHILD NAME=(WDK601,WDK6),INDEX=WDK6GSEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
