*        ARTIKELREGISTER SEC. IND. LEVERANTÖR                                   
*                                                                               
         DBD   NAME=WDK6A,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDK6AK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDK6A1,PARENT=0,BYTES=12                                    
         FIELD NAME=(WDK6A1KY,SEQ,U),BYTES=10,START=1,TYPE=X                    
         FIELD NAME=(IDLEVNR),BYTES=5,START=1,TYPE=X                            
         FIELD NAME=(IDARTNR),BYTES=5,START=6,TYPE=P                            
         FIELD NAME=(KDERS),BYTES=2,START=11,TYPE=P                             
         LCHILD NAME=(WDK601,WDK6),INDEX=WDK6ASEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
