*        ARTIKELREGISTER SEC. IND. ADART                                        
*                                                                               
         DBD   NAME=WDK6E,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDK6EK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDK6E1,PARENT=0,BYTES=12                                    
         FIELD NAME=(WDK6E1KY,SEQ,U),BYTES=12,START=1,TYPE=X                    
         FIELD NAME=(ADART),BYTES=7,START=1,TYPE=X                              
         FIELD NAME=(IDARTNR),BYTES=5,START=8,TYPE=P                            
         LCHILD NAME=(WDK611,WDK6),INDEX=WDK6ESEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
