*        ARTIKELREGISTER SEC. IND. EMBALLAGE ARTIKEL NUMMER                     
*                                                                               
         DBD   NAME=WDK6C,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDK6CK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDK6C1,PARENT=0,BYTES=13                                    
         FIELD NAME=(WDK6C1KY,SEQ,U),BYTES=13,START=1,TYPE=X                    
         FIELD NAME=(EMBARTNR),BYTES=5,START=1,TYPE=P                           
         FIELD NAME=(IDARTNR),BYTES=5,START=6,TYPE=P                            
         LCHILD NAME=(WDK601,WDK6),INDEX=WDK6CSEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
