*        ARTIKELREGISTER SEC. IND. BYTES EXTRA RETURVECKOR                      
*                                                                               
         DBD   NAME=WDK6D,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDK6DK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDK6D1,PARENT=0,BYTES=5                                     
         FIELD NAME=(WDK6D1KY,SEQ,U),BYTES=5,START=1,TYPE=P                     
         LCHILD NAME=(WDK601,WDK6),INDEX=WDK6DSEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
