*        ARTIKELREGISTER SEC. IND. IDAO                                         
*                                                                               
         DBD   NAME=WDK6F,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDK6FK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDK6F1,PARENT=0,BYTES=15                                    
         FIELD NAME=(WDK6F1KY,SEQ,U),BYTES=15,START=1,TYPE=X                    
         FIELD NAME=(IDAO),BYTES=10,START=1,TYPE=X                              
         FIELD NAME=(IDARTNR),BYTES=5,START=11,TYPE=P                           
         LCHILD NAME=(WDK601,WDK6),INDEX=WDK6FSEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
