*        ARTIKELREGISTER S-LAGER                                                
*                                                                               
         DBD   NAME=WDK7,RMNAME=(V12008,1,225000),                     *        
               ACCESS=(HDAM,OSAM)                                               
         DATASET DD1=WDK7V,DEVICE=3390,SIZE=8192,SCAN=0                         
*                                                                               
         SEGM  NAME=WDK701,PARENT=0,BYTES=5,PTR=T                               
         FIELD NAME=(IDARTNR,SEQ,U),BYTES=5,START=1,TYPE=P                      
*                                                                               
         SEGM  NAME=WDK711,PARENT=WDK701,BYTES=290,PTR=T                        
         FIELD NAME=(IDDC,SEQ,U),BYTES=2,START=1,TYPE=X                         
         FIELD NAME=(IDDC1),BYTES=1,START=1,TYPE=X                              
         FIELD NAME=(ADART),BYTES=7,START=3,TYPE=X                              
         FIELD NAME=(IDDCREF),BYTES=2,START=40,TYPE=X                           
         FIELD NAME=(IDLEVNR),BYTES=5,START=42,TYPE=X                           
         FIELD NAME=(PRAVCOST),BYTES=5,START=156,TYPE=P                         
         FIELD NAME=(/CKIDART),BYTES=5,START=1,TYPE=P                           
         LCHILD NAME=(WDK7A1,WDK7A),PTR=INDX                                    
         XDFLD NAME=WDK7ASEQ,SEGMENT=WDK711,                           *        
               SRCH=(IDDC,ADART),                                      *        
               SUBSEQ=(/CKIDART),                                      *        
               DDATA=(IDLEVNR)                                                  
*                                                                               
         LCHILD NAME=(WDK7B1,WDK7B),PTR=INDX                                    
         XDFLD NAME=WDK7BSEQ,SEGMENT=WDK711,                           *        
               SRCH=(IDDCREF),NULLVAL=BLANK,                           *        
               SUBSEQ=(IDDC,/CKIDART),                                 *        
               EXTRTN=WDK7BEXT                                                  
*                                                                               
* EXIT FINNS NÄR IDDC POS.1 = '7' (DVS. BARA KINA-LAGER)                        
*                                                                               
         SEGM  NAME=WDK721,PARENT=WDK711,BYTES=140,PTR=NT                       
         FIELD NAME=(KDSEGKEY,SEQ,U),BYTES=1,START=1,TYPE=X                     
*                                                                               
         SEGM  NAME=WDK722,PARENT=WDK711,BYTES=170,PTR=NT                       
         FIELD NAME=(KDSEGKEY,SEQ,U),BYTES=1,START=1,TYPE=X                     
*                                                                               
         SEGM  NAME=WDK723,PARENT=WDK711,BYTES=21,PTR=T                         
         FIELD NAME=(WDK723KY,SEQ,U),BYTES=12,START=1,TYPE=X                    
         FIELD NAME=(IDAVTAL),BYTES=7,START=1,TYPE=P                            
         FIELD NAME=(IDLEVNRA),BYTES=5,START=8,TYPE=X                           
*                                                                               
         SEGM  NAME=WDK724,PARENT=WDK711,BYTES=44,PTR=T                         
         FIELD NAME=(WDK724KY,SEQ,U),BYTES=13,START=1,TYPE=X                    
         FIELD NAME=(DAPRLIST),BYTES=8,START=1,TYPE=X                           
         FIELD NAME=(IDLEVNRP),BYTES=5,START=9,TYPE=X                           
*                                                                               
         SEGM  NAME=WDK725,PARENT=WDK711,BYTES=17,PTR=T,RULES=(,HERE)           
         FIELD NAME=(IDBEST),BYTES=7,START=1,TYPE=P                             
*                                                                               
         SEGM  NAME=WDK727,PARENT=WDK711,BYTES=15,PTR=NT                        
         FIELD NAME=(KDSEGKEY,SEQ,U),BYTES=1,START=1,TYPE=X                     
*                                                                               
         SEGM  NAME=WDK728,PARENT=WDK711,BYTES=53,PTR=T                         
         FIELD NAME=(DAINLEV,SEQ,U),BYTES=16,START=1,TYPE=X                     
         FIELD NAME=(IDTRACK),BYTES=25,START=29,TYPE=X                          
*                                                                               
         SEGM  NAME=WDK712,PARENT=WDK701,BYTES=75,PTR=T                         
         FIELD NAME=(IDLAND,SEQ,U),BYTES=2,START=1,TYPE=X                       
*                                                                               
         SEGM  NAME=WDK726,PARENT=WDK712,BYTES=08,PTR=T                         
         FIELD NAME=(KDEMBKEY,SEQ,U),BYTES=03,START=1,TYPE=X                    
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
