*        ORDER PACKUNDERLAG STATISTIK                                           
*                                                                               
         DBD   NAME=WDL1,RMNAME=(V12008,10,510300),                    *        
               ACCESS=(HDAM,OSAM)                                               
         DATASET DD1=WDL1V,DEVICE=3390,SIZE=2048,SCAN=0                         
*                                                                               
         SEGM  NAME=WDL101,PARENT=0,BYTES=19,PTR=T                              
         FIELD NAME=(WDL101KY,SEQ,U),BYTES=19,START=1,TYPE=X                    
         FIELD NAME=(IDDISTR),BYTES=3,START=1,TYPE=P                            
         FIELD NAME=(IDKUNDNR),BYTES=4,START=4,TYPE=P                           
         FIELD NAME=(IDKUNDRF),BYTES=10,START=8,TYPE=X                          
         FIELD NAME=(IDDC),BYTES=2,START=18,TYPE=X                              
*                                                                               
         SEGM  NAME=WDL111,PARENT=WDL101,BYTES=8,PTR=T                          
         FIELD NAME=(DAFAKT,SEQ,U),BYTES=8,START=1,TYPE=X                       
*                                                                               
         SEGM  NAME=WDL112,PARENT=WDL101,BYTES=8,PTR=T                          
         FIELD NAME=(DAHISTOB,SEQ,U),BYTES=8,START=1,TYPE=X                     
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
