*        INLEV-HISTORIK                                                         
*                                                                               
         DBD   NAME=WDL2,RMNAME=(V12008,2,252000,50000),               *        
               ACCESS=(HDAM,OSAM)                                               
         DATASET DD1=WDL2V,DEVICE=3390,SIZE=2048,SCAN=0                         
*                                                                               
         SEGM  NAME=WDL201,PARENT=0,BYTES=5,PTR=T                               
         FIELD NAME=(IDARTNR,SEQ,U),BYTES=5,START=1,TYPE=P                      
*                                                                               
         SEGM  NAME=WDL211,PARENT=WDL201,BYTES=16,PTR=T                         
         FIELD NAME=(DAINLEV,SEQ,U),BYTES=16,START=1,TYPE=X                     
*                                                                               
         SEGM  NAME=WDL221,PARENT=WDL211,BYTES=107,PTR=NT                       
         FIELD NAME=(IDPTYP),BYTES=3,START=1,TYPE=X                             
         FIELD NAME=(IDLOPNRM),BYTES=5,START=4,TYPE=P                           
         FIELD NAME=(IDLEVNR),BYTES=5,START=43,TYPE=X                           
*                                                                               
         SEGM  NAME=WDL231,PARENT=WDL221,BYTES=10,PTR=T                         
         FIELD NAME=(TIREGDAT),BYTES=4,START=1,TYPE=P                           
*                                                                               
         SEGM  NAME=WDL222,PARENT=WDL211,BYTES=92,PTR=NT                        
         FIELD NAME=(IDPTYP),BYTES=3,START=1,TYPE=X                             
         FIELD NAME=(IDLOPNRM),BYTES=5,START=4,TYPE=P                           
*                                                                               
         SEGM  NAME=WDL223,PARENT=WDL211,BYTES=25,PTR=NT                        
         FIELD NAME=(IDPTYP),BYTES=3,START=1,TYPE=X                             
         FIELD NAME=(IDLOPNRM),BYTES=5,START=4,TYPE=P                           
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
