*        ORDERINGÅNGS-HISTORIK REGISTER SDC                                     
*                                                                               
         DBD   NAME=WDL4,RMNAME=(V12008,1,384000),                     *        
               ACCESS=(HDAM,OSAM)                                               
         DATASET DD1=WDL4V,DEVICE=3390,SIZE=8192,SCAN=0                         
*                                                                               
         SEGM  NAME=WDL401,PARENT=0,BYTES=5,PTR=T                               
         FIELD NAME=(IDARTNR,SEQ,U),BYTES=5,START=1,TYPE=P                      
*                                                                               
         SEGM  NAME=WDL411,PARENT=WDL401,BYTES=566,PTR=T                        
         FIELD NAME=(IDDC,SEQ,U),BYTES=2,START=1,TYPE=X                         
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
