*        FAKTURAHISTORIK INDEX=IDSHIPM                                          
*                                                                               
         DBD   NAME=WDL5A,                                             *        
               ACCESS=(INDEX,VSAM)                                              
         DATASET DD1=WDL5AK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDL5A1,PARENT=0,BYTES=29                                    
         FIELD NAME=(WDL5A1KY,SEQ,U),BYTES=18,START=1,TYPE=X                    
         FIELD NAME=(IDSHIPM),BYTES=7,START=1,TYPE=X                            
         FIELD NAME=(IDFAKT),BYTES=4,START=8,TYPE=P                             
         FIELD NAME=(IDPRODNR),BYTES=4,START=12,TYPE=P                          
         FIELD NAME=(IDKOLLI),BYTES=3,START=16,TYPE=P                           
         LCHILD NAME=(WDL511,WDL5),INDEX=WDL5ASEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
