*        FAKTURA HISTORIK                                                       
*                                                                               
         DBD   NAME=WDL5,RMNAME=(V12008,1,180000),                     *        
               ACCESS=(HDAM,OSAM)                                               
         DATASET DD1=WDL5V,DEVICE=3390,SIZE=16384,SCAN=0                        
*                                                                               
         SEGM  NAME=WDL501,PARENT=0,BYTES=172,PTR=T                             
         FIELD NAME=(IDFAKT,SEQ,U),BYTES=4,START=1,TYPE=P                       
         FIELD NAME=(IDDC),BYTES=2,START=5,TYPE=X                               
*                                                                               
         SEGM  NAME=WDL511,PARENT=WDL501,BYTES=62,PTR=T                         
         FIELD NAME=(WDL511KY,SEQ,U),BYTES=7,START=1,TYPE=X                     
         FIELD NAME=(IDPRODNR),BYTES=4,START=1,TYPE=P                           
         FIELD NAME=(IDKOLLI),BYTES=3,START=5,TYPE=P                            
         FIELD NAME=(IDGMTREF),BYTES=17,START=8,TYPE=X                          
         FIELD NAME=(IDDISTR),BYTES=3,START=8,TYPE=P                            
         FIELD NAME=(IDKUNDNR),BYTES=4,START=11,TYPE=P                          
         FIELD NAME=(IDORDNR7),BYTES=7,START=15,TYPE=X                          
         FIELD NAME=(IDSHIPM),BYTES=7,START=29,TYPE=X                           
         FIELD NAME=(TISKEPPN),BYTES=4,START=36,TYPE=P                          
         FIELD NAME=(TIFAKT),BYTES=4,START=40,TYPE=P                            
         FIELD NAME=(/CKFAKT),BYTES=4,START=1,TYPE=P                            
         LCHILD NAME=(WDL5A1,WDL5A),PTR=INDX                                    
         XDFLD NAME=WDL5ASEQ,SEGMENT=WDL511,                           *        
               SRCH=(IDSHIPM),                                         *        
               SUBSEQ=(/CKFAKT,IDPRODNR,IDKOLLI),                      *        
               DDATA=(IDDISTR,TISKEPPN,TIFAKT)                                  
*                                                                               
         SEGM  NAME=WDL521,PARENT=WDL511,BYTES=161,PTR=T                        
         FIELD NAME=(WDL521KY,SEQ,U),BYTES=8,START=1,TYPE=X                     
         FIELD NAME=(IDARTNR),BYTES=5,START=1,TYPE=P                            
         FIELD NAME=(IDPURAD),BYTES=3,START=6,TYPE=P                            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
