*        SDC INLEV HISTORIK REGISTER                                            
*                                                                               
         DBD   NAME=WDL6,RMNAME=(V12008,1,540000),                     *        
               ACCESS=(HDAM,OSAM)                                               
         DATASET DD1=WDL6V,DEVICE=3390,SIZE=8192,SCAN=5                         
*                                                                               
         SEGM  NAME=WDL601,PARENT=0,BYTES=5,PTR=T                               
         FIELD NAME=(IDARTNR,SEQ,U),BYTES=5,START=1,TYPE=P                      
*                                                                               
         SEGM  NAME=WDL611,PARENT=WDL601,BYTES=181,PTR=T                        
         FIELD NAME=(DAINLEV,SEQ,U),BYTES=16,START=1,TYPE=X                     
         FIELD NAME=(IDDC),BYTES=2,START=27,TYPE=X                              
         FIELD NAME=(IDLEVNR),BYTES=5,START=29,TYPE=X                           
         FIELD NAME=(IDLOPNRM),BYTES=5,START=34,TYPE=P                          
         FIELD NAME=(IDFAKT),BYTES=4,START=39,TYPE=P                            
         FIELD NAME=(IDDISTR),BYTES=3,START=43,TYPE=P                           
         FIELD NAME=(IDKUNDNR),BYTES=4,START=46,TYPE=P                          
         FIELD NAME=(IDKUNDRF),BYTES=10,START=50,TYPE=X                         
         FIELD NAME=(IDKOLLI),BYTES=3,START=60,TYPE=P                           
         FIELD NAME=(IDPTYP),BYTES=3,START=63,TYPE=X                            
         FIELD NAME=(KDKOLLI),BYTES=8,START=68,TYPE=P                           
         FIELD NAME=(KDRT),BYTES=2,START=76,TYPE=P                              
         FIELD NAME=(/CKARTNR),BYTES=5,START=1,TYPE=P                           
*                                                                               
         LCHILD NAME=(WDL6A1,WDL6A),PTR=INDX                                    
         XDFLD NAME=WDL6ASEQ,SEGMENT=WDL611,                           *        
               SRCH=(IDFAKT,IDKUNDRF,IDKUNDNR,IDKOLLI),                *        
               SUBSEQ=(/CKARTNR,DAINLEV),                              *        
               DDATA=(IDDC,IDPTYP,KDKOLLI),                            *        
               EXTRTN=WDL6AEXT                                                  
* EXIT FINNS NÄR IDPTYP NOT = R32 R33 R34 R40                                   
*                                                                               
         LCHILD NAME=(WDL6B1,WDL6B),PTR=INDX                                    
         XDFLD NAME=WDL6BSEQ,SEGMENT=WDL622,                           *        
               SRCH=(IDDC,IDILIST,ADART),                              *        
               SUBSEQ=(/CKARTNR,/CKINLEV)                                       
*                                                                               
         LCHILD NAME=(WDL6C1,WDL6C),PTR=INDX                                    
         XDFLD NAME=WDL6CSEQ,SEGMENT=WDL611,                           *        
               SRCH=(IDFAKT,IDDC),                                     *        
               SUBSEQ=(/CKARTNR,DAINLEV),                              *        
               EXTRTN=WDL6CEXT                                                  
* EXIT FINNS NÄR IDPTYP = R32                                                   
*                                                                               
         LCHILD NAME=(WDL6D1,WDL6D),PTR=INDX                                    
         XDFLD NAME=WDL6DSEQ,SEGMENT=WDL611,                           *        
               SRCH=(IDDC,IDDISTR,IDKUNDNR,IDKUNDRF,IDKOLLI),          *        
               SUBSEQ=(/CKARTNR,DAINLEV),                              *        
               DDATA=(IDFAKT),                                         *        
               EXTRTN=WDL6AEXT                                                  
* EXIT FINNS NÄR IDPTYP NOT = R32 R33 R34 R40                                   
*                                                                               
         SEGM  NAME=WDL621,PARENT=WDL611,BYTES=10,PTR=T                         
         FIELD NAME=(TIREGDAT),BYTES=4,START=1,TYPE=P                           
*                                                                               
         SEGM  NAME=WDL622,PARENT=WDL611,BYTES=32,PTR=NT                        
         FIELD NAME=(KDSEGKEY,SEQ,U),BYTES=1,START=1,TYPE=X                     
         FIELD NAME=(IDILIST),BYTES=5,START=2,TYPE=X                            
         FIELD NAME=(IDDC),BYTES=2,START=7,TYPE=X                               
         FIELD NAME=(ADART),BYTES=7,START=9,TYPE=X                              
         FIELD NAME=(/CKARTNR),BYTES=5,START=1,TYPE=P                           
         FIELD NAME=(/CKINLEV),BYTES=16,START=6,TYPE=X                          
*                                                                               
         SEGM  NAME=WDL623,PARENT=WDL611,BYTES=25,PTR=T                         
         FIELD NAME=(IDTRACK),BYTES=25,START=1,TYPE=X                           
*                                                                               
         SEGM  NAME=WDL612,PARENT=WDL601,BYTES=48,PTR=T                         
         FIELD NAME=(WDL612KY,SEQ,U),BYTES=12,START=1,TYPE=X                    
         FIELD NAME=(DAREGDAT),BYTES=8,START=1,TYPE=X                           
         FIELD NAME=(TIREGTID),BYTES=4,START=9,TYPE=P                           
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
