*        ORDERINGÅNGSTATISTIK REGISTER SDC                                      
*                                                                               
         DBD   NAME=WDL7,RMNAME=(V12008,1,810000),                     *        
               ACCESS=(HDAM,OSAM)                                               
         DATASET DD1=WDL7V,DEVICE=3390,SIZE=8192,SCAN=0                         
*                                                                               
         SEGM  NAME=WDL701,PARENT=0,BYTES=5,PTR=T                               
         FIELD NAME=(IDARTNR,SEQ,U),BYTES=5,START=1,TYPE=P                      
*                                                                               
         SEGM  NAME=WDL711,PARENT=WDL701,BYTES=1448,PTR=T                       
         FIELD NAME=(IDDC,SEQ,U),BYTES=2,START=1,TYPE=X                         
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
