*        ARTIKEL URSPRUNGSLAND HISTORIK                                         
*                                                                               
         DBD   NAME=WDM1,RMNAME=(V12008,4,99000),                      *        
               ACCESS=(HDAM,OSAM)                                               
         DATASET DD1=WDM1V,DEVICE=3390,SIZE=4096,SCAN=0                         
*                                                                               
         SEGM  NAME=WDM101,PARENT=0,BYTES=14,PTR=T                              
         FIELD NAME=(WDM101KY,SEQ,U),BYTES=10,START=1,TYPE=X                    
         FIELD NAME=(IDARTNR),BYTES=5,START=1,TYPE=P                            
         FIELD NAME=(IDLEVNR),BYTES=5,START=6,TYPE=X                            
*                                                                               
         SEGM  NAME=WDM111,PARENT=WDM101,BYTES=10,PTR=T                         
         FIELD NAME=(BEAVTAL,SEQ,U),BYTES=10,START=1,TYPE=X                     
*                                                                               
         SEGM  NAME=WDM121,PARENT=WDM111,BYTES=28,PTR=T                         
         FIELD NAME=(TIREGDA9,SEQ,U),BYTES=4,START=1,TYPE=P                     
         FIELD NAME=(TIGILTIF),BYTES=4,START=5,TYPE=P                           
         FIELD NAME=(TIGILTIT),BYTES=4,START=9,TYPE=P                           
         FIELD NAME=(IDSTAMIC),BYTES=2,START=13,TYPE=X                          
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
