*        KAMPANJER ART INGÅNG                                                   
*                                                                               
         DBD   NAME=WDM2A,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDM2AK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDM2A1,PARENT=0,BYTES=11                                    
         FIELD NAME=(WDM2A1KY,SEQ,U),BYTES=11,START=1,TYPE=X                    
         FIELD NAME=(IDARTNR),BYTES=5,START=1,TYPE=P                            
         FIELD NAME=(IDKAMPRF),BYTES=4,START=6,TYPE=P                           
         FIELD NAME=(IDDC),BYTES=2,START=10,TYPE=X                              
         LCHILD NAME=(WDM211,WDM2),INDEX=WDM2ASEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
