*        KAMPANJER                                                              
*                                                                               
         DBD   NAME=WDM2,RMNAME=(V12008,,6300),                        *        
               ACCESS=(HDAM,OSAM)                                               
         DATASET DD1=WDM2V,DEVICE=3390,SIZE=2048,SCAN=0                         
*                                                                               
         SEGM  NAME=WDM201,PARENT=0,BYTES=18,PTR=T                              
         FIELD NAME=(WDM201KY,SEQ,U),BYTES=6,START=1,TYPE=X                     
         FIELD NAME=(IDKAMPRF),BYTES=4,START=1,TYPE=P                           
         FIELD NAME=(IDDC),BYTES=2,START=5,TYPE=X                               
*                                                                               
         SEGM  NAME=WDM211,PARENT=WDM201,BYTES=29,PTR=T                         
         FIELD NAME=(IDARTNR,SEQ,U),BYTES=5,START=1,TYPE=P                      
         FIELD NAME=(/CKKAMP),BYTES=4,START=1,TYPE=P                            
         FIELD NAME=(/CKIDDC),BYTES=2,START=5,TYPE=P                            
         LCHILD NAME=(WDM2A1,WDM2A),PTR=INDX                                    
         XDFLD NAME=WDM2ASEQ,SEGMENT=WDM211,                           *        
               SRCH=(IDARTNR),                                         *        
               SUBSEQ=(/CKKAMP,/CKIDDC)                                         
*                                                                               
         SEGM  NAME=WDM221,PARENT=WDM211,BYTES=22,PTR=T                         
         FIELD NAME=(WDM221KY,SEQ,U),BYTES=14,START=1,TYPE=X                    
         FIELD NAME=(IDDISTRF),BYTES=3,START=1,TYPE=P                           
         FIELD NAME=(IDDISTRT),BYTES=3,START=4,TYPE=P                           
         FIELD NAME=(IDKUNDNF),BYTES=4,START=7,TYPE=P                           
         FIELD NAME=(IDKUNDNT),BYTES=4,START=11,TYPE=P                          
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
