*        TRANSPORTER MELLAN VTV OCH RA                                          
*                                                                               
         DBD   NAME=WDM5,RMNAME=(V12008,4,315),                        *        
               ACCESS=(HDAM,OSAM)                                               
         DATASET DD1=WDM5V,DEVICE=3390,SIZE=2048,SCAN=0                         
*                                                                               
         SEGM  NAME=WDM501,PARENT=0,BYTES=3,PTR=T                               
         FIELD NAME=(ADTRDEST,SEQ,U),BYTES=3,START=1,TYPE=X                     
*                                                                               
         SEGM  NAME=WDM511,PARENT=WDM501,BYTES=3,PTR=T                          
         FIELD NAME=(IDTRPTNR,SEQ,U),BYTES=3,START=1,TYPE=P                     
*                                                                               
         SEGM  NAME=WDM521,PARENT=WDM511,BYTES=70,PTR=T                         
         FIELD NAME=(DADATTID,SEQ,U),BYTES=14,START=1,TYPE=X                    
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
