*        BYTES LAGRING AV RETURER                                               
*                                                                               
         DBD   NAME=WDM6A,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDM6AK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDM6A1,PARENT=0,BYTES=22                                    
         FIELD NAME=(WDM6A1KY,SEQ,U),BYTES=18,START=1,TYPE=X                    
         FIELD NAME=(KDBYTSTA),BYTES=1,START=1,TYPE=X                           
         FIELD NAME=(IDDC),BYTES=2,START=2,TYPE=X                               
         FIELD NAME=(DAREGDAT),BYTES=8,START=4,TYPE=X                           
         FIELD NAME=(IDDISTR),BYTES=3,START=12,TYPE=P                           
         FIELD NAME=(IDBYTRAP),BYTES=4,START=15,TYPE=P                          
         FIELD NAME=(IDKUNDNR),BYTES=4,START=19,TYPE=P                          
         LCHILD NAME=(WDM601,WDM6),INDEX=WDM6ASEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
