*        BYTES LAGRING AV RETURER                                               
*                                                                               
         DBD   NAME=WDM6E,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDM6EK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDM6E1,PARENT=0,BYTES=15                                    
         FIELD NAME=(WDM6E1KY,SEQ,U),BYTES=15,START=1,TYPE=X                    
         FIELD NAME=(IDARTNR),BYTES=5,START=1,TYPE=P                            
         FIELD NAME=(IDDISTR),BYTES=3,START=6,TYPE=P                            
         FIELD NAME=(IDBYTRP9),BYTES=4,START=9,TYPE=P                           
         FIELD NAME=(IDBYTRAD),BYTES=3,START=13,TYPE=P                          
         LCHILD NAME=(WDM611,WDM6),INDEX=WDM6ESEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
