*        IDTULL IDUSER                                                          
*                                                                               
         DBD   NAME=WDM7B,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDM7BK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDM7B1,PARENT=0,BYTES=48                                    
         FIELD NAME=(WDM7B1KY,SEQ,U),BYTES=33,START=1,TYPE=X                    
         FIELD NAME=(IDTULL),BYTES=10,START=1,TYPE=X                            
         FIELD NAME=(IDUSER),BYTES=8,START=11,TYPE=X                            
         LCHILD NAME=(WDM701,WDM7),INDEX=WDM7BSEQ,PTR=SYMB                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
