*        HISTORIK TRANSPORTER VTV-R - SEC. IX. IDTRPTNR                         
*                                                                               
         DBD   NAME=WDM9B,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDM9BK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDM9B1,PARENT=0,BYTES=22,PTR=T                              
         FIELD NAME=(WDM9B1KY,SEQ,U),BYTES=22,START=1,TYPE=X                    
         FIELD NAME=(IDTRPTNR),BYTES=3,START=1,TYPE=P                           
         FIELD NAME=(DADATTI9),BYTES=14,START=4,TYPE=X                          
         FIELD NAME=(IDARTNR),BYTES=5,START=18,TYPE=P                           
         LCHILD NAME=(WDM911,WDM9),INDEX=WDM9BSEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
