*        KATALOG MASTERREGISTER SEC. IND. ARTIKEL                               
*                                                                               
         DBD   NAME=WDN1A,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDN1AK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDN1A1,PARENT=0,BYTES=15,PTR=T                              
         FIELD NAME=(WDN1A1KY,SEQ,U),BYTES=6,START=1,TYPE=X                     
         FIELD NAME=(TIOMBRYT),BYTES=4,START=1,TYPE=P                           
         FIELD NAME=(KDFORDON),BYTES=2,START=5,TYPE=X                           
         FIELD NAME=(IDCATNR),BYTES=5,START=7,TYPE=X                            
         FIELD NAME=(TIOMBRYS),BYTES=4,START=12,TYPE=P                          
         LCHILD NAME=(WDN101,WDN1),INDEX=WDN1ASEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
