*        KATALOGREGISTER                                                        
*                                                                               
         DBD   NAME=WDN1,RMNAME=(V12008,,315),                         *        
               ACCESS=(HDAM,OSAM)                                               
         DATASET DD1=WDN1V,DEVICE=3390,SIZE=2048,SCAN=0                         
*                                                                               
         SEGM  NAME=WDN101,PARENT=0,BYTES=468,PTR=T                             
         FIELD NAME=(IDCATNR,SEQ,U),BYTES=5,START=1,TYPE=X                      
         FIELD NAME=(KDFORDON),BYTES=2,START=61,TYPE=X                          
         FIELD NAME=(TIOMBRYF),BYTES=4,START=181,TYPE=P                         
         FIELD NAME=(TIOMBRYS),BYTES=4,START=193,TYPE=P                         
         LCHILD NAME=(WDN1A1,WDN1A),PTR=INDX                                    
         XDFLD NAME=WDN1ASEQ,SEGMENT=WDN101,                           *        
               SRCH=(TIOMBRYF,KDFORDON),                               *        
               DDATA=(IDCATNR,TIOMBRYS),EXTRTN=WDN1AEXT                         
*                                                                               
         SEGM  NAME=WDN111,PARENT=WDN101,BYTES=448,PTR=T                        
         FIELD NAME=(TIAAAA,SEQ,U),BYTES=4,START=1,TYPE=X                       
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
