*        KATALOG FOTNOT-LEXIKON                                                 
*                                                                               
         DBD   NAME=WDN3,RMNAME=(V12008,2,2520),                       *        
               ACCESS=(HDAM,OSAM)                                               
         DATASET DD1=WDN3V,DEVICE=3390,SIZE=2048,SCAN=0                         
*                                                                               
         SEGM  NAME=WDN301,PARENT=0,BYTES=3,PTR=T                               
         FIELD NAME=(IDFOTNR,SEQ,U),BYTES=3,START=1,TYPE=P                      
         LCHILD NAME=(WDN3A1,WDN3A),PTR=INDX                                    
         XDFLD NAME=WDN3ASEQ,SEGMENT=WDN321,                           *        
               SRCH=(IDSKYLT),                                         *        
               SUBSEQ=(/CKFORDO,/CKFOTNR,IDSEGMNR),                    *        
               DDATA=(BEFOTNOT)                                                 
*                                                                               
         SEGM  NAME=WDN311,PARENT=WDN301,BYTES=7,PTR=NT                         
         FIELD NAME=(KDFORDON,SEQ,U),BYTES=2,START=1,TYPE=X                     
         FIELD NAME=(FLOVERS),BYTES=1,START=3,TYPE=X                            
         FIELD NAME=(TIUPPDAT),BYTES=4,START=4,TYPE=P                           
*                                                                               
         SEGM  NAME=WDN321,PARENT=WDN311,BYTES=59,PTR=T                         
         FIELD NAME=(WDN321KY,SEQ,U),BYTES=4,START=1,TYPE=X                     
         FIELD NAME=(IDSKYLT),BYTES=3,START=1,TYPE=X                            
         FIELD NAME=(IDSEGMNR),BYTES=1,START=4,TYPE=P                           
         FIELD NAME=(BEFOTNOT),BYTES=55,START=5,TYPE=X                          
         FIELD NAME=(/CKFOTNR),BYTES=3,START=1,TYPE=P                           
         FIELD NAME=(/CKFORDO),BYTES=2,START=4,TYPE=X                           
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
