*        KATALOG TILLÄGGSTEXT REGISTER SEC. IND. IDSKYLT                        
*                                                                               
         DBD   NAME=WDN4A,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDN4AK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDN4A1,PARENT=0,BYTES=31,PTR=T                              
         FIELD NAME=(WDN4A1KY,SEQ,U),BYTES=6,START=1,TYPE=X                     
         FIELD NAME=(IDSKYLT),BYTES=3,START=1,TYPE=X                            
         FIELD NAME=(IDTTEXNR),BYTES=3,START=4,TYPE=P                           
         FIELD NAME=(BETILLTE),BYTES=25,START=7,TYPE=X                          
         LCHILD NAME=(WDN401,WDN4),INDEX=WDN4ASEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
