*        KATALOG TILLÄGGSTEXT REGISTER                                          
*                                                                               
         DBD   NAME=WDN4,RMNAME=(V12008,5,1260),                       *        
               ACCESS=(HDAM,OSAM)                                               
         DATASET DD1=WDN4V,DEVICE=3390,SIZE=2048,SCAN=0                         
*                                                                               
         SEGM  NAME=WDN401,PARENT=0,BYTES=8,PTR=T                               
         FIELD NAME=(IDTTEXNR,SEQ,U),BYTES=3,START=1,TYPE=P                     
         FIELD NAME=(FLOVERS),BYTES=1,START=4,TYPE=X                            
         FIELD NAME=(TIREGDAT),BYTES=4,START=5,TYPE=P                           
         LCHILD NAME=(WDN4A1,WDN4A),PTR=INDX                                    
         XDFLD NAME=WDN4ASEQ,SEGMENT=WDN411,                           *        
               SRCH=(IDSKYLT),                                         *        
               SUBSEQ=(/CKTTEXT),                                      *        
               DDATA=(BETILLTE)                                                 
*                                                                               
         SEGM  NAME=WDN411,PARENT=WDN401,BYTES=28,PTR=T                         
         FIELD NAME=(IDSKYLT,SEQ,U),BYTES=3,START=1,TYPE=X                      
         FIELD NAME=(BETILLTE),BYTES=25,START=4,TYPE=X                          
         FIELD NAME=(/CKTTEXT),BYTES=3,START=1,TYPE=P                           
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
