*        KATALOG AVSNITTSREGISTER SEC. IND. AVSNITT                             
*                                                                               
         DBD   NAME=WDN5A,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDN5AK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDN5A1,PARENT=0,BYTES=11,PTR=T                              
         FIELD NAME=(WDN5A1KY,SEQ,U),BYTES=11,START=1,TYPE=X                    
         FIELD NAME=(IDCATNR),BYTES=5,START=1,TYPE=X                            
         FIELD NAME=(IDCATGRP),BYTES=2,START=6,TYPE=X                           
         FIELD NAME=(IDCATAVS),BYTES=4,START=8,TYPE=X                           
         LCHILD NAME=(WDN501,WDN5),INDEX=WDN5ASEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
