*        KATALOG MASTERREGISTER                                                 
*                                                                               
         DBD   NAME=WDN6,RMNAME=(V12008,10,37800),                     *        
               ACCESS=(HDAM,OSAM)                                               
         DATASET DD1=WDN6V,DEVICE=3390,SIZE=2048,SCAN=0                         
*                                                                               
         SEGM  NAME=WDN601,PARENT=0,BYTES=7,PTR=T                               
         FIELD NAME=(IDARTNR,SEQ,U),BYTES=5,START=1,TYPE=P                      
*                                                                               
         SEGM  NAME=WDN611,PARENT=WDN601,BYTES=28,PTR=T                         
         FIELD NAME=(WDN611KY,SEQ,U),BYTES=6,START=1,TYPE=X                     
         FIELD NAME=(IDFORDON),BYTES=2,START=1,TYPE=P                           
         FIELD NAME=(TIOMBRYT),BYTES=4,START=3,TYPE=P                           
         LCHILD NAME=(WDN6A1,WDN6A),PTR=INDX                                    
         XDFLD NAME=WDN6ASEQ,SEGMENT=WDN621,                           *        
               SRCH=(IDMODELL),                                        *        
               SUBSEQ=(/CKARTNR),                                      *        
               DDATA=(BEMODELL)                                                 
*                                                                               
         SEGM  NAME=WDN621,PARENT=WDN611,BYTES=34,PTR=T                         
         FIELD NAME=(IDMODELL,SEQ,U),BYTES=3,START=1,TYPE=X                     
         FIELD NAME=(BEMODELL),BYTES=15,START=4,TYPE=X                          
         FIELD NAME=(TIMODSTA),BYTES=4,START=19,TYPE=X                          
         FIELD NAME=(TIMODSTO),BYTES=4,START=23,TYPE=X                          
         FIELD NAME=(/CKARTNR),BYTES=11,START=1,TYPE=X                          
*                                                                               
         SEGM  NAME=WDN612,PARENT=WDN601,BYTES=27,PTR=NT                        
         FIELD NAME=(KDSEGKEY),BYTES=1,START=1,TYPE=X                           
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
