*        KATALOG AVSNITTSREGISTER SEC. IND. ARTIKEL                             
*                                                                               
         DBD   NAME=WDN6A,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDN6AK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDN6A1,PARENT=0,BYTES=29,PTR=T                              
         FIELD NAME=(WDN6A1KY,SEQ,U),BYTES=14,START=1,TYPE=X                    
         FIELD NAME=(IDMODELL),BYTES=3,START=1,TYPE=X                           
         FIELD NAME=(IDARTNR),BYTES=5,START=4,TYPE=P                            
         FIELD NAME=(IDFORDON),BYTES=2,START=9,TYPE=P                           
         FIELD NAME=(TIOMBRYT),BYTES=4,START=11,TYPE=P                          
         FIELD NAME=(BEMODELL),BYTES=15,START=15,TYPE=X                         
         LCHILD NAME=(WDN611,WDN6),INDEX=WDN6ASEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
