*        KATALOG ILLUSTRATIONSREGISTER                                          
*                                                                               
         DBD   NAME=WDN7,RMNAME=(V12008,10,1323),                      *        
               ACCESS=(HDAM,OSAM)                                               
         DATASET DD1=WDN7V,DEVICE=3390,SIZE=2048,SCAN=0                         
*                                                                               
         SEGM  NAME=WDN701,PARENT=0,BYTES=79,PTR=T                              
         FIELD NAME=(IDILLU,SEQ,U),BYTES=3,START=1,TYPE=P                       
         LCHILD NAME=(WDN7A1,WDN7A),PTR=INDX                                    
         XDFLD NAME=WDN7ASEQ,SEGMENT=WDN701,                           *        
               SRCH=(IDILLU)                                                    
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
