*        SUBMIT REGISTER                                                        
*                                                                               
         DBD   NAME=WDP1,RMNAME=(V12008,2,180),                        *        
               ACCESS=(HDAM,OSAM)                                               
         DATASET DD1=WDP1V,DEVICE=3390,SIZE=4096,SCAN=0                         
         SEGM  NAME=WDP101,PARENT=0,BYTES=30,PTR=T                              
         FIELD NAME=(WDP101KY,SEQ,U),BYTES=30,START=1,TYPE=X                    
         FIELD NAME=(IDHTYP),BYTES=4,START=1,TYPE=X                             
         FIELD NAME=(IDRUTIN),BYTES=8,START=5,TYPE=X                            
         FIELD NAME=(IDJOB),BYTES=8,START=13,TYPE=X                             
*                                                                               
         SEGM  NAME=WDP111,PARENT=WDP101,BYTES=20,PTR=T                         
         FIELD NAME=(WDP111KY,SEQ,U),BYTES=16,START=1,TYPE=X                    
         FIELD NAME=(IDOWNER),BYTES=8,START=1,TYPE=X                            
         FIELD NAME=(IDUSER),BYTES=8,START=9,TYPE=X                             
*                                                                               
         SEGM  NAME=WDP112,PARENT=WDP101,BYTES=41,PTR=T                         
         FIELD NAME=(IDRUTIN,SEQ,U),BYTES=8,START=1,TYPE=X                      
*                                                                               
         SEGM  NAME=WDP113,PARENT=WDP101,BYTES=47,PTR=T                         
         FIELD NAME=(IDJOB,SEQ,U),BYTES=8,START=1,TYPE=X                        
*                                                                               
         SEGM  NAME=WDP114,PARENT=WDP101,BYTES=84,PTR=T                         
         FIELD NAME=(IDJCLRAD,SEQ,U),BYTES=3,START=1,TYPE=P                     
         FIELD NAME=(IDTYP),BYTES=1,START=4,TYPE=X                              
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
