*        PERSONKODER INDEX=ARTIKELINTERVALL                                     
*                                                                               
         DBD   NAME=WDP3A,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDP3AK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDP3A1,PARENT=0,BYTES=22,PTR=T                              
         FIELD NAME=(WDP3A1KY,SEQ,U),BYTES=20,START=1,TYPE=X                    
         FIELD NAME=(IDLAND),BYTES=2,START=1,TYPE=P                             
         FIELD NAME=(IDARTNRF),BYTES=5,START=3,TYPE=P                           
         FIELD NAME=(IDARTNRT),BYTES=5,START=8,TYPE=P                           
         FIELD NAME=(KDARBTYP),BYTES=8,START=13,TYPE=X                          
         FIELD NAME=(IDPERSON),BYTES=2,START=21,TYPE=P                          
         LCHILD NAME=(WDP311,WDP3),INDEX=WDP3ASEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
