*        PERSONKODSREGISTER                                                     
*                                                                               
         DBD   NAME=WDP3,RMNAME=(V12008,,90),                          *        
               ACCESS=(HDAM,OSAM)                                               
         DATASET DD1=WDP3V,DEVICE=3390,SIZE=8192,SCAN=0                         
*                                                                               
         SEGM  NAME=WDP301,PARENT=0,BYTES=8,PTR=T                               
         FIELD NAME=(KDARBTYP,SEQ,U),BYTES=8,START=1,TYPE=X                     
*                                                                               
         SEGM  NAME=WDP311,PARENT=WDP301,BYTES=130,PTR=T                        
         FIELD NAME=(IDPERSON,SEQ,U),BYTES=2,START=1,TYPE=P                     
*                                                                               
         LCHILD NAME=(WDP3A1,WDP3A),PTR=INDX                                    
         XDFLD NAME=WDP3ASEQ,SEGMENT=WDP321,                           *        
               SRCH=(IDLAND,IDARTNRF,IDARTNRT),                        *        
               SUBSEQ=(/CKARBT),                                       *        
               DDATA=(/CKIDPER)                                                 
*                                                                               
         LCHILD NAME=(WDP3B1,WDP3B),PTR=INDX                                    
         XDFLD NAME=WDP3BSEQ,SEGMENT=WDP322,                           *        
               SRCH=(IDLAND,IDLEVNR),                                  *        
               SUBSEQ=(/CKARBT),                                       *        
               DDATA=(/CKIDPER)                                                 
*                                                                               
         LCHILD NAME=(WDP3C1,WDP3C),PTR=INDX                                    
         XDFLD NAME=WDP3CSEQ,SEGMENT=WDP323,                           *        
               SRCH=(IDLAND,IDFKNGRF,IDFKNGRT),                        *        
               SUBSEQ=(/CKARBT),                                       *        
               DDATA=(/CKIDPER)                                                 
*                                                                               
         SEGM  NAME=WDP321,PARENT=WDP311,BYTES=12,PTR=T                         
         FIELD NAME=(WDP321KY,SEQ,U),BYTES=12,START=1,TYPE=X                    
         FIELD NAME=(IDLAND),BYTES=2,START=1,TYPE=X                             
         FIELD NAME=(IDARTNRF),BYTES=5,START=3,TYPE=P                           
         FIELD NAME=(IDARTNRT),BYTES=5,START=8,TYPE=P                           
         FIELD NAME=(/CKARBT),BYTES=8,START=1,TYPE=X                            
         FIELD NAME=(/CKIDPER),BYTES=2,START=9,TYPE=P                           
*                                                                               
         SEGM  NAME=WDP322,PARENT=WDP311,BYTES=10,PTR=T                         
         FIELD NAME=(WDP322KY,SEQ,U),BYTES=7,START=1,TYPE=X                     
         FIELD NAME=(IDLAND),BYTES=2,START=1,TYPE=X                             
         FIELD NAME=(IDLEVNR),BYTES=5,START=3,TYPE=X                            
         FIELD NAME=(/CKARBT),BYTES=8,START=1,TYPE=X                            
         FIELD NAME=(/CKIDPER),BYTES=2,START=9,TYPE=P                           
*                                                                               
         SEGM  NAME=WDP323,PARENT=WDP311,BYTES=8,PTR=T                          
         FIELD NAME=(WDP323KY,SEQ,U),BYTES=8,START=1,TYPE=X                     
         FIELD NAME=(IDLAND),BYTES=2,START=1,TYPE=X                             
         FIELD NAME=(IDFKNGRF),BYTES=3,START=3,TYPE=P                           
         FIELD NAME=(IDFKNGRT),BYTES=3,START=6,TYPE=P                           
         FIELD NAME=(/CKARBT),BYTES=8,START=1,TYPE=X                            
         FIELD NAME=(/CKIDPER),BYTES=2,START=9,TYPE=P                           
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
