*        NYCKLAR I SEKV.                                                        
*                                                                               
         DBD   NAME=WDP5A,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDP5AK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDP5A1,PARENT=0,BYTES=60                                    
         FIELD NAME=(WDP5A1KY,SEQ,U),BYTES=19,START=1,TYPE=X                    
         FIELD NAME=(IDSKYLT),BYTES=3,START=1,TYPE=X                            
         FIELD NAME=(IDDOKTYP),BYTES=8,START=4,TYPE=X                           
         FIELD NAME=(IDDOK),BYTES=8,START=12,TYPE=X                             
         LCHILD NAME=(WDP501,WDP5),INDEX=WDP5ASEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
