*        DISPATCHER                                                             
*                                                                               
         DBD   NAME=WDP8,RMNAME=(V12008,10,2700),                      *        
               ACCESS=(HDAM,OSAM)                                               
         DATASET DD1=WDP8V,DEVICE=3390,SIZE=8192,SCAN=30                        
*                                                                               
         SEGM  NAME=WDP801,PARENT=0,BYTES=54,PTR=T                              
         FIELD NAME=(WDP801KY,SEQ,U),BYTES=25,START=1,TYPE=X                    
         FIELD NAME=(IDSNDNOD),BYTES=8,START=1,TYPE=X                           
         FIELD NAME=(IDSNDJOB),BYTES=8,START=9,TYPE=X                           
         FIELD NAME=(TIREGDAT),BYTES=4,START=17,TYPE=P                          
         FIELD NAME=(TIKLOCK),BYTES=5,START=21,TYPE=P                           
         FIELD NAME=(IDCPYTXT),BYTES=8,START=26,TYPE=X                          
         FIELD NAME=(IDLTERM),BYTES=8,START=34,TYPE=X                           
         FIELD NAME=(IDMFSMED),BYTES=3,START=42,TYPE=X                          
         FIELD NAME=(IDUSER),BYTES=8,START=45,TYPE=X                            
         FIELD NAME=(KDKOM),BYTES=2,START=53,TYPE=X                             
         FIELD NAME=(KDKOMSTA),BYTES=1,START=53,TYPE=X                          
         FIELD NAME=(KDKOMBEH),BYTES=1,START=54,TYPE=X                          
         LCHILD NAME=(WDP8A1,WDP8A),PTR=INDX                                    
         XDFLD NAME=WDP8ASEQ,SEGMENT=WDP801,                           *        
               SRCH=(TIREGDAT,TIKLOCK),                                *        
               SUBSEQ=(IDSNDNOD,IDSNDJOB),                             *        
               DDATA=(IDCPYTXT,IDLTERM,IDMFSMED,IDUSER,KDKOM)                   
*                                                                               
         SEGM  NAME=WDP811,PARENT=WDP801,BYTES=1015,PTR=T                       
         FIELD NAME=(IDRADNR,SEQ,U),BYTES=3,START=1,TYPE=P                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
