*        ORDERBEKRÄFTELSE REGISTER INDEX=GMT+TID+FRAKTKOD                       
*                                                                               
         DBD   NAME=WDQ1B,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDQ1BK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDQ1B1,PARENT=0,BYTES=59                                    
         FIELD NAME=(WDQ1B1KY,SEQ,U),BYTES=42,START=1,TYPE=X                    
         FIELD NAME=(IDDISTR),BYTES=3,START=1,TYPE=P                            
         FIELD NAME=(IDKUNDNR),BYTES=4,START=4,TYPE=P                           
         FIELD NAME=(TITIORD9),BYTES=5,START=8,TYPE=P                           
         FIELD NAME=(KDFRAKT),BYTES=2,START=13,TYPE=P                           
         FIELD NAME=(KDORDKL),BYTES=1,START=15,TYPE=P                           
         FIELD NAME=(IDKUNDRF),BYTES=10,START=16,TYPE=X                         
         FIELD NAME=(IDARTNR),BYTES=5,START=26,TYPE=P                           
         FIELD NAME=(IDLOPNR),BYTES=2,START=31,TYPE=P                           
         FIELD NAME=(IDSEKVNR),BYTES=2,START=33,TYPE=P                          
         FIELD NAME=(IDDC),BYTES=2,START=35,TYPE=X                              
         FIELD NAME=(IDORDER),BYTES=4,START=37,TYPE=P                           
         FIELD NAME=(KDORDBEK),BYTES=2,START=41,TYPE=X                          
         LCHILD NAME=(WDQ101,WDQ1),INDEX=WDQ1BSEQ,PTR=SYMB                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
