*        ORDERBEKRÄFTELSE REGISTER                                              
*                                                                               
         DBD   NAME=WDQ1,                                              *        
               ACCESS=(HISAM,VSAM)                                              
         DATASET DD1=WDQ1K,DEVICE=3390,SIZE=4096                                
*                                                                               
         SEGM  NAME=WDQ101,PARENT=0,BYTES=373                                   
         FIELD NAME=(WDQ101KY,SEQ,U),BYTES=17,START=1,TYPE=X                    
         FIELD NAME=(IDORDER),BYTES=4,START=1,TYPE=P                            
         FIELD NAME=(FILLERD),BYTES=11,START=5,TYPE=X                           
         FIELD NAME=(IDARTNR),BYTES=5,START=5,TYPE=P                            
         FIELD NAME=(FILLERB),BYTES=8,START=10,TYPE=X                           
         FIELD NAME=(IDLOPNR),BYTES=2,START=10,TYPE=P                           
         FIELD NAME=(IDSEKVNR),BYTES=2,START=12,TYPE=P                          
         FIELD NAME=(IDDC),BYTES=2,START=14,TYPE=X                              
         FIELD NAME=(KDORDBEK),BYTES=2,START=16,TYPE=X                          
         FIELD NAME=(FLOBOK),BYTES=1,START=79,TYPE=X                            
         FIELD NAME=(FLOBTRAN),BYTES=1,START=80,TYPE=X                          
         FIELD NAME=(IDGMTREF),BYTES=17,START=93,TYPE=X                         
         FIELD NAME=(FILLERA),BYTES=7,START=93,TYPE=X                           
         FIELD NAME=(IDDISTR),BYTES=3,START=93,TYPE=P                           
         FIELD NAME=(IDKUNDNR),BYTES=4,START=96,TYPE=P                          
         FIELD NAME=(IDKUNDRF),BYTES=10,START=100,TYPE=X                        
         FIELD NAME=(IDSYSTEM),BYTES=4,START=141,TYPE=X                         
         FIELD NAME=(TIORDREG),BYTES=4,START=212,TYPE=P                         
         FIELD NAME=(TIREGDAT),BYTES=4,START=220,TYPE=P                         
         FIELD NAME=(TITIREG9),BYTES=5,START=232,TYPE=P                         
         FIELD NAME=(FILLERC),BYTES=8,START=241,TYPE=X                          
         FIELD NAME=(TITIORD9),BYTES=5,START=241,TYPE=P                         
         FIELD NAME=(KDFRAKT),BYTES=2,START=246,TYPE=P                          
         FIELD NAME=(KDORDKL),BYTES=1,START=248,TYPE=P                          
         LCHILD NAME=(WDQ1A1,WDQ1A),PTR=SYMB                                    
         XDFLD NAME=WDQ1ASEQ,SEGMENT=WDQ101,                           *        
               SRCH=(FILLERA,TITIREG9,IDARTNR,FILLERB,IDKUNDRF),       *        
               SUBSEQ=(IDORDER),                                       *        
               DDATA=(IDSYSTEM)                                                 
         LCHILD NAME=(WDQ1B1,WDQ1B),PTR=SYMB                                    
         XDFLD NAME=WDQ1BSEQ,SEGMENT=WDQ101,                           *        
               SRCH=(FILLERA,FILLERC,IDKUNDRF,FILLERD),                *        
               SUBSEQ=(IDORDER,KDORDBEK)                                        
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
