*        ORDERHUVUD-REGISTER INDEX=DC+TRANSPORT                                 
*                                                                               
         DBD   NAME=WDQ2B,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDQ2BK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDQ2B1,PARENT=0,BYTES=22                                    
         FIELD NAME=(WDQ2B1KY,SEQ,U),BYTES=22,START=1,TYPE=X                    
         FIELD NAME=(IDDC),BYTES=2,START=1,TYPE=X                               
         FIELD NAME=(IDTRP),BYTES=5,START=3,TYPE=X                              
         FIELD NAME=(DATRPAVT),BYTES=11,START=8,TYPE=X                          
         FIELD NAME=(IDORDER),BYTES=4,START=19,TYPE=P                           
         LCHILD NAME=(WDQ201,WDQ2),INDEX=WDQ2BSEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
