*        ORDERHUVUD-REGISTER INDEX=GMT+ORDER                                    
*                                                                               
         DBD   NAME=WDQ2C,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDQ2CK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDQ2C1,PARENT=0,BYTES=22                                    
         FIELD NAME=(WDQ2C1KY,SEQ,U),BYTES=17,START=1,TYPE=X                    
         FIELD NAME=(IDGMTREF),BYTES=17,START=1,TYPE=X                          
         FIELD NAME=(IDORDER),BYTES=4,START=18,TYPE=P                           
         FIELD NAME=(FLBORT),BYTES=1,START=22,TYPE=X                            
         LCHILD NAME=(WDQ201,WDQ2),INDEX=WDQ2CSEQ,PTR=SNGL                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
