*        ORDERHUVUD-REGISTER                                                    
*                                                                               
         DBD   NAME=WDQ2,RMNAME=(V12008,1,360000),                     *        
               ACCESS=(HDAM,OSAM)                                               
         DATASET DD1=WDQ2V,DEVICE=3390,SIZE=4096,SCAN=0                         
*                                                                               
         SEGM  NAME=WDQ201,PARENT=0,BYTES=657,PTR=T                             
         FIELD NAME=(IDORDER,SEQ,U),BYTES=4,START=1,TYPE=P                      
         FIELD NAME=(FLBORT),BYTES=1,START=467,TYPE=X                           
         FIELD NAME=(FLKLAR),BYTES=1,START=470,TYPE=X                           
         FIELD NAME=(IDGMTREF),BYTES=17,START=504,TYPE=X                        
         FIELD NAME=(IDDISTR),BYTES=3,START=504,TYPE=P                          
         FIELD NAME=(IDKUNDNR),BYTES=4,START=507,TYPE=P                         
         FIELD NAME=(IDKUNDRF),BYTES=10,START=511,TYPE=X                        
         FIELD NAME=(KDORDKL),BYTES=1,START=564,TYPE=P                          
         FIELD NAME=(KDTPOTYP),BYTES=1,START=565,TYPE=P                         
         FIELD NAME=(TIREGDAT),BYTES=4,START=572,TYPE=P                         
         FIELD NAME=(TIREGTID),BYTES=4,START=576,TYPE=P                         
         FIELD NAME=(TIREGDA9),BYTES=4,START=600,TYPE=P                         
         FIELD NAME=(FLORDTIL),BYTES=1,START=604,TYPE=X                         
         FIELD NAME=(FLSOFT),BYTES=1,START=614,TYPE=X                           
         LCHILD NAME=(WDQ2B1,WDQ2B),PTR=INDX                                    
         XDFLD NAME=WDQ2BSEQ,SEGMENT=WDQ212,                           *        
               SRCH=(IDDC,IDTRP,DATRPAVT),                             *        
               SUBSEQ=(/CKWDQ2X)                                                
         LCHILD NAME=(WDQ2C1,WDQ2C),PTR=INDX                                    
         XDFLD NAME=WDQ2CSEQ,SEGMENT=WDQ201,                           *        
               SRCH=(IDGMTREF),                                        *        
               DDATA=(IDORDER,FLBORT)                                           
         LCHILD NAME=(WDQ2D1,WDQ2D),PTR=INDX                                    
         XDFLD NAME=WDQ2DSEQ,SEGMENT=WDQ201,                           *        
               SRCH=(FLSOFT,IDDISTR,IDKUNDNR),                         *        
               SUBSEQ=(TIREGDA9,IDORDER),                              *        
               DDATA=(TIREGDAT)                                                 
         LCHILD NAME=(WDQ2E1,WDQ2E),PTR=INDX                                    
         XDFLD NAME=WDQ2ESEQ,SEGMENT=WDQ201,                           *        
               SRCH=(IDDISTR,IDKUNDNR,KDORDKL),                        *        
               SUBSEQ=(TIREGDA9,IDORDER),                              *        
               EXTRTN=WDQ2EEXT                                                  
*                                                                               
* EXIT FINNS NÄR FLORDTIL = J                                                   
*                                                                               
         LCHILD NAME=(WDQ2F1,WDQ2F),PTR=INDX                                    
         XDFLD NAME=WDQ2FSEQ,SEGMENT=WDQ201,                           *        
               SRCH=(FLSOFT,IDDISTR,TIREGDA9),                         *        
               SUBSEQ=(IDKUNDNR,IDORDER),                              *        
               DDATA=(TIREGDAT)                                                 
         SEGM  NAME=WDQ211,PARENT=WDQ201,BYTES=49,PTR=T                         
         FIELD NAME=(WDQ211KY,SEQ,U),BYTES=7,START=1,TYPE=X                     
         FIELD NAME=(IDDC),BYTES=2,START=1,TYPE=X                               
         FIELD NAME=(IDLEVNR),BYTES=5,START=3,TYPE=X                            
*                                                                               
         SEGM  NAME=WDQ212,PARENT=WDQ201,BYTES=107,PTR=T                        
         FIELD NAME=(IDDC,SEQ,U),BYTES=2,START=1,TYPE=X                         
         FIELD NAME=(FLODELUT),BYTES=1,START=63,TYPE=X                          
         FIELD NAME=(IDTRP),BYTES=5,START=67,TYPE=X                             
         FIELD NAME=(DATRPAVT),BYTES=11,START=93,TYPE=X                         
         FIELD NAME=(KDORDST1),BYTES=1,START=104,TYPE=X                         
         FIELD NAME=(/CKWDQ2X),BYTES=4,START=1,TYPE=P                           
*                                                                               
         SEGM  NAME=WDQ221,PARENT=WDQ212,BYTES=41,PTR=T                         
         FIELD NAME=(ADLAGOMR,SEQ,U),BYTES=2,START=1,TYPE=P                     
         FIELD NAME=(IDPRC),BYTES=4,START=3,TYPE=X                              
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
