*        ORDERDELSREG. PLANERING PROD.SKANAL (STA=R)                            
*                                                                               
         DBD   NAME=WDQ3K,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDQ3KK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDQ3K1,PARENT=0,BYTES=56                                    
         FIELD NAME=(WDQ3K1KY,SEQ,U),BYTES=28,START=1,TYPE=X                    
         FIELD NAME=(IDDC),BYTES=2,START=1,TYPE=X                               
         FIELD NAME=(DARFS),BYTES=12,START=3,TYPE=X                             
         FIELD NAME=(IDPRC),BYTES=4,START=15,TYPE=X                             
         FIELD NAME=(IDPRCBAS),BYTES=3,START=15,TYPE=X                          
         FIELD NAME=(IDPRCVAR),BYTES=1,START=18,TYPE=X                          
         FIELD NAME=(IDPRODNR),BYTES=4,START=19,TYPE=P                          
         FIELD NAME=(IDPLKLST),BYTES=2,START=23,TYPE=P                          
         FIELD NAME=(IDORDER),BYTES=4,START=25,TYPE=P                           
         LCHILD NAME=(WDQ301,WDQ3),INDEX=WDQ3KSEQ,PTR=SYMB                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
