*        ORDERDELSREG. PLANERING PRODUKTIONSKANAL                               
*                                                                               
         DBD   NAME=WDQ3F,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDQ3FK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDQ3F1,PARENT=0,BYTES=40                                    
         FIELD NAME=(WDQ3F1KY,SEQ,U),BYTES=24,START=1,TYPE=X                    
         FIELD NAME=(IDDC),BYTES=2,START=1,TYPE=X                               
         FIELD NAME=(DARFSDAT),BYTES=8,START=3,TYPE=X                           
         FIELD NAME=(IDPRC),BYTES=4,START=11,TYPE=X                             
         FIELD NAME=(IDPRCBAS),BYTES=3,START=11,TYPE=X                          
         FIELD NAME=(IDPRCVAR),BYTES=1,START=14,TYPE=X                          
         FIELD NAME=(IDORDER),BYTES=4,START=15,TYPE=P                           
         FIELD NAME=(IDPRODNR),BYTES=4,START=19,TYPE=P                          
         FIELD NAME=(IDPLKLST),BYTES=2,START=23,TYPE=P                          
         FIELD NAME=(KDODELST),BYTES=1,START=25,TYPE=X                          
         LCHILD NAME=(WDQ301,WDQ3),INDEX=WDQ3FSEQ,PTR=SYMB                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
