*        DISTR+KUND                                                             
*                                                                               
         DBD   NAME=WDQ3D,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDQ3DK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDQ3D1,PARENT=0,BYTES=24                                    
         FIELD NAME=(WDQ3D1KY,SEQ,U),BYTES=12,START=1,TYPE=X                    
         FIELD NAME=(IDPRODNR),BYTES=4,START=1,TYPE=P                           
         FIELD NAME=(IDPLKLST),BYTES=2,START=5,TYPE=P                           
         FIELD NAME=(IDORDER),BYTES=4,START=7,TYPE=P                            
         FIELD NAME=(IDDC),BYTES=2,START=11,TYPE=X                              
         LCHILD NAME=(WDQ301,WDQ3),INDEX=WDQ3DSEQ,PTR=SYMB                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
