*        ORDERDELS-REGISTER INDEX=IDDC+IDPRCPLK+IDLOTNRP                        
*                                                                               
         DBD   NAME=WDQ3H,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDQ3HK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDQ3H1,PARENT=0,BYTES=26                                    
         FIELD NAME=(WDQ3H1KY,SEQ,U),BYTES=14,START=1,TYPE=X                    
         FIELD NAME=(IDDC),BYTES=2,START=1,TYPE=X                               
         FIELD NAME=(IDPRCPLK),BYTES=4,START=3,TYPE=X                           
         FIELD NAME=(IDLOTNRP),BYTES=2,START=7,TYPE=P                           
         FIELD NAME=(IDPRODNR),BYTES=4,START=9,TYPE=P                           
         FIELD NAME=(IDPLKLST),BYTES=2,START=13,TYPE=P                          
         LCHILD NAME=(WDQ301,WDQ3),INDEX=WDQ3HSEQ,PTR=SYMB                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
