*        PRC-UTSKRIFT                                                           
*                                                                               
         DBD   NAME=WDQ3C,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDQ3CK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDQ3C1,PARENT=0,BYTES=59                                    
         FIELD NAME=(WDQ3C1KY,SEQ,U),BYTES=40,START=1,TYPE=X                    
         FIELD NAME=(IDDC),BYTES=2,START=1,TYPE=X                               
         FIELD NAME=(IDPRC),BYTES=4,START=3,TYPE=X                              
         FIELD NAME=(DARFS),BYTES=12,START=7,TYPE=X                             
         FIELD NAME=(DALSTORD),BYTES=12,START=19,TYPE=X                         
         FIELD NAME=(IDORDER),BYTES=4,START=31,TYPE=P                           
         FIELD NAME=(IDPRODNR),BYTES=4,START=35,TYPE=P                          
         FIELD NAME=(IDPLKLST),BYTES=2,START=39,TYPE=P                          
         FIELD NAME=(KDODELST),BYTES=1,START=47,TYPE=X                          
         LCHILD NAME=(WDQ301,WDQ3),INDEX=WDQ3CSEQ,PTR=SYMB                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
