*        ORDERHUVUD-REGISTER INDEX=DISTR+KUND+IDDC+KUNDRF                       
*                                                                               
         DBD   NAME=WDQ3G,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDQ3GK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDQ3G1,PARENT=0,BYTES=71                                    
         FIELD NAME=(WDQ3G1KY,SEQ,U),BYTES=29,START=1,TYPE=X                    
         FIELD NAME=(IDDISTR),BYTES=3,START=1,TYPE=P                            
         FIELD NAME=(IDKUNDNR),BYTES=4,START=4,TYPE=P                           
         FIELD NAME=(IDDC),BYTES=2,START=8,TYPE=X                               
         FIELD NAME=(IDKUNDRF),BYTES=10,START=10,TYPE=X                         
         FIELD NAME=(IDORDER),BYTES=4,START=20,TYPE=P                           
         FIELD NAME=(IDPRODNR),BYTES=4,START=24,TYPE=P                          
         FIELD NAME=(IDPLKLST),BYTES=2,START=28,TYPE=P                          
         LCHILD NAME=(WDQ301,WDQ3),INDEX=WDQ3GSEQ,PTR=SYMB                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
