*        ORDERRADSKÖ-REGISTER INDEX=ARTIKEL+GMT                                 
*                                                                               
         DBD   NAME=WDQ4B,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDQ4BK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDQ4B1,PARENT=0,BYTES=61                                    
         FIELD NAME=(WDQ4B1KY,SEQ,U),BYTES=37,START=1,TYPE=X                    
         FIELD NAME=(IDARTNR),BYTES=5,START=1,TYPE=P                            
         FIELD NAME=(IDLOPNR),BYTES=2,START=6,TYPE=P                            
         FIELD NAME=(IDGMTREF),BYTES=17,START=8,TYPE=X                          
         FIELD NAME=(IDDISTR),BYTES=3,START=8,TYPE=P                            
         FIELD NAME=(IDKUNDNR),BYTES=4,START=11,TYPE=P                          
         FIELD NAME=(IDORDER),BYTES=4,START=25,TYPE=P                           
         FIELD NAME=(IDDC),BYTES=2,START=29,TYPE=X                              
         FIELD NAME=(ADLAGOMR),BYTES=2,START=31,TYPE=P                          
         FIELD NAME=(ADGANG),BYTES=2,START=33,TYPE=P                            
         FIELD NAME=(ADPLATS),BYTES=3,START=35,TYPE=P                           
         FIELD NAME=(KVBEARTQ),BYTES=4,START=38,TYPE=P                          
         LCHILD NAME=(WDQ401,WDQ4),INDEX=WDQ4BSEQ,PTR=SYMB                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
