*        ORDERRADSKÖ-REGISTER INDEX=ARTIKEL+DC                                  
*                                                                               
         DBD   NAME=WDQ4C,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDQ4CK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDQ4C1,PARENT=0,BYTES=44                                    
         FIELD NAME=(WDQ4C1KY,SEQ,U),BYTES=20,START=1,TYPE=X                    
         FIELD NAME=(IDARTNR),BYTES=5,START=1,TYPE=P                            
         FIELD NAME=(IDDC),BYTES=2,START=06,TYPE=X                              
         FIELD NAME=(IDORDER),BYTES=4,START=08,TYPE=P                           
         FIELD NAME=(IDLOPNR),BYTES=2,START=12,TYPE=P                           
         FIELD NAME=(ADLAGOMR),BYTES=2,START=14,TYPE=P                          
         FIELD NAME=(ADGANG),BYTES=2,START=16,TYPE=P                            
         FIELD NAME=(ADPLATS),BYTES=3,START=18,TYPE=P                           
         FIELD NAME=(KVOKSPRE),BYTES=4,START=21,TYPE=P                          
         LCHILD NAME=(WDQ401,WDQ4),INDEX=WDQ4CSEQ,PTR=SYMB                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
