*        ORDERRADSKÖ-REGISTER INDEX=VOLVO-ORDER+ARTIKEL                         
*                                                                               
         DBD   NAME=WDQ4A,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDQ4AK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDQ4A1,PARENT=0,BYTES=40                                    
         FIELD NAME=(WDQ4A1KY,SEQ,U),BYTES=20,START=1,TYPE=X                    
         FIELD NAME=(IDORDER),BYTES=4,START=1,TYPE=P                            
         FIELD NAME=(IDARTNR),BYTES=5,START=5,TYPE=P                            
         FIELD NAME=(IDLOPNR),BYTES=2,START=10,TYPE=P                           
         FIELD NAME=(IDDC),BYTES=2,START=12,TYPE=X                              
         FIELD NAME=(ADLAGOMR),BYTES=2,START=14,TYPE=P                          
         FIELD NAME=(ADGANG),BYTES=2,START=16,TYPE=P                            
         FIELD NAME=(ADPLATS),BYTES=3,START=18,TYPE=P                           
         LCHILD NAME=(WDQ401,WDQ4),INDEX=WDQ4ASEQ,PTR=SYMB                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
