*        ORDERRAD/BEKRÄFTELSE FRÅN VIPS                                         
*                                                                               
         DBD   NAME=WDQ5,                                              *        
               ACCESS=(HISAM,VSAM)                                              
         DATASET DD1=WDQ5K,DEVICE=3390,SIZE=4096                                
*                                                                               
         SEGM  NAME=WDQ501,PARENT=0,BYTES=326                                   
         FIELD NAME=(WDQ501KY,SEQ,U),BYTES=17,START=1,TYPE=X                    
         FIELD NAME=(IDORDER),BYTES=4,START=1,TYPE=P                            
         FIELD NAME=(IDARTNR),BYTES=5,START=5,TYPE=P                            
         FIELD NAME=(FILLERA),BYTES=4,START=10,TYPE=P                           
         FIELD NAME=(IDLOPNR),BYTES=2,START=10,TYPE=P                           
         FIELD NAME=(IDSEKVNR),BYTES=2,START=12,TYPE=P                          
         FIELD NAME=(IDDC),BYTES=2,START=14,TYPE=X                              
         FIELD NAME=(KDORDBEK),BYTES=2,START=16,TYPE=X                          
         FIELD NAME=(IDGMTREF),BYTES=17,START=271,TYPE=X                        
         FIELD NAME=(IDDISTR),BYTES=3,START=271,TYPE=P                          
         FIELD NAME=(IDKUNDNR),BYTES=4,START=274,TYPE=P                         
         FIELD NAME=(IDKUNDRF),BYTES=10,START=278,TYPE=X                        
         LCHILD NAME=(WDQ5A1,WDQ5A),PTR=SYMB                                    
         XDFLD NAME=WDQ5ASEQ,SEGMENT=WDQ501,                           *        
               SRCH=(IDGMTREF),                                        *        
               SUBSEQ=(IDARTNR,FILLERA,IDDC,KDORDBEK,IDORDER)                   
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
