*        HÄNDELSEREGISTER MED FAST (STYR) INFO FÖR 9233                         
*                                                                               
         DBD   NAME=WDR1,RMNAME=(V12008,,6480),                        *        
               ACCESS=(HDAM,OSAM)                                               
         DATASET DD1=WDR1V,DEVICE=3390,SIZE=8192,SCAN=0                         
*                                                                               
         SEGM  NAME=WDR101,PARENT=0,BYTES=30,PTR=T                              
         FIELD NAME=(WDGXKEY,SEQ,U),BYTES=30,START=1,TYPE=X                     
         FIELD NAME=(IDHTYP),BYTES=4,START=1,TYPE=X                             
*                                                                               
         SEGM  NAME=WDR110,PARENT=WDR101,BYTES=30,PTR=T                         
         FIELD NAME=(WDGXKEY,SEQ,U),BYTES=5,START=1,TYPE=X                      
         FIELD NAME=(BETRPDST),BYTES=15,START=6,TYPE=X                          
         FIELD NAME=(KDORDKL),BYTES=1,START=8,TYPE=P                            
         FIELD NAME=(KVRADER),BYTES=3,START=10,TYPE=P                           
         FIELD NAME=(VKORDNTO),BYTES=4,START=13,TYPE=P                          
         FIELD NAME=(VLORDNTO),BYTES=4,START=17,TYPE=P                          
*                                                                               
*HTR=4402                                                                       
         SEGM  NAME=WDR113,PARENT=WDR101,BYTES=36,PTR=T                         
         FIELD NAME=(KY4402,SEQ,U),BYTES=12,START=1,TYPE=X                      
         FIELD NAME=(IDTRPTNR),BYTES=2,START=33,TYPE=P                          
         FIELD NAME=(IDDCX),BYTES=2,START=35,TYPE=P                             
*                                                                               
*HTR=4424                                                                       
         SEGM  NAME=WDR114,PARENT=WDR101,BYTES=60,PTR=T                         
         FIELD NAME=(WDGXKEY,SEQ,U),BYTES=40,START=1,TYPE=X                     
         FIELD NAME=(BEROUTE),BYTES=25,START=1,TYPE=X                           
         FIELD NAME=(IDTRANSP),BYTES=15,START=26,TYPE=X                         
*                                                                               
         SEGM  NAME=WDR115,PARENT=WDR101,BYTES=40,PTR=T                         
         FIELD NAME=(KDSEGKEY),BYTES=1,START=1,TYPE=X                           
*                                                                               
*HTR=4406                                                                       
         SEGM  NAME=WDR116,PARENT=WDR101,BYTES=17,PTR=T                         
         FIELD NAME=(WDGXKEY,SEQ,U),BYTES=10,START=1,TYPE=X                     
*                                                                               
*HTR=4408                                                                       
         SEGM  NAME=WDR117,PARENT=WDR116,BYTES=11,PTR=T                         
         FIELD NAME=(WDGXKEY,SEQ,U),BYTES=10,START=1,TYPE=X                     
         FIELD NAME=(FLRUTFUL),BYTES=1,START=11,TYPE=X                          
*                                                                               
*HTR=4412                                                                       
         SEGM  NAME=WDR118,PARENT=WDR101,BYTES=10,PTR=T                         
         FIELD NAME=(WDGXKEY,SEQ,U),BYTES=10,START=1,TYPE=X                     
*                                                                               
*HTR=4414                                                                       
         SEGM  NAME=WDR119,PARENT=WDR118,BYTES=32,PTR=T                         
         FIELD NAME=(WDGXKEY,SEQ,U),BYTES=10,START=1,TYPE=X                     
         FIELD NAME=(TESPAERR),BYTES=20,START=13,TYPE=X                         
*                                                                               
         SEGM  NAME=WDR120,PARENT=WDR101,BYTES=60,PTR=T                         
         FIELD NAME=(WDGXKEY,SEQ,U),BYTES=5,START=1,TYPE=X                      
         FIELD NAME=(IDGMTOMF),BYTES=4,START=6,TYPE=X                           
         FIELD NAME=(IDGMTOMT),BYTES=4,START=10,TYPE=X                          
         FIELD NAME=(IDHLOFOM),BYTES=2,START=14,TYPE=X                          
         FIELD NAME=(IDHLOTOM),BYTES=2,START=16,TYPE=X                          
         FIELD NAME=(IDTRP),BYTES=5,START=18,TYPE=X                             
         FIELD NAME=(KDFRAKTF),BYTES=2,START=23,TYPE=P                          
         FIELD NAME=(KDFRAKTT),BYTES=2,START=25,TYPE=P                          
         FIELD NAME=(KDPRODKF),BYTES=1,START=27,TYPE=X                          
         FIELD NAME=(KDPRODKT),BYTES=1,START=28,TYPE=X                          
*                                                                               
*HTR=4418                                                                       
         SEGM  NAME=WDR121,PARENT=WDR101,BYTES=62,PTR=T                         
         FIELD NAME=(WDGXKEY,SEQ,U),BYTES=10,START=1,TYPE=X                     
*                                                                               
*HTR=4420                                                                       
         SEGM  NAME=WDR122,PARENT=WDR121,BYTES=32,PTR=T                         
         FIELD NAME=(WDGXKEY,SEQ,U),BYTES=10,START=1,TYPE=X                     
         FIELD NAME=(TESPAERR),BYTES=20,START=13,TYPE=X                         
*                                                                               
         SEGM  NAME=WDR130,PARENT=WDR101,BYTES=30,PTR=T                         
         FIELD NAME=(WDGXKEY,SEQ,U),BYTES=10,START=1,TYPE=X                     
         FIELD NAME=(IDUSER),BYTES=8,START=2,TYPE=X                             
         FIELD NAME=(BETRPFIR),BYTES=15,START=11,TYPE=X                         
*                                                                               
         SEGM  NAME=WDR140,PARENT=WDR101,BYTES=100,PTR=T                        
         FIELD NAME=(WDGXKEY,SEQ,U),BYTES=10,START=1,TYPE=X                     
*                                                                               
         SEGM  NAME=WDR150,PARENT=WDR101,BYTES=270,PTR=T                        
         FIELD NAME=(WDGXKEY,SEQ,U),BYTES=10,START=1,TYPE=X                     
*                                                                               
         SEGM  NAME=WDR160,PARENT=WDR101,BYTES=150,PTR=T                        
         FIELD NAME=(WDGXKEY,SEQ,U),BYTES=5,START=1,TYPE=X                      
         FIELD NAME=(KDORDBEK),BYTES=2,START=1,TYPE=X                           
         FIELD NAME=(KDPRCGRP),BYTES=5,START=87,TYPE=X                          
         FIELD NAME=(KDPRODKL),BYTES=1,START=93,TYPE=X                          
*                                                                               
*HTR=4822                                                                       
         SEGM  NAME=WDR170,PARENT=WDR101,BYTES=386,PTR=T                        
         FIELD NAME=(WDGXKEY,SEQ,U),BYTES=5,START=1,TYPE=X                      
*                                                                               
         SEGM  NAME=WDR180,PARENT=WDR101,BYTES=1200,PTR=T                       
         FIELD NAME=(KDSEGKEY),BYTES=1,START=1,TYPE=X                           
*                                                                               
         SEGM  NAME=WDR190,PARENT=WDR101,BYTES=300,PTR=T                        
         FIELD NAME=(KDSEGKEY),BYTES=1,START=1,TYPE=X                           
*                                                                               
*HTR=3107                                                                       
         SEGM  NAME=WDGX3108,PARENT=WDR101,BYTES=22,PTR=NT                      
         FIELD NAME=(KDSEGKEY,SEQ,U),BYTES=1,START=1,TYPE=X                     
*                                                                               
*HTR=3112                                                                       
         SEGM  NAME=WDGX3112,PARENT=WDR101,BYTES=56,PTR=T                       
         FIELD NAME=(IDARTNR,SEQ,U),BYTES=10,START=1,TYPE=X                     
*                                                                               
*HTR=3156                                                                       
         SEGM  NAME=WDGX3156,PARENT=WDR101,BYTES=92,PTR=T                       
         FIELD NAME=(KDSEGKEY,SEQ,U),BYTES=1,START=1,TYPE=X                     
*                                                                               
*HTR=3158                                                                       
         SEGM  NAME=WDGX3158,PARENT=WDR101,BYTES=233,PTR=T                      
         FIELD NAME=(KEY3158,SEQ,U),BYTES=5,START=1,TYPE=X                      
         FIELD NAME=(IDDISTR),BYTES=3,START=1,TYPE=P                            
         FIELD NAME=(KDEXCHA),BYTES=2,START=4,TYPE=P                            
*                                                                               
*HTR=3160                                                                       
         SEGM  NAME=WDGX3160,PARENT=WDR101,BYTES=68,PTR=T                       
         FIELD NAME=(KDBYTREF,SEQ,U),BYTES=3,START=1,TYPE=X                     
*                                                                               
*HTR=4107                                                                       
         SEGM  NAME=WDGX4108,PARENT=WDR101,BYTES=15,PTR=T                       
         FIELD NAME=(KDSEGKEY,SEQ,M),BYTES=1,START=1,TYPE=X                     
*                                                                               
*HTR=4109                                                                       
         SEGM  NAME=WDGX4110,PARENT=WDR101,BYTES=63,PTR=T                       
         FIELD NAME=(KEY4110,SEQ,U),BYTES=15,START=1,TYPE=X                     
         FIELD NAME=(IDARTNR),BYTES=5,START=1,TYPE=P                            
         FIELD NAME=(KDANMORS),BYTES=2,START=6,TYPE=X                           
         FIELD NAME=(DAGILTIF),BYTES=8,START=8,TYPE=X                           
*                                                                               
*HTR=4111                                                                       
         SEGM  NAME=WDGX4112,PARENT=WDR101,BYTES=18,PTR=T                       
*                                                                               
*HTR=4113                                                                       
         SEGM  NAME=WDGX4114,PARENT=WDR101,BYTES=33,PTR=T                       
         FIELD NAME=(KEY4114,SEQ,U),BYTES=4,START=1,TYPE=X                      
         FIELD NAME=(KDANMORS),BYTES=2,START=1,TYPE=X                           
         FIELD NAME=(IDLOPNR),BYTES=2,START=3,TYPE=P                            
         FIELD NAME=(IDDISTRF),BYTES=3,START=5,TYPE=P                           
         FIELD NAME=(IDDISTRT),BYTES=3,START=8,TYPE=P                           
         FIELD NAME=(IDKUNDNF),BYTES=4,START=11,TYPE=P                          
         FIELD NAME=(IDKUNDNT),BYTES=4,START=15,TYPE=P                          
         FIELD NAME=(PRARTNTO),BYTES=5,START=19,TYPE=P                          
*                                                                               
*HTR=4115                                                                       
         SEGM  NAME=WDGX4116,PARENT=WDR101,BYTES=35,PTR=T                       
         FIELD NAME=(KEY4116,SEQ,U),BYTES=4,START=1,TYPE=X                      
         FIELD NAME=(KDANMORS),BYTES=2,START=1,TYPE=X                           
         FIELD NAME=(IDLOPNR),BYTES=2,START=3,TYPE=P                            
         FIELD NAME=(IDDC),BYTES=2,START=5,TYPE=X                               
         FIELD NAME=(IDDISTRF),BYTES=3,START=7,TYPE=P                           
         FIELD NAME=(IDDISTRT),BYTES=3,START=10,TYPE=P                          
         FIELD NAME=(IDKUNDNF),BYTES=4,START=13,TYPE=P                          
         FIELD NAME=(IDKUNDNT),BYTES=4,START=17,TYPE=P                          
         FIELD NAME=(PRARTNTO),BYTES=5,START=21,TYPE=P                          
*                                                                               
*HTR=4117                                                                       
         SEGM  NAME=WDGX4118,PARENT=WDR101,BYTES=38,PTR=T                       
         FIELD NAME=(KEY4118,SEQ,U),BYTES=6,START=1,TYPE=X                      
         FIELD NAME=(KDANMORS),BYTES=2,START=1,TYPE=X                           
         FIELD NAME=(IDDC),BYTES=2,START=3,TYPE=X                               
         FIELD NAME=(IDLOPNR),BYTES=2,START=5,TYPE=P                            
         FIELD NAME=(IDDISTRF),BYTES=3,START=7,TYPE=P                           
         FIELD NAME=(IDDISTRT),BYTES=3,START=10,TYPE=P                          
         FIELD NAME=(IDKUNDNF),BYTES=4,START=13,TYPE=P                          
         FIELD NAME=(IDKUNDNT),BYTES=4,START=17,TYPE=P                          
         FIELD NAME=(PRARTNTO),BYTES=5,START=21,TYPE=P                          
         FIELD NAME=(ADLAGOMR),BYTES=2,START=36,TYPE=P                          
         FIELD NAME=(KDORDKL),BYTES=1,START=38,TYPE=P                           
*                                                                               
*HTR=4123                                                                       
         SEGM  NAME=WDGX4124,PARENT=WDR101,BYTES=6,PTR=T                        
         FIELD NAME=(KEY4124,SEQ,U),BYTES=6,START=1,TYPE=X                      
         FIELD NAME=(IDDISTRF),BYTES=3,START=1,TYPE=P                           
         FIELD NAME=(IDDISTRT),BYTES=3,START=4,TYPE=P                           
*                                                                               
*HTR=4123                                                                       
         SEGM  NAME=WDGX4126,PARENT=WDGX4124,BYTES=54,PTR=T                     
         FIELD NAME=(KEY4126,SEQ,U),BYTES=8,START=1,TYPE=X                      
         FIELD NAME=(SUKRENOF),BYTES=4,START=1,TYPE=P                           
         FIELD NAME=(SUKRENOT),BYTES=4,START=5,TYPE=P                           
         FIELD NAME=(IDUSERAD),BYTES=8,START=35,TYPE=X                          
*                                                                               
*HTR=4437                                                                       
         SEGM  NAME=WDGX4438,PARENT=WDR101,BYTES=26,PTR=T                       
         FIELD NAME=(DADATUM,SEQ,U),BYTES=8,START=1,TYPE=X                      
*                                                                               
*HTR=4459                                                                       
         SEGM  NAME=WDGX4460,PARENT=WDR101,BYTES=15,PTR=T                       
         FIELD NAME=(KY4460,SEQ,U),BYTES=7,START=1,TYPE=X                       
         FIELD NAME=(IDDISTR),BYTES=3,START=1,TYPE=P                            
         FIELD NAME=(IDKUNDNR),BYTES=4,START=4,TYPE=P                           
*                                                                               
*HTR=4517                                                                       
         SEGM  NAME=WDGX4518,PARENT=WDR101,BYTES=22,PTR=NT                      
         FIELD NAME=(KDSEGKEY,SEQ,U),BYTES=1,START=1,TYPE=X                     
*                                                                               
*HTR=4523                                                                       
         SEGM  NAME=WDGX4524,PARENT=WDR101,BYTES=184,PTR=T                      
         FIELD NAME=(KDSEGKEY,SEQ,U),BYTES=1,START=1,TYPE=X                     
*                                                                               
*HTR=4539                                                                       
         SEGM  NAME=WDGX4540,PARENT=WDR101,BYTES=10,PTR=T                       
         FIELD NAME=(KDSEGKEY,SEQ,U),BYTES=1,START=1,TYPE=X                     
*                                                                               
*HTR=4543                                                                       
         SEGM  NAME=WDGX4544,PARENT=WDR101,BYTES=25,PTR=T                       
         FIELD NAME=(KY4544,SEQ,U),BYTES=22,START=1,TYPE=X                      
         FIELD NAME=(IDLANDX2),BYTES=2,START=1,TYPE=X                           
         FIELD NAME=(ADPOSTNF),BYTES=10,START=3,TYPE=X                          
         FIELD NAME=(ADPOSTNT),BYTES=10,START=13,TYPE=X                         
*                                                                               
*HTR=4549                                                                       
         SEGM  NAME=WDGX4550,PARENT=WDR101,BYTES=12,PTR=T                       
         FIELD NAME=(KY4550,SEQ,U),BYTES=7,START=1,TYPE=X                       
         FIELD NAME=(IDDISTR),BYTES=3,START=1,TYPE=P                            
         FIELD NAME=(IDKUNDNR),BYTES=4,START=4,TYPE=P                           
*                                                                               
*HTR=4589                                                                       
         SEGM  NAME=WDGX4590,PARENT=WDR101,BYTES=25,PTR=T                       
         FIELD NAME=(KDSEGKEY,SEQ,U),BYTES=1,START=1,TYPE=X                     
*                                                                               
*HTR=4732                                                                       
         SEGM  NAME=WDGX4732,PARENT=WDR101,BYTES=121,PTR=T                      
         FIELD NAME=(KDSEGKEY,SEQ,M),BYTES=1,START=1,TYPE=X                     
*                                                                               
*HTR=4735                                                                       
         SEGM  NAME=WDGX4735,PARENT=WDR101,BYTES=211,PTR=T                      
         FIELD NAME=(KDSEGKEY,SEQ,M),BYTES=1,START=1,TYPE=X                     
*                                                                               
*HTR=4738                                                                       
         SEGM  NAME=WDGX4738,PARENT=WDR101,BYTES=73,PTR=T                       
         FIELD NAME=(KDSEGKEY,SEQ,M),BYTES=1,START=1,TYPE=X                     
*                                                                               
*HTR=4739                                                                       
         SEGM  NAME=WDGX4739,PARENT=WDR101,BYTES=91,PTR=T                       
         FIELD NAME=(KDSEGKEY,SEQ,M),BYTES=1,START=1,TYPE=X                     
*                                                                               
*HTR=5121                                                                       
         SEGM  NAME=WDGX5122,PARENT=WDR101,BYTES=28,PTR=T                       
         FIELD NAME=(KEY5122,SEQ,U),BYTES=16,START=1,TYPE=X                     
*                                                                               
*HTR=5131                                                                       
         SEGM  NAME=WDGX5132,PARENT=WDR101,BYTES=15,PTR=T                       
         FIELD NAME=(BEFT,SEQ,U),BYTES=2,START=1,TYPE=P                         
*                                                                               
*HTR=5133                                                                       
         SEGM  NAME=WDGX5134,PARENT=WDR101,BYTES=10,PTR=T                       
         FIELD NAME=(IDARTNR,SEQ,U),BYTES=5,START=1,TYPE=P                      
*                                                                               
*HTR=5135                                                                       
         SEGM  NAME=WDGX5136,PARENT=WDR101,BYTES=19,PTR=T                       
         FIELD NAME=(IDARTNR,SEQ,U),BYTES=5,START=1,TYPE=P                      
*                                                                               
*HTR=5137                                                                       
         SEGM  NAME=WDGX5138,PARENT=WDR101,BYTES=15,PTR=T                       
         FIELD NAME=(KDFORPGP,SEQ,U),BYTES=2,START=1,TYPE=X                     
*                                                                               
*HTR=5141                                                                       
         SEGM  NAME=WDGX5142,PARENT=WDR101,BYTES=36,PTR=T                       
         FIELD NAME=(IDARTNR,SEQ,U),BYTES=5,START=1,TYPE=P                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
