*        HÄNDELSEREGISTER MED FAST (STYR) INFO                                  
*                                                                               
         DBD   NAME=WDR2,RMNAME=(V12008,,3600),                        *        
               ACCESS=(HDAM,OSAM)                                               
         DATASET DD1=WDR2V,DEVICE=3390,SIZE=8192,SCAN=0                         
*                                                                               
         SEGM  NAME=WDR201,PARENT=0,BYTES=30,PTR=T                              
         FIELD NAME=(WDGXKEY,SEQ,U),BYTES=30,START=1,TYPE=X                     
         FIELD NAME=(IDHTYP),BYTES=4,START=1,TYPE=X                             
*                                                                               
*HTYP=2225                                                                      
         SEGM  NAME=WDR210,PARENT=WDR201,BYTES=55,PTR=T                         
         FIELD NAME=(KDSEGKEY),BYTES=1,START=1,TYPE=X                           
*                                                                               
*HTYP=2231, 5117                                                                
         SEGM  NAME=WDR220,PARENT=WDR201,BYTES=20,PTR=T                         
         FIELD NAME=(WDGXKEY,SEQ,U),BYTES=5,START=1,TYPE=X                      
*                                                                               
*HTYP=3139                                                                      
         SEGM  NAME=WDR230,PARENT=WDR201,BYTES=60,PTR=T                         
         FIELD NAME=(WDGXKEY,SEQ,U),BYTES=10,START=1,TYPE=X                     
         FIELD NAME=(IDARTNR),BYTES=5,START=1,TYPE=P                            
         FIELD NAME=(IDDISTR),BYTES=3,START=6,TYPE=P                            
         FIELD NAME=(IDTABNR),BYTES=2,START=9,TYPE=P                            
*                                                                               
*HTYP=2215                                                                      
         SEGM  NAME=WDR242,PARENT=WDR201,BYTES=59,PTR=T                         
         FIELD NAME=(IDLEVNR,SEQ,U),BYTES=5,START=1,TYPE=X                      
*                                                                               
*HTYP=1165                                                                      
         SEGM  NAME=WDGX1166,PARENT=WDR201,BYTES=226,PTR=NT                     
         FIELD NAME=(KDSEGKEY,SEQ,U),BYTES=1,START=1,TYPE=X                     
*                                                                               
*HTYP=1165                                                                      
         SEGM  NAME=WDGX1168,PARENT=WDR201,BYTES=227,PTR=T                      
         FIELD NAME=(KDFGTRP,SEQ,U),BYTES=2,START=1,TYPE=X                      
*                                                                               
*HTYP=1205                                                                      
         SEGM  NAME=WDGX1206,PARENT=WDR201,BYTES=200,PTR=T                      
         FIELD NAME=(KY1206,SEQ,U),BYTES=11,START=1,TYPE=X                      
         FIELD NAME=(IDCATNR),BYTES=5,START=1,TYPE=X                            
         FIELD NAME=(KDLEX),BYTES=1,START=6,TYPE=X                              
         FIELD NAME=(IDLEXNR),BYTES=5,START=7,TYPE=X                            
*                                                                               
*HTYP 1211                                                                      
         SEGM  NAME=WDGX1212,PARENT=WDR201,BYTES=26,PTR=T                       
         FIELD NAME=(IDMODELL,SEQ,U),BYTES=3,START=1,TYPE=X                     
*                                                                               
*HTYP 1213                                                                      
         SEGM  NAME=WDGX1214,PARENT=WDR201,BYTES=27,PTR=T                       
         FIELD NAME=(IDVARIAN,SEQ,U),BYTES=15,START=1,TYPE=X                    
*                                                                               
*HTYP 1215                                                                      
         SEGM  NAME=WDGX1216,PARENT=WDR201,BYTES=23,PTR=T                       
         FIELD NAME=(IDVARIAN,SEQ,U),BYTES=15,START=1,TYPE=X                    
*                                                                               
*HTYP 1217                                                                      
         SEGM  NAME=WDGX1218,PARENT=WDR201,BYTES=20,PTR=T                       
         FIELD NAME=(WDGXKEY,SEQ,U),BYTES=8,START=1,TYPE=X                      
*HTYP=1219                                                                      
         SEGM  NAME=WDGX1220,PARENT=WDR201,BYTES=13,PTR=NT                      
         FIELD NAME=(KDSEGKEY,SEQ,U),BYTES=1,START=1,TYPE=X                     
*                                                                               
         SEGM  NAME=WDGX1221,PARENT=WDGX1220,BYTES=14,PTR=T                     
         FIELD NAME=(KY1221,SEQ,U),BYTES=10,START=1,TYPE=P                      
         FIELD NAME=(TIREGD9),BYTES=5,START=1,TYPE=P                            
         FIELD NAME=(TIDLOP9),BYTES=5,START=6,TYPE=P                            
         FIELD NAME=(IDBENNR),BYTES=4,START=11,TYPE=P                           
*                                                                               
*HTYP=2205                                                                      
         SEGM  NAME=WDGX2206,PARENT=WDR201,BYTES=52,PTR=T                       
         FIELD NAME=(KY2206,SEQ,U),BYTES=07,START=1,TYPE=X                      
         FIELD NAME=(IDLEVNR),BYTES=5,START=1,TYPE=X                            
         FIELD NAME=(IDDC),BYTES=2,START=6,TYPE=X                               
*                                                                               
*HTYP=2243                                                                      
         SEGM  NAME=WDGX2244,PARENT=WDR201,BYTES=15,PTR=T                       
         FIELD NAME=(KDPRODSL,SEQ,U),BYTES=2,START=1,TYPE=P                     
*                                                                               
*HTYP=2261                                                                      
         SEGM  NAME=WDGX2262,PARENT=WDR201,BYTES=80,PTR=T                       
         FIELD NAME=(IDARTNR,SEQ,U),BYTES=5,START=1,TYPE=P                      
*                                                                               
*HTYP=2263                                                                      
         SEGM  NAME=WDGX2264,PARENT=WDR201,BYTES=03,PTR=T                       
         FIELD NAME=(TISOP,SEQ,U),BYTES=3,START=1,TYPE=P                        
*                                                                               
*HTYP=2263                                                                      
         SEGM  NAME=WDGX2266,PARENT=WDGX2264,BYTES=11,PTR=T                     
         FIELD NAME=(KY2266,SEQ,U),BYTES=7,START=1,TYPE=X                       
         FIELD NAME=(IDARTNR),BYTES=5,START=1,TYPE=P                            
         FIELD NAME=(IDDC),BYTES=2,START=6,TYPE=X                               
*                                                                               
*HTYP=2501                                                                      
         SEGM  NAME=WDGX2502,PARENT=WDR201,BYTES=793,PTR=T                      
         FIELD NAME=(IDREFTAB,SEQ,U),BYTES=1,START=1,TYPE=X                     
*                                                                               
*HTYP=2503                                                                      
         SEGM  NAME=WDGX2504,PARENT=WDR201,BYTES=10,PTR=NT                      
         FIELD NAME=(IDKUNDRF),BYTES=10,START=1,TYPE=X                          
*                                                                               
*NY HB                                                                          
*HTYP=3147                                                                      
         SEGM  NAME=WDGX3148,PARENT=WDR201,BYTES=30,PTR=T                       
         FIELD NAME=(KY3148,SEQ,U),BYTES=12,START=1,TYPE=X                      
         FIELD NAME=(IDUSER),BYTES=8,START=1,TYPE=X                             
         FIELD NAME=(IDDC),BYTES=2,START=9,TYPE=X                               
         FIELD NAME=(IDDCREC),BYTES=2,START=11,TYPE=X                           
*                                                                               
*HTYP=3147                                                                      
         SEGM  NAME=WDGX3150,PARENT=WDGX3148,BYTES=7,PTR=T                      
         FIELD NAME=(KY3150,SEQ,U),BYTES=7,START=1,TYPE=X                       
         FIELD NAME=(IDDISTR),BYTES=3,START=1,TYPE=P                            
         FIELD NAME=(IDBYTRAP),BYTES=4,START=4,TYPE=P                           
*                                                                               
*NY HB                                                                          
*                                                                               
*HTYP=3151                                                                      
         SEGM  NAME=WDGX3152,PARENT=WDR201,BYTES=21,PTR=T                       
         FIELD NAME=(KY3152,SEQ,U),BYTES=11,START=1,TYPE=X                      
*                                                                               
         SEGM  NAME=WDGX3154,PARENT=WDGX3152,BYTES=09,PTR=T                     
         FIELD NAME=(IDARTNRO,SEQ,U),BYTES=5,START=1,TYPE=P                     
*                                                                               
*HTYP=4129                                                                      
         SEGM  NAME=WDGX4130,PARENT=WDR201,BYTES=14,PTR=T                       
         FIELD NAME=(IDDC,SEQ,U),BYTES=2,START=1,TYPE=X                         
*                                                                               
         SEGM  NAME=WDGX4132,PARENT=WDGX4130,BYTES=2,PTR=T                      
         FIELD NAME=(KDANMORS,SEQ,U),BYTES=2,START=1,TYPE=X                     
*                                                                               
*HTYP=4141                                                                      
         SEGM  NAME=WDGX4142,PARENT=WDR201,BYTES=57,PTR=T                       
         FIELD NAME=(KY4142,SEQ,U),BYTES=12,START=1,TYPE=X                      
         FIELD NAME=(IDDC),BYTES=2,START=1,TYPE=X                               
         FIELD NAME=(KDORDKL),BYTES=1,START=3,TYPE=P                            
         FIELD NAME=(KDFRAKT),BYTES=2,START=4,TYPE=P                            
         FIELD NAME=(IDDISTR),BYTES=3,START=6,TYPE=P                            
         FIELD NAME=(IDKUNDNR),BYTES=4,START=9,TYPE=P                           
*                                                                               
*HTYP=4591                                                                      
         SEGM  NAME=WDGX4592,PARENT=WDR201,BYTES=42,PTR=T                       
         FIELD NAME=(IDDISTR,SEQ,U),BYTES=3,START=1,TYPE=P                      
*                                                                               
*HTYP=5103                                                                      
         SEGM  NAME=WDGX5104,PARENT=WDR201,BYTES=69,PTR=T                       
         FIELD NAME=(IDDC,SEQ,U),BYTES=02,START=1,TYPE=X                        
*                                                                               
*HTYP=5105                                                                      
         SEGM  NAME=WDGX5106,PARENT=WDR201,BYTES=37,PTR=NT                      
         FIELD NAME=(KDSEGKEY,SEQ,U),BYTES=1,START=1,TYPE=X                     
*                                                                               
*HTYP=5107                                                                      
         SEGM  NAME=WDGX5108,PARENT=WDR201,BYTES=39,PTR=T                       
         FIELD NAME=(IDFTG,SEQ,U),BYTES=2,START=1,TYPE=X                        
*                                                                               
*HTYP=5109                                                                      
         SEGM  NAME=WDGX5110,PARENT=WDR201,BYTES=10,PTR=T                       
         FIELD NAME=(BEAVTAL,SEQ,U),BYTES=10,START=1,TYPE=X                     
*                                                                               
         SEGM  NAME=WDGX5112,PARENT=WDGX5110,BYTES=2,PTR=T                      
         FIELD NAME=(IDLANDX2,SEQ,U),BYTES=2,START=1,TYPE=X                     
*                                                                               
*HTYP=6303                                                                      
         SEGM  NAME=WDGX6304,PARENT=WDR201,BYTES=16,PTR=NT                      
         FIELD NAME=(KDSEGKEY,SEQ,U),BYTES=1,START=1,TYPE=X                     
*                                                                               
*HTYP=6311                                                                      
         SEGM  NAME=WDGX6312,PARENT=WDR201,BYTES=5,PTR=NT                       
         FIELD NAME=(KDSEGKEY,SEQ,U),BYTES=1,START=1,TYPE=X                     
*                                                                               
*HTYP=6313                                                                      
         SEGM  NAME=WDGX6314,PARENT=WDR201,BYTES=23,PTR=T                       
         FIELD NAME=(KDFREQ,SEQ,U),BYTES=02,START=1,TYPE=X                      
*                                                                               
*HTYP=6315                                                                      
         SEGM  NAME=WDGX6316,PARENT=WDR201,BYTES=43,PTR=T                       
         FIELD NAME=(KDSTOR,SEQ,U),BYTES=03,START=1,TYPE=X                      
*                                                                               
*HTYP=6317                                                                      
         SEGM  NAME=WDGX6318,PARENT=WDR201,BYTES=12,PTR=T                       
         FIELD NAME=(BEFT,SEQ,U),BYTES=2,START=1,TYPE=P                         
         FIELD NAME=(FLFPOMRC),BYTES=1,START=3,TYPE=X                           
         FIELD NAME=(FLFPOMRS),BYTES=1,START=4,TYPE=X                           
         FIELD NAME=(FLFPGRST),BYTES=1,START=5,TYPE=X                           
         FIELD NAME=(FLFPGR28),BYTES=1,START=6,TYPE=X                           
         FIELD NAME=(FLFPGRGR),BYTES=1,START=7,TYPE=X                           
         FIELD NAME=(FLFPGRMA),BYTES=1,START=8,TYPE=X                           
         FIELD NAME=(FLFPGRSA),BYTES=1,START=9,TYPE=X                           
*                                                                               
*HTYP=6331                                                                      
         SEGM  NAME=WDGX6332,PARENT=WDR201,BYTES=36,PTR=T                       
         FIELD NAME=(IDDC,SEQ,U),BYTES=2,START=1,TYPE=X                         
         FIELD NAME=(KDDC),BYTES=2,START=35,TYPE=X                              
*                                                                               
         SEGM  NAME=WDGX6334,PARENT=WDGX6332,BYTES=2,PTR=T                      
         FIELD NAME=(IDDC,SEQ,U),BYTES=2,START=1,TYPE=X                         
*                                                                               
*HTYP=6335                                                                      
         SEGM  NAME=WDGX6336,PARENT=WDR201,BYTES=2,PTR=T                        
         FIELD NAME=(IDDC,SEQ,U),BYTES=2,START=1,TYPE=X                         
*                                                                               
         SEGM  NAME=WDGX6338,PARENT=WDGX6336,BYTES=12,PTR=T                     
         FIELD NAME=(KY6338,SEQ,U),BYTES=12,START=1,TYPE=X                      
         FIELD NAME=(IDARTNR),BYTES=5,START=1,TYPE=X                            
         FIELD NAME=(ADLAGOMR),BYTES=2,START=6,TYPE=P                           
         FIELD NAME=(ADGANG),BYTES=2,START=8,TYPE=P                             
         FIELD NAME=(ADPLATS),BYTES=3,START=10,TYPE=P                           
*                                                                               
*HTYP=6341                                                                      
         SEGM  NAME=WDGX6342,PARENT=WDR201,BYTES=2,PTR=T                        
         FIELD NAME=(IDDC,SEQ,U),BYTES=2,START=1,TYPE=X                         
*                                                                               
         SEGM  NAME=WDGX6344,PARENT=WDGX6342,BYTES=11,PTR=T                     
         FIELD NAME=(KY6344,SEQ,U),BYTES=6,START=1,TYPE=X                       
         FIELD NAME=(ADLAGOMR),BYTES=2,START=1,TYPE=P                           
         FIELD NAME=(ADGANG),BYTES=2,START=3,TYPE=P                             
         FIELD NAME=(ADPLDEL),BYTES=2,START=5,TYPE=X                            
*                                                                               
*HTYP=6345                                                                      
         SEGM  NAME=WDGX6346,PARENT=WDR201,BYTES=5,PTR=T                        
         FIELD NAME=(IDDC,SEQ,U),BYTES=2,START=1,TYPE=X                         
*                                                                               
         SEGM  NAME=WDGX6348,PARENT=WDGX6346,BYTES=5,PTR=T                      
         FIELD NAME=(ADLAGOMR,SEQ,U),BYTES=2,START=1,TYPE=P                     
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
