*        TRANSAR TILL BATCH BER./ANSK. FRÅN ONLINE (WLFILC)                     
*                                                                               
         DBD   NAME=WDR3,                                              *        
               ACCESS=(HISAM,VSAM)                                              
         DATASET DD1=WDR3K,DEVICE=3390,SIZE=4096                                
*                                                                               
         SEGM  NAME=WDR301,PARENT=0,BYTES=227                                   
         FIELD NAME=(WDR301KY,SEQ,U),BYTES=27,START=1,TYPE=X                    
         FIELD NAME=(IDPGM),BYTES=8,START=1,TYPE=X                              
         FIELD NAME=(TIREGDAT),BYTES=4,START=9,TYPE=P                           
         FIELD NAME=(TIKLOCK),BYTES=5,START=13,TYPE=P                           
         FIELD NAME=(IDSEKVNR),BYTES=2,START=18,TYPE=P                          
         FIELD NAME=(IDCPYTXT),BYTES=8,START=20,TYPE=X                          
         FIELD NAME=(IDSYSTEM),BYTES=4,START=20,TYPE=X                          
         FIELD NAME=(IDPTYP),BYTES=3,START=24,TYPE=X                            
         FIELD NAME=(IDVTYP),BYTES=1,START=27,TYPE=X                            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
