*        HÄNDELSEREGISTER MED DYNAMISK INFO FÖR 9233                            
*                                                                               
         DBD   NAME=WDR4,RMNAME=(V12008,1,3600),                       *        
               ACCESS=(HDAM,OSAM)                                               
         DATASET DD1=WDR4V,DEVICE=3390,SIZE=8192,SCAN=0                         
*                                                                               
         SEGM  NAME=WDR401,PARENT=0,BYTES=30,PTR=T                              
         FIELD NAME=(WDGXKEY,SEQ,U),BYTES=30,START=1,TYPE=X                     
         FIELD NAME=(IDHTYP),BYTES=4,START=1,TYPE=X                             
*                                                                               
         SEGM  NAME=WDR410,PARENT=WDR401,BYTES=20,PTR=T                         
         FIELD NAME=(WDGXKEY,SEQ,U),BYTES=5,START=1,TYPE=X                      
         FIELD NAME=(IDKOLLI),BYTES=3,START=1,TYPE=P                            
         FIELD NAME=(IDPLKLST),BYTES=2,START=4,TYPE=P                           
*                                                                               
*HTR=5119                                                                       
         SEGM  NAME=WDR413,PARENT=WDR401,BYTES=4,PTR=NT                         
         FIELD NAME=(TIUPPDAT),BYTES=4,START=1,TYPE=P                           
*                                                                               
*HTR=4320                                                                       
         SEGM  NAME=WDR414,PARENT=WDR401,BYTES=66,PTR=T                         
         FIELD NAME=(WDGXKEY,SEQ,U),BYTES=20,START=1,TYPE=X                     
         FIELD NAME=(IDARTNR),BYTES=5,START=15,TYPE=P                           
*                                                                               
*HTR=4306                                                                       
         SEGM  NAME=WDR418,PARENT=WDR401,BYTES=12,PTR=T                         
         FIELD NAME=(WDGXKEY,SEQ,U),BYTES=10,START=1,TYPE=X                     
*                                                                               
*HTR=4308                                                                       
         SEGM  NAME=WDR419,PARENT=WDR418,BYTES=17,PTR=T                         
         FIELD NAME=(WDGXKEY,SEQ,U),BYTES=10,START=1,TYPE=P                     
*HTR=4312                                                                       
         SEGM  NAME=WDR421,PARENT=WDR401,BYTES=60,PTR=T                         
         FIELD NAME=(WDGXKEY,SEQ,U),BYTES=10,START=1,TYPE=X                     
         FIELD NAME=(IDUSER),BYTES=8,START=11,TYPE=X                            
*                                                                               
*HTR=4314                                                                       
         SEGM  NAME=WDR422,PARENT=WDR421,BYTES=15,PTR=T                         
         FIELD NAME=(WDGXKEY,SEQ,U),BYTES=10,START=1,TYPE=X                     
         FIELD NAME=(KDBEHAND),BYTES=1,START=15,TYPE=P                          
*                                                                               
         SEGM  NAME=WDR430,PARENT=WDR401,BYTES=40,PTR=T                         
         FIELD NAME=(WDGXKEY,SEQ,U),BYTES=10,START=1,TYPE=X                     
         FIELD NAME=(IDARTNR),BYTES=5,START=1,TYPE=P                            
         FIELD NAME=(IDDC),BYTES=2,START=6,TYPE=X                               
*                                                                               
         SEGM  NAME=WDR450,PARENT=WDR401,BYTES=60,PTR=T                         
         FIELD NAME=(WDGXKEY,SEQ,U),BYTES=10,START=1,TYPE=X                     
*                                                                               
         SEGM  NAME=WDR460,PARENT=WDR401,BYTES=1000,PTR=T                       
         FIELD NAME=(KDSEGKEY),BYTES=1,START=1,TYPE=X                           
*                                                                               
         SEGM  NAME=WDR470,PARENT=WDR401,BYTES=80,PTR=T                         
         FIELD NAME=(KDSEGKEY),BYTES=1,START=1,TYPE=X                           
*                                                                               
*HTR=3101                                                                       
         SEGM  NAME=WDGX3102,PARENT=WDR401,BYTES=160,PTR=NT                     
*                                                                               
*HTR=3101                                                                       
         SEGM  NAME=WDGX3104,PARENT=WDR401,BYTES=8,PTR=T                        
         FIELD NAME=(DADATUM,SEQ,U),BYTES=8,START=1,TYPE=X                      
*                                                                               
*HTR=3101                                                                       
         SEGM  NAME=WDGX3106,PARENT=WDGX3104,BYTES=8,PTR=T                      
         FIELD NAME=(IDARTNR,SEQ,U),BYTES=5,START=1,TYPE=P                      
*                                                                               
*HTR=3161                                                                       
         SEGM  NAME=WDGX3162,PARENT=WDR401,BYTES=52,PTR=T                       
         FIELD NAME=(KY3162,SEQ,U),BYTES=20,START=1,TYPE=X                      
         FIELD NAME=(DAORDREG),BYTES=8,START=1,TYPE=X                           
         FIELD NAME=(IDORDER),BYTES=4,START=9,TYPE=P                            
         FIELD NAME=(IDARTNR),BYTES=5,START=13,TYPE=P                           
         FIELD NAME=(IDRADNR),BYTES=3,START=18,TYPE=P                           
*                                                                               
*HTR=3165                                                                       
         SEGM  NAME=WDGX3166,PARENT=WDR401,BYTES=42,PTR=T                       
         FIELD NAME=(IDBYTFAK,SEQ,U),BYTES=4,START=1,TYPE=X                     
         FIELD NAME=(IDDC),BYTES=2,START=21,TYPE=X                              
         FIELD NAME=(IDDISTR),BYTES=3,START=23,TYPE=P                           
         FIELD NAME=(KDBYTFAK),BYTES=1,START=34,TYPE=X                          
*                                                                               
         SEGM  NAME=WDGX3168,PARENT=WDGX3166,BYTES=12,PTR=T                     
         FIELD NAME=(WDGX3168,SEQ,U),BYTES=8,START=1,TYPE=X                     
         FIELD NAME=(IDBYTKOL),BYTES=3,START=1,TYPE=X                           
         FIELD NAME=(IDARTNRO),BYTES=5,START=4,TYPE=P                           
*                                                                               
*HTR=3169                                                                       
         SEGM  NAME=WDGX3170,PARENT=WDR401,BYTES=8,PTR=T                        
         FIELD NAME=(IDDC,SEQ,U),BYTES=2,START=1,TYPE=X                         
*                                                                               
*HTR=3171                                                                       
         SEGM  NAME=WDGX3172,PARENT=WDR401,BYTES=40,PTR=T                       
         FIELD NAME=(IDFAKT,SEQ,U),BYTES=4,START=1,TYPE=P                       
*                                                                               
*HTR=3171                                                                       
         SEGM  NAME=WDGX3174,PARENT=WDGX3172,BYTES=12,PTR=T                     
         FIELD NAME=(IDKOLLI,SEQ,U),BYTES=3,START=1,TYPE=P                      
         FIELD NAME=(KDTRSTAT),BYTES=1,START=4,TYPE=P                           
*                                                                               
*HTR=3171                                                                       
         SEGM  NAME=WDGX3176,PARENT=WDGX3174,BYTES=13,PTR=T                     
         FIELD NAME=(IDARTNRO,SEQ,U),BYTES=5,START=1,TYPE=P                     
*                                                                               
*HTR=4001                                                                       
         SEGM  NAME=WDGX4002,PARENT=WDR401,BYTES=1356,PTR=NT                    
         FIELD NAME=(KDSEGKEY,SEQ,U),BYTES=1,START=1,TYPE=X                     
*                                                                               
*HTR=4003                                                                       
         SEGM  NAME=WDGX4004,PARENT=WDR401,BYTES=425,PTR=NT                     
         FIELD NAME=(KDSEGKEY,SEQ,U),BYTES=1,START=1,TYPE=X                     
*                                                                               
         SEGM  NAME=WDGX4006,PARENT=WDGX4004,BYTES=152,PTR=T                    
         FIELD NAME=(KY4006,SEQ,U),BYTES=18,START=1,TYPE=X                      
         FIELD NAME=(KDPRT),BYTES=3,START=1,TYPE=X                              
*                                                                               
*HTR=4007                                                                       
         SEGM  NAME=WDGX4008,PARENT=WDR401,BYTES=472,PTR=NT                     
         FIELD NAME=(KDSEGKEY,SEQ,U),BYTES=1,START=1,TYPE=X                     
*                                                                               
         SEGM  NAME=WDGX4010,PARENT=WDGX4008,BYTES=451,PTR=T                    
         FIELD NAME=(KY4010,SEQ,U),BYTES=22,START=1,TYPE=X                      
         FIELD NAME=(KDPRT),BYTES=3,START=5,TYPE=X                              
         FIELD NAME=(ADLAGOMR),BYTES=2,START=9,TYPE=P                           
*                                                                               
*HTR=4011                                                                       
         SEGM  NAME=WDGX4012,PARENT=WDR401,BYTES=1193,PTR=NT                    
         FIELD NAME=(KDSEGKEY,SEQ,U),BYTES=1,START=1,TYPE=X                     
*                                                                               
*HTR=4013                                                                       
         SEGM  NAME=WDGX4014,PARENT=WDR401,BYTES=17,PTR=T                       
         FIELD NAME=(IDGMTREF,SEQ,U),BYTES=17,START=1,TYPE=X                    
*HTR=4013                                                                       
         SEGM  NAME=WDGX4016,PARENT=WDGX4014,BYTES=49,PTR=T                     
         FIELD NAME=(KY4016,SEQ,U),BYTES=11,START=1,TYPE=X                      
         FIELD NAME=(IDARTNR),BYTES=5,START=1,TYPE=P                            
         FIELD NAME=(IDLOPNR),BYTES=2,START=6,TYPE=P                            
         FIELD NAME=(IDSEKVNR),BYTES=2,START=8,TYPE=P                           
         FIELD NAME=(KDORDBEK),BYTES=2,START=10,TYPE=X                          
*                                                                               
*HTR=4017                                                                       
         SEGM  NAME=WDGX4018,PARENT=WDR401,BYTES=1301,PTR=NT                    
         FIELD NAME=(KDSEGKEY,SEQ,U),BYTES=1,START=1,TYPE=X                     
*                                                                               
*HTR=4101                                                                       
         SEGM  NAME=WDGX4102,PARENT=WDR401,BYTES=125,PTR=T                      
         FIELD NAME=(KY4102,SEQ,U),BYTES=22,START=1,TYPE=X                      
         FIELD NAME=(IDKUNDNR),BYTES=4,START=1,TYPE=P                           
         FIELD NAME=(IDRAPP),BYTES=10,START=5,TYPE=X                            
         FIELD NAME=(IDKOLLI),BYTES=3,START=15,TYPE=P                           
         FIELD NAME=(IDARTNR),BYTES=5,START=18,TYPE=P                           
*HTR=4201                                                                       
         SEGM  NAME=WDGX4202,PARENT=WDR401,BYTES=18,PTR=T                       
         FIELD NAME=(KDSEGKEY,SEQ,U),BYTES=1,START=1,TYPE=X                     
*                                                                               
*HTR=4403                                                                       
         SEGM  NAME=WDGX4404,PARENT=WDR401,BYTES=06,PTR=T                       
         FIELD NAME=(IDPRC,SEQ,U),BYTES=4,START=1,TYPE=X                        
*                                                                               
*HTR=4463                                                                       
         SEGM  NAME=WDGX4464,PARENT=WDR401,BYTES=8,PTR=T                        
         FIELD NAME=(DASKEPPN,SEQ,U),BYTES=8,START=1,TYPE=X                     
*HTR=4463                                                                       
         SEGM  NAME=WDGX4466,PARENT=WDGX4464,BYTES=14,PTR=T                     
         FIELD NAME=(KY4466,SEQ,U),BYTES=14,START=1,TYPE=X                      
         FIELD NAME=(IDTRPTNR),BYTES=2,START=1,TYPE=P                           
         FIELD NAME=(IDLBBET),BYTES=12,START=3,TYPE=X                           
*HTR=4463                                                                       
         SEGM  NAME=WDGX4468,PARENT=WDGX4466,BYTES=71,PTR=T                     
         FIELD NAME=(KY4468,SEQ,U),BYTES=24,START=1,TYPE=X                      
         FIELD NAME=(IDDISTR),BYTES=3,START=1,TYPE=P                            
         FIELD NAME=(IDKUNDNR),BYTES=4,START=4,TYPE=P                           
         FIELD NAME=(IDKUNDRF),BYTES=10,START=8,TYPE=X                          
         FIELD NAME=(IDPRODNR),BYTES=4,START=18,TYPE=P                          
         FIELD NAME=(IDKOLLI),BYTES=3,START=22,TYPE=P                           
         FIELD NAME=(IDORDKL),BYTES=1,START=55,TYPE=P                           
*                                                                               
*HTR=4479                                                                       
         SEGM  NAME=WDGX4480,PARENT=WDR401,BYTES=12,PTR=NT                      
         FIELD NAME=(KDSEGKEY),BYTES=1,START=1,TYPE=X                           
*                                                                               
*HTR=4479                                                                       
         SEGM  NAME=WDGX4482,PARENT=WDR401,BYTES=75,PTR=T                       
         FIELD NAME=(WDGXKEY,SEQ,U),BYTES=25,START=1,TYPE=X                     
         FIELD NAME=(IDDISTR),BYTES=3,START=1,TYPE=P                            
         FIELD NAME=(IDKUNDNR),BYTES=4,START=4,TYPE=X                           
         FIELD NAME=(KDFAKTYP),BYTES=1,START=8,TYPE=X                           
         FIELD NAME=(IDKUNDRF),BYTES=10,START=9,TYPE=P                          
         FIELD NAME=(IDPRODNR),BYTES=4,START=19,TYPE=P                          
         FIELD NAME=(IDKOLLI),BYTES=3,START=23,TYPE=P                           
*                                                                               
*HTR=4487                                                                       
         SEGM  NAME=WDGX4488,PARENT=WDR401,BYTES=5,PTR=T                        
         FIELD NAME=(KDPRCGRP,SEQ,U),BYTES=5,START=1,TYPE=X                     
*                                                                               
*HTR=4487                                                                       
         SEGM  NAME=WDGX4490,PARENT=WDGX4488,BYTES=31,PTR=T                     
         FIELD NAME=(KY4490,SEQ,U),BYTES=18,START=1,TYPE=X                      
         FIELD NAME=(DARFS),BYTES=12,START=1,TYPE=X                             
         FIELD NAME=(IDPRODNR),BYTES=4,START=13,TYPE=P                          
         FIELD NAME=(IDPLKLST),BYTES=2,START=17,TYPE=P                          
         FIELD NAME=(TIKLAR),BYTES=4,START=28,TYPE=P                            
*                                                                               
*HTR=4491                                                                       
         SEGM  NAME=WDGX4492,PARENT=WDR401,BYTES=1199,PTR=T                     
         FIELD NAME=(TIAA,SEQ,U),BYTES=2,START=1,TYPE=P                         
*HTR=4491                                                                       
         SEGM  NAME=WDGX4494,PARENT=WDR401,BYTES=73,PTR=T                       
         FIELD NAME=(KY4494,SEQ,U),BYTES=34,START=1,TYPE=X                      
         FIELD NAME=(DALASTN),BYTES=8,START=1,TYPE=X                            
         FIELD NAME=(IDTRPTNR),BYTES=2,START=9,TYPE=P                           
         FIELD NAME=(IDZON),BYTES=2,START=11,TYPE=X                             
         FIELD NAME=(IDGMTREF),BYTES=17,START=13,TYPE=X                         
         FIELD NAME=(IDDISTR),BYTES=3,START=13,TYPE=P                           
         FIELD NAME=(IDTRPBO),BYTES=5,START=30,TYPE=X                           
         FIELD NAME=(IDLBBET),BYTES=12,START=35,TYPE=X                          
         FIELD NAME=(IDKOLLI),BYTES=3,START=67,TYPE=P                           
*HTR=4495                                                                       
         SEGM  NAME=WDGX4496,PARENT=WDR401,BYTES=30,PTR=NT                      
         FIELD NAME=(KDSEGKEY),BYTES=1,START=1,TYPE=X                           
*                                                                               
*HTR=4495                                                                       
         SEGM  NAME=WDGX4497,PARENT=WDR401,BYTES=20,PTR=T                       
         FIELD NAME=(IDKOLLIS,SEQ,U),BYTES=3,START=1,TYPE=P                     
*                                                                               
*HTR=4495                                                                       
         SEGM  NAME=WDGX4498,PARENT=WDR401,BYTES=75,PTR=T                       
         FIELD NAME=(WDGXKEY,SEQ,U),BYTES=25,START=1,TYPE=X                     
         FIELD NAME=(IDDISTR),BYTES=3,START=1,TYPE=P                            
         FIELD NAME=(IDKUNDNR),BYTES=4,START=4,TYPE=X                           
         FIELD NAME=(KDFAKTYP),BYTES=1,START=8,TYPE=X                           
         FIELD NAME=(IDKUNDRF),BYTES=10,START=9,TYPE=P                          
         FIELD NAME=(IDPRODNR),BYTES=4,START=19,TYPE=P                          
         FIELD NAME=(IDKOLLI),BYTES=3,START=23,TYPE=P                           
         FIELD NAME=(IDKOLLIS),BYTES=3,START=30,TYPE=P                          
*                                                                               
*                                                                               
*HTR=4503                                                                       
         SEGM  NAME=WDGX4504,PARENT=WDR401,BYTES=100,PTR=T                      
         FIELD NAME=(KY4504,SEQ,U),BYTES=7,START=1,TYPE=X                       
         FIELD NAME=(IDPRODNR),BYTES=4,START=1,TYPE=P                           
         FIELD NAME=(IDKOLLI),BYTES=3,START=5,TYPE=P                            
*                                                                               
*HTR=4505                                                                       
         SEGM  NAME=WDGX4506,PARENT=WDR401,BYTES=11,PTR=T                       
         FIELD NAME=(IDARTNR,SEQ,M),BYTES=5,START=1,TYPE=P                      
*                                                                               
*HTR=4507                                                                       
         SEGM  NAME=WDGX4508,PARENT=WDR401,BYTES=5,PTR=T                        
         FIELD NAME=(IDFAKT,SEQ,U),BYTES=4,START=1,TYPE=P                       
         FIELD NAME=(FLKLAR),BYTES=1,START=5,TYPE=X                             
*                                                                               
*HTR=4507                                                                       
         SEGM  NAME=WDGX4510,PARENT=WDGX4508,BYTES=328,PTR=T                    
         FIELD NAME=(KY4510,SEQ,U),BYTES=10,START=1,TYPE=X                      
         FIELD NAME=(IDPRODNR),BYTES=4,START=1,TYPE=P                           
         FIELD NAME=(IDKOLLI),BYTES=3,START=5,TYPE=P                            
         FIELD NAME=(IDPURAD),BYTES=3,START=8,TYPE=P                            
*                                                                               
*HTR=4513                                                                       
         SEGM  NAME=WDGX4514,PARENT=WDR401,BYTES=08,PTR=T                       
         FIELD NAME=(DASKEPPN,SEQ,U),BYTES=8,START=1,TYPE=X                     
*                                                                               
*HTR=4513                                                                       
         SEGM  NAME=WDGX4516,PARENT=WDGX4514,BYTES=30,PTR=T                     
         FIELD NAME=(WDGXKEY,SEQ,M),BYTES=13,START=1,TYPE=X                     
         FIELD NAME=(IDDC),BYTES=2,START=1,TYPE=X                               
         FIELD NAME=(IDSKEPPN),BYTES=4,START=3,TYPE=P                           
         FIELD NAME=(IDDISTR),BYTES=3,START=7,TYPE=P                            
         FIELD NAME=(IDKUNDNR),BYTES=4,START=10,TYPE=P                          
*                                                                               
*HTR=4541                                                                       
         SEGM  NAME=WDGX4542,PARENT=WDR401,BYTES=154,PTR=T                      
         FIELD NAME=(KY4542,SEQ,U),BYTES=16,START=1,TYPE=X                      
         FIELD NAME=(IDDISTR),BYTES=3,START=1,TYPE=P                            
         FIELD NAME=(IDANSK),BYTES=2,START=4,TYPE=P                             
         FIELD NAME=(IDARTNR),BYTES=5,START=6,TYPE=P                            
         FIELD NAME=(IDLOPNR),BYTES=2,START=11,TYPE=P                           
         FIELD NAME=(IDORDER),BYTES=4,START=13,TYPE=P                           
         FIELD NAME=(IDDC),BYTES=2,START=27,TYPE=X                              
         FIELD NAME=(KDVORATG),BYTES=1,START=59,TYPE=X                          
         FIELD NAME=(TEVORMRK),BYTES=2,START=77,TYPE=X                          
*                                                                               
*HTR=4545                                                                       
         SEGM  NAME=WDGX4546,PARENT=WDR401,BYTES=230,PTR=T                      
         FIELD NAME=(KY4546,SEQ,U),BYTES=7,START=1,TYPE=X                       
         FIELD NAME=(IDPRODNR),BYTES=4,START=1,TYPE=P                           
         FIELD NAME=(IDKOLLI),BYTES=3,START=5,TYPE=P                            
*                                                                               
*HTR=4547                                                                       
         SEGM  NAME=WDGX4548,PARENT=WDR401,BYTES=237,PTR=T                      
         FIELD NAME=(KY4548,SEQ,U),BYTES=7,START=1,TYPE=X                       
         FIELD NAME=(IDPRODNR),BYTES=4,START=1,TYPE=P                           
         FIELD NAME=(IDKOLLI),BYTES=3,START=5,TYPE=P                            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
