*        HÄNDELSEREGISTER MED DYNAMISK INFO                                     
*                                                                               
         DBD   NAME=WDR5,RMNAME=(V12008,,1080),                        *        
               ACCESS=(HDAM,OSAM)                                               
         DATASET DD1=WDR5V,DEVICE=3390,SIZE=8192,SCAN=0                         
*                                                                               
         SEGM  NAME=WDR501,PARENT=0,BYTES=30,PTR=T                              
         FIELD NAME=(WDGXKEY,SEQ,U),BYTES=30,START=1,TYPE=X                     
         FIELD NAME=(IDHTYP),BYTES=4,START=1,TYPE=X                             
*                                                                               
         SEGM  NAME=WDR510,PARENT=WDR501,BYTES=42,PTR=T                         
         FIELD NAME=(WDGXKEY,SEQ,U),BYTES=10,START=1,TYPE=X                     
         FIELD NAME=(KDLARM),BYTES=2,START=9,TYPE=P                             
         FIELD NAME=(IDARTNR),BYTES=5,START=11,TYPE=P                           
         FIELD NAME=(FLNYLARM),BYTES=1,START=16,TYPE=X                          
*                                                                               
         SEGM  NAME=WDR520,PARENT=WDR501,BYTES=92,PTR=T                         
         FIELD NAME=(WDGXKEY,SEQ,U),BYTES=52,START=1,TYPE=X                     
         FIELD NAME=(IDLEVNR),BYTES=5,START=1,TYPE=X                            
         FIELD NAME=(BELEVART),BYTES=30,START=6,TYPE=X                          
         FIELD NAME=(IDARTNR),BYTES=5,START=36,TYPE=P                           
         FIELD NAME=(IDUSER),BYTES=8,START=41,TYPE=X                            
*                                                                               
         SEGM  NAME=WDR521,PARENT=WDR520,BYTES=242,PTR=T,RULES=(,HERE)          
         FIELD NAME=(KDSEGKEY),BYTES=1,START=1,TYPE=X                           
*                                                                               
         SEGM  NAME=WDR530,PARENT=WDR501,BYTES=20,PTR=T                         
         FIELD NAME=(WDGXKEY,SEQ,U),BYTES=10,START=1,TYPE=X                     
         FIELD NAME=(IDARTNR),BYTES=5,START=1,TYPE=P                            
         FIELD NAME=(KDCLAGER),BYTES=1,START=6,TYPE=P                           
*                                                                               
         SEGM  NAME=WDR540,PARENT=WDR501,BYTES=30,PTR=T,RULES=(,HERE)           
         FIELD NAME=(KDSEGKEY),BYTES=1,START=1,TYPE=X                           
*                                                                               
         SEGM  NAME=WDR550,PARENT=WDR501,BYTES=70,PTR=T                         
         FIELD NAME=(WDGXKEY,SEQ,U),BYTES=10,START=1,TYPE=X                     
         FIELD NAME=(KDLARM),BYTES=2,START=9,TYPE=P                             
         FIELD NAME=(IDARTNR),BYTES=5,START=11,TYPE=P                           
         FIELD NAME=(IDDC),BYTES=2,START=16,TYPE=X                              
         FIELD NAME=(IDLEVNR),BYTES=5,START=52,TYPE=X                           
         FIELD NAME=(FLNYLARM),BYTES=1,START=18,TYPE=X                          
*                                                                               
         SEGM  NAME=WDR551,PARENT=WDR501,BYTES=12,PTR=T                         
         FIELD NAME=(WDGXKEY,SEQ,U),BYTES=10,START=1,TYPE=X                     
         FIELD NAME=(IDLEVNR),BYTES=5,START=1,TYPE=X                            
         FIELD NAME=(IDARTNR),BYTES=5,START=6,TYPE=P                            
*                                                                               
*                                                                               
*IDHTYP=0101                                                                    
         SEGM  NAME=WDGX0102,PARENT=WDR501,BYTES=108,PTR=T                      
         FIELD NAME=(IDUSERKY,SEQ,U),BYTES=50,START=1,TYPE=X                    
*                                                                               
*IDHTYP=0103                                                                    
         SEGM  NAME=WDGX0104,PARENT=WDR501,BYTES=664,PTR=T                      
         FIELD NAME=(ADDISPAB,SEQ,U),BYTES=50,START=1,TYPE=X                    
*                                                                               
*IDHTYP=1133                                                                    
         SEGM  NAME=WDGX1134,PARENT=WDR501,BYTES=5,PTR=T                        
         FIELD NAME=(IDARTNR,SEQ,U),BYTES=5,START=1,TYPE=P                      
*                                                                               
*IDHTYP=2219                                                                    
         SEGM  NAME=WDGX2220,PARENT=WDR501,BYTES=40,PTR=T                       
         FIELD NAME=(KY2220,SEQ,U),BYTES=13,START=1,TYPE=X                      
         FIELD NAME=(DAREGDAT),BYTES=8,START=1,TYPE=X                           
         FIELD NAME=(TIKLOCK),BYTES=5,START=9,TYPE=P                            
         FIELD NAME=(IDARTNR),BYTES=5,START=14,TYPE=P                           
         FIELD NAME=(IDANSK),BYTES=2,START=19,TYPE=P                            
         FIELD NAME=(IDLEVNR),BYTES=5,START=21,TYPE=X                           
         FIELD NAME=(KDLARM),BYTES=2,START=26,TYPE=P                            
*                                                                               
*IDHTYP=2247                                                                    
         SEGM  NAME=WDGX2248,PARENT=WDR501,BYTES=18,PTR=T                       
         FIELD NAME=(KY2248,SEQ,U),BYTES=12,START=1,TYPE=X                      
         FIELD NAME=(IDDC),BYTES=2,START=1,TYPE=X                               
         FIELD NAME=(IDLEVNR),BYTES=5,START=3,TYPE=X                            
         FIELD NAME=(IDARTNR),BYTES=5,START=8,TYPE=P                            
*                                                                               
*IDHTYP=2401                                                                    
         SEGM  NAME=WDGX2402,PARENT=WDR501,BYTES=693,PTR=T                      
         FIELD NAME=(IDARTNR,SEQ,M),BYTES=5,START=1,TYPE=P                      
         FIELD NAME=(IDDC),BYTES=2,START=6,TYPE=X                               
*                                                                               
*IDHTYP=2403                                                                    
         SEGM  NAME=WDGX2404,PARENT=WDR501,BYTES=98,PTR=T                       
         FIELD NAME=(KY2404,SEQ,U),BYTES=10,START=1,TYPE=X                      
         FIELD NAME=(IDARTNR),BYTES=5,START=1,TYPE=P                            
         FIELD NAME=(IDDC),BYTES=2,START=6,TYPE=X                               
         FIELD NAME=(IDFKNGRP),BYTES=3,START=8,TYPE=P                           
         FIELD NAME=(KDLEVSP),BYTES=2,START=11,TYPE=P                           
         FIELD NAME=(KVSPARR),BYTES=4,START=13,TYPE=P                           
         FIELD NAME=(IDUSER),BYTES=8,START=17,TYPE=X                            
*                                                                               
*IDHTYP=2505                                                                    
         SEGM  NAME=WDGX2506,PARENT=WDR501,BYTES=30,PTR=T                       
         FIELD NAME=(IDUSER,SEQ,M),BYTES=08,START=1,TYPE=X                      
         FIELD NAME=(IDGMTREF),BYTES=17,START=09,TYPE=X                         
         FIELD NAME=(IDDISTR),BYTES=3,START=09,TYPE=P                           
         FIELD NAME=(IDKUNDNR),BYTES=4,START=12,TYPE=P                          
         FIELD NAME=(IDKUNDRF),BYTES=10,START=16,TYPE=X                         
*                                                                               
*IDHTYP=2507                                                                    
         SEGM  NAME=WDGX2508,PARENT=WDR501,BYTES=02,PTR=T                       
         FIELD NAME=(IDLANDX2,SEQ,U),BYTES=02,START=1,TYPE=X                    
*                                                                               
*IDHTYP=2507                                                                    
         SEGM  NAME=WDGX2510,PARENT=WDGX2508,BYTES=18,PTR=T                     
         FIELD NAME=(IDARTNR,SEQ,U),BYTES=5,START=1,TYPE=P                      
*                                                                               
*IDHTYP=4103                                                                    
         SEGM  NAME=WDGX4104,PARENT=WDR501,BYTES=20,PTR=T                       
         FIELD NAME=(KEY4104,SEQ,U),BYTES=4,START=1,TYPE=X                      
         FIELD NAME=(IDDC),BYTES=2,START=1,TYPE=X                               
         FIELD NAME=(KDKRENOT),BYTES=2,START=3,TYPE=X                           
*                                                                               
         SEGM  NAME=WDGX4105,PARENT=WDGX4104,BYTES=331,PTR=NT                   
         FIELD NAME=(KDSEGKEY,SEQ,U),BYTES=1,START=1,TYPE=X                     
*                                                                               
         SEGM  NAME=WDGX4106,PARENT=WDGX4104,BYTES=52,PTR=T                     
         FIELD NAME=(TIDATETI,SEQ,U),BYTES=14,START=1,TYPE=X                    
         FIELD NAME=(IDUSERGK),BYTES=8,START=15,TYPE=X                          
         FIELD NAME=(FLKLAR),BYTES=1,START=48,TYPE=X                            
*                                                                               
*IDHTYP=4127                                                                    
         SEGM  NAME=WDGX4128,PARENT=WDR501,BYTES=39,PTR=T                       
         FIELD NAME=(KY4128,SEQ,U),BYTES=16,START=1,TYPE=X                      
         FIELD NAME=(IDDISTRF),BYTES=3,START=1,TYPE=P                           
         FIELD NAME=(IDDISTRT),BYTES=3,START=4,TYPE=P                           
         FIELD NAME=(IDKUNDNF),BYTES=4,START=7,TYPE=P                           
         FIELD NAME=(IDKUNDNT),BYTES=4,START=11,TYPE=P                          
         FIELD NAME=(KDANMORS),BYTES=2,START=15,TYPE=X                          
*                                                                               
*IDHTYP=4133                                                                    
         SEGM  NAME=WDGX4134,PARENT=WDR501,BYTES=29,PTR=T                       
         FIELD NAME=(KY4134,SEQ,U),BYTES=22,START=1,TYPE=X                      
         FIELD NAME=(IDLANDX2),BYTES=2,START=1,TYPE=X                           
         FIELD NAME=(ADPOSTNF),BYTES=10,START=3,TYPE=X                          
         FIELD NAME=(ADPOSTNT),BYTES=10,START=13,TYPE=X                         
         FIELD NAME=(IDDISTR),BYTES=3,START=23,TYPE=P                           
         FIELD NAME=(IDKUNDNR),BYTES=4,START=26,TYPE=P                          
*                                                                               
*IDHTYP=4137                                                                    
         SEGM  NAME=WDGX4138,PARENT=WDR501,BYTES=46,PTR=T                       
         FIELD NAME=(IDLANDX3,SEQ,U),BYTES=3,START=1,TYPE=X                     
*                                                                               
*IDHTYP=4251                                                                    
         SEGM  NAME=WDGX4252,PARENT=WDR501,BYTES=161,PTR=T                      
         FIELD NAME=(KY4252,SEQ,U),BYTES=11,START=1,TYPE=X                      
         FIELD NAME=(IDLOPNR),BYTES=2,START=1,TYPE=P                            
         FIELD NAME=(IDARTNR),BYTES=9,START=3,TYPE=X                            
*                                                                               
*IDHTYP=4253                                                                    
         SEGM  NAME=WDGX4254,PARENT=WDR501,BYTES=35,PTR=T                       
         FIELD NAME=(IDARTNR,SEQ,U),BYTES=5,START=1,TYPE=P                      
*                                                                               
*IDHTYP=4425                                                                    
         SEGM  NAME=WDGX4426,PARENT=WDR501,BYTES=15,PTR=T                       
         FIELD NAME=(IDSTATNR,SEQ,U),BYTES=5,START=1,TYPE=P                     
*                                                                               
         SEGM  NAME=WDGX4428,PARENT=WDGX4426,BYTES=5,PTR=T                      
         FIELD NAME=(KDSEGKEY,SEQ,U),BYTES=1,START=1,TYPE=X                     
*                                                                               
*IDHTYP=4563                                                                    
         SEGM  NAME=WDGX4564,PARENT=WDR501,BYTES=38,PTR=T                       
         FIELD NAME=(KY4564,SEQ,U),BYTES=24,START=1,TYPE=X                      
         FIELD NAME=(IDGMTREF),BYTES=17,START=01,TYPE=X                         
         FIELD NAME=(IDARTNR),BYTES=5,START=18,TYPE=P                           
         FIELD NAME=(IDLOPNR),BYTES=2,START=23,TYPE=P                           
         FIELD NAME=(TIREPDAT),BYTES=4,START=25,TYPE=P                          
*                                                                               
*IDHTYP=4703                                                                    
         SEGM  NAME=WDGX4704,PARENT=WDR501,BYTES=26,PTR=T                       
         FIELD NAME=(IDILIST,SEQ,U),BYTES=5,START=1,TYPE=X                      
*                                                                               
*IDHTYP=6301                                                                    
         SEGM  NAME=WDGX6302,PARENT=WDR501,BYTES=188,PTR=T                      
         FIELD NAME=(KEY6302,SEQ,U),BYTES=12,START=1,TYPE=X                     
         FIELD NAME=(DABERANK),BYTES=8,START=1,TYPE=X                           
         FIELD NAME=(IDFAKT),BYTES=4,START=9,TYPE=P                             
         FIELD NAME=(IDDCSEND),BYTES=2,START=17,TYPE=X                          
         FIELD NAME=(IDGMTREF),BYTES=17,START=19,TYPE=X                         
         FIELD NAME=(IDDISTR),BYTES=3,START=19,TYPE=P                           
         FIELD NAME=(IDKUNDNR),BYTES=4,START=22,TYPE=P                          
         FIELD NAME=(IDKUNDRF),BYTES=10,START=26,TYPE=X                         
         FIELD NAME=(IDLBBET),BYTES=12,START=36,TYPE=X                          
         FIELD NAME=(IDDCLEV),BYTES=2,START=80,TYPE=X                           
         FIELD NAME=(IDSUBSCR),BYTES=6,START=137,TYPE=P                         
*                                                                               
*IDHTYP=6305                                                                    
         SEGM  NAME=WDGX6306,PARENT=WDR501,BYTES=16,PTR=T                       
         FIELD NAME=(IDFAKT,SEQ,U),BYTES=4,START=1,TYPE=P                       
         FIELD NAME=(FLKLAR),BYTES=1,START=5,TYPE=X                             
*                                                                               
         SEGM  NAME=WDGX6308,PARENT=WDGX6306,BYTES=61,PTR=T                     
         FIELD NAME=(KEY6308,SEQ,U),BYTES=22,START=1,TYPE=X                     
         FIELD NAME=(IDDISTR),BYTES=3,START=1,TYPE=P                            
         FIELD NAME=(IDKUNDNR),BYTES=4,START=4,TYPE=P                           
         FIELD NAME=(IDRAPPNR),BYTES=7,START=8,TYPE=X                           
         FIELD NAME=(IDARTNR),BYTES=5,START=15,TYPE=P                           
         FIELD NAME=(IDRADNR),BYTES=3,START=20,TYPE=P                           
*                                                                               
*IDHTYP=6309                                                                    
         SEGM  NAME=WDGX6310,PARENT=WDR501,BYTES=36,PTR=T                       
         FIELD NAME=(IDILIST,SEQ,U),BYTES=5,START=1,TYPE=X                      
         FIELD NAME=(ADINLOMI),BYTES=4,START=6,TYPE=X                           
         FIELD NAME=(TIREGDAI),BYTES=4,START=25,TYPE=P                          
         FIELD NAME=(TIUPPDAI),BYTES=4,START=29,TYPE=P                          
         FIELD NAME=(TIUTSKR),BYTES=4,START=33,TYPE=P                           
*                                                                               
*IDHTYP=6321                                                                    
         SEGM  NAME=WDGX6322,PARENT=WDR501,BYTES=8,PTR=T                        
         FIELD NAME=(DASKROT9,SEQ,U),BYTES=8,START=1,TYPE=X                     
*                                                                               
         SEGM  NAME=WDGX6324,PARENT=WDGX6322,BYTES=280,PTR=T                    
         FIELD NAME=(KY6324,SEQ,U),BYTES=8,START=1,TYPE=X                       
         FIELD NAME=(IDARTNR),BYTES=5,START=1,TYPE=P                            
         FIELD NAME=(IDDC),BYTES=2,START=6,TYPE=X                               
         FIELD NAME=(KDSTASKR),BYTES=1,START=8,TYPE=P                           
         FIELD NAME=(IDPERSON),BYTES=2,START=105,TYPE=P                         
*                                                                               
         SEGM  NAME=WDGX6326,PARENT=WDGX6324,BYTES=47,PTR=T                     
         FIELD NAME=(TIDATETI,SEQ,U),BYTES=14,START=1,TYPE=X                    
         FIELD NAME=(IDUSERGK),BYTES=8,START=15,TYPE=X                          
*                                                                               
         SEGM  NAME=WDGX6325,PARENT=WDGX6324,BYTES=69,PTR=T                     
         FIELD NAME=(IDRADNR,SEQ,U),BYTES=3,START=1,TYPE=P                      
*                                                                               
*IDHTYP=6327                                                                    
         SEGM  NAME=WDGX6328,PARENT=WDR501,BYTES=130,PTR=T                      
         FIELD NAME=(KY6328,SEQ,U),BYTES=15,START=1,TYPE=X                      
         FIELD NAME=(SUBEL),BYTES=7,START=1,TYPE=X                              
         FIELD NAME=(IDUSERGK),BYTES=8,START=8,TYPE=X                           
*                                                                               
*IDHTYP=6351                                                                    
         SEGM  NAME=WDGX6352,PARENT=WDR501,BYTES=70,PTR=T                       
         FIELD NAME=(DAINLEV,SEQ,U),BYTES=16,START=1,TYPE=X                     
         FIELD NAME=(IDARTNR),BYTES=5,START=17,TYPE=P                           
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
