*        EKONOMI TRANSAR TILL DIVERSE KLIENTER FRÅN PULS                        
*                                                                               
         DBD   NAME=WDR9,                                              *        
               ACCESS=(HISAM,VSAM)                                              
         DATASET DD1=WDR9K,DEVICE=3390,SIZE=4096                                
*                                                                               
         SEGM  NAME=WDR901,PARENT=0,BYTES=304                                   
         FIELD NAME=(WDR901KY,SEQ,U),BYTES=31,START=1,TYPE=X                    
         FIELD NAME=(IDPGM),BYTES=8,START=1,TYPE=X                              
         FIELD NAME=(DAREGDAT),BYTES=8,START=9,TYPE=X                           
         FIELD NAME=(TIKLOCK),BYTES=5,START=17,TYPE=P                           
         FIELD NAME=(IDSEKVNR),BYTES=2,START=22,TYPE=P                          
         FIELD NAME=(IDCPYTXT),BYTES=8,START=24,TYPE=X                          
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
