*        MOTSVARAR SEKVENSFIL VARIABEL <= 1000                                  
*                                                                               
         DBD   NAME=WDS2,                                              *        
               ACCESS=(GSAM,BSAM)                                               
         DATASET DD1=WDS2G,RECFM=VB,RECORD=1000,SIZE=27998                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
