*        ART. PÅFYLLNING - KDPRIOPF 'FOM' INGÅNG                                
*                                                                               
         DBD   NAME=WDT1G,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDT1GK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDT1G1,PARENT=0,BYTES=42,PTR=T                              
         FIELD NAME=(WDT1G1KY,SEQ,U),BYTES=23,START=1,TYPE=X                    
         FIELD NAME=(IDDC),BYTES=2,START=1,TYPE=X                               
         FIELD NAME=(KDPRIOPF),BYTES=1,START=3,TYPE=P                           
         FIELD NAME=(ADLAGFOM),BYTES=2,START=4,TYPE=P                           
         FIELD NAME=(ADGANFOM),BYTES=2,START=6,TYPE=P                           
         FIELD NAME=(ADPLAFOM),BYTES=3,START=8,TYPE=P                           
         FIELD NAME=(KDSTAPF),BYTES=1,START=11,TYPE=X                           
         FIELD NAME=(TIORDTIM),BYTES=12,START=12,TYPE=X                         
         LCHILD NAME=(WDT101,WDT1),INDEX=WDT1GSEQ,PTR=SYMB                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
