*        ART. PÅFYLLNING - ADLAGOMR-FOM INGÅNG                                  
*                                                                               
         DBD   NAME=WDT1A,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDT1AK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDT1A1,PARENT=0,BYTES=37,PTR=T                              
         FIELD NAME=(WDT1A1KY,SEQ,U),BYTES=18,START=1,TYPE=X                    
         FIELD NAME=(IDDC),BYTES=2,START=1,TYPE=X                               
         FIELD NAME=(ADLAGFOM),BYTES=2,START=3,TYPE=P                           
         FIELD NAME=(KDSTAPF),BYTES=1,START=5,TYPE=X                            
         FIELD NAME=(KDPRIOPF),BYTES=1,START=6,TYPE=P                           
         FIELD NAME=(TIORDTIM),BYTES=12,START=7,TYPE=X                          
         LCHILD NAME=(WDT101,WDT1),INDEX=WDT1ASEQ,PTR=SYMB                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
