*        ART. PÅFYLLNING - ADPLATS-FOM INGÅNG                                   
*                                                                               
         DBD   NAME=WDT1C,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDT1CK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDT1C1,PARENT=0,BYTES=41,PTR=T                              
         FIELD NAME=(WDT1C1KY,SEQ,U),BYTES=21,START=1,TYPE=X                    
         FIELD NAME=(IDDC),BYTES=2,START=1,TYPE=X                               
         FIELD NAME=(ADLAGFOM),BYTES=2,START=3,TYPE=P                           
         FIELD NAME=(ADGANFOM),BYTES=2,START=5,TYPE=P                           
         FIELD NAME=(ADPLAFOM),BYTES=3,START=7,TYPE=P                           
         FIELD NAME=(TIORDTIM),BYTES=12,START=10,TYPE=X                         
         FIELD NAME=(KDSTAPF),BYTES=1,START=22,TYPE=X                           
         LCHILD NAME=(WDT101,WDT1),INDEX=WDT1CSEQ,PTR=SYMB                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
