*        ART. PÅFYLLNING - ADPLATS-TOM INGÅNG                                   
*                                                                               
         DBD   NAME=WDT1D,ACCESS=(INDEX,VSAM)                                   
         DATASET DD1=WDT1DK,DEVICE=3390,SIZE=4096                               
*                                                                               
         SEGM  NAME=WDT1D1,PARENT=0,BYTES=41,PTR=T                              
         FIELD NAME=(WDT1D1KY,SEQ,U),BYTES=21,START=1,TYPE=X                    
         FIELD NAME=(IDDC),BYTES=2,START=1,TYPE=X                               
         FIELD NAME=(ADLAGTOM),BYTES=2,START=3,TYPE=P                           
         FIELD NAME=(ADGANTOM),BYTES=2,START=5,TYPE=P                           
         FIELD NAME=(ADPLATOM),BYTES=3,START=7,TYPE=P                           
         FIELD NAME=(TIORDTIM),BYTES=12,START=10,TYPE=X                         
         FIELD NAME=(KDSTAPF),BYTES=1,START=22,TYPE=X                           
         LCHILD NAME=(WDT101,WDT1),INDEX=WDT1DSEQ,PTR=SYMB                      
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
