*        TEKNINSK INFO FÖR KINAS ART.ETIKETTER                                  
*                                                                               
         DBD   NAME=WDT4,                                              *        
               ACCESS=(HISAM,VSAM)                                              
         DATASET DD1=WDT4K,DEVICE=3390,SIZE=4096                                
*                                                                               
         SEGM  NAME=WDT401,PARENT=0,BYTES=185,PTR=T                             
         FIELD NAME=(IDARTNR,SEQ,U),BYTES=5,START=1,TYPE=P                      
         FIELD NAME=(IDTEKINF),BYTES=180,START=6,TYPE=X                         
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
