*                                                                               
*        AVSEDD FÖR HTYP 1117 PRODUKTSLAG ÄNDR.                                 
*                                                                               
         DBD   NAME=WL1117,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WL111701,PARENT=0,SOURCE=((WDG201,,WDG2))                   
         SEGM  NAME=WL111711,PARENT=WL111701,SOURCE=((WDGX1118,,WDG2))          
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
