*        FARLIGT GODS (PROPER SHIPPING NAME)                                    
*                                                                               
         DBD   NAME=WL1165,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WL116501,PARENT=0,SOURCE=((WDR201,,WDR2))                   
         SEGM  NAME=WL116511,PARENT=WL116501,SOURCE=((WDGX1166,,WDR2))          
         SEGM  NAME=WL116512,PARENT=WL116501,SOURCE=((WDGX1168,,WDR2))          
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
