*        KATALOG RUBRIK- TEXT- FOTNOT TILL ÖVERSÄTTNING                         
*                                                                               
         DBD   NAME=WL1205,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
         SEGM  NAME=WL120501,PARENT=0,SOURCE=((WDR201,,WDR2))                   
         SEGM  NAME=WL120511,PARENT=WL120501,SOURCE=((WDGX1206,,WDR2))          
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
