*        KATALOG BENÄMNINGSÖVERSÄTTNING                                         
*                                                                               
         DBD   NAME=WL1219,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
         SEGM  NAME=WL121901,PARENT=0,SOURCE=((WDR201,,WDR2))                   
         SEGM  NAME=WL121911,PARENT=WL121901,SOURCE=((WDGX1220,,WDR2))          
         SEGM  NAME=WL121921,PARENT=WL121911,SOURCE=((WDGX1221,,WDR2))          
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
