*        REFILL ORDERNUMMER REGISTER                                            
*                                                                               
         DBD   NAME=WL2503,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WL250301,PARENT=0,SOURCE=((WDR201,,WDR2))                   
         SEGM  NAME=WL250311,PARENT=WL250301,SOURCE=((WDGX2504,,WDR2))          
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
