*        REFILL PARAMETERTABELL                                                 
*                                                                               
         DBD   NAME=WL2501,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WL250101,PARENT=0,SOURCE=((WDR201,,WDR2))                   
         SEGM  NAME=WL250111,PARENT=WL250101,SOURCE=((WDGX2502,,WDR2))          
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
