*                                                                               
*        AVSEDD FÖR HTYP 3111 RADIO REGISTER                                    
*                                                                               
         DBD   NAME=WL3111,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WL311101,PARENT=0,SOURCE=((WDR101,,WDR1))                   
         SEGM  NAME=WL311111,PARENT=WL311101,SOURCE=((WDGX3112,,WDR1))          
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
