*                                                                               
*        AVSEDD FÖR HTYP 3131 ARTIKELSTATISTIK                                  
*                                                                               
         DBD   NAME=WL3131,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WL313101,PARENT=0,SOURCE=((WDG201,,WDG2))                   
         SEGM  NAME=WL313111,PARENT=WL313101,SOURCE=((WDGX3132,,WDG2))          
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
