*        BYTES PROFORMAFAKTURA                                                  
*                                                                               
         DBD   NAME=WL3171,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
         SEGM  NAME=WL317101,PARENT=0,SOURCE=((WDR401,,WDR4))                   
         SEGM  NAME=WL317111,PARENT=WL317101,SOURCE=((WDGX3172,,WDR4))          
         SEGM  NAME=WL317121,PARENT=WL317111,SOURCE=((WDGX3174,,WDR4))          
         SEGM  NAME=WL317131,PARENT=WL317121,SOURCE=((WDGX3176,,WDR4))          
*                                                                               
         DBDGEN                                                                 
         END                                                                    
