*        VIPS ORDERBEKRÄFTELSER                                                 
*                                                                               
         DBD   NAME=WL4013,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WL401301,PARENT=0,SOURCE=((WDR401,,WDR4))                   
         SEGM  NAME=WL401311,PARENT=WL401301,SOURCE=((WDGX4014,,WDR4))          
         SEGM  NAME=WL401321,PARENT=WL401311,SOURCE=((WDGX4016,,WDR4))          
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
