*        UTSKRIFT AV PLOCKSATS                                                  
*                                                                               
         DBD   NAME=WL4007,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WL400701,PARENT=0,SOURCE=((WDR401,,WDR4))                   
         SEGM  NAME=WL400711,PARENT=WL400701,SOURCE=((WDGX4008,,WDR4))          
         SEGM  NAME=WL400721,PARENT=WL400701,SOURCE=((WDGX4010,,WDR4))          
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
