*LÖPNUMMER REGISTER                                                             
*                                                                               
         DBD   NAME=WL4111,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
         SEGM  NAME=WL411101,PARENT=0,SOURCE=((WDR101,,WDR1))                   
         SEGM  NAME=WL411111,PARENT=WL411101,SOURCE=((WDGX4112,,WDR1))          
*                                                                               
         DBDGEN                                                                 
         END                                                                    
