*KREDITNOTA/RETURTILLSTÅND ÅTERSTARTSREGISTER                                   
*                                                                               
         DBD   NAME=WL4121,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
         SEGM  NAME=WL412101,PARENT=0,SOURCE=((WDR401,,WDR4))                   
         SEGM  NAME=WL412111,PARENT=WL412101,SOURCE=((WDR470,,WDR4))            
*                                                                               
         DBDGEN                                                                 
         END                                                                    
