*        LEVANM/RETUR ANALYSNUMMER                                              
*                                                                               
         DBD   NAME=WL4109,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WL410901,PARENT=0,SOURCE=((WDR101,,WDR1))                   
         SEGM  NAME=WL410911,PARENT=WL410901,SOURCE=((WDGX4110,,WDR1))          
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
