*        NDC BILL OF LADING                                                     
*                                                                               
         DBD   NAME=WL4463,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
         SEGM  NAME=WL446301,PARENT=0,SOURCE=((WDR401,,WDR4))                   
         SEGM  NAME=WL446311,PARENT=WL446301,SOURCE=((WDGX4464,,WDR4))          
         SEGM  NAME=WL446321,PARENT=WL446311,SOURCE=((WDGX4466,,WDR4))          
         SEGM  NAME=WL446331,PARENT=WL446321,SOURCE=((WDGX4468,,WDR4))          
*                                                                               
         DBDGEN                                                                 
         END                                                                    
