*        LASTBÄRARE                                                             
*                                                                               
         DBD   NAME=WL4495,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WL449501,PARENT=0,SOURCE=((WDR401,,WDR4))                   
         SEGM  NAME=WL449511,PARENT=WL449501,SOURCE=((WDGX4496,,WDR4))          
         SEGM  NAME=WL449512,PARENT=WL449501,SOURCE=((WDGX4498,,WDR4))          
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
