*        VOR-KÖ                                                                 
*                                                                               
         DBD   NAME=WL4541,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WL454101,PARENT=0,SOURCE=((WDR401,,WDR4))                   
         SEGM  NAME=WL454111,PARENT=WL454101,SOURCE=((WDGX4542,,WDR4))          
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
