*                                                                               
         DBD   NAME=WL4551,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WL455101,PARENT=0,SOURCE=((WDR401,,WDR4))                   
         SEGM  NAME=WL455111,PARENT=WL455101,SOURCE=((WDR470,,WDR4))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
