*TEXT REGISTER                                                                  
*                                                                               
         DBD   NAME=WL4735,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
         SEGM  NAME=WL473501,PARENT=0,SOURCE=((WDR101,,WDR1))                   
         SEGM  NAME=WL473511,PARENT=WL473501,SOURCE=((WDGX4735,,WDR1))          
*                                                                               
         DBDGEN                                                                 
         END                                                                    
