*TEXT REGISTER                                                                  
*                                                                               
         DBD   NAME=WL4732,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
         SEGM  NAME=WL473201,PARENT=0,SOURCE=((WDR101,,WDR1))                   
         SEGM  NAME=WL473211,PARENT=WL473201,SOURCE=((WDGX4732,,WDR1))          
*                                                                               
         DBDGEN                                                                 
         END                                                                    
