*PRISSÄTTNING - KOSTNAD/FÖRPACKNINGSGRUPP                                       
*                                                                               
         DBD   NAME=WL5137,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
         SEGM  NAME=WL513701,PARENT=0,SOURCE=((WDR101,,WDR1))                   
         SEGM  NAME=WL513711,PARENT=WL513701,SOURCE=((WDGX5138,,WDR1))          
*                                                                               
         DBDGEN                                                                 
         END                                                                    
