*        KOMMANDE NYA/ÄNDRADE LOCAL PRODUKT KOD                                 
*                                                                               
         DBD   NAME=WL5141,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
         SEGM  NAME=WL514101,PARENT=0,SOURCE=((WDR101,,WDR1))                   
         SEGM  NAME=WL514111,PARENT=WL514101,SOURCE=((WDGX5142,,WDR1))          
*                                                                               
         DBDGEN                                                                 
         END                                                                    
