*PRISSÄTTNING - KOSTNAD/FÖRPACKNINGSTYP                                         
*                                                                               
         DBD   NAME=WL5131,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
         SEGM  NAME=WL513101,PARENT=0,SOURCE=((WDR101,,WDR1))                   
         SEGM  NAME=WL513111,PARENT=WL513101,SOURCE=((WDGX5132,,WDR1))          
*                                                                               
         DBDGEN                                                                 
         END                                                                    
