*        STORAGE  TABLE                                                         
*                                                                               
         DBD   NAME=WL6315,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WL631501,PARENT=0,SOURCE=((WDR201,,WDR2))                   
         SEGM  NAME=WL631511,PARENT=WL631501,SOURCE=((WDGX6316,,WDR2))          
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
