*        SDC + NDC INLEV RETUR INFO.                                            
*                                                                               
         DBD   NAME=WL6305,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WL630501,PARENT=0,SOURCE=((WDR501,,WDR5))                   
         SEGM  NAME=WL630511,PARENT=WL630501,SOURCE=((WDGX6306,,WDR5))          
         SEGM  NAME=WL630521,PARENT=WL630511,SOURCE=((WDGX6308,,WDR5))          
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
