*        SDC + NDC INLEV FAKTURAINFO.                                           
*                                                                               
         DBD   NAME=WL6301,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WL630101,PARENT=0,SOURCE=((WDR501,,WDR5))                   
         SEGM  NAME=WL630111,PARENT=WL630101,SOURCE=((WDGX6302,,WDR5))          
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
