*        INVENTERINGS REGISTER ACS                                              
*                                                                               
         DBD   NAME=WLACSC,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLACSC01,PARENT=0,SOURCE=((WDJ7B1,,WDJ7B))                  
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
