*        INVENTERINGS REGISTER ACS                                              
*                                                                               
         DBD   NAME=WLACSD,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLACSD01,PARENT=0,SOURCE=((WDJ7C1,,WDJ7C))                  
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
