*        INVENTERINGS REGISTER ACS                                              
*                                                                               
         DBD   NAME=WLACSB,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLACSB01,PARENT=0,SOURCE=((WDJ7A1,,WDJ7A))                  
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
