*          DATA SET WLARTHDII0 AT LEVEL 001 AS OF 88/04/05                      
*                                                                               
         DBD   NAME=WLARTH,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLARTH01,PARENT=0,SOURCE=((WDD2A1,,WDD2A))                  
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
