*          DATA SET WLARTMDII0 AT LEVEL 002 AS OF 90/03/22                      
*                                                                               
         DBD   NAME=WLARTM,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLARTM01,PARENT=0,SOURCE=((WDK901,,WDK9))                   
         SEGM  NAME=WLARTM11,PARENT=WLARTM01,SOURCE=((WDK911,,WDK9))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
