*        ARTIKEL S-LAGER SEC. IND. ARTIKELADRESS                                
*                                                                               
         DBD   NAME=WLARTR,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLARTR01,PARENT=0,SOURCE=((WDK7A1,,WDK7A))                  
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
