*        BUFFER-REGISTER                                                        
*                                                                               
         DBD   NAME=WLARTD,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLARTD01,PARENT=0,SOURCE=((WDD801,,WDD8))                   
         SEGM  NAME=WLARTD11,PARENT=WLARTD01,SOURCE=((WDD811,,WDD8))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
