*        DSP/VR ARTIKEL-LAGERSTYRNINGSINFORMATION                               
*                                                                               
         DBD   NAME=WLARTF,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLARTF01,PARENT=0,SOURCE=((WDK801,,WDK8))                   
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
