*        ARTIKEL SEC. IND. LEVERANTÖR                                           
*                                                                               
         DBD   NAME=WLARTQ,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLARTQ01,PARENT=0,SOURCE=((WDK6A1,,WDK6A))                  
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
