*          DATA SET WLARTKDII0 AT LEVEL 001 AS OF 88/04/06                      
*                                                                               
         DBD   NAME=WLARTK,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLARTK01,PARENT=0,SOURCE=((WDD2D1,,WDD2D))                  
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
