*        ARTIKELREGISTER FARLIGT GODS                                           
*                                                                               
         DBD   NAME=WLARTN,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLARTN01,PARENT=0,SOURCE=((WDD501,,WDD5))                   
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
