*        KUND-REGISTER BETALARE                                                 
*                                                                               
         DBD   NAME=WLBETC,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLBETC01,PARENT=0,SOURCE=((WDB101,,WDB1))                   
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
