*                                                                               
*        BYTES LAGRING RETURER                                                  
*                                                                               
         DBD   NAME=WLBYTF,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
         SEGM  NAME=WLBYTF01,PARENT=0,SOURCE=((WDM601,,WDM6))                   
         SEGM  NAME=WLBYTF11,PARENT=WLBYTF01,SOURCE=((WDM611,,WDM6))            
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
