*        EKONOMI HÄNDELSER                                                      
*                                                                               
         DBD   NAME=WLEKKA,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
         SEGM  NAME=WLEKKA01,PARENT=0,SOURCE=((WDH501,,WDH5))                   
         SEGM  NAME=WLEKKA11,PARENT=WLEKKA01,SOURCE=((WDH511,,WDH5))            
         SEGM  NAME=WLEKKA21,PARENT=WLEKKA11,SOURCE=((WDH521,,WDH5))            
         SEGM  NAME=WLEKKA31,PARENT=WLEKKA21,SOURCE=((WDH531,,WDH5))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
