*        EKONOMI HÄNDELSER                                                      
*                                                                               
         DBD   NAME=WLEKKB,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLEKKB01,PARENT=0,SOURCE=((WDH5A1,,WDH5A))                  
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
