*          DATA SET WLERSBDII0 AT LEVEL 003 AS OF 84/05/09                      
*                                                                               
         DBD   NAME=WLERSB,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLERSB01,PARENT=0,SOURCE=((WDD7A1,,WDD7A))                  
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
