*          DATA SET WLERSADII0 AT LEVEL 003 AS OF 84/04/24                      
*                                                                               
         DBD   NAME=WLERSA,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
         SEGM  NAME=WLERSA01,PARENT=0,SOURCE=((WDD701,,WDD7))                   
         SEGM  NAME=WLERSA11,PARENT=WLERSA01,SOURCE=((WDD702,,WDD7))            
         SEGM  NAME=WLERSA13,PARENT=WLERSA01,SOURCE=((WDD704,,WDD7))            
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
