*        ARTIKEL REGISTER                                                       
*                                                                               
         DBD   NAME=WLETIA,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
         SEGM  NAME=WLETIA01,PARENT=0,SOURCE=((WDK301,,WDK3))                   
         SEGM  NAME=WLETIA11,PARENT=WLETIA01,SOURCE=((WDK311,,WDK3))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
