*        TRANSAR TILL BATCH BEREDNING/ANSKAFFNING FRÅN ONLINE                   
*                                                                               
         DBD   NAME=WLFILC,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLFILC01,PARENT=0,SOURCE=((WDR301,,WDR3))                   
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
