*        TRANSAR TILL BATCH EKONOMI FRÅN ONLINE                                 
*                                                                               
         DBD   NAME=WLFILB,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLFILB01,PARENT=0,SOURCE=((WDR801,,WDR8))                   
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
