*          DATA SET WLFSGBDII0 AT LEVEL 001 AS OF 89/09/15                      
*                                                                               
         DBD   NAME=WLFSGB,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLFSGB01,PARENT=0,SOURCE=((WDM3A1,,WDM3A))                  
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
