*          DATA SET WLFSGADII0 AT LEVEL 001 AS OF 89/09/15                      
*                                                                               
         DBD   NAME=WLFSGA,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLFSGA01,PARENT=0,SOURCE=((WDM301,,WDM3))                   
         SEGM  NAME=WLFSGA11,PARENT=WLFSGA01,SOURCE=((WDM311,,WDM3))            
         SEGM  NAME=WLFSGA12,PARENT=WLFSGA01,SOURCE=((WDM312,,WDM3))            
         SEGM  NAME=WLFSGA13,PARENT=WLFSGA01,SOURCE=((WDM313,,WDM3))            
         SEGM  NAME=WLFSGA14,PARENT=WLFSGA01,SOURCE=((WDM314,,WDM3))            
         SEGM  NAME=WLFSGA15,PARENT=WLFSGA01,SOURCE=((WDM315,,WDM3))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
