*        KUND-REGISTER FRAKTKOD GODSMOTTAGARE                                   
*                                                                               
         DBD   NAME=WLGMTC,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLGMTC01,PARENT=0,SOURCE=((WDB501,,WDB5))                   
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
