*        KUND-REGISTER GODSMOTTAGARE INDEX=BETALARE                             
*                                                                               
         DBD   NAME=WLGMTD,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLGMTD01,PARENT=0,SOURCE=((WDB2A1,,WDB2A))                  
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
