*        INVENTERINGS-REGISTER SEC. IND. DC + LAGERPLATS                        
*                                                                               
         DBD   NAME=WLINVB,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLINVB01,PARENT=0,SOURCE=((WDH1A1,,WDH1A))                  
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
