*        SDC INLEV HISTORIK REGISTER                                            
*                                                                               
         DBD   NAME=WLINLC,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLINLC01,PARENT=0,SOURCE=((WDL601,,WDL6))                   
         SEGM  NAME=WLINLC11,PARENT=WLINLC01,SOURCE=((WDL611,,WDL6))            
         SEGM  NAME=WLINLC12,PARENT=WLINLC01,SOURCE=((WDL612,,WDL6))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
