*        INVENTERINGSHISTORIK                                                   
*                                                                               
         DBD   NAME=WLINVC,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLINVC01,PARENT=0,SOURCE=((WDH701,,WDH7))                   
         SEGM  NAME=WLINVC11,PARENT=WLINVC01,SOURCE=((WDH711,,WDH7))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
