*        INVENTERINGS-REGISTER                                                  
*                                                                               
         DBD   NAME=WLINVA,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLINVA01,PARENT=0,SOURCE=((WDH101,,WDH1))                   
         SEGM  NAME=WLINVA11,PARENT=WLINVA01,SOURCE=((WDH111,,WDH1))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
