*          DATA SET WLINLEDII0 AT LEVEL 003 AS OF 86/04/03                      
*                                                                               
         DBD   NAME=WLINLE,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLINLE01,PARENT=0,SOURCE=((WDL201,,WDL2))                   
         SEGM  NAME=WLINLE11,PARENT=WLINLE01,SOURCE=((WDL211,,WDL2))            
         SEGM  NAME=WLINLE21,PARENT=WLINLE11,SOURCE=((WDL221,,WDL2))            
         SEGM  NAME=WLINLE31,PARENT=WLINLE21,SOURCE=((WDL231,,WDL2))            
         SEGM  NAME=WLINLE22,PARENT=WLINLE11,SOURCE=((WDL222,,WDL2))            
         SEGM  NAME=WLINLE23,PARENT=WLINLE11,SOURCE=((WDL223,,WDL2))            
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
