         DBD   NAME=WLINLB,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLINLB01,PARENT=0,SOURCE=((WDD901,,WDD9))                   
         SEGM  NAME=WLINLB11,PARENT=WLINLB01,SOURCE=((WDD902,,WDD9))            
         SEGM  NAME=WLINLB22,PARENT=WLINLB11,SOURCE=((WDD904,,WDD9))            
         SEGM  NAME=WLINLB23,PARENT=WLINLB11,SOURCE=((WDD905,,WDD9))            
         SEGM  NAME=WLINLB31,PARENT=WLINLB23,SOURCE=((WDD906,,WDD9))            
         SEGM  NAME=WLINLB32,PARENT=WLINLB23,SOURCE=((WDD907,,WDD9))            
         SEGM  NAME=WLINLB24,PARENT=WLINLB11,SOURCE=((WDD924,,WDD9))            
         SEGM  NAME=WLINLB25,PARENT=WLINLB11,SOURCE=((WDD925,,WDD9))            
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
