*          DATA SET WLJCLADII0 AT LEVEL 001 AS OF 84/02/07                      
*                                                                               
         DBD   NAME=WLJCLA,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
         SEGM  NAME=WLJCLA01,PARENT=0,SOURCE=((WDP101,,WDP1))                   
         SEGM  NAME=WLJCLA11,PARENT=WLJCLA01,SOURCE=((WDP111,,WDP1))            
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
