*          DATA SET WLJCLDDII0 AT LEVEL 001 AS OF 84/02/07                      
*                                                                               
         DBD   NAME=WLJCLD,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
         SEGM  NAME=WLJCLD01,PARENT=0,SOURCE=((WDP101,,WDP1))                   
         SEGM  NAME=WLJCLD11,PARENT=WLJCLD01,SOURCE=((WDP111,,WDP1))            
         SEGM  NAME=WLJCLD12,PARENT=WLJCLD01,SOURCE=((WDP114,,WDP1))            
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
