*          DATA SET WLJCLCDII0 AT LEVEL 002 AS OF 84/07/11                      
*                                                                               
         DBD   NAME=WLJCLC,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
         SEGM  NAME=WLJCLC01,PARENT=0,SOURCE=((WDP101,,WDP1))                   
         SEGM  NAME=WLJCLC11,PARENT=WLJCLC01,SOURCE=((WDP111,,WDP1))            
         SEGM  NAME=WLJCLC12,PARENT=WLJCLC01,SOURCE=((WDP113,,WDP1))            
         SEGM  NAME=WLJCLC13,PARENT=WLJCLC01,SOURCE=((WDP114,,WDP1))            
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
