*        KATALOG AVSNITT SEC.IND. IDILLU                                        
*                                                                               
         DBD   NAME=WLKATO,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLKATO01,PARENT=0,SOURCE=((WDN5C1,,WDN5C))                  
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
