*        KATALOG AVSNITT SEC.IND. ARTIKEL                                       
*                                                                               
         DBD   NAME=WLKATJ,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLKATJ01,PARENT=0,SOURCE=((WDN5B1,,WDN5B))                  
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
