*        KATALOG TILLÄGGSTEXT SEC.IND. IDSKYLT                                  
*                                                                               
         DBD   NAME=WLKATE,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLKATE01,PARENT=0,SOURCE=((WDN4A1,,WDN4A))                  
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
