*        KATALOG AVSNITT SEC.IND. IDRUBNR                                       
*                                                                               
         DBD   NAME=WLKATQ,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLKATQ01,PARENT=0,SOURCE=((WDN5E1,,WDN5E))                  
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
