*        KATALOG RUBRIK-LEXIKON SEC.IND. IDSKYLT                                
*                                                                               
         DBD   NAME=WLKATC,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLKATC01,PARENT=0,SOURCE=((WDN2A1,,WDN2A))                  
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
