*        KATALOG ILLUSTRATION SEC.IND. IDILLU                                   
*                                                                               
         DBD   NAME=WLKATL,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLKATL01,PARENT=0,SOURCE=((WDN7A1,,WDN7A))                  
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
