*        KATALOG AVSNITT SEC.IND. IDFOTNR                                       
*                                                                               
         DBD   NAME=WLKATR,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLKATR01,PARENT=0,SOURCE=((WDN5F1,,WDN5F))                  
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
