*        KATALOG ILLUSTRATIONS-REGISTER                                         
*                                                                               
         DBD   NAME=WLKATK,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLKATK01,PARENT=0,SOURCE=((WDN701,,WDN7))                   
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
