*        KATALOG MASTER-REGISTER                                                
*                                                                               
         DBD   NAME=WLKATN,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLKATN01,PARENT=0,SOURCE=((WDN601,,WDN6))                   
         SEGM  NAME=WLKATN11,PARENT=WLKATN01,SOURCE=((WDN611,,WDN6))            
         SEGM  NAME=WLKATN12,PARENT=WLKATN01,SOURCE=((WDN612,,WDN6))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
