*        KATALOG AVSNITT-REGISTER                                               
*                                                                               
         DBD   NAME=WLKATH,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLKATH01,PARENT=0,SOURCE=((WDN501,,WDN5))                   
         SEGM  NAME=WLKATH11,PARENT=WLKATH01,SOURCE=((WDN511,,WDN5))            
         SEGM  NAME=WLKATH12,PARENT=WLKATH01,SOURCE=((WDN512,,WDN5))            
         SEGM  NAME=WLKATH21,PARENT=WLKATH12,SOURCE=((WDN521,,WDN5))            
         SEGM  NAME=WLKATH22,PARENT=WLKATH12,SOURCE=((WDN522,,WDN5))            
         SEGM  NAME=WLKATH23,PARENT=WLKATH12,SOURCE=((WDN523,,WDN5))            
         SEGM  NAME=WLKATH24,PARENT=WLKATH12,SOURCE=((WDN524,,WDN5))            
         SEGM  NAME=WLKATH25,PARENT=WLKATH12,SOURCE=((WDN525,,WDN5))            
         SEGM  NAME=WLKATH26,PARENT=WLKATH12,SOURCE=((WDN526,,WDN5))            
         SEGM  NAME=WLKATH27,PARENT=WLKATH12,SOURCE=((WDN527,,WDN5))            
         SEGM  NAME=WLKATH13,PARENT=WLKATH01,SOURCE=((WDN513,,WDN5))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
