*        KATALOG FOTNOT SEC.IND. IDSKYLT                                        
*                                                                               
         DBD   NAME=WLKATG,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLKATG01,PARENT=0,SOURCE=((WDN3A1,,WDN3A))                  
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
