*        KATALOG AVSNITT SEC.IND. KATALOG                                       
*                                                                               
         DBD   NAME=WLKATI,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLKATI01,PARENT=0,SOURCE=((WDN5A1,,WDN5A))                  
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
