*          DATA SET WLKNDDDII0 AT LEVEL 001 AS OF 88/07/14                      
*                                                                               
         DBD   NAME=WLKNDD,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLKNDD01,PARENT=0,SOURCE=((WDB401,,WDB4))                   
         SEGM  NAME=WLKNDD14,PARENT=WLKNDD01,SOURCE=((WDB414,,WDB4))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
