*                                                                               
         DBD   NAME=WLKREH,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
         SEGM  NAME=WLKREH01,PARENT=0,SOURCE=((WDA2C1,,WDA2C))                  
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
