*                                                                               
         DBD   NAME=WLKREK,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
         SEGM  NAME=WLKREK01,PARENT=0,SOURCE=((WDA2F1,,WDA2F))                  
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
