*                                                                               
         DBD   NAME=WLKREG,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
         SEGM  NAME=WLKREG01,PARENT=0,SOURCE=((WDA2B1,,WDA2B))                  
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
