*                                                                               
         DBD   NAME=WLKREJ,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
         SEGM  NAME=WLKREJ01,PARENT=0,SOURCE=((WDA2E1,,WDA2E))                  
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
