*                                                                               
         DBD   NAME=WLLEVA,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLLEVA01,PARENT=0,SOURCE=((WDF101,,WDF1))                   
         SEGM  NAME=WLLEVA11,PARENT=WLLEVA01,SOURCE=((WDF102,,WDF1))            
         SEGM  NAME=WLLEVA12,PARENT=WLLEVA01,SOURCE=((WDF103,,WDF1))            
         SEGM  NAME=WLLEVA13,PARENT=WLLEVA01,SOURCE=((WDF104,,WDF1))            
         SEGM  NAME=WLLEVA14,PARENT=WLLEVA01,SOURCE=((WDF106,,WDF1))            
         SEGM  NAME=WLLEVA15,PARENT=WLLEVA01,SOURCE=((WDF107,,WDF1))            
         SEGM  NAME=WLLEVA16,PARENT=WLLEVA01,SOURCE=((WDF116,,WDF1))            
         SEGM  NAME=WLLEVA17,PARENT=WLLEVA01,SOURCE=((WDF117,,WDF1))            
         SEGM  NAME=WLLEVA18,PARENT=WLLEVA01,SOURCE=((WDF118,,WDF1))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
