*        DIREKTLEV.STYRNING - IDDIRLEV INGÅNG                                   
*                                                                               
         DBD   NAME=WLLEVH,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLLEVH01,PARENT=0,SOURCE=((WDF2B1,,WDF2B))                  
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
