*        LISTÅTERSTARTSREGISTER SEC. IND. IDLTERM+DATUM                         
*                                                                               
         DBD   NAME=WLLISC,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLLISC01,PARENT=0,SOURCE=((WDG8A1,,WDG8A))                  
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
