*        PLATS HISTORIK REGISTER                                                
*                                                                               
         DBD   NAME=WLLOCB,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLLOCB01,PARENT=0,SOURCE=((WDJ901,,WDJ9))                   
         SEGM  NAME=WLLOCB11,PARENT=WLLOCB01,SOURCE=((WDJ911,,WDJ9))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
