*        ORDERINGÅNG-STATISTIK                                                  
*                                                                               
         DBD   NAME=WLOIGA,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLOIGA01,PARENT=0,SOURCE=((WDL701,,WDL7))                   
         SEGM  NAME=WLOIGA11,PARENT=WLOIGA01,SOURCE=((WDL711,,WDL7))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
