*        ORDERINGÅNG-STATISTIK CDC                                              
*                                                                               
         DBD   NAME=WLOIGB,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLOIGB01,PARENT=0,SOURCE=((WDL801,,WDL8))                   
         SEGM  NAME=WLOIGB11,PARENT=WLOIGB01,SOURCE=((WDL811,,WDL8))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
