*        ORDERDELSREG. PLANERING PRODUKTIONSKANAL                               
*                                                                               
         DBD   NAME=WLORQS,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLORQS01,PARENT=0,SOURCE=((WDQ3F1,,WDQ3F))                  
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
