*          DATA SET WLORQODII0 AT LEVEL 003 AS OF 90/05/10                      
*                                                                               
         DBD   NAME=WLORQO,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLORQO01,PARENT=0,SOURCE=((WDQ1B1,,WDQ1B))                  
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
