*          DATA SET WLORQBDII0 AT LEVEL 002 AS OF 90/03/14                      
*                                                                               
         DBD   NAME=WLORQB,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLORQB01,PARENT=0,SOURCE=((WDQ3A1,,WDQ3A))                  
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
