*                                                                               
         DBD   NAME=WLORQQ,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLORQQ01,PARENT=0,SOURCE=((WDQ5A1,,WDQ5A))                  
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
