*          DATA SET WLORDQDII0 AT LEVEL 001 AS OF 88/06/15                      
*                                                                               
         DBD   NAME=WLORDQ,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLORDQ01,PARENT=0,SOURCE=((WDA5A1,,WDA5A))                  
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
