*          DATA SET WLORDPDII0 AT LEVEL 001 AS OF 88/06/15                      
*                                                                               
         DBD   NAME=WLORDP,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLORDP01,PARENT=0,SOURCE=((WDA501,,WDA5))                   
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
