*          DATA SET WLORQHDII0 AT LEVEL 003 AS OF 90/04/05                      
*                                                                               
         DBD   NAME=WLORQH,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLORQH01,PARENT=0,SOURCE=((WDQ4B1,,WDQ4B))                  
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
