*          DATA SET WLORQLDII0 AT LEVEL 004 AS OF 90/04/12                      
*                                                                               
         DBD   NAME=WLORQL,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLORQL01,PARENT=0,SOURCE=((WDQ2C1,,WDQ2C))                  
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
