*        ORDERRADER TILL PULS                                                   
*                                                                               
         DBD   NAME=WLORQP,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLORQP01,PARENT=0,SOURCE=((WDQ501,,WDQ5))                   
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
