*          DATA SET WLORDSDII0 AT LEVEL 001 AS OF 88/06/15                      
*                                                                               
         DBD   NAME=WLORDS,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLORDS01,PARENT=0,SOURCE=((WDA5C1,,WDA5C))                  
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
