*          DATA SET WLORQGDII0 AT LEVEL 003 AS OF 90/04/05                      
*                                                                               
         DBD   NAME=WLORQG,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLORQG01,PARENT=0,SOURCE=((WDQ4A1,,WDQ4A))                  
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
