*          DATA SET WLORQFDII0 AT LEVEL 003 AS OF 90/04/05                      
*                                                                               
         DBD   NAME=WLORQF,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLORQF01,PARENT=0,SOURCE=((WDQ401,,WDQ4))                   
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
