*                                                                               
         DBD   NAME=WLORDM,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLORDM01,PARENT=0,SOURCE=((WDL101,,WDL1))                   
         SEGM  NAME=WLORDM11,PARENT=WLORDM01,SOURCE=((WDL111,,WDL1))            
         SEGM  NAME=WLORDM12,PARENT=WLORDM01,SOURCE=((WDL112,,WDL1))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
