*        PRISREGISTER RABATTSTRUKTUR AMC (NEW PRICE)                            
*                                                                               
         DBD   NAME=WLPRIB,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLPRIB01,PARENT=0,SOURCE=((WDC201,,WDC2))                   
         SEGM  NAME=WLPRIB11,PARENT=WLPRIB01,SOURCE=((WDC211,,WDC2))            
         SEGM  NAME=WLPRIB12,PARENT=WLPRIB01,SOURCE=((WDC212,,WDC2))            
         SEGM  NAME=WLPRIB13,PARENT=WLPRIB01,SOURCE=((WDC213,,WDC2))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
