*        STANDARDPRISREGISTER (KOMMANDE) SEC. IND. IDLEVNR                      
*                                                                               
         DBD   NAME=WLPRIF,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLPRIF01,PARENT=0,SOURCE=((WDC6A1,,WDC6A))                  
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
