*                                                                               
         DBD   NAME=WLPROC,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLPROC01,PARENT=0,SOURCE=((WDE801,,WDE8))                   
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
