*                                                                               
         DBD   NAME=WLRETA,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLRETA01,PARENT=0,SOURCE=((WDA301,,WDA3))                   
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
