*                                                                               
         DBD   NAME=WLRETE,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
         SEGM  NAME=WLRETE01,PARENT=0,SOURCE=((WDA3D1,,WDA3D))                  
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
