*                                                                               
         DBD   NAME=WLRETG,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
         SEGM  NAME=WLRETG01,PARENT=0,SOURCE=((WDA3F1,,WDA3F))                  
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
