*                                                                               
         DBD   NAME=WLRETF,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
         SEGM  NAME=WLRETF01,PARENT=0,SOURCE=((WDA3E1,,WDA3E))                  
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
