*                                                                               
         DBD   NAME=WLRETC,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
         SEGM  NAME=WLRETC01,PARENT=0,SOURCE=((WDA3B1,,WDA3B))                  
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
