*          DATA SET WLSATLDII0 AT LEVEL 004 AS OF 90/10/30                      
*                                                                               
         DBD   NAME=WLSATL,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLSATL01,PARENT=0,SOURCE=((WDJ2E1,,WDJ2E))                  
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
