*          DATA SET WLSATIDII0 AT LEVEL 002 AS OF 90/10/30                      
*                                                                               
         DBD   NAME=WLSATI,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLSATI01,PARENT=0,SOURCE=((WDJ2B1,,WDJ2B))                  
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
