*          DATA SET WLSATJDII0 AT LEVEL 002 AS OF 90/10/30                      
*                                                                               
         DBD   NAME=WLSATJ,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLSATJ01,PARENT=0,SOURCE=((WDJ2C1,,WDJ2C))                  
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
