*          DATA SET WLSATKDII0 AT LEVEL 004 AS OF 90/10/30                      
*                                                                               
         DBD   NAME=WLSATK,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLSATK01,PARENT=0,SOURCE=((WDJ2D1,,WDJ2D))                  
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
