*          DATA SET WLSATDDII0 AT LEVEL 001 AS OF 90/03/28                      
*                                                                               
         DBD   NAME=WLSATD,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLSATD01,PARENT=0,SOURCE=((WDJ1B1,,WDJ1B))                  
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
