*          DATA SET WLSATGDII0 AT LEVEL 003 AS OF 90/10/30                      
*                                                                               
         DBD   NAME=WLSATG,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLSATG01,PARENT=0,SOURCE=((WDJ201,,WDJ2))                   
         SEGM  NAME=WLSATG11,PARENT=WLSATG01,SOURCE=((WDJ211,,WDJ2))            
         SEGM  NAME=WLSATG12,PARENT=WLSATG01,SOURCE=((WDJ212,,WDJ2))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
