*          DATA SET WLSATFDII0 AT LEVEL 003 AS OF 90/05/23                      
*                                                                               
         DBD   NAME=WLSATF,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLSATF01,PARENT=0,SOURCE=((WDJ1D1,,WDJ1D))                  
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
