*          DATA SET WLXXKBDII0 AT LEVEL 002 AS OF 90/03/07                      
*                                                                               
         DBD   NAME=WLXXKB,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLXXKB01,PARENT=0,SOURCE=((WDR101,,WDR1))                   
         SEGM  NAME=WLXXKB11,PARENT=WLXXKB01,SOURCE=((WDR130,,WDR1))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
