*          DATA SET WLXXAPDII0 AT LEVEL 001 AS OF 88/02/18                      
*                                                                               
         DBD   NAME=WLXXAP,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLXXAP01,PARENT=0,SOURCE=((WDG201,,WDG2))                   
         SEGM  NAME=WLXXAP11,PARENT=WLXXAP01,SOURCE=((WDG203,,WDG2))            
         SEGM  NAME=WLXXAP12,PARENT=WLXXAP01,SOURCE=((WDG230,,WDG2))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
