*                                                                               
*        AVSEDD FÖR HTYP 2245 LEVERANSPLAN PV-LEVERANTÖR                        
*                                                                               
         DBD   NAME=WLXXCZ,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLXXCZ01,PARENT=0,SOURCE=((WDR501,,WDR5))                   
         SEGM  NAME=WLXXCZ11,PARENT=WLXXCZ01,SOURCE=((WDR530,,WDR5))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
