*          DATA SET WLXXKYDII0 AT LEVEL 003 AS OF 90/06/11                      
*                                                                               
         DBD   NAME=WLXXKY,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLXXKY01,PARENT=0,SOURCE=((WDR401,,WDR4))                   
         SEGM  NAME=WLXXKY11,PARENT=WLXXKY01,SOURCE=((WDR470,,WDR4))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
