*          DATA SET WLXXIDDII0 AT LEVEL 003 AS OF 87/02/05                      
*                                                                               
         DBD   NAME=WLXXID,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLXXID01,PARENT=0,SOURCE=((WDG301,,WDG3))                   
         SEGM  NAME=WLXXID11,PARENT=WLXXID01,SOURCE=((WDG302,,WDG3))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
