*          DATA SET WLXXBNDII0 AT LEVEL 010 AS OF 86/03/19                      
*                                                                               
         DBD   NAME=WLXXBN,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
         SEGM  NAME=WLXXBN01,PARENT=0,SOURCE=((WDG301,,WDG3))                   
         SEGM  NAME=WLXXBN11,PARENT=WLXXBN01,SOURCE=((WDG303,,WDG3))            
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
