*          DATA SET WLXXBVDII0 AT LEVEL 010 AS OF 90/05/17                      
*                                                                               
         DBD   NAME=WLXXBV,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLXXBV01,PARENT=0,SOURCE=((WDR201,,WDR2))                   
         SEGM  NAME=WLXXBV11,PARENT=WLXXBV01,SOURCE=((WDR210,,WDR2))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
