*          DATA SET WLXXJMDII0 AT LEVEL 001 AS OF 88/06/06                      
*                                                                               
         DBD   NAME=WLXXJM,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
         SEGM  NAME=WLXXJM01,PARENT=0,SOURCE=((WDG201,,WDG2))                   
         SEGM  NAME=WLXXJM11,PARENT=WLXXJM01,SOURCE=((WDG220,,WDG2))            
*                                                                               
         DBDGEN                                                                 
         END                                                                    
