*          DATA SET WLXXAVDII0 AT LEVEL 001 AS OF 88/05/18                      
*                                                                               
         DBD   NAME=WLXXAV,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLXXAV01,PARENT=0,SOURCE=((WDG201,,WDG2))                   
         SEGM  NAME=WLXXAV11,PARENT=WLXXAV01,SOURCE=((WDG202,,WDG2))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
