*                                                                               
         DBD   NAME=WLXXAD,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
         SEGM  NAME=WLXXAD01,PARENT=0,SOURCE=((WDG301,,WDG3))                   
         SEGM  NAME=WLXXAD11,PARENT=WLXXAD01,SOURCE=((WDG302,,WDG3))            
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
