*                                                                               
         DBD   NAME=WLXXBQ,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLXXBQ01,PARENT=0,SOURCE=((WDG301,,WDG3))                   
         SEGM  NAME=WLXXBQ11,PARENT=WLXXBQ01,SOURCE=((WDG303,,WDG3))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
