*PACKNING LÅSNINGSREGISTER                                                      
*                                                                               
         DBD   NAME=WLXXDJ,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
         SEGM  NAME=WLXXDJ01,PARENT=0,SOURCE=((WDR401,,WDR4))                   
         SEGM  NAME=WLXXDJ11,PARENT=WLXXDJ01,SOURCE=((WDR418,,WDR4))            
         SEGM  NAME=WLXXDJ21,PARENT=WLXXDJ11,SOURCE=((WDR419,,WDR4))            
         DBDGEN                                                                 
         END                                                                    
