*          DATA SET WLXXAJDII0 AT LEVEL 009 AS OF 85/09/17                      
*                                                                               
         DBD   NAME=WLXXAJ,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
         SEGM  NAME=WLXXAJ01,PARENT=0,SOURCE=((WDG201,,WDG2))                   
         SEGM  NAME=WLXXAJ11,PARENT=WLXXAJ01,SOURCE=((WDG205,,WDG2))            
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
