*          DATA SET WLXXASDII0 AT LEVEL 001 AS OF 88/04/04                      
*                                                                               
         DBD   NAME=WLXXAS,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLXXAS01,PARENT=0,SOURCE=((WDG201,,WDG2))                   
         SEGM  NAME=WLXXAS11,PARENT=WLXXAS01,SOURCE=((WDG220,,WDG2))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
