*          DATA SET WLXXKXDII0 AT LEVEL 002 AS OF 90/05/16                      
*                                                                               
         DBD   NAME=WLXXKX,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLXXKX01,PARENT=0,SOURCE=((WDR401,,WDR4))                   
         SEGM  NAME=WLXXKX11,PARENT=WLXXKX01,SOURCE=((WDR430,,WDR4))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
