*          DATA SET WLXXAZDII0 AT LEVEL 003 AS OF 90/08/06                      
*                                                                               
         DBD   NAME=WLXXAZ,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLXXAZ01,PARENT=0,SOURCE=((WDR501,,WDR5))                   
         SEGM  NAME=WLXXAZ11,PARENT=WLXXAZ01,SOURCE=((WDR520,,WDR5))            
         SEGM  NAME=WLXXAZ21,PARENT=WLXXAZ11,SOURCE=((WDR521,,WDR5))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
