*          DATA SET WLXXBWDII0 AT LEVEL 010 AS OF 90/05/17                      
*                                                                               
         DBD   NAME=WLXXBW,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLXXBW01,PARENT=0,SOURCE=((WDR501,,WDR5))                   
         SEGM  NAME=WLXXBW11,PARENT=WLXXBW01,SOURCE=((WDR530,,WDR5))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
