*          DATA SET WLXXKADII0 AT LEVEL 002 AS OF 90/03/07                      
*                                                                               
         DBD   NAME=WLXXKA,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLXXKA01,PARENT=0,SOURCE=((WDR101,,WDR1))                   
         SEGM  NAME=WLXXKA11,PARENT=WLXXKA01,SOURCE=((WDR110,,WDR1))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
