*          DATA SET WLXXATDII0 AT LEVEL 001 AS OF 88/04/04                      
*                                                                               
         DBD   NAME=WLXXAT,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLXXAT01,PARENT=0,SOURCE=((WDG201,,WDG2))                   
         SEGM  NAME=WLXXAT11,PARENT=WLXXAT01,SOURCE=((WDG220,,WDG2))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
