*          DATA SET WLXXAXDII0 AT LEVEL 002 AS OF 89/03/01                      
*                                                                               
         DBD   NAME=WLXXAX,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLXXAX01,PARENT=0,SOURCE=((WDG201,,WDG2))                   
         SEGM  NAME=WLXXAX11,PARENT=WLXXAX01,SOURCE=((WDG215,,WDG2))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
