*                                                                               
         DBD   NAME=WLXXDU,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLXXDU01,PARENT=0,SOURCE=((WDR401,,WDR4))                   
         SEGM  NAME=WLXXDU11,PARENT=WLXXDU01,SOURCE=((WDR410,,WDR4))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
