*PACKNINGEN FYSISKA NOLLOR                                                      
*                                                                               
         DBD   NAME=WLXXJD,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
         SEGM  NAME=WLXXJD01,PARENT=0,SOURCE=((WDR401,,WDR4))                   
         SEGM  NAME=WLXXJD11,PARENT=WLXXJD01,SOURCE=((WDR414,,WDR4))            
         DBDGEN                                                                 
         END                                                                    
