*                                                                               
         DBD   NAME=WLXXLO,ACCESS=LOGICAL                                       
         DATASET LOGICAL                                                        
*                                                                               
         SEGM  NAME=WLXXLO01,PARENT=0,SOURCE=((WDR401,,WDR4))                   
         SEGM  NAME=WLXXLO11,PARENT=WLXXLO01,SOURCE=((WDR470,,WDR4))            
*                                                                               
         DBDGEN                                                                 
         FINISH                                                                 
         END                                                                    
